{
    "id": "5162375718f3ad9b9e2456ecc9b24e979ed74427",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602120A"
        },
        "ProgramElementTitle": {
            "val": "Sensors and Electronic Survivability"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "42.677"
            },
            "CurrentYear": {
                "val": "46.258"
            },
            "BudgetYearOne": {
                "val": "38.374"
            },
            "BudgetYearOneBase": {
                "val": "38.374"
            },
            "BudgetYearTwo": {
                "val": "38.448"
            },
            "BudgetYearThree": {
                "val": "35.826"
            },
            "BudgetYearFour": {
                "val": "35.200"
            },
            "BudgetYearFive": {
                "val": "35.889"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates designs and evaluates sensors and electronic components and software that enhance situational awareness, survivability, lethality, and autonomous mobility for tactical ground forces. Project H15 focuses on Combat Identification (CID) technologies, which include devices to locate, identify, track, and engage targets in the Joint fires environment. Project H16 investigates sensors, signal processing and information fusion technologies to increase target detection range and speed of engagement. Project SA2 conducts applied research on biological sensors and biologically derived electronics that exploits breakthroughs in biotechnology basic research in collaboration with the Institute for Collaborative Biotechnology (ICB) a University Affiliated Research Center (UARC) led by the University of California, Santa Barbara in partnership with California Institute of Technology and Massachusetts Institute of Technology and their industry partners. Project TS1 researches and evaluates space-based remote sensing, signal, and information processing software in collaboration with other Department of Defense (DoD) and government agencies to support space force enhancement and space superiority advanced technology integration into Army battlefield operating systems. Project TS2 focuses on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and unique mobility for unmanned vehicles.  \n\nWork in this program element (PE) complements and is fully coordinated with efforts in PE 0602307A (Advanced Weapons Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603006A (Command, Control, Communications Advanced Technology), PE 0603008A (Command Electronic Warfare Advanced Technology),\nPE 0603710A (Night Vision Advanced Technologies), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology),\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy\n\nWork is performed by the U.S. Army Research Laboratory, Adelphi, MD and Aberdeen Proving Ground, MD; the Communications-Electronics Research, Development, and Engineering Center, Aberdeen Proving Ground, MD; and the US Army Space and Missile Defense Technical Center, Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.148"
                },
                "CurrentYear": {
                    "val": "33.515"
                },
                "BudgetYearOne": {
                    "val": "38.631"
                },
                "BudgetYearOneBase": {
                    "val": "38.631"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "42.677"
                },
                "CurrentYear": {
                    "val": "46.258"
                },
                "BudgetYearOne": {
                    "val": "38.374"
                },
                "BudgetYearOneBase": {
                    "val": "38.374"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.471"
                },
                "CurrentYear": {
                    "val": "12.743"
                },
                "BudgetYearOne": {
                    "val": "-0.257"
                },
                "BudgetYearOneBase": {
                    "val": "-0.257"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.007"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "12.750"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.250"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.721"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.257"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.257"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H15"
                    },
                    "ProjectTitle": {
                        "val": "Ground Combat Id Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.287"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and investigates emergent techniques, devices and software for combat identification (CID) of Joint, allied, and coalition forces, including air-to-ground and ground-to-ground for mounted, dismounted, forward observer, and forward air controller missions. Efforts include research to enable a common battlespace picture for Joint and coalition situation awareness and fusion efforts to increase the survivability and lethality of coalition forces by fusing battlefield sensor and situational awareness data to identify friend from foe.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier and Ground Maneuver portfolios. Efforts in this project are complimentary of PE 0602270A (EW Techniques), PE 0603270A (EW Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Identification (CID) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and enhances CID modeling and simulation tools, concepts, and algorithms to improve anti-fratricide and combatant\/non-combatant identification capabilities. Soldier-to-Soldier CID algorithms that interoperate with non-traditional CID sensors (air and ground) are developed to increase situational awareness (SA), feed the common operating picture, and increase the combat effectiveness of Soldier and  Brigade Combat Teams (BCTs). Work being accomplished under PE 0603270A\/project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.287"
                                            },
                                            "Text": {
                                                "val": "Designed and integrated tactical and commercial communications, wireless personal area networks and position location beaconing for a Soldier-to-Soldier CID capability utilizing equipment that is already employed by Soldiers; designed CID display and training tools to implement on existing mobile and handheld platforms being targeted by applicable programs of record."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H16"
                    },
                    "ProjectTitle": {
                        "val": "S3I Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.720"
                        },
                        "CurrentYear": {
                            "val": "17.936"
                        },
                        "BudgetYearOne": {
                            "val": "21.168"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.168"
                        },
                        "BudgetYearTwo": {
                            "val": "21.438"
                        },
                        "BudgetYearThree": {
                            "val": "17.964"
                        },
                        "BudgetYearFour": {
                            "val": "18.057"
                        },
                        "BudgetYearFive": {
                            "val": "18.405"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, investigates, and evaluates advanced sensor components, signal processing, and information fusion algorithms that will provide the future Soldier decisive new capabilities to locate, identify, decide and engage battlefield targets in tactical environments.  The ultimate impact and utility of this work will be to greatly increase the lethality, range, and speed of engagement of the Soldier.  Emphasis is on solving critical Army-specific battlefield sensing and information management problems such as false targets, complex terrain (including urban applications), movement of sensors on military vehicles, and exploitation of multimodal sensors.  Significant areas of research include: low cost sensors designed to be employed in large numbers of networked sensors for force protection, hostile fire defeat, homeland defense, counter terrorism operations, and munitions; fusion of disparate sensors such as non-imaging acoustic, seismic, electric-field (E-field), magnetic, radar; imaging infrared (IR), forward looking IR (FLIR), laser detection and ranging (LADAR), visible imagers; low cost acoustic, seismic, and magnetic sensors that can passively detect, classify, and track battlefield targets such as personnel, heavy\/light vehicles, and helicopters.  Other areas of research include sensing technologies for tagging, tracking, and locating (TTL) non-traditional targets as well as the location of direct and indirect fires and other hostile threats.  Further areas of research include ultraviolet (UV) optoelectronics for battlefield sensors, networked compact radar for vehicle and dismount identification and tracking; ultra wideband radar for buried and concealed threat detection, enhanced robotic mobility, stand-off characterization of infrastructure; and the detection, classification, and tracking of humans in urban terrain.  Additional areas of research are aided\/automatic target recognition (ATR) allowing sensors to autonomously locate and identify targets; advanced battlefield sensor and information processing to conduct a dynamic and real time situational assessment to present a common picture of the battlespace focused on low echelon commanders; protection of sensors (including Soldier's eyes) from battlefield laser threats; and advanced information processing methods to provide automatic information technologies that utilize widely dispersed sensor and legacy information sources.\n\nThis project supports Army science and technology efforts in the Command Control and Communications, Ground, and Soldier portfolios.  The work in this project complements efforts funded in PE 0601104A (University and Industry Research Centers), PE 0602709A (Night Vision Technology), PE 0603710A (Night Vision Advanced Technologies), and PE 0603001A (Warfighter Advanced Technology).  The networked sensing and data fusion efforts performed in this project complement efforts funded in PE 0601104A\/Project H50 (Network Sciences CTA) and PE0601104A\/Project J22 (Network Science and Technology Research Center CTA).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this area is performed by the U.S. Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-Imaging Intelligence, Surveillance, and Reconnaissance (ISR) Sensing"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and designs technologies for multi-modal low-cost networked sensors to enhance persistent sensing capabilities with increased probability of target detection and reduced false alarms.  A key focus is on acoustic, seismic, magnetic, E-field, and passive radio frequency (RF) with unique capabilities for Army & DoD applications such as technologies that enable detection of underground facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.317"
                                            },
                                            "Text": {
                                                "val": "Evaluated combination of collocated passive IR sensors to discriminate humans from animals with high confidence; investigated new algorithms to detect digging using seismic and magnetic sensors; and developed and evaluated algorithms to fuse input from acoustic velocity sensors, electric-field charge detectors, burn-product sensors, and infrared flash detectors to improve detection and classification of hostile threats such as gunfire, mortars, and rockets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.539"
                                            },
                                            "Text": {
                                                "val": "Exploit multimodal sensing, fusion, and sensor processing to detect and locate diverse threats using static and mobile sensors and networked systems; enhance sensors and algorithms to provide persistent surveillance and actionable information; and exploit target features and mitigate environmental interference to enhance intelligence, surveillance, and reconnaissance (ISR) capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.435"
                                            },
                                            "Text": {
                                                "val": "Will develop advanced acoustic, magnetic- and e-field sensors and arrays to detect and locate threats in complex environments; implement algorithms to mitigate effects of acoustic  propagation channel and signature modifications to optimize transient classification of mortar, rocket, gunfire and explosive events; apply electric and magnetic field phasor processing to detect and classify equipment and power events; and develop methods for detecting and classifying humans and human activities with multimodal image, video, and text data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Sensing and Data Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and assess a concept to link physical sensors and information sources to Soldiers and small units.  Specifically the research focuses on (1) multimodal sensor fusion for detection and classification of human activities and infrastructures such as personnel, vehicles, machinery, RF emissions, chemicals, and computers in hidden and confined spaces, such as  tunnels, caves, sewers, and buildings, (2) interoperability and networking of disparate sensors and information sources, (3) distributed information for decision making, and (4) approaches for fusing results of processed outputs of multimodal sensors such as visible, IR, and hyperspectral imagers, and acoustic, magnetic, and electric field sensors. This effort complements efforts funded in PE 0601104A\/H50 (Network Sciences CTA) and PE0601104A\/J22 (Network Science and Technology Research Center CTA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.748"
                                            },
                                            "Text": {
                                                "val": "Developed pattern of life algorithms and statistics to discriminate between potential threat activities and normal behavior; developed and evaluated fusion algorithms that correlates bearing information from multiple soldier-worn gunfire detection systems for localization of shooter with reduced errors and uncertainties; developed protocols and message formats to enable interoperability between disparate sensor systems; developed tools to understand value and quality of information based on data discovery, collection, and fusion of large data sets; evaluated fusion of acoustic and electric field sensing systems to enable passive ranging of near-miss bullets based on wave propagation velocity differences; and developed passive electromagnetic (EM) target detection and localization using multi-axis electric field and magnetic field sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.843"
                                            },
                                            "Text": {
                                                "val": "Implement anomaly detection algorithms by fusing the output of social network with disparate multimodal sensors to determine patterns of behavior; enhance acoustic, magnetic and electric field sensors and algorithms to detect, classify, and localize hostile transient threat events such as mortars, rockets, gunfire, and moving ground\/air vehicles, to include unmanned aerial systems (UAS); and mitigate background noise resulting from mobile sensor systems in complex environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.474"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.474"
                                            },
                                            "Text": {
                                                "val": "Will expand tools to improve search capabilities of relevant social media data to fuse with sensor data; expand interoperability for sensor plug-and-play capabilities and quick integration across unmanned sensors; develop algorithms that will exploit electric and magnetic field sensor fusion for electrical power event monitoring; and develop detection, tracking and cueing methodologies for counter-unmanned aerial system (C-UAS) using fusion of acoustic, passive RF, and imaging modalities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging Tracking and Locating (TTL)"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to support advances in state-of-the-art clandestine TTL for non-traditional hostile forces and non-cooperative targets. Specific technical details related to this effort are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.081"
                                            },
                                            "Text": {
                                                "val": "Investigated battery-free tags for extending the operating life of tags; and developed and extracted signals from targets of interest using mechanical and electromechanical coupling methods combined with applicable sensing modalities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultra Wideband (UWB) Radar"
                                    },
                                    "Description": {
                                        "val": "Conduct research to examine the technical underpinnings of UWB radar for several key Army concealed target detection technology requirements including landmine and improvised explosive device (IED) detection, sensing through-the-wall (STTW), and obstacle detection. Use a combination of advanced computational electromagnetic algorithms, radar measurements and advanced signal processing techniques to define the performance boundaries of state of the art airborne and ground-based UWB radar for concealed target detection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.369"
                                            },
                                            "Text": {
                                                "val": "Developed techniques for combining UWB radar with complementary sensors, such as video and thermal IR, for improving the probability of detection and confirmation of targets; and investigated computational electromagnetic models of the radar signature of RF devices placed in a complex building environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.913"
                                            },
                                            "Text": {
                                                "val": "Assess performance of UWB radar with complementary sensor techniques and technologies and compare to the current target detection capabilities and performance metrics; and investigate computational electromagnetic models to address new target deployments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.892"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.892"
                                            },
                                            "Text": {
                                                "val": "Will investigate utility of combining forward looking radar with EO\/IR sensor to improve detection and reduce false alarms for standoff detection of explosive hazards; incorporate stereo visible cameras to provide three-dimensional reconstruction of the environment that can be fused with radar image formation algorithms; and investigate and validate disturbed earth computational UWB forward-looking radar models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Compact Radar, Wide Bandgap Optoelectronics, and Laser Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate RF networking technology in support of integrated RF systems for use on ground, air, and Soldier platforms to support radio, radar, and control functions to allow communications, combat identification (ID), and target acquisition\/tracking. Research semiconductor-based ultraviolet (UV) optoelectronics for communications, water\/air\/surface purification, and detection and identification of biological threats. Research novel materials and high speed switching technology for sensor and eye protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.433"
                                            },
                                            "Text": {
                                                "val": "Created software and hardware architectures that enable compact radars to network with other unattended ground sensors for small unit force protection; evaluated nonlinear optical materials and tuned their properties to optimize performance of the overall vision protection system; and grew and characterized gallium nitride materials for extending the spectral range of UV lasers, light emitting diodes (LEDs), and detectors to wavelengths of 230 to 365 nanometers for enabling communications, water\/air\/surface purification, detection and identification of biological threats, and electro-optic countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.083"
                                            },
                                            "Text": {
                                                "val": "Grow and characterize wide bandgap semiconductor materials and develop device designs to extend the spectral range of UV lasers, LEDs, and detectors to wavelengths from 200 to 365 nanometers to enable water\/air\/surface purification and the detection and identification of biological threats; investigate different materials and evaluate solutions for eye and sensor protection against ultra-short pulses and near-IR high power threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.854"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.854"
                                            },
                                            "Text": {
                                                "val": "Will study and characterize non-linear optical materials (including two novel platinum bipyridine complexes and several iridium dimes) for eye and camera protection on mounted ground vehicle platforms and investigate active long wavelength protection filters for uncooled infrared cameras and focal plane arrays to reduce their vulnerability to damage and dazzle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Information Collection and Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops network and processing infrastructure concepts, and validates algorithms to enable assets to dynamically modify their physical and information producing behaviors to adaptively operate within the dynamics and timelines of small unit decision makers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.772"
                                            },
                                            "Text": {
                                                "val": "Evaluated decision-adaptive anomaly detection techniques as a means of filtering data at the sensor level to improve situational understanding for small unit decision makers and evaluate the impact of these techniques on data latency and situational awareness; integrated these filtering algorithms into an autonomous collaborative collection framework and assessed the impact on delay and situation awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Mode Air Defense Radar"
                                    },
                                    "Description": {
                                        "val": "This research supports the current and future technical challenges associated with air defense radar technology. In particular, this effort will analyze current and emerging RF spoofing, RF jamming and RF signature management technology to determine their impact on the performance of air defense radar technology. Electromagnetic modeling, RF measurements and experiments will be used to mitigate the effects of spoofing, jamming and signature management technology. This will include research extending from electronic devices, subassembly design, and laboratory prototypes to advance the state-of-the-art of air defense technology operating in contested environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.558"
                                            },
                                            "Text": {
                                                "val": "Investigate current and emerging technologies, across a broad RF spectrum, which may limit the performance of current air defense radar systems; modify existing physics-based electromagnetic modeling techniques to assess performance and identify critical areas of research; and examine performance in contested environments and research techniques to mitigate performance limitations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.513"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.513"
                                            },
                                            "Text": {
                                                "val": "Will model air targets to investigate multiband architectures, alternative spectrum configurations, and broadband apertures;  investigate spectrum sensing algorithms specific to air defense radar bands (e.g., L-band thru X-band and beyond); and investigate novel tracking algorithms for rockets, artillery, and mortar  targets for next generation air defense radar."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SA1"
                    },
                    "ProjectTitle": {
                        "val": "Sensors and Electronic Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.750"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Sensors and Electronic Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Force Protection Radar Development"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Congressional interest item for Force Protection Radar Development"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace security"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.750"
                                        },
                                        "Text": {
                                            "val": "Congressional interest funding for cyberspace security research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SA2"
                    },
                    "ProjectTitle": {
                        "val": "Biotechnology Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.915"
                        },
                        "CurrentYear": {
                            "val": "2.859"
                        },
                        "BudgetYearOne": {
                            "val": "2.972"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.972"
                        },
                        "BudgetYearTwo": {
                            "val": "1.861"
                        },
                        "BudgetYearThree": {
                            "val": "2.180"
                        },
                        "BudgetYearFour": {
                            "val": "2.105"
                        },
                        "BudgetYearFive": {
                            "val": "2.147"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, develops and evaluates biotechnology with application to sensors, electronics, photonics, and network science.  This project funds collaborative applied research and integration of government, academic, and industry scientific research on biotechnology from PE 0601104\/H05, Institute for Collaborative Biotechnologies (ICB) to advance innovative capabilities. Areas of applied research include bio-array sensors, biological, and bio-inspired power generation and storage, biomimetics, proteomics, genomics, network science, DNA research and development, control of protein, and gene expression.  \n\nThe ICB is a collaborative effort led by the University of California, Santa Barbara (Santa Barbara, CA) in partnership with the California Institute of Technology (Pasadena, CA), the Massachusetts Institute of Technology (Cambridge, MA), the Army Laboratories and Research, Development and Engineering Centers, and the ICB industrial partners.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the U.S. Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Biotechnology Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort exploits breakthroughs in biotechnology basic research invented at the ICB to enable capabilities in sensors, electronics, photonics, and network science."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.915"
                                            },
                                            "Text": {
                                                "val": "Improved biofuel cell electrode and membrane materials design, and validated for powering unattended ground sensors and other monitoring systems; completed and validated bio-inspired algorithms for control of swarms of micro-unmanned aerial vehicles; evaluated the use of a virus to template electrode materials to design improved batteries for small-scale, unmanned aerial vehicles; and evaluated protein capture agents and synthetic bio-molecules as materials to improve stability, affinity for overall environmental tolerance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.859"
                                            },
                                            "Text": {
                                                "val": "Investigate performance limits of hybrid biofuel cells for powering unattended ground sensors or other remote, stand-alone monitoring systems; study interface technologies for small-scale batteries using virus templated materials for use on unmanned aerial vehicles (UAVs); and develop and study rapid bio-based screening, selection, and production processes for recognition and targeting of emerging threats to the Soldier."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.972"
                                            },
                                            "Text": {
                                                "val": "Will test hybrid biofuel cells; develop and test assays with advanced protein capture agents in order to validate capability to rapidly respond to emerging threats; and evaluate bio-inspired algorithms for control applications including decision support tools to unburden UAV operators and conduct field evaluation of combined bio-inspired algorithms for distributed mobile gunfire detection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS1"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Space Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.378"
                        },
                        "CurrentYear": {
                            "val": "4.775"
                        },
                        "BudgetYearOne": {
                            "val": "5.808"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.808"
                        },
                        "BudgetYearTwo": {
                            "val": "6.702"
                        },
                        "BudgetYearThree": {
                            "val": "7.026"
                        },
                        "BudgetYearFour": {
                            "val": "7.072"
                        },
                        "BudgetYearFive": {
                            "val": "7.213"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project researches and evaluates technologies for space-based and high altitude applications for Army tactical ground forces.  Applied research efforts include the design and development of sensors and electronic components, communications, signal and information processing, target acquisition, position\/navigation, and threat warning within space and high altitude environments.  The applied research and technology evaluations conducted under this Project leverage other DoD space science and technology applications to support Army space force enhancement and cooperative satellite payload development.  \n\nWork in this project complements and is fully coordinated with PE 0603006A (Space Applications Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.     \n  \nWork in this project is performed by the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) in Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Space Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and evaluates space-based technologies, components, and tools that lead to smaller, lighter, more responsive payloads and applications. These technologies allow for the rapid integration and development of tactical payloads in support of responsive space environments. Work related to standard Army networks is done in coordination with the Communications-Electronics Research Development and Engineering Center (CERDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.349"
                                            },
                                            "Text": {
                                                "val": "Designed and developed tracking system and antenna pointing component technologies for small satellites; developed orbit planning and analysis tools to support small satellite constellation concept of operation feasibility studies; researched and developed propulsion concepts for small satellite station keeping and maneuvering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.765"
                                            },
                                            "Text": {
                                                "val": "Develop payload deployer subsystem for affordable launch vehicle; design and develop advanced attitude determination and control and propulsion subsystems for nanosatellites to change orbits in flight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.787"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop network hardware and software interfaces and information dissemination architecture that allows Software Defined Radio (SDR) and imagery payloads to be controlled from any node and products distributed to tactical ground units; develop follow-on small satellite antenna and guidance, navigation, and control (GNC) components that have less mass, are more accurate, and are more power efficient; and investigate technologies and explore collaboration opportunities with other Services and Agencies for small satellite affordable launch capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and Analysis Lab"
                                    },
                                    "Description": {
                                        "val": "This effort provides an in-house capability to design and conduct analytic evaluations of space and high altitude technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.029"
                                            },
                                            "Text": {
                                                "val": "Designed and implemented a communications satellite testbed to conduct and evaluate nanosatellite assembly, payload integration, ground testing and preflight checkout; improved ground station capabilities within the lab to support on-orbit communications and imagery nanosatellite demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.010"
                                            },
                                            "Text": {
                                                "val": "Validate performance of Hardware In The Loop nanosatellite attitude control, to include attitude control software, device integration, and in-flight simulation of commanded motion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.021"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.021"
                                            },
                                            "Text": {
                                                "val": "Will develop components for follow-on small satellite designs, to include propulsion and distributed aperture imager components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS2"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.377"
                        },
                        "CurrentYear": {
                            "val": "7.938"
                        },
                        "BudgetYearOne": {
                            "val": "8.426"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.426"
                        },
                        "BudgetYearTwo": {
                            "val": "8.447"
                        },
                        "BudgetYearThree": {
                            "val": "8.656"
                        },
                        "BudgetYearFour": {
                            "val": "7.966"
                        },
                        "BudgetYearFive": {
                            "val": "8.124"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, evaluates, and investigates autonomous technologies to enable robotics to assist military missions.  Technical efforts are focused on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and improved mobility for unmanned vehicles of scales from micro-systems through tactical vehicles.  The project provides the underpinning research of the Robotics Collaborative Technology Alliance (CTA), a cooperative arrangement with industry and academia to conduct a concerted, collaborative effort advancing key enabling robotic technologies required for future unmanned systems.  The Robotics CTA research is funded in PE 0601104A\/Project H09.  \n\nThis project sustains Army science and technology efforts supporting the Air and Ground Maneuver portfolios.\n\nThis project leverages basic research conducted under PE 0601102A\/Project T63 (Robotics Autonomy, Manipulation and Portability) and PE 0601104A\/Project H09 (Robotics CTA) and transitions knowledge and emerging technologies to PE 0603005A (Combat Vehicle and Automotive Advanced Technology) for maturation and demonstration.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas, and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) at the Aberdeen Proving Ground, MD, and the Robotics Collaborative Technology Alliance consisting of Carnegie Mellon University, Florida  State University, General Dynamics Robotics Systems, Jet Propulsion Laboratory, QinetiQ North America, University of Central Florida, and University of Pennsylvania."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics CTA"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to provide essential capabilities for advanced perception, intelligent control and tactical behavior, human-robot interaction, robotic manipulation, and unique mobility for unmanned systems to conduct multiple military missions for a full range of robots from man-portable to larger systems. Research focuses on new sensor and sensor processing algorithms for rapid detection and classification of objects in cluttered and unknown environments, enabling autonomous mobility and intelligent tactical behavior by future unmanned systems; implementing adaptive control strategies that will enable unmanned systems to display intelligent tactical behavior, formulation of control strategies that will facilitate use of unmanned systems in populated environments and minimize the cognitive workload on Soldier operators enabling more dexterous manipulation of objects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.654"
                                            },
                                            "Text": {
                                                "val": "Continued to design perception and intelligence algorithms that permits unmanned systems to team with soldiers in moderately complex environments and conduct missions; instantiated learning algorithms to enable robots to continually learn from experience and recognize intent of other agents; focused on the implementation of hybrid cognitive\/metric architecture to minimize the workload placed upon soldier, including the implementation of non-traditional control techniques; and implemented concepts for manipulation of objects and improved ground mobility for complex and constrained environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.573"
                                            },
                                            "Text": {
                                                "val": "Incorporate perception and intelligence algorithms into effective teaming of humans and robots as part of a mixed team to successfully conduct missions; conduct technology assessments of components and integrated systems to determine performance and technology maturity levels; and implement perception and reasoning skills with technology test beds employing unique mobility modes (e.g., legs, and manipulation skills) to assess technology performance levels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.790"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.790"
                                            },
                                            "Text": {
                                                "val": "Will instantiate enhanced hybrid cognitive architecture on robots to explore teaming behaviors including; natural modes of communication and control in the context of a mixed small unit; incorporate mechanisms and software to permit robots to effectively perform basic manipulation skills; integrate resultant technology into test bed platforms to assess technology maturity.  The hybrid architecture permits command and communication to be at a natural or abstract level similar to a Soldier issuing a command (e.g., open the third door on the right) to a subordinate."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception and Intelligent Control"
                                    },
                                    "Description": {
                                        "val": "Advance perception and intelligent control technologies required to achieve autonomous tactical behaviors and other objective capabilities for future unmanned vehicles of multiple size scales and to transition this technology to advanced development programs being conducted under PE 0603005A (Combat Vehicle and Automotive Advanced Technology)\/project 515 (Robotic Ground Systems) for integration into test bed systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.723"
                                            },
                                            "Text": {
                                                "val": "Implemented algorithms for perception of the local environment employing a hybrid cognitive\/metric architecture; incorporated advanced algorithms for whole body manipulation on to test bed platforms; and implemented novel approaches to mobility in complex and constrained environments; and assessed performance of algorithms in an integrated context."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.365"
                                            },
                                            "Text": {
                                                "val": "Develop the perceptual and reasoning capabilities necessary to enable an unmanned system to deduce the intent of actions\/activity; and explore and implement on test bed platforms the mechanisms and control algorithms that will enable autonomous unmanned systems to dexterously manipulate objects and maneuver through complex terrain, with an emphasis on increased efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.636"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.636"
                                            },
                                            "Text": {
                                                "val": "Will continue extension of perceptual, reasoning, and learning techniques for unmanned systems to enable creation of a common, though not necessarily equivalent, mental model of the surrounding world facilitating planning and execution of tasks, as well as communication with human teammates; and conduct experiments focused upon establishing technology maturity and performance gaps."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}