{
    "id": "591c02cf038bbf642e406a17399e5bbfa08b3e1c",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605604A"
        },
        "ProgramElementTitle": {
            "val": "Survivability\/Lethality Analysis"
        },
        "R1LineNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "42.865"
            },
            "CurrentYear": {
                "val": "33.294"
            },
            "BudgetYearOne": {
                "val": "33.246"
            },
            "BudgetYearOneBase": {
                "val": "33.246"
            },
            "BudgetYearTwo": {
                "val": "28.243"
            },
            "BudgetYearThree": {
                "val": "28.510"
            },
            "BudgetYearFour": {
                "val": "29.521"
            },
            "BudgetYearFive": {
                "val": "30.064"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016 increase attributed to realignment of funding for higher priority programs."
        },
        "ProgramElementMissionDescription": {
            "val": "This project funds analytical products necessary for inherently-governmental Army Test & Evaluation Command\/Army Evaluation Center's (ATEC\/AEC) mission.  Products result from investigating, analyzing, assessing, and reporting on the survivability of Soldiers, and on the survivability, lethality and vulnerability (SLV) of the highest priority Army systems whether those systems are employed during stability, support, defensive, or offensive missions.  Developed through measurement, experiment, test support, and modeling and simulation (M&S), the products funded by this project are used in many ways to make the Army force more survivable.  The project provides quantitative lethality and survivability analyses and data for fielded and developmental systems as the Army makes the required choices to decisively transform into a modular Brigade Combat Team (BCT) based organization.  Products concern Army fire support systems, direct fire munitions; Army air defense and missile defense systems; Army aviation systems including Unmanned Aerial Vehicles; network communications and other network enabled battle command and communication systems; and selected joint services systems particularly relevant to the Army's joint and expeditionary role.  Products also include analysis and data concerning individual Soldier items including protective equipment such as helmets and vests.  These survivability products are leveraged into rapid-equipping initiatives and other technical support for operational forces involved in the current fight.  Continued development of these products also guarantees preservation of the Army's vitally needed technical corporate memory for expert survivability advice.\n\nSurvivability analyses funded by this project are conducted across the spectrum of battlefield threats to include guns, missiles, mines and other methods of inflicting physical damage; jammers, countermeasures, and other electronic warfare techniques; cybersecurity and computer network operations; and directed energy weapons.  This survivability information enables developers, users, and decision makers to perform credible survivability tradeoffs for both Soldiers and materiel.  These technical survivability details enable properly informed decisions concerning systems and tactics that maximize both the combat power and survivability of Army forces.  Survivability data and analysis results funded by this project are efficiently leveraged for many different Army uses, reducing total cost to the Army by eliminating the need for duplicative capabilities funded by individual system developers.  Central funding of this mission assures the Army accurate and consistent treatment of survivability across all classes of systems, across all formal system Evaluations, and across the Army's AR 5-5 studies process.  Work program is prioritized principally by the ATEC\/AEC and is used by them in the Army's formal Evaluation process in such a way that ATEC can comply with its legally mandated responsibility to assess system survivability along with effectiveness and suitability.  Program Managers (PM) and the Program Executive Officers (PEO) use the survivability analyses and data funded by this project to make design decisions that are optimized for survivability, to direct specific weapon system development efforts that are needed for survivability enhancement, and to structure product improvement programs. Soldier survivability data and analysis is leveraged to support the survivability portion of the HQDA G1 MANPRINT program.  TRADOC combat developers exploit the survivability products funded by this project to initiate and improve survivability\/lethality requirements, and to develop and refine doctrine and tactics.  Also, the quantitative analytical results funded by the project are leveraged as core inputs to formal AR 5-5 studies and other studies as directed by Army leaders.  While the Army is at war, analytical results funded by this project are also directly leveraged for survivability support to current operations.  Finally, for particularly urgent or controversial survivability issues, data and analysis funded by this project are used directly by senior Army decision makers to assure technically sound program\/production decisions.   \n \nThis project also supports cybersecurity survivability analysis of Army battle command\/networked systems as well as Army network architectures and technology.  Supports ATEC and other electronic warfare vulnerability testers and evaluators by developing and providing highly technical specialized field countermeasure environments that threat forces may employ against Army communications networks, air defense and other systems.  In conjunction with PMs and Army intelligence agencies, analyzes technical vulnerabilities of foreign weapons, network related systems, and intelligence Electronic Warfare (EW) systems to U.S. Army EW systems.  Without the survivability products funded by this project, ATEC would not have a technically credible account of survivability issues at milestone decision points and systems could be fielded with unknown vulnerabilities leading to unnecessary US casualties.  PMs would make design choices that failed to properly optimize survivability, TRADOC would generate requirements that were not technically credible, and the Army studies process would rest on an inaccurate and inconsistent basis."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.256"
                },
                "CurrentYear": {
                    "val": "33.295"
                },
                "BudgetYearOne": {
                    "val": "28.203"
                },
                "BudgetYearOneBase": {
                    "val": "28.203"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "42.865"
                },
                "CurrentYear": {
                    "val": "33.294"
                },
                "BudgetYearOne": {
                    "val": "33.246"
                },
                "BudgetYearOneBase": {
                    "val": "33.246"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.391"
                },
                "CurrentYear": {
                    "val": "-0.001"
                },
                "BudgetYearOne": {
                    "val": "5.043"
                },
                "BudgetYearOneBase": {
                    "val": "5.043"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.391"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.043"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.043"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675"
                    },
                    "ProjectTitle": {
                        "val": "Army Survivability Analysis & Evaluation Supp"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.865"
                        },
                        "CurrentYear": {
                            "val": "33.294"
                        },
                        "BudgetYearOne": {
                            "val": "33.246"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.246"
                        },
                        "BudgetYearTwo": {
                            "val": "28.243"
                        },
                        "BudgetYearThree": {
                            "val": "28.510"
                        },
                        "BudgetYearFour": {
                            "val": "29.521"
                        },
                        "BudgetYearFive": {
                            "val": "30.064"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds analytical products necessary for inherently-governmental Army Test & Evaluation Command\/Army Evaluation Center's (ATEC\/AEC) mission.  Products result from investigating, analyzing, assessing, and reporting on the survivability of Soldiers, and on the survivability, lethality and vulnerability (SLV) of the highest priority Army systems whether those systems are employed during stability, support, defensive, or offensive missions.  Developed through measurement, experiment, test support, and modeling and simulation (M&S), the products funded by this project are used in many ways to make the Army force more survivable.  The project provides quantitative lethality and survivability analyses and data for fielded and developmental systems as the Army makes the required choices to decisively transform into a modular Brigade Combat Team (BCT) based organization.  Products concern Army fire support systems, direct fire munitions; Army air defense and missile defense systems; Army aviation systems including Unmanned Aerial Vehicles; network communications and other network enabled battle command and communication systems; and selected joint services systems particularly relevant to the Army's joint and expeditionary role.  Products also include analysis and data concerning individual Soldier items including protective equipment such as helmets and vests.  These survivability products are leveraged into rapid-equipping initiatives and other technical support for operational forces involved in the current fight.  Continued development of these products also guarantees preservation of the Army's vitally needed technical corporate memory for expert survivability advice.\n\nSurvivability analyses funded by this project are conducted across the spectrum of battlefield threats to include guns, missiles, mines and other methods of inflicting physical damage; jammers, countermeasures, and other electronic warfare techniques; cybersecurity and computer network operations; and directed energy weapons.  This survivability information enables developers, users, and decision makers to perform credible survivability tradeoffs for both Soldiers and materiel.  These technical survivability details enable properly informed decisions concerning systems and tactics that maximize both the combat power and survivability of Army forces.  Survivability data and analysis results funded by this project are efficiently leveraged for many different Army uses, reducing total cost to the Army by eliminating the need for duplicative capabilities funded by individual system developers.  Central funding of this mission assures the Army accurate and consistent treatment of survivability across all classes of systems, across all formal system Evaluations, and across the Army's AR 5-5 studies process.  Work program is prioritized principally by the ATEC\/AEC and is used by them in the Army's formal Evaluation process in such a way that ATEC can comply with its legally mandated responsibility to assess system survivability along with effectiveness and suitability.  Program Managers (PM) and the Program Executive Officers (PEO) use the survivability analyses and data funded by this project to make design decisions that are optimized for survivability, to direct specific weapon system development efforts that are needed for survivability enhancement, and to structure product improvement programs. Soldier survivability data and analysis is leveraged to support the survivability portion of the HQDA G1 MANPRINT program.  TRADOC combat developers exploit the survivability products funded by this project to initiate and improve survivability\/lethality requirements, and to develop and refine doctrine and tactics.  Also, the quantitative analytical results funded by the project are leveraged as core inputs to formal AR 5-5 studies and other studies as directed by Army leaders.  While the Army is at war, analytical results funded by this project are also directly leveraged for survivability support to current operations.  Finally, for particularly urgent or controversial survivability issues, data and analysis funded by this project are used directly by senior Army decision makers to assure technically sound program\/production decisions.   \n \nThis project also supports highly technical cybersecurity survivability analysis of Army battle command\/networked systems as well as Army network architectures and technology.  Supports ATEC and other electronic warfare vulnerability testers and evaluators by developing and providing highly technical specialized field countermeasure environments that threat forces may employ against Army communications networks, air defense and other systems.  In conjunction with PMs and Army intelligence agencies, analyzes technical vulnerabilities of foreign weapons, network related systems, and intelligence Electronic Warfare (EW) systems to U.S. Army EW systems.  Provides survivability analysis to SoS Network Vulnerability Assessments to CIO G6, Network Integration Evaluation (NIE)to triad (the Brigade Modernization Command (BMC), the Army Test and Evaluation Command (ATEC), and the System of Systems Integration (SoSI)Directorate).  Without the survivability products funded by this project, ATEC would not have a technically credible account of survivability issues at milestone decision points and systems could be fielded with unknown vulnerabilities leading to unnecessary US casualties.  PMs would make design choices that failed to properly optimize survivability, TRADOC would generate requirements that were not technically credible, and the Army studies process would rest on an inaccurate and inconsistent basis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Survivability, Lethality, Vulnerability (SLV) Analyses for Ground, Aviation, Munitions, and Soldier Systems"
                                    },
                                    "Description": {
                                        "val": "Conduct integrated survivability, lethality, vulnerability analyses for developmental aviation, ground, soldier and munition systems including Stryker, Ground Soldier System, Excalibur, and Intelligent Mine System (IMS). Completed ballistic survivability\/vulnerability analysis for MRAP T&E, Guided Multiple Launch Rocket system (GMLRS) Alternative Warhead Initial Operational Test and Evaluation (IOT&E) and Excalibur Live Fire Test and Evaluation (LFT&E) System Engineering Test-P1 test events, which included providing pre-shot predictions, performing damage assessments after each live fire test, completing post-shot analyses, behind armor debris (BAD) test\/analyses, and crew survivability analysis and providing technical data required by ATEC for the Systems Evaluation Reports.  Additionally, results and recommendations from our crosswalk of MRAP LFT&E assessed casualty\/selected Theater casualty incidents were briefed to MRAP PM & vendors, ATEC, HQDA and DOT&E resulting in vehicle design improvements for MRAP platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.127"
                                            },
                                            "Text": {
                                                "val": "Conducted vulnerability analysis for future helicopter systems, such as future vertical lift. Conducted analysis for Kiowa CASUP MS C evaluations to include ballistic survivability assessment, MANPADs threat assessments, and EW and cybersecurity assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.477"
                                            },
                                            "Text": {
                                                "val": "Conduct ballistic SLVA on AEC's highest priority platform and weapon systems, supporting LFT&E pre-shot predictions, damage assessments, post-shot analysis, and crew survivability analysis and provide technical data for system evaluation reports. Provide vulnerability reduction recommendations to PMs for those systems supported. For systems analyzed will provide data to AMSAA for support of AR 5-5 and other Army studies.  Conduct conventional and under-body blast vulnerability analyses for the M270A1 MLRS. Perform pre-shot predictions and prepare for the start of Paladin Integrated Management program's FUSL live-fire in 1QFY16."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.654"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.654"
                                            },
                                            "Text": {
                                                "val": "Will conduct ballistic SLVA on AEC's highest priority platform and weapon systems, supporting LFT&E pre-shot predictions, damage assessments, post-shot analysis, and crew survivability analysis and providing technical data for system evaluation reports. Will provide vulnerability reduction recommendations to PMs for those systems supported. For systems analyzed will provide data to AMSAA for support of Army Analyses of Alternatives. Will make the necessary preparations for the start of AMPV and Bradley full-up system-level LFTE in FY17.  Will perform damage and crew casualty assessments as well as post-shot analyses during the JLTV and the Joint Assault Bridge (JAB) LFTE programs; these data will inform the DOT&E live-fire report to Congress as well as the System Evaluation Reports prepared by ATEC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) System Survivability Assessments"
                                    },
                                    "Description": {
                                        "val": "This effort produces assessments of the survivability of C4ISR systems in Electronic (EW) and cybersecurity threat environments and conducts Electronic Attack (EA) and Cybersecurity projects that reveal critical vulnerabilities in C4ISR systems.  It also defines, demonstrates, and recommends mitigation options to proponents and evaluators of C4ISR.  A cyber vulnerability database is maintained for the benefit of the community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.067"
                                            },
                                            "Text": {
                                                "val": "Conducted modeling and simulation on WIN-T Inc 3 in support of AEC's survivability evaluation of JC4ISR radio's Milestone C decision scheduled for FY15. Conducted priority modeling, testing and analyses of MNVR, Rifleman and Handheld, Manpack and Small Form Fit (HMS) systems.  Conducted Electronic Protection (EP) and Cybersecurity survivability analysis investigations to help identify and mitigate capability gaps in areas such as: C4ISR, battlespace awareness, joint fires, intelligence fusion with secure data sharing and combat identification.  Worked with AEC, product developer and TRADOC user communities to provide integrated SV solutions that are necessary to counter increasingly smart and sophisticated evolving EW and IW threats.  Provided analysis of systems and networks during System-of-Systems Network Vulnerability Assessments and Network Integration Evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.850"
                                            },
                                            "Text": {
                                                "val": "Conduct Electronic Protection (EP) and Cybersecurity survivability analysis Investigations to help identify and mitigate capability gaps in areas such as: C4ISR, battle space awareness, joint fires, intelligence fusion with secure data sharing and combat identification.  Work in conjunction with AEC, product developers and TRADOC user communities to provide integrated SV solutions that are necessary to counter increasingly smart and sophisticated evolving EW and cyber threats.  Provide analysis of systems and networks during System-of-Systems Network Vulnerability Assessments and Network Integration Evaluations. Conduct modeling, simulation and testing on WIN-T Inc 3 in support of AEC's survivability evaluation of JC4ISR radio's Milestone C decision scheduled for FY16. Conduct analysis on both legacy and new COTs radios and waveforms as required. Conduct EW and cyber studies on MARSS, DGCS, Prophet and UAS ISR, AFATDS and IPADS.  Advance development of SAGE communication modeling environment in support of NIE and other field test environments. Develop a methodology to investigate and test GPS reliant systems in an anechoic chamber. Continue developing tools and techniques to conduct software code analysis and the subsequent development of potential exploits. Further development of a large-scale mobile ad-hoc network simulation environment to determine potential vulnerabilities in systems before DT\/OT test events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.625"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.625"
                                            },
                                            "Text": {
                                                "val": "Will analyze data for JTRS MNVR IOTE (NIE 16.1) and FOTE (NIE 16.2).Will analyze test data for the JTRS airborne radio systems. Conduct experimental and modeling analysis in support of Military GPS User Equipment (MGUE) Increment1\/2 [support of ACD&P, Technical  Risk Reduction, EMD \/ Production Phases, and MS_B\/C]  Will conduct experimental and modeling analysis in support of DCGS-A Development and Test Inc 2 Rel 1 Software, [support of DCGS-A(D07)Increment 2-Development Contract Award Increment 2 and MS_B 2QFY16]. Conduct experimental and modeling analysis in support of AFATDS Inc 2 V.7.0 Implementation \/ Deployment [support of Project DU5 Partial Deployment Decision (PDD) for V.7.0] Will conduct experimental and modeling analysis in support of Avenger Fire Control Computer (AFCC) software and hardware upgrades for FAAD [support AFCC-Revision (AFCC-R) Development ensure the system meets the latest Information Assurance (IA) requirements]."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability, Lethality, Vulnerability (SLV) Analyses for Developmental Air and Missile Defense Systems"
                                    },
                                    "Description": {
                                        "val": "Conduct integrated SLV analyses for developmental air and missile defense systems, pre-planned product improvements of current systems, and recently fielded systems.  These systems include the Ballistic Missile Defense System (BMDS), Terminal High Altitude Air Defense (THAAD), PATRIOT, Surface-Launched Advanced Medium Range Air-to-Air Missile (SLAMRAAM), Joint Land Attack Cruise Missile Defense Elevated Netted Sensor System (JLENS), and Sentinel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.905"
                                            },
                                            "Text": {
                                                "val": "Provided Patriot mobile flight simulator (FMS) with simulated advanced electronic attack countermeasure waveforms.  Leveraged capability to support air and missile defense systems.  Conducted LFT&E testing and lethality assessment of PATRIOT MSE missile assessing new lethality enhancers.  Provided cybersecurity testing on multiple air and missile defense system, e.g. counter artillery rocket & mortar (C-RAM) and future efforts, e.g. integrated air & missile defense (IAMD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Text": {
                                                "val": "Design, develop, and employ advanced electronic attack countermeasures to assess AIAMD system of systems.  Provide advanced EA for Patriot PDB-08 limited user testing.  Conduct cybersecurity testing on next iteration of C-RAM.  Complete live-fire test and evaluation lethality assessment of the Patriot MSE missile."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.554"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Text": {
                                                "val": "Will design, develop, and employ advanced electronic attack countermeasures to assess AIAMD system of systems.  Will provide advanced EA and cybersecurity testing for Patriot PDB-08 user operational test events.  Will provided additional EA and cybersecurity testing on other AMD systems as needed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System-of-systems survivability simulation (S4)"
                                    },
                                    "Description": {
                                        "val": "Develop and use an S4 tool to conduct system-of-systems vulnerability analysis supporting the evaluation of a full range of future military capabilities.  This tool will allow SLAD to provide analytical information that extends beyond the reach of traditional single-thread analysis and addresses impacts on mission execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.766"
                                            },
                                            "Text": {
                                                "val": "Supported Army Test and Evaluation Command (ATEC) electronic warfare analysis of software radio. Conducted decision making process development in the context of system of systems survivability analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "Use the system-of-systems survivability simulation to investigate the effects of wide-ranging battlefield threats upon mission execution.  Threat effects include ballistic vulnerability\/lethality, cybersecurity, and electronic warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.413"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "Will use the system-of-systems survivability simulation to investigate the effects of wide-ranging battlefield threats upon mission execution, with an improved level of engineering fidelity. Threat effects include ballistic vulnerability\/lethality, cybersecurity, and electronic warfare."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}