{
    "id": "59ee356347553f98a6ffbe26aa5d4c02018a5974",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602235N"
        },
        "ProgramElementTitle": {
            "val": "Common Picture Applied Research"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "35.411"
            },
            "CurrentYear": {
                "val": "43.533"
            },
            "BudgetYearOne": {
                "val": "42.551"
            },
            "BudgetYearOneBase": {
                "val": "42.551"
            },
            "BudgetYearTwo": {
                "val": "42.646"
            },
            "BudgetYearThree": {
                "val": "39.301"
            },
            "BudgetYearFour": {
                "val": "39.565"
            },
            "BudgetYearFive": {
                "val": "39.736"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2014 - R2 Activity Human Factors and Organizational Design requirements and associated funding is transferred to the Warfighter Sustainment Applied research PE (PE 0602236N).  Ongoing Human Factors research is more closely aligned to Warfighter Sustainment objectives."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (Sep 2011). This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nActivities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "34.136"
                },
                "CurrentYear": {
                    "val": "43.541"
                },
                "BudgetYearOne": {
                    "val": "42.681"
                },
                "BudgetYearOneBase": {
                    "val": "42.681"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.411"
                },
                "CurrentYear": {
                    "val": "43.533"
                },
                "BudgetYearOne": {
                    "val": "42.551"
                },
                "BudgetYearOneBase": {
                    "val": "42.551"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.275"
                },
                "CurrentYear": {
                    "val": "-0.008"
                },
                "BudgetYearOne": {
                    "val": "-0.130"
                },
                "BudgetYearOneBase": {
                    "val": "-0.130"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.008"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.302"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.027"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.584"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.584"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.714"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.714"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Common Picture Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "35.411"
                        },
                        "CurrentYear": {
                            "val": "43.533"
                        },
                        "BudgetYearOne": {
                            "val": "42.551"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.551"
                        },
                        "BudgetYearTwo": {
                            "val": "42.646"
                        },
                        "BudgetYearThree": {
                            "val": "39.301"
                        },
                        "BudgetYearFour": {
                            "val": "39.565"
                        },
                        "BudgetYearFive": {
                            "val": "39.736"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (Sep 2011). This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nActivities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMUNICATION AND NETWORKS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop high throughput dynamic wireless communications and network technologies critical to the mission performance and robustness of naval communications for widely dispersed, mobile air, land, surface and submerged platforms.  These platforms are often size, weight and power (SWaP) limited, and will operate under constraints of cluttered RF spectrum, harsh electro-magnetic interference (EMI) and Beyond Line Of Sight (BLOS) conditions.  The technical payoff is increased network data rates, interoperability across heterogeneous radios, dynamic bandwidth management, and greater mobile network connectivity.  The operational payoff is that warfighters from the operational command to the tactical edge have near real-time access to information, knowledge and decision-making necessary to perform their tasks, including coalition and allied forces.  Emphasis is on tactical edge communications and networks to fully realize net-centric warfare, bridging the Global Information Grid (GIG) and the 'disadvantaged user', e.g., small-deck combatants, submarines, unmanned vehicles, distributed sensors and ground units in urban and radio frequency (RF) challenged environments.  \n\nThe current specific objectives are:\na) Radios and Apertures: Develop technologies for high band radio, electrically-small and actively scanned antennas, addressing critical issue of radio spectrum bandwidth efficiency, spectrum contention and clutter, agile frequency communications with dynamic spectrum access, all-digital front-end with wide dynamic range, power amplifier efficiency, multipath effects, saltwater propagation and BLOS communications. Develop algorithms and signal processing for space-time-frequency diversity communications, including measures for electronic protection, such as low-intercept, antijam waveforms and modulation.  Develop affordable antenna technologies for small size and weight, high radiation efficiency, and wideband operation with rapid beam-steering.  Develop alternatives to RF communications in airborne and terrestrial environments as well as high data rate underwater communications for undersea warfare (distributed sensor netting, unmanned underwater vehicle data exfiltration, submarine Communications at Speed and Depth) using electro-optic\/infra-red (EO\/IR) technologies.  Develop secure, high bandwidth communications systems and the exploitation of existing and emerging network protocols that will avail development of new, Low Earth Orbit (LEO) based data transport mechanisms.\n\nb) Tactical Networking and Network Control\/Management: \nDevelop advanced networking techniques for robust, highly dynamic environments; interoperable networks for secure communications and protocols, bandwidth and network management techniques that manage and allocate bandwidth across tactical and theater levels in support of net-centric operations. Develop rapidly auto-configuring and self-organizing networks with efficient and survivable routing, secure authentication, mobility management and Quality-of-Service guarantee, while optimizing network resources.  Address low bandwidth, synchronization and reliability for Service Oriented Architecture (SOA)\/middleware architecture in both mobile ad-hoc networks (MANET) and infrastructure-based Internet Protocol (IP) backbone networks. Develop cognitive network planning and operations engines whose criteria are based directly on mission objectives, while self-adapting and managing the spectrum allocation and radio resources in such a way that network operations, SOA community of interest, and computer network defense are integrated to form a single common tactical network picture that requires a minimum of human intervention and skill.  Develop technology for improving tactical edge networking and for improving voice communications.\n\nThe decrease from FY 2014 to FY 2015 is the reprioritizing of the Development of optical communications technologies for underwater platforms and research into multi-modal networking across undersea platforms with acoustic, optical, and RF communications.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radios and Apertures: \n- Continued development of low intercept and low probability of Detection (LPD), jam resistant communications\/networks for distributed nodes. \n- Continued blue-green fiber laser technology development for space-based submarine communications. \n- Continued design and development of electronic protection for HF communications. \n- Continued development of integrated metamaterial antennas for ship and ground platforms. \n- Continued demonstration of high peak power, short pulse operation of fiber lasers in blue-green region. \n- Continued development of optical wavefront modulation techniques and optical phased array beam steering methods for terrestrial EO\/IR Lasercomm. \n- Continued novel fiber technology that enables tunable, energy-scalable emissions at a user-defined\/desired wavelength, particularly in the blue-green spectral range. \n- Continued use of novel metamaterials and metastructures that enable conformal antenna designs with ultra-wideband performance. \n- Continued program for a novel blade antenna payload for wideband Ku\/UHF communications that is light weight, has lower power consumption, and is very low cost. \n- Continued technologies to improve spectrum co-existence of military waveforms with commercial communications (e.g., overlay\/underlay techniques, interference cancellation, machine learning and reasoning algorithms for distributed spectral awareness\/management, etc.). \n- Completed design and development of low observable, jam resistant waveform, including directionalization, for advanced tactical data links. \n- Completed structurally integrated HF antennas. \n- Completed new architecture and modes of operation for advanced tactical data link operation in both contested and anti-access regions. \n- Initiated development of low cost approaches for electronic beam steering and multi-beam RF systems \n- Initiated development of blue-green receiver and detector technologies with greater sensitivity, while reducing size, weight, power, and\/or cost. \n\nTactical Networking and Network Control\/Management: \n- Continued design and development of cognitive netops for tactical communications. \n- Continued development of effort to improve secure voice by developing secure voice technology that can interoperate between tactical and strategic networks. \n- Continued program that leverages topology discovery, content modeling, and resource scheduling to support content management functions at the Tactical Edge. \n- Continued managing and controlling functions within a protected routing core at the Tactical Edge. \n- Continued dynamic routing mechanisms that focus on robust data delivery -- in near real time -- under harsh networking conditions (i.e.,intermittent connectivity, limited throughput, etc.).\n- Continued development of cognitive networking, cross-layer optimization protocols for light SOA for tactical networks.\n- Completed development of topology control, discovery mechanisms and directional networking for free space optical links.\n- Completed an investigation of applied wireless communication network science for autonomous, mobile information networks.\n- Completed social network analysis algorithms for protecting wireless networks.\n- Completed an investigation of applied wireless communication network science for autonomous, mobile information networks. \n- Initiated development of techniques and algorithms to manage resources of tactical networks in a manner consistent with Commander's Intent."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.150"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radios and Apertures:\n- Continue all efforts of FY 2014 less those noted as complete. \n- Complete blue-green fiber laser technology development for space-based submarine communications.\n- Complete novel fiber technology that enables tunable, energy-scalable emissions at a user-defined\/desired wavelength, particularly in the blue-green spectral range.\n- Complete development of low intercept and low probability of Detection (LPD), jam resistant communications\/networks for distributed nodes.\n- Complete development of optical wavefront modulation techniques and optical phased array beam steering methods for terrestrial EO\/IR Lasercomm.\n- Complete use of novel metamaterials and metastructures that enable conformal antenna designs with ultra-wideband performance.\n- Complete program for a novel blade antenna payload for wideband Ku\/UHF communications that is light weight, has lower power consumption, and is very low cost.\n- Initiate development of technologies to enable troposcatter communications on the move with reduced size, weight, and power antennas.\n- Initiate development of blue-green filter technologies with wide field of view, narrow bandwidth, and reduced size, weight, complexity, etc. \n\nTactical Networking and Network Control\/Management: \n- Continue all efforts of FY2014 less those noted as complete. \n- Complete development of cognitive networking, cross-layer optimization protocols for light SOA for tactical networks.\n- Complete development of effort to improve secure voice by developing secure voice technology that can interoperate between tactical and strategic networks.\n- Complete program that leverages topology discovery, content modeling, and resource scheduling to support content management functions at the Tactical Edge.\n- Complete managing and controlling functions within a protected routing core at the Tactical Edge.\n- Initiate development of techniques and algorithms to ensure end-to-end delivery of data across undersea networks with large delays and multi-modal communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.975"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.975"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radios and Apertures: \n- Continue all efforts of FY 2015 less those noted as complete. \n- Complete development of integrated metamaterial antennas for ship and ground platforms. \n- Complete demonstration of high peak power, short pulse operation of fiber lasers in blue-green region.\n- Complete development of blue-green receiver and detector technologies with greater sensitivity, while reducing size, weight, power, and\/or cost.\n\nTactical Networking and Network Control\/Management: \n- Continue all efforts of FY2015 less those noted as complete. \n- Complete design and development of cognitive netops for tactical communications.\n- Initiate the development of software-defined networking capabilities for tactical platforms"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "APPLIED INFORMATION SCIENCES FOR DECISION MAKING"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop enablers for decision making and mission execution, to achieve battlespace superiority.  It focuses on the development of algorithms and software technologies that identify and integrate informational content from multiple sources, leading to decision aids that support user-cognitive processes.  Because persistent sensors are generating massive amounts of data, the focus is on technologies that not only integrate information from diverse sources, but also provide indications of information significance in ways that support the user's decision needs, regardless of location and operational situation.  To achieve this, it must be possible to automate understanding of the battlespace by identifying objects, determining relationships among the objects, assessing intent, and automatically generating courses of action with associated risks and uncertainty.  Effort will also be devoted to developing technology for increasing assurance and security for C3 information systems and technology for improving information discovery and information presentation in such systems.  The Nano Electronics Technology activity is focused on developing ultra-low power, higher performance computing devices and components that are based on novel functionalities of nanometer scale materials and are enabled by improved understanding of nanomaterials, new devices and circuit design concepts, as well as new architectures uniquely suited for nanoscale systems.  \n\nEffective in FY 2013, this activity title has been changed from Computational Framework and Methods for Rapid Accurate Decision Making to Applied Information Sciences for Decision Making in order to completely capture the work being performed.  \n\nThe current specific objectives are:\n\na) Data Understanding: Develop automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance.\n\nb) Information Integration: Develop innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions.\n\nc) Data Analytics (Formerly titled: Mission Focused Autonomy (MFA)): Develop proactive situational awareness and rapid decision making applications and analytics with information PUSH as well as PULL, where joint human controlled and automated analytic processes can collaboratively work together to solve tactical and strategic problems within a multi-level, secure environment.  Areas addressed include the following elements: a) access to enterprise level structured and unstructured data repositories and automated search and discovery of evidence collected across these heterogeneous databases; b) analytics that automate the ability to infer the meaning of evidence that is discovered; c) structured process (hypothesis or argument) that provides context in order to constrain and guide the search and analytic techniques toward goals that are focused on proving the hypothesis right or wrong; d) knowledge repository that maintains pedigree and state of hypothesis satisfaction or refutation; e) Collaborative environment wherein all analytic participants can share the state of hypothesis satisfaction and collectively contribute evidence data to solve the common problem. Develop rigorous and efficient methods for building sophisticated situational models, and develop automated reasoning techniques to categorize and recognize situations under a variety of conditions leading to methods that predict situations under different settings including capabilities to address growing cyber-related threats.\n\nd) Resource Optimization: Develop automated decision tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time.  Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner.\n\ne) Cyber Defense (Formerly titled Trusted Systems & Networks): Develop tools and methods to securely handle information without exposing intelligence information about the networks or systems to adversaries. \n\nf) Nanoscale Electronics: To develop novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. Effective in FY 2014, Nanoscale Electronics has been transferred from Electromagnetic Systems Applied Research to Applied Information Sciences for Decision Making in order to completely capture the work being performed.\n\ng) Quantum Information Sciences: Conduct research supporting the efficacy of a free space optical quantum key distribution that would operate in a maritime environment. Understand the implications of imperfect hardware implementations upon the vulnerability of the known protocols. Develop new protocols and encoding schemes that lead to robust performance with high throughput. Conduct research that leads to an understanding of, and develop methods that compensate for atmospheric effects.  \n\nThe increase of funds from FY2014 to FY2015 is for the development and demonstration  of new naval capabilities providing improved cyber situational awareness and cyber toolkit development to assess vulnerabilities in Naval networks.  The funds will also explore new technologies to prevent\/ isolate intrusions to Naval networks and explore automated approaches to cyber policy implementation management.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.198"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Data Understanding: \n- Continued development of methods for integration of low-level image processing and high-level knowledge for simultaneous image segmentation and object recognition, and visual reasoning for image understanding. \n- Continued development of 3D image processing for object recognition and meaningful change detection. \n- Continued development of modular, interactive, intelligent, video-based surveillance systems. \n- Continued methods for building sophisticated visual knowledge bases, development of methods for visual reasoning and integrating them in image\/video understanding, and development of methods for image description. \n- Completed effort to develop a vision-based system for tactical unmanned aerial vehicle to navigate paths without requiring maps or GPS.  \n- Initiated development of algorithms for extraction of information from Light Detection and Ranging (LIDAR) and Radar.\n- Initiated efforts to develop an automated tool to improve checkpoint security by identifying accents of non-native English speakers \n\nInformation Integration: \n- Continued development of algorithms and tools for information representation of unstructured data and structured data in such a way that shared concepts\/relationships in disparate data sets can be automatically compared, matched, or associated, and in a way that can facilitate and improve information fusion. \n- Continued development of algorithms and tools for information fusion of heterogeneous data for classification and reconstruction based on high level features inherent in each data source, with the goal of forming a more complete picture of battlespace environment. \n- Continued development of algorithms and tools for discovering and extracting higher-level features -- objects, events, patterns, intents, relationships, anomalies -- from various data types in support of future asymmetric warfare.\n - Continued research to extend user interfaces for immersive simulation to enable users to better express themselves through non-verbal communications.\n- Initiated development of methods for analysis and integration of text with imagery and video. \n- Initiated development of methods for analysis of structured and unstructured data. \n\nData Analytics (Formally Titled Mission Focused Autonomy (MFA)): \n- Continued research in mission-focused autonomy and reasoning methods; expanded autonomy from simple platform kinematics to include all-source information exploitation and surrounding cultural and social influences. \n- Initiated bringing capability into a multi-level security environment \n- Initiated automating current set of time critical reports to ensure timely decision making that is informed by forensics data.\n- Initiated efforts to develop a task scheduler for unmanned aerial system operators that reflects operator workload  \n\nResource Optimization: \n- Continued development of methods for selecting sensors and platforms for search and surveillance operations in a theater, allocating the selected sensors and platforms to specific missions, operating the allocated sensors during a mission, and fusing the information from the sensors and other sources. \n- Continued development of optimization-based decision aids for resource allocation, such as those required for mission planning at the strategic, operational, and tactical level. \n\nTrusted Systems & Networks: \n- Continued development of anti-tamper methods that are capable of lengthy operation in unattended and un-powered environments, have very high probability of tamper detection and very low probability of false alarm, and remain undetected in the host system. \n- Continued development of automated tools that identify and mitigate potential software vulnerabilities, such as tools that analyze code as it is being written, vulnerability-aware compilers that automatically enhance code security, and techniques for enhancing the client-side security of web applications. \n- Continued development of theory, methods, and tools for model-driven, component-based construction and automatic verification of software systems. \n\nNanoscale Electronics: (Beginning in FY 2014, efforts listed below are continued from PE 0602271)\n- Continued effort to develop a highly linear, low-noise RF amplifier using aligned arrays of single-walled carbon nanotubes. \n- Continued new research in graphene synthesis and device concepts.\n- Continued effort to develop the synthesis, fabrication and testing of graphene-based electromechanical structures and devices. \n- Continued work on graphene-based devices and circuits for low power flexible electronics. \n- Continued research on graphene-organic hybrid materials interfaces and device structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.207"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Data Understanding: \n- Continue all efforts of FY 2014, less those noted as complete.\n- Complete development of electronic protection techniques for long\nrange emitter classification systems.  \n\nInformation Integration: \n- Continue all efforts of FY 2014.\n\nData Analytics (Formally Titled Mission Focused Autonomy (MFA): \n- Continue all efforts of FY 2014.\n- Initiate integrating this analytic environment into parallel Navy Tactical Cloud environment\n\nResource Optimization: \n- Continue all efforts from FY 2014. \n\nTrusted Systems & Networks: \n- Continue all efforts from FY 2014.\n- Complete development of theory, methods, and tools for model-driven, component-based construction and automatic verification of software systems. \n\nNanoscale Electronics:  \n- Continue all efforts of FY 2014, less those noted as completed above.\n\nQuantum Information Sciences:\n- Initiate free-space Quantum Key Distribution applied research program for secure communication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.944"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.944"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Data Understanding: \n- Continue all efforts of FY 2015, less those noted as completed above.\n - Initiate efforts for reconstructing events from a loose network of heterogeneous cameras.\n\nInformation Integration: \n- Continue all efforts of FY 2015.\n- Complete research to extend user interfaces for immersive simulation to enable users to better express themselves through non-verbal communications.  \n\nData Analytics (Formerly Titled: Mission Focused Autonomy (MFA)\n- Continue all efforts from FY 2015.\n- Initiate Maritime domain awareness toolkit development for small vessel tracking.\n- Initiate cyber information awareness decision tools for hull, mechanical and electrical security for Naval vessels.\n\nResource Optimization: \n- Continue all efforts from FY 2015 less those noted as completed above. \n\nTrusted Systems & Networks: \n- Continue all efforts from FY 2015 less those noted as completed above.\n- Initiate development for methods and tools for semi-\/fully- automated software model extraction and online program execution monitoring toward achieving adaptive and resilient computing system.\n\nQuantum Information Sciences: \n- Continue all efforts from FY 2015 less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MULTI-SOURCE INTEGRATION AND COMBAT IDENTIFICATION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses theater air and missile defense (TAMD), and responds to warfighter needs for rapid, high confidence Combat Identification (CID) of air and missile threats at long range, using real time and non-real time threat attributes and intelligence information.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.847"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of a new radar signature analysis technique based on nonlinear dynamics.\n- Continued development of coordinated, multi-platform, multi-component waveforms.\n- Continued development of a real-time, electronic warfare support, de-interleaving capability.\n- Continued development of advanced communications emitter identification.\n- Continued to develop and demonstrate Multiple Input Multiple Output (MIMO) radar concepts and technology using High Frequency (HF) Skywave radar.\n- Continued development of unique tactical feature derivation of modern surveillance systems.\n- Continued development of electronic protection techniques for long range emitter classification systems.\n- Completed development of functional classification techniques of advanced threat emissions.\n- Initiated development of Associative Learning signal classification framework to provide robust automatic target recognition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 unless noted as complete.\n- Complete development of unique tactical feature derivation of modern surveillance systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.818"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.818"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 unless noted as complete."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL SPACE EXPLOITATION"
                                    },
                                    "Description": {
                                        "val": "The Tactical Space Exploitation initiative explores the application of new space craft technologies on small, light-weight and low-cost satellites, to enhance naval warfighting capabilities by taking advantage of the global access, revisit and connectivity provided by orbital platforms.\n\na) Spacecraft Technology: Affordably expendable payload and bus technologies will be developed, which will serve as building blocks for future responsive space systems: payloads, bus technologies and significant space robotic technologies that address on-orbit inspection, servicing, repair and assembly, and mission-life extension.\n\nThe increase in funding from FY 2014 to FY 2015 reflects initiation of new efforts and planned funding profile of existing efforts within this activity.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Spacecraft Technology:\n- Continued program to use chemical release from satellites launched into selected low-Earth orbits to de-populate intense trapped electrons in radiation belts following a low-altitude nuclear explosion in space.\n- Continued effort to develop technologies using autonomous, bi-dexterous manipulation for close proximity operations in space.\n- Continued developing the underlying fluid transfer technologies for steerable radiators that will enable spacecraft thermal radiators to be pointed away from the sun.\n- Continued developing a proof-of-concept, reliable, touch sensitive skin for robotic arms, with emphasis on space applications, and the associated fault detection and model identification algorithms required to utilize it.\n- Continued developing the ability to artificially generate and maintain a dust layer in the near-earth plasma environment to induce enhanced drag on space debris, aiming toward debris mitigation.\n- Continued effort to develop a self-contained, space-based plasma impedance probe innovative sensor that will be easy to mount and field on any space platform, which will provide reliable early warning of hazardous spacecraft charging.\n- Continued effort to develop the key advanced technologies leading to robust use of space-based electrodynamic propulsion, which will enable spacecraft that perform large scale maneuvers fuel-free, and more cheaply than is currently possible.\n- Continued effort to design and develop a novel miniature radiation displacement damage sensor that will accurately measure the impact of displacement damage in a space environment. \n- Completed effort to design, develop and test a novel PicoSat-compatible spacecraft attitude sensor that is based on an existing NRL-designed space weather spectrometer, which will enable PicoSat-class missions requiring continuous day\/night operations.\n- Initiated efforts to develop a novel actuator and associated control laws that will enable lighter weight architectures for spaceflight robot arms, thereby dramatically reducing size, weight, complexity, and cost of spaceflight robotic manipulators.\n- Initiated efforts to quickly assimilate tracking data of orbiting debris and space objects, while simultaneously shrinking position uncertainties, in order to create more room to operate in space."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.264"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Spacecraft Technology:\n- Continue all efforts of FY 2014 unless noted as complete.\n- Complete effort to develop a self-contained, space-based plasma impedance probe innovative sensor that will be easy to mount and field on any space platform, which will provide reliable early warning of hazardous spacecraft charging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Spacecraft Technology: \n- Continue all efforts of FY 2015 unless noted as complete.\n- Complete effort to design and develop a novel miniature radiation displacement damage sensor that will accurately measure the impact of displacement damage in a space environment. \n- Complete effort to develop the key advanced technologies leading to robust use of space-based electrodynamic propulsion, which will enable spacecraft that perform large scale maneuvers fuel-free, and more cheaply than is currently possible."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INFORMATION SECURITY RESEARCH"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to protect the Navy and the Joint information infrastructure from hostile exploitation and attack.  This activity transfers from PE 0603235N effective FY 2013 to focus on applied research in information security.  \n\nThe current specific objectives are: \na) Network Situation Awareness & Security: Develop tools, techniques and methodologies to improve network resistance to denial of service attacks and improve indications and warnings of suspect activities. \nb) Network Traffic Analysis and Assessment: Develop methods for conducting network traffic analysis; monitoring and assessing network status and health; identifying new capabilities to analyze network vulnerabilities and attacks; and providing situational awareness of network assets and operations.\nc) Information Assurance: Develop and measure the effectiveness of Information Assurance (IA) protective solutions and improve the quality and level of certification of information assurance software.\nThe following accomplishments and plans are non-inclusive examples of accomplishments and plans for projects funded in this activity.\n\nBeginning in FY15, efforts identified under \"Information Security Research\" will be executed in Activity- APPLIED INFORMATION SCIENCES FOR DECISION MAKING under objective Cyber Defense (Formerly titled Trusted Systems & Networks)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Network Situation Awareness & Security:\n- Continued development of algorithms\/methods for providing attribution of threat-agents through the network\/infrastructure. Emphasis will be placed on addressing translational boundaries, cross-domains, and obfuscation techniques to avoid detection and tagging.\n- Continued new mobile agent technology that provides network protection, thwarts botnet attacks, and provides for a resilient computational infrastructure and communications environment. Investigate new methods for subverting the control plane of the mobile code attacking the infrastructure.\n- Continued development of algorithms\/methods for providing attribution of threat-agents through the network\/infrastructure. Building upon previous results, develop network-based techniques to provide pro-active response to attributed threat agents to mitigate attack vector and ensure mission success. \n- Continued investigating new methods for subverting the control plane of the mobile code attacking the network infrastructure. \n- Completed development of algorithms to link\/mine disparate system\/network activities in order to identify malicious\/threat agent actions against infrastructure components\/ systems. Expand algorithms to include threat-agent identification. \n- Initiated the development of new algorithms for taking control of bots once the control plane is compromised. \n- Initiated development of new algorithms\/techniques to characterize Navy and Marine Corps network assets in order to develop robust security mechanisms and support technologies based on criticality and mission essential operations. \n\nNetwork Traffic Analysis and Assessment:\n- Continued development of new algorithms focused on detection of nation state sponsored activities through the network infrastructure.\n- Continued algorithms to address sophisticated malicious code techniques that exploit network traffic\/data that is fragmented, encrypted, and\/or obfuscated using polymorphic methods, as well as techniques that transgress security perimeters and exfiltrate data.\n- Continued development of new algorithms focused on detection of nation state sponsored activities through the network infrastructure. Develop algorithms to address sophisticated malicious code techniques. \n- Initiated development of new algorithms that provide attack prediction and targets of opportunity. \n\nInformation Assurance: \n- Completed development of the enclave boundary security controller to protect Navy networks from attack and exploitation with emphasis on addressing malware detection, data exfiltration, general attack detection, network reconstitution, exploitable cross-infrastructure dependencies. \n- Initiated development of methods and techniques to provide component repurposing\/agility to flatten the attack surface from sophisticated nation-state sponsored attacks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Network Situation Awareness & Security: \n- Continue all efforts of FY 2014 unless otherwise noted as complete. \n\nNetwork Traffic Analysis and Assessment: \n- Continue all efforts of FY 2014.  \n- Continue development of new algorithms focused on detection of nation state sponsored activities through the network infrastructure. Develop algorithms to address sophisticated malicious code techniques. \n- Initiate the development of algorithms and techniques to detect stealthy protocols that enable covert communication by exploiting channels available in existing widely used protocols.\n \nInformation Assurance: \n- Continue all efforts of FY 2014 unless otherwise noted as complete.  \n- Continue the development of methods and techniques to provide component repurposing\/agility to flatten the attack surface from sophisticated nation-state sponsored attacks.\n- Initiate the development of trusted computing technologies to minimize\/limit authentication\/sign-on services across various network, virtual, and\/or cloud environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Network Situation Awareness & Security:\n- Continue all efforts of FY 2015.  \n- Continue the development of algorithms and techniques to detect stealthy protocols that enable covert communication by exploiting channels available in existing widely used protocols.\n- Initiate the development of a secure information exchange framework capable of supporting various system components for various types of information exchange, including between nodes and within cyber nodes across various classification domains.\n\nNetwork Traffic Analysis and Assessment: \n- Continue all efforts of FY 2015.\n- Initiate the development of automated techniques to assess the cyber vulnerability of defense assets, particularly complex systems, or \"systems of systems,\" in order to quantify defense readiness against nation state-sponsored attacks. \n\nInformation Assurance: \n- Continue all efforts of FY 2015. \n- Continue the development of trusted computing technologies to minimize\/limit authentication\/sign-on services across various network, virtual, and\/or cloud environments.\n- Initiate the development of multi-level security enablers that support heterogeneous cyber assets, with particular emphasis on the challenges of unmanned airborne assets that require near real-time mission repurposing and agile defenses against nation state-sponsored attacks."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AUTONOMOUS SYSTEMS AND ROBOTICS"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Systems and Robotics initiative explores the application of new technologies to advance capabilities in the area of robotics, autonomous systems propulsion and control, and integration of autonomous systems. Efforts will be focused on the Assistant Secretary of Defense (Research and Engineering) (ASD(R&E)) priorities in autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Robotics Platform Research:\nThis addresses development of autonomous robotic systems capability to interact with and service other platforms and autonomous vehicles.\n\nMicro-Robotic Servicing - advanced highly dexterous control of extremely lightweight and flexible robotic arms, with specific application to EOD, surveillance and on-orbit servicing robotic communities. This research would extend ongoing research in lightweight robotic arms.\n\nAutonomous Refueling - development of hardware, algorithms, and sensors for hybrid rigid-compliant robotic arms in rapidly changing environments, with specific application to autonomous refueling of USVs, UAVs and UGVs while moving in their environments, advancing beyond the DARPA-sponsored \"Rapid Autonomous Fuel Transfer Project\".\n\nLow Power Micro-robotics - development of onboard sensors, control electronics, and actuators requiring very low power, with specific application to robotic missions over long durations.\n\nAdvanced Manipulators and Tool-Changers - development of innovative robotic manipulators, tool changers, and associated sensors for challenging robotic manipulation tasks, with specific application to EOD and other robotic missions in difficult environments. This research would extend previous research by providing robust end effector technology and tool changing capability. The overall research outcomes will enhance DoD capability in the areas of explosive ordnance disposal, autonomous vehicle refueling, and innovative robotic arm control. Research deliverables will include hardware development in the areas of lightweight robotic arms, end effector tools and tool changers, and low\npower electronics and actuators.\n\nAutonomous Vehicles:\n- This effort will draw from current research and push the technology development to the next level to provide a leap-ahead capability in long endurance, deployable, autonomous, robotic air vehicle using fuel cell electric propulsion systems for high efficiency, even in small vehicles, which can provide robust airborne sensor capabilities for submarines, UUVs, small naval platforms and small dismounted units.\n\nUndersea Vehicles:\n- Funding would be used to acquire a medium sized (12.5 inch diameter) Autonomous Underwater Vehicle as an at sea test platform to advance the state of art of onboard intelligent autonomy. This medium sized UUV is readily amenable to vehicle and sensor testing in the wave pool in the Laboratory for Autonomous Systems Research facility. Subsequently, this would allow at sea testing of State of the art autonomy algorithms (e.g. goal driven autonomy, human cognitive models, Markov decision processes) that allow Navy underwater vehicles to carry out complex mission in denied areas by understanding the environment and adapting mission goals in the context of the commander's intent, with\nlittle or no human operator intervention.\n\nAutonomous Systems Integration:\n- To support the Assistant Secretary of Defense (Research and Engineering) (ASD(R&E)) priorities in autonomous systems, and specifically to advance the state of the art in heterogeneous teams of autonomous platforms, (including sensor networks and mobile communication nodes) that can work seamlessly with the warfighter, funding will be applied to small air platforms and militarily relevant unmanned ground vehicles to integrate sensors and advanced power sources, and to develop the autonomy software that allows the individual platforms to work together, as well as to work at a peer-to-peer level with the warfighter. This includes advanced human-robot interaction techniques and information\nprocessing and presentation techniques that reduce the warfighter's cognitive load and allows him to work with a team of autonomous systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.972"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 for sustainment of Autonomous Systems and Robotics initiative."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies that enable the transformation to network centric warfare.  Net-centric operations include communications and information assurance capabilities to enable all-source data access, tailored dissemination of information to Command and Control (C2) and Intelligence, Surveillance and Reconnaissance (ISR) users across the network, and rapid, accurate decision making based on this information.  The operational benefits sought are increased speed of response, accuracy, and precision of command; distributed self-synchronization; flexibility and adaptability to an operational situation; and decision superiority.  \n\nSpecific examples of metrics under this PE include:\n- Increase network data rates and interoperability across heterogeneous radios; improve dynamic bandwidth management and mobile network connectivity.\n- Increase the understanding of the battlespace by the development of automated tools for extracting information from images and signals, identifying objects, determining relationships among the objects, assessing intent, and generating courses of action.\n- Improve the integration of  sensors, networks, decision aids, weapons, and supporting systems into a highly adaptive, human-centric, comprehensive maritime system.\n- Improve integrated signals electronics packages in small, light-weight, and low-cost satellites to test new concepts for global ship tracking and two-way data exfiltration."
                        }
                    }
                }
            ]
        }
    }
}