{
    "id": "5b068d3ffea45109302c5bfe543f748f77fb9877",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Budget and Program Assessments"
        },
        "R1LineNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.572"
            },
            "PriorYear": {
                "val": "4.005"
            },
            "CurrentYear": {
                "val": "4.093"
            },
            "BudgetYearOne": {
                "val": "4.123"
            },
            "BudgetYearOneBase": {
                "val": "4.123"
            },
            "BudgetYearTwo": {
                "val": "4.161"
            },
            "BudgetYearThree": {
                "val": "4.210"
            },
            "BudgetYearFour": {
                "val": "4.259"
            },
            "BudgetYearFive": {
                "val": "4.325"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the Office of the Director, Cost Assessment & Program Evaluation (CAPE).  It funds assessments that help to resolve budget and programmatic issues across the full range of the Department’s activities.  Projects that support this effort help to inform the leadership on program alternatives, capability concept development, design and cost, the appropriate balance of capabilities across the force, and also to identify how well the Department’s expenditures are meeting its goals, and how well the force can implement the Defense strategy.\n\nThis program provides for analytical research across a spectrum of  issues and concerns.  The research agenda is focused on near to long-term problems identified by the Secretary of Defense, and addresses difficult and complex questions linked to program alternatives for current and future capabilities and forces in order to enhance the senior leadership's deliberations and decision-making.\n\nThis program provides the scientific and technical engineering services needed for research studies in the development of models and simulations and the evaluation of current analytical tools and scientific methods used to evaluate and assess weapons systems and warfighting capabilities for warfighting environments and scenarios, and related force structure.  Deliverables from this program will include reports, briefings, and analyses designed to illuminate critical issues facing the Department.  Outcomes include recommendations for new modeling techniques, programmatic alternatives, and scenario development."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.068"
                },
                "CurrentYear": {
                    "val": "4.100"
                },
                "BudgetYearOne": {
                    "val": "4.150"
                },
                "BudgetYearOneBase": {
                    "val": "4.150"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.005"
                },
                "CurrentYear": {
                    "val": "4.093"
                },
                "BudgetYearOne": {
                    "val": "4.123"
                },
                "BudgetYearOneBase": {
                    "val": "4.123"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.063"
                },
                "CurrentYear": {
                    "val": "-0.007"
                },
                "BudgetYearOne": {
                    "val": "-0.027"
                },
                "BudgetYearOneBase": {
                    "val": "-0.027"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.063"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.027"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program reduced minimally to better align with Department priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "101"
                    },
                    "ProjectTitle": {
                        "val": "Budget and Program Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.572"
                        },
                        "PriorYear": {
                            "val": "4.005"
                        },
                        "CurrentYear": {
                            "val": "4.093"
                        },
                        "BudgetYearOne": {
                            "val": "4.123"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.123"
                        },
                        "BudgetYearTwo": {
                            "val": "4.161"
                        },
                        "BudgetYearThree": {
                            "val": "4.210"
                        },
                        "BudgetYearFour": {
                            "val": "4.259"
                        },
                        "BudgetYearFive": {
                            "val": "4.325"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports the Office of the Director, Cost Assessment & Program Evaluation (CAPE).  It funds assessments that help to resolve budget and programmatic issues across the full range of the Department’s activities.  Projects that support this effort help to inform the leadership on program alternatives, capability concept development, design and cost, the appropriate balance of capabilities across the force, and also to identify how well the Department’s expenditures are meeting its goals, and how well the force can implement the Defense strategy.\n\nThis program provides for analytical research across a spectrum of  issues and concerns.  The research agenda is focused on near to long-term problems identified by the Secretary of Defense, and addresses difficult and complex questions linked to program alternatives for current and future capabilities and forces in order to enhance DoD senior leadership's deliberations and decision-making.\n\nThis program provides the scientific and technical engineering services needed for research studies in the development of models and simulations and the evaluation of current analytical tools and scientific methods used to evaluate and assess weapons systems and warfighting capabilities for warfighting environments and scenarios, and related force structure.  Deliverables from this program will include reports, briefings, and analyses designed to illuminate critical issues facing the Department.  Outcomes include recommendations for new modeling techniques, programmatic alternatives, and scenario development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OSD Support for Programming Budget"
                                    },
                                    "Description": {
                                        "val": "This program provides for analytical research across a spectrum of  issues and concerns.  The research agenda is focused on near to long-term problems identified by the Secretary of Defense, and addresses difficult and complex questions linked to program alternatives for current and future capabilities and forces in order to enhance the senior leadership's deliberations and decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.005"
                                            },
                                            "Text": {
                                                "val": "- Evaluated and upgraded the cost analysis tools used to inform program, budget, and Defense Acquisition Board reviews.\n- Analyzed war-fighting and joint operations to support major defense reviews, including transformation initiatives, force and weapons systems requirements, and AoAs to support major acquisition decisions; land forces, including the manning, equipping, training, sustaining, and fighting these forces with special emphasis on the resources needed to accomplish these activities.\n- Analyzed mobility requirements and modernization decisions for airlift aircraft, sealift vessels, and tankers in support of the defense strategy; force structure and investment decisions for pre-positioning ashore and afloat and the impact of forward presence postures.\n- Evaluated scenarios for reducing logistics vulnerabilities to include evaluation of threat databases, demographics, and technological trends.  Developed determinations of impact on national security resources.\n- Analyzed sea and airbase scenarios to support transformation initiatives.\n- Evaluated medical cost growth to reliably forecast costs for budgeting using the tool developed to evaluate the impact of alternative benefit structures and policies on future costs.\n- Continued to analyze alternative cyber defense strategies to improve the cyber security and mission assurance of the Department of Defense, by support of training objectives and scenarios and advocating for and assisting in the development of a data driven analysis.\n- Continued to analyze sexual assault investigations from Service Military Criminal Investigative Organizations to identify programs that can be developed or expanded to eliminate the problem."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.093"
                                            },
                                            "Text": {
                                                "val": "- Continue to evaluate and upgrade the cost analysis tools used to inform program, budget, and Defense Acquisition Board reviews.\n- Continue to analyzed war-fighting and joint operations to support major defense reviews, including transformation initiatives, force and weapons systems requirements, and AoAs to support major acquisition decisions; land forces, including the manning, equipping, training, sustaining, and fighting these forces with special emphasis on the resources needed to accomplish these activities.\n- Analyze mobility requirements and modernization decisions for airlift aircraft, sealift vessels, and tankers in support of the defense strategy; force structure and investment decisions for pre-positioning ashore and afloat and the impact of forward presence postures.\n- Evaluate scenarios for reducing logistics vulnerabilities to include evaluation of threat databases, demographics, and technological trends; and developed strategies to reduce the impact on national security resources.\n- Analyze scenarios of national security interest to support transformation initiatives.\n- Improve medical cost growth to reliably forecast costs for budgeting using the tool developed to evaluate the impact of alternative benefit structures and policies on future costs.\n- Analyze alternative cyber defense strategies to improve the cyber security and mission assurance of the Department of Defense, by support of training objectives and scenarios and advocating for and assisting in the development of a data driven analysis.\n- Continue to analyze sexual assault investigations from Service Military Criminal Investigative Organizations to identify programs that can be developed or expanded to eliminate the problem."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.123"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.123"
                                            },
                                            "Text": {
                                                "val": "Studies, analyses, and assessments will be focused on:\n- Improving cost analysis tools to inform program, budget, and Defense Acquisition Board reviews\n- In support of WSARA, independently assessing, analyzing, and, where appropriate, updating cost indices, inflation rates, and escalation rates used in preparation of the President’s budget for major acquisition programs.\n- Developing and enhancing databases that provide cost data for major weapon systems\n- Improving estimates produced by the Defense Employment and Purchases Projection System and Defense Translator, which are used in decision briefs to the President, Congress, Secretary of Defense, and Deputy Secretary of Defense.  The translator accounts for the distribution of Defense spending among the industries producing the goods and services that support DoD. \n- Modeling and analysis of aircraft survivability against various threat detection approaches and in various operational environments.  Assessing the ability of aircraft and weapons to operate in anti-access\/area denial regions.\n- Modeling and analysis of logistical vulnerabilities against various threats and in various operational environments.  Assessing the cost and mission effectiveness of proposed improvements.\n- Scenarios and modeling for mobile intelligence targets.\n- In support of the Defense Strategic Guidance, analyzing rotary wing programs to assess alternative platforms for combat rescue; examining the cost of all mission alternatives and acquisition strategies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A mix of competitive contracts with commercial firms and research provided by university affiliated research centers (UARCs), and Federally Funded Research and Development Centers (FFRDCs)."
                        },
                        "PerformanceMetrics": {
                            "val": "The products or expected outcomes of this program are studies and analyses to support resource allocation decisions, major defense acquisition decisions, and issues of high interest to the Secretary of Defense.  Performance is measured by the quality of the analyses and is monitored through the review of the organizational assessment process.  The primary goal is to ensure that study and analytical products are timely, clear, complete, accurate, responsive, balanced, and objective."
                        }
                    }
                }
            ]
        }
    }
}