{
    "id": "5b45c04c39bcc086dd4ea0beacbeb87debebbc35",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603716D8Z"
        },
        "ProgramElementTitle": {
            "val": "Strategic Environmental Research and Development Program (SERDP)"
        },
        "R1LineNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "122.841"
            },
            "PriorYear": {
                "val": "60.651"
            },
            "CurrentYear": {
                "val": "57.714"
            },
            "BudgetYearOne": {
                "val": "65.836"
            },
            "BudgetYearOneBase": {
                "val": "65.836"
            },
            "BudgetYearTwo": {
                "val": "69.905"
            },
            "BudgetYearThree": {
                "val": "74.772"
            },
            "BudgetYearFour": {
                "val": "80.806"
            },
            "BudgetYearFive": {
                "val": "81.925"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Climate Change, and Weapons Systems and Platforms.  SERDP does this by addressing high priority DoD environmental technology requirements.  SERDP enhances military operations, improves military systems` effectiveness, enhances military training\/readiness, sustains DoD’s training and test ranges and installation infrastructure, and helps ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.324"
                },
                "CurrentYear": {
                    "val": "57.796"
                },
                "BudgetYearOne": {
                    "val": "68.287"
                },
                "BudgetYearOneBase": {
                    "val": "68.287"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.651"
                },
                "CurrentYear": {
                    "val": "57.714"
                },
                "BudgetYearOne": {
                    "val": "65.836"
                },
                "BudgetYearOneBase": {
                    "val": "65.836"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.673"
                },
                "CurrentYear": {
                    "val": "-0.082"
                },
                "BudgetYearOne": {
                    "val": "-2.451"
                },
                "BudgetYearOneBase": {
                    "val": "-2.451"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "CurrentYear": {
                        "val": "-0.082"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.673"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.451"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.451"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The revised funding levels for FY 2016 are due to the need to address high priority programs within AT&L as determined by senior leadership."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P470"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Environmental Research and Development Program (SERDP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "122.841"
                        },
                        "PriorYear": {
                            "val": "60.651"
                        },
                        "CurrentYear": {
                            "val": "57.714"
                        },
                        "BudgetYearOne": {
                            "val": "65.836"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.836"
                        },
                        "BudgetYearTwo": {
                            "val": "69.905"
                        },
                        "BudgetYearThree": {
                            "val": "74.772"
                        },
                        "BudgetYearFour": {
                            "val": "80.806"
                        },
                        "BudgetYearFive": {
                            "val": "81.925"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Climate Change, and Weapons Systems and Platforms.  SERDP does this by addressing high-priority DoD environmental technology requirements.  Technologies developed by SERDP enhance military operations, improve military systems’ effectiveness, enhance military training\/readiness, sustain DoD’s training and test ranges and installation infrastructure, and help ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and by reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Restoration"
                                    },
                                    "Description": {
                                        "val": "Environmental Restoration (ER) reduces DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.633"
                                            },
                                            "Text": {
                                                "val": "Research initiatives focused on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  Specific Statements of Need were released and proposals were selected that will address  improved remediation operation through fine scale delineation of contaminated subsurface environments, in situ remediation of perfluoroalkyl contaminated groundwater, and improved understanding of the impact of ongoing, low level contaminant influx to aquatic sediment site restoration.  Details are available at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.346"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  A Statement of Need was released and proposals are being selected that will address improved understanding of long term natural attenuation processes on contaminants in groundwater. Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.806"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Response (MR)"
                                    },
                                    "Description": {
                                        "val": "Munitions Response (MR) develops detection, discrimination, and remediation technologies for Unexploded Ordnance (UXO) to address the significant DoD liability in the Military Munitions Response Program.  Investments are also made to improve active range clearance and to reduce generation of UXO during live fire testing and training operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.006"
                                            },
                                            "Text": {
                                                "val": "Research initiatives focused on the highest priority DoD requirements in underwater UXO detection and discrimination, including wide area and detailed surveys; cost-effective recovery and disposal; characteristics of munitions underwater and their environment; and protocols to reduce the costs associated with detecting and remediating UXO underwater.  Statements of Need were released and proposals were selected to address these issues.  Details are available at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.648"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and discrimination, advanced sensors, signal processing, supporting technologies, and protocols to reduce the costs associated with detecting and remediating UXO underwater.  A Statement of Need was released and proposals are being selected that will address the detection, classification, and remediation of military munitions underwater. Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.106"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.106"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and discrimination, advanced sensors, signal processing, supporting technologies, and protocols to reduce the costs associated with detecting and remediating UXO underwater."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Conservation and Climate Change (RC)"
                                    },
                                    "Description": {
                                        "val": "Resource Conservation and Climate Change (RC) develops the science and technologies required to sustain training and testing ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.606"
                                            },
                                            "Text": {
                                                "val": "Research initiatives focused on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges and respond to requirements in the 2010 QDR, including the assessment of climate change impacts to DoD installations.  Specific Statements of Need were released and proposals were selected for funding to address these issues.  Details are available at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.773"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges and respond to requirements in the 2010 QDR, including the assessment of climate change impacts to DoD installations. Specific Statements of Need were released and proposals are being selected for funding to address new paradigms for managing species and ecosystems in a non-stationary world and adapting to changes in the hydrologic cycle under non-stationary climate conditions. Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.706"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.706"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges and respond to requirements in the 2010 QDR, including the assessment of climate change impacts to DoD installations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons Systems and Platforms (WP)"
                                    },
                                    "Description": {
                                        "val": "Weapons Systems and Platforms (WP) develops technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.406"
                                            },
                                            "Text": {
                                                "val": "Research focused on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts.  Specific Statements of Need were released to address the development of environmentally Sustainable Gas Generators and Mono\/Bi-Propellants, development of replacements for polyimide composite materials containing methylene dianiline (MDA).  Details are available at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.947"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts.  Specific Statements of Need were released and proposals are being selected for funding to address sustainable gasless delay formulations and standardized test methodologies for low observable coating durability. Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.218"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.218"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance in this program is monitored at two levels.  At the lowest level, each of the more than 160 individual projects is measured against both technical and financial milestones on a quarterly and annual basis.  At a program-wide level, progress is measured against DoD's environmental requirements and the development of technologies that address these requirements as well as the transition of these technologies to either to demonstration and validation programs or to direct use in the field."
                        }
                    }
                }
            ]
        }
    }
}