{
    "id": "5b91c8df4583cc1956b6f06cb3feb5eb143932b5",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineNumber": {
            "val": "68"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "51.875"
            },
            "PriorYear": {
                "val": "47.240"
            },
            "CurrentYear": {
                "val": "46.300"
            },
            "BudgetYearOne": {
                "val": "37.420"
            },
            "BudgetYearOneBase": {
                "val": "37.420"
            },
            "BudgetYearTwo": {
                "val": "38.912"
            },
            "BudgetYearThree": {
                "val": "38.873"
            },
            "BudgetYearFour": {
                "val": "41.433"
            },
            "BudgetYearFive": {
                "val": "41.873"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The basic mission of this program element is to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments. It contains two projects.\n \nP455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy. OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects. First, to develop, demonstrate and transition into use operational energy technologies and practices that will improve DoD military capabilities and\/or reduce costs. Second, to establish within the military Services sustainable, institutional capacity to continue to research, develop and adopt operational energy innovations. OECIF funds serve as “seed money” to start or consolidate promising operational energy programs to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects.\n \nP456, the Hybrid Energy Storage Module (HESM), co-sponsored by ASD(R&E) and ASD(OEPP), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of HESM are to (1) demonstrate energy storage systems with high power and energy densities, scalable to all power levels that reduce total logistics demand, increase platform ability to sustain operations during engagement, and (2) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "47.001"
                },
                "CurrentYear": {
                    "val": "31.800"
                },
                "BudgetYearOne": {
                    "val": "37.584"
                },
                "BudgetYearOneBase": {
                    "val": "37.584"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.240"
                },
                "CurrentYear": {
                    "val": "46.300"
                },
                "BudgetYearOne": {
                    "val": "37.420"
                },
                "BudgetYearOneBase": {
                    "val": "37.420"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.239"
                },
                "CurrentYear": {
                    "val": "14.500"
                },
                "BudgetYearOne": {
                    "val": "-0.164"
                },
                "BudgetYearOneBase": {
                    "val": "-0.164"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "14.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.239"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.164"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.164"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016  funding increase due to Congressional restoral of funding to FY 2014 levels."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "48.625"
                        },
                        "PriorYear": {
                            "val": "32.327"
                        },
                        "CurrentYear": {
                            "val": "46.300"
                        },
                        "BudgetYearOne": {
                            "val": "37.420"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.420"
                        },
                        "BudgetYearTwo": {
                            "val": "38.912"
                        },
                        "BudgetYearThree": {
                            "val": "38.873"
                        },
                        "BudgetYearFour": {
                            "val": "41.433"
                        },
                        "BudgetYearFive": {
                            "val": "41.873"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Operational Energy Capability Improvement Fund (OECIF)\n \nDescription: The basic mission of the OECIF is to fund innovation that will improve DoD operational effectiveness via targeted S&T investments. As Defense-Wide funding, it incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy. OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop, demonstrate and transition into use operational energy technologies and practices that will improve DoD military capabilities and\/or reduce costs. Second, to establish within the military Services sustainable, institutional capability to continue to research, develop and adopt operational energy innovations. OECIF funds serve as “seed money” to start or consolidate promising operational energy programs to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Fund"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.327"
                                            },
                                            "Text": {
                                                "val": "The expeditionary outpost energy load reduction focus and Waste to Energy (W2E) programs begun in FY12 were continued. The Advanced, Energy Efficient Shelter Systems for Contingency Basing (AEESS) program performed full prototype technical evaluations in Kuwait and Guam.  The Super Energy Efficient Containerized Living Unit (SuperCLU) program tested and verified improved CLUs and split system Environmental Control Units (ECU), expeditionary air conditioners, at multiple military facilities. The Innovative Cooling Equipment (ICE) program received 9K, 18K, 36K and 60KBTU improved ECUs that were successfully tested to show energy savings from 16 to 54%.  The Navy Expeditionary Technology Transition Program (NETTP) explored and proved the concepts of two dehumidification membranes and continued development of two waste heat based ECUs and a Stirling engine based ECU.  The Transformative Reductions in Operational Energy Consumption (TROPEC) program assessed a collection of energy efficiency and man portable systems in summer testing. In the W2E program with the Strategic Environmental Research and Development Program (SERDP), four designs were prototyped, tested and component improvements begun. \n \nThe operational energy consortia programs begun in FY13 also progressed.  The Engineered Surfaces Materials and Coatings for Drag Reduction program identified additional legacy fleet drag reduction technologies - non-structural Outer Mold Line (OML) \"add-ons\" with potential to reduce drag penalties of pylon and winglet integration on C-17 aircraft, the Air Forces largest fuel consumer.  A BAA was issued to establish a consortium-like team to pursue other drag reduction technologies, with emphasis on non-traditional technology providers.  The Energy Efficient Outpost Modeling Consortium (EEOMC) established initial optimization models for the Energy Resource Planning Tool and identified key parameters for a baseline commander dashboard application.  An executive level energy education course was developed to aid the shift to an energy aware culture. The Tactical Microgrid Standards Consortia (TMSC) established three working groups of Subject Matter Experts (SMEs) drawn from the Services. Five major gaps in existing microgrid standards were identified and the program developed plans to address them. The Soldier and Small Unit Power (Soldier Power) program established a government steering committee from the requirements, S&T and acquisition communities, and formulated the next generation Soldier Power and Energy architecture.\n \nSix new programs were selected to begin in FY14 to improve analytical methods for considering operational energy in DoD planning and management processes above the platform\/engineering level. The Marines will develop the Expeditionary version to the Synthetic Theater Operations Research Model (STORM-E) to explicitly incorporate energy issues for an expeditionary force at the campaign level. OECIF funding will augment and deepen the work of the Army’s Operational Energy Analysis Task Force (OEATF) program, supporting work in data, scenarios and modeling tools.  The Joint Deployment Energy Planning and Logistics Optimization Initiative (J-DEPLOI) program will fold operational energy considerations into the Joint Operational Planning Process (JOPP) at Pacific Combatant Command (PACOM).  The Comprehensive Operational Energy Toolkit (COE Toolkit) program will develop tools to examine the mission level effects of attacks on energy supplies at and in route to air bases.  The Energy Integration and Interoperability (Energy I&I) program will fold energy considerations into a kill chain analysis technique for the Navy.  The Capability Assessment and Modeling for Energy Logistics (CAMEL) program, led by the Air Force Research Lab (AFRL), will develop operational energy analysis tools for the mobility air force, including airlift, air to air refueling, and cost benefit analysis. With better methods and tools for understanding the burdens and vulnerabilities imposed by operational energy and how it affects our military effectiveness, planners and decision makers will be able to make better informed choices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.300"
                                            },
                                            "Text": {
                                                "val": "The expeditionary outpost energy load reduction focus and W2E programs begun in FY12 will generally be reaching their conclusion. AEESS plans to hold cold weather demonstrations in Ft Greely, Alaska and Ellsworth AFB and hot weather demonstrations in Holloman AFB of improved shelter systems.  SuperCLU is currently testing the improved CLUs and split system ECUs in Guam and Florida, and plans to test at Camp Lemonnier, Djibouti in February and the Philippines in May.  The ICE program will conduct capability demonstrations and testing of the improved 9K, 18K, 36K and 60KBTU ECUs at CERDEC and the Army’s TECD-4a demonstration. NETTP will demonstrate Technology Readiness Level (TRL) 6 for two waste heat powered ECUs and a five ton cooling Stirling ECU. TROPEC will perform another set of lab and field assessments, and will continue its shift toward funding by other DoD users.  The W2E program will be testing with a variety of surrogate waste streams in order to mimic real world contingency base operations and the prototype system designs will be improved and developed for potential demonstration validation efforts.\n \nThe consortia programs will progress.  The TMSC program will work closely with the technical sub-groups and other consortium members to start developing draft standards where commercial power systems standards are not adequate for the tactical environment. EEOMC’s Energy Resource Planning Tool will be enhanced with increased time steps, load generation tool development and completion of sub-modules describing photovoltaic and battery systems. Soldier Power will develop and evaluate intelligent power management approaches, low power demand soldier electronics technologies, high power\/energy density power generation and energy storage systems, and actionable non-materiel recommendations to reduce the Soldier Power operational energy burden.  The Engineered Surfaces Materials and Coatings Drag Reduction program will quantify benefits on C-17 aircraft by the addition of non-structural OML \"add-ons\" to reduce drag associated with pylon and winglet integration. In addition, the program will establish a consortium-like team, hold a workshop to inform technology providers of program requirements and goals, and fund the most promising drag reduction technologies.  \n \nThe analytical method programs selected and started in FY14 will ramp up.  The STORM-E program will transition the STORM database to the Pacific theater, address additional\/alternative data requirements and identify evolving analytical focus and data requirements for campaign-level assessments of operational energy to inform STORM-E Roadmap.  The OEATF program will begin developing the scenarios, data, and simulation capability to assess operational energy across a range of operational environments.  The J-DEPLOI program will analyze the Joint Operational Planning Process's (JOPP) current logistical capacity and vulnerability planning gaps, assess over two dozen existing defense information technology tools to determine the best architecture and database candidates for an operational energy insertion method, and select the best fit to address those gaps.  The COE Toolkit program will develop tools to examine evolving weapons and targeting impacts against a variety of energy related targets.  The Energy I&I team will begin planning for Valiant Shield 2016 and actively employ the Energy I&I analytical methodology within the Navy.  The CAMEL program will develop and\/or leverage modeling, simulation, and analysis (MS&A) solutions to close airlift and air refueling mission gaps.  \n \nThe new FY15 programs will significantly expand on-going collaboration with DOE under the Advanced Vehicle Power Technology Alliance.  The primary emphasis will be improving the energy efficiency\/range and, hence, the military capability from DoD’s legacy tactical ground vehicles.  This effort might cover such technologies and topics as electrification of auxiliaries, engine controls, drive trains, and lightweighting. In addition, a Marine and Army program to demonstrate energy harvesting technology at the company level and improve the data on actual duty cycles of dismounted troops’ equipment will also begin; this will complement the Soldier Power consortia program begun in FY13."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.420"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.420"
                                            },
                                            "Text": {
                                                "val": "The consortia programs will continue.  TMSC, with the support of DoD, DOE, NIST, IEEE and other professional societies will review and revise draft standards. EEOMC’s Energy Resource Planning Tool will implement additional user-selectable parameters reflecting geographic location and mission duration, and initiate hardware testing and integration into the Virtual Forward Operating Base system.  The Soldier Power program will conduct integration and field testing of integrated soldier power and data management systems, reduced power demand soldier electronics, and high power\/energy density power generation and energy storage technologies. The Engineered Surfaces for Drag Reduction program will mature the best candidate drag reduction technologies and conduct flight tests as appropriate.\n \nThe analytical methods programs will also continue.  STORM-E will incorporate Spiral 1 into the USMC analytical environment for Expeditionary Force 21 (EF 21) and perform studies with the Pacific theater scenarios to refine EF 21 operational concepts.  The OEATF program will complete the development of the OE analytic capabilities, conduct validation and verification of the simulations, and provide the capability to the user community.  J-DEPLOI will develop user-defined requirements for and a prototype of an IT tool to be used by joint operational planners to address any non-materiel changes in tactics and procedures required, and assess results against JOPP modification objectives.  The COE Toolkit program will develop tools to track the logistics of the energy network and interdiction of energy resources in route to a base.  The Energy I&I program will roll out the Energy I&I Analytical Methodology to the USAF to develop a joint sea and air effects\/kill chain approach.  The CAMEL program will execute analyses focusing on aerial refueling missions and identify MS&A capability and data gaps specific to the operational burdens of various capabilities. \n \nThe effort begun in FY15 to improve the energy efficiency of DoD’s legacy tactical ground vehicles, in collaboration with DOE, will continue to ramp up. The Marine\/Army energy harvesting program will focus on system of system integration with heavy emphasis on incremental field evaluations building to the final company level trial. \n \nNew programs starting in FY16 will reflect a continuing shift within OECIF from an emphasis on contingency bases to one of mobile platforms.  Given OECIF’s on-going work on energy efficient ground vehicles, improving the energy efficiency of sea or air platforms will be of primary interest.  Of particular interest could be reducing the loads, including hotel loads, on such platforms. The focus of such new programs may also reflect input from various communities of interest within DoD - such as Energy and Power, Ground and Sea Platforms, and Air Platforms - and the results from OEPP’s oversight of the research programs of the Services and any developing gaps identified by OEPP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P456"
                    },
                    "ProjectTitle": {
                        "val": "Hybrid Energy Storage Module (HESM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.250"
                        },
                        "PriorYear": {
                            "val": "14.913"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P456, the Hybrid Energy Storage Module (HESM), co-sponsored by ASD(R&E) and ASD(OEPP), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, increase platform ability to sustain operations during engagement, and (2) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Energy Storage Module (HESM)"
                                    },
                                    "Description": {
                                        "val": "P456, the Hybrid Energy Storage Module (HESM), co-sponsored by ASD(R&E) and ASD(OEPP), develops advanced technology in energy storage to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of this program are to (1) demonstrate energy storage systems with high power and energy densities, scalable to all power levels, that reduce total logistics demand, increase platform ability to sustain operations during engagement, and (2) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's Advanced Research Projects Agency - Energy (ARPA-E). AMPED technology will be used to potentially extend the operational performance benefits and safety for these applications beyond the hybrid storage module baseline design configurations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.913"
                                            },
                                            "Text": {
                                                "val": "The HESM efforts initiated in FY 12 and FY13 were continued including hybrid energy storage research of application oriented model development, establishment of test-beds and device limitation characterization at the service laboratories for military specific applications, design architecture for plug-and-play capabilities, definition of safety metrics, and validation & verification of advanced complex controls. Additional effort including Air Force\/Navy aircraft, Navy ships HESM, and Safe Energy Storage demonstrator development were continued. Efforts associated with Army and USMC battlefield generator and vehicle HESM demonstrator development were completed. Technology transition agreements were signed by OPNAV N96."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                }
            ]
        }
    }
}