{
    "id": "5c6ad1b576f0e2b9276b65b34e5f395d2bb58713",
    "meta": {
        "filename": "dod-2016_RDTE_2016_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2016.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160431BB"
        },
        "ProgramElementTitle": {
            "val": "Warrior Systems"
        },
        "R1LineNumber": {
            "val": "243"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "15.691"
            },
            "CurrentYear": {
                "val": "20.573"
            },
            "BudgetYearOne": {
                "val": "25.342"
            },
            "BudgetYearOneBase": {
                "val": "25.342"
            },
            "BudgetYearTwo": {
                "val": "20.243"
            },
            "BudgetYearThree": {
                "val": "17.875"
            },
            "BudgetYearFour": {
                "val": "16.182"
            },
            "BudgetYearFive": {
                "val": "20.520"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for development, testing and integration of specialized equipment in the areas of automation, communication, radio, weapon, soldier protection and survival, visual augmentation, lasers and sensors, munition and military information support operations (MISO) systems.  The efforts within this PE improve SOF warfighting capabilities by continuing efforts to develop smaller, lighter, more efficient and more robust capabilities.  The SOF mission mandates that SOF systems remain technologically superior to any threat to provide a maximum degree of survivability while, generally, being conducted in harsh environments for unspecified periods and in locations requiring small unit autonomy.  Communications efforts will maintain a Command, Control, and Communications (C3) link between SOF Commanders and SOF Teams, and provide interoperability with all Services, various agencies of the U.S. Government, Air Traffic Control, commercial agencies and allied foreign forces.  Efforts relating to soldier protection and survival requirements will improve survivability and mobility of SOF while conducting varied missions.  Specialized visual augmentation, lasers and sensors will permit small, highly trained forces to conduct required operations across the entire spectrum of conflict.  Munition efforts include advanced engineering operational system development and qualification efforts related to SOF-peculiar munitions and equipment.  Additionally, MISO efforts include planned operations to convey selected information and indicators to foreign audiences to influence their emotions, motives, objective reasoning, and ultimately, the behavior of foreign governments, organizations, groups and individuals.  \n\nWarrior Systems specialized equipment will permit small, highly trained forces to conduct required operations across the entire spectrum of conflict.  SOF must infiltrate by land, sea, and air to conduct unconventional warfare, direct action, or deep reconnaissance operations in denied areas against insurgent units, terrorists, or highly sophisticated threat forces.  The requirement to operate in denied areas controlled by a sophisticated threat mandates that SOF systems remain technologically superior to threat forces to ensure mission success.\n\nTactical Systems Development:\nThis project provides for development, testing, and integration of specialized automation equipment to meet the unique requirements of SOF. Tactical systems provide forward deployed forces with advanced networking, automated data processing, storage, and display capabilities to support situational awareness, mission planning and execution, and command and control (C2) of forces. \n\nCommunications Equipment and Electronics Systems:\nThis project provides for communication systems to meet emergent requirements to support SOF.  SOF units require communications equipment that improves their warfighting capability without degrading their mobility.  Therefore, SOF Communications Equipment and Electronics is a continuing effort to develop smaller, lighter, more efficient and more robust SOF Command, Control, Communications, and Computer (C4) capabilities.\n\nTactical Radio Systems:\nThis project is for development of all SOF tactical radio programs.  SOF units require radio communication equipment that improves their warfighting capability without degrading their mobility.  United States Special Operations Command (USSOCOM) has developed an overall strategy to ensure that Tactical Radio Systems continue to provide SOF with the required capabilities throughout the 21st century.  SOF Tactical Radios provide the critical C3 link between SOF Commanders and SOF Teams involved in overseas contingency operations (OCO) and training exercises.  They also provide interoperability with all Services, various agencies of the U.S. Government, Air Traffic Control, commercial agencies, and allied\/coalition forces.  Tactical Radios rapidly and seamlessly establish and maintain mobile and fixed (C2) communications between infiltrated\/operational elements and higher echelon headquarters, allowing SOF to operate with any force combination in multiple environments.\n\nWeapons Systems:\nThis project provides for next generation system development and pre-planned product improvements (P3I), testing, and integration of specialized weapon systems and weapon accessories to meet the unique requirements of SOF. Efforts include muzzle brakes and suppressors and P3I for assault, sniper, and crew served weapons leveraging the latest technological advances to achieve overmatch capability against emerging threats. \n\nSoldier Protection and Survival Systems:\nThis project provides for development, testing, and integration of specialized equipment to meet the unique soldier protection and survival requirements of SOF.  Specialized equipment will improve survivability and mobility of SOF while conducting varied missions.  Current efforts include, but are not limited to counter-improvised explosive device system improvements and testing to meet continually changing technology on the battlefield. \n\nBody Armor and Associated Equipment:\nThis project provides specialized equipment with ballistic protection to meet the unique soldier protection and survival requirements of SOF.  Specialized ballistic equipment improves survivability and load bearing equipment impacting the mobility of SOF while conducting varied missions.  This project enhances the SOF Personal Equipment Advanced Requirements (SPEAR) program by supporting body armor plates, soft armor, helmets, and eye protection.  It also provides for the research, development, and testing of a variety of body armor and personal protective equipment to meet current ballistic threats that exists on the battlefield.\n\nVisual Augmentation, Lasers and Sensor Systems:\nThis project provides for development, testing, and integration of specialized visual augmentation, laser and sensor systems equipment to meet the unique requirements of SOF.  Programs in this area include binocular\/monocular devices and visual augmentation to include next generation laser designation and geo-location systems.  \n\nMunitions Development:\nThis project provides for the advanced engineering, operational system development, and qualification efforts related to SOF-peculiar and Foreign\/Non-standard munitions and equipment.  Funding supports development of Insensitive Munitions (IM) technology and evaluation, in accordance with statutory requirement set forth in U.S. Code, Title 10, Chapter 141, Section 2389 (December 2001).  Testing is in accordance with the USSOCOM IM Strategic Plan.  Funding also supports efforts to develop and improve Stand-Off Precision Guided Munitions (SOPGM), including the development and integration of improved warheads, seeker, guidance navigation and control systems, operational flight software and missile delivery to meet SOF requirements.\n\nMISO:\nThis project provides for the development, test and integration of MISO equipment.  MISO are planned operations to convey selected information and indicators to foreign audiences to influence their emotions, motives, objective reasoning, and ultimately, the behavior of foreign governments, organizations, groups, and individuals.  This project funds transformational systems and equipment to conduct the seven phase MISO process (planning, targeting audience analysis, series development, product development and design, approval, production\/distribution\/dissemination, and measures of effectiveness) in support of combatant commanders."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.973"
                },
                "CurrentYear": {
                    "val": "24.661"
                },
                "BudgetYearOne": {
                    "val": "25.963"
                },
                "BudgetYearOneBase": {
                    "val": "25.963"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.691"
                },
                "CurrentYear": {
                    "val": "20.573"
                },
                "BudgetYearOne": {
                    "val": "25.342"
                },
                "BudgetYearOneBase": {
                    "val": "25.342"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.718"
                },
                "CurrentYear": {
                    "val": "-4.088"
                },
                "BudgetYearOne": {
                    "val": "-0.621"
                },
                "BudgetYearOneBase": {
                    "val": "-0.621"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-4.088"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.718"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.621"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.621"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: \n\nFY2014:  Net increase of $0.718 million is for a reprogramming of $0.566 million to support development and testing of the SPEAR program, $0.182 million to support testing for signature reduction efforts in a Weapons Accessories program; and a reprogramming (-$0.030 million) to support higher command priorities.\n \nFY2015:  Decrease of -$4.088 million is due to a Congressional Directed Reduction to the Long range MISO program.\n\nFY2016: Decrease of -$0.621 million is due to a realignment of -$0.437 million to higher command priorities and a decrease of -$0.184 million due to Departmental economic assumption decrease.\n\nSchedule:  None.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S710"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Systems Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.243"
                        },
                        "CurrentYear": {
                            "val": "1.023"
                        },
                        "BudgetYearOne": {
                            "val": "0.968"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.968"
                        },
                        "BudgetYearTwo": {
                            "val": "1.330"
                        },
                        "BudgetYearThree": {
                            "val": "1.095"
                        },
                        "BudgetYearFour": {
                            "val": "1.183"
                        },
                        "BudgetYearFive": {
                            "val": "1.080"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for development, testing, and integration of specialized automation equipment to meet the unique requirements of Special Operations Forces (SOF). Specialized automation equipment will permit small, highly trained forces to conduct required operations across the entire spectrum of conflict. These operations are generally conducted in harsh environments, for unspecified periods and in locations requiring small unit autonomy. SOF must infiltrate by land, sea, and air to conduct unconventional warfare, direct action, or deep reconnaissance operations in denied areas against insurgent units, terrorists, or highly sophisticated threat forces. The requirement to operate in denied areas controlled by a sophisticated threat mandates that SOF systems remain technologically superior to threat forces to ensure mission success.\n\n- The Tactical Local Area Network (TACLAN) provides SOF operational commanders and forward deployed forces advanced networking, automated data processing, storage, and display capabilities to support situational awareness, mission planning and execution, and command and control of forces. The project consists of Suites, Mission Planning Kits and Field Computing Devices, Coalition Local Area Network, and Full Motion Video Kits."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TACLAN Suites"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.243"
                                            },
                                            "Text": {
                                                "val": "Begin development, integration, and testing  of Evolutionary Technology Insertions (ETI) such as advanced hardware equipment and new software applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.023"
                                            },
                                            "Text": {
                                                "val": "Begin development, integration, and testing of ETI for Secure Data At Rest, secure wireless and cross domain solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.968"
                                            },
                                            "Text": {
                                                "val": "Continues development, integration, and testing of ETI for Secure Data At Rest, secure wireless and cross domain solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC"
                                    },
                                    "Title": {
                                        "val": "OTHER ITEMS <$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.141"
                                        },
                                        "CurrentYear": {
                                            "val": "106.675"
                                        },
                                        "BudgetYearOne": {
                                            "val": "79.149"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "79.149"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "70.287"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.149"
                                        },
                                        "BudgetYearFour": {
                                            "val": "84.526"
                                        },
                                        "BudgetYearFive": {
                                            "val": "80.958"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The TACLAN program has an evolutionary acquisition strategy.  Commercial and government agency sources will be leveraged for required certifications, functional and operational test, and acceptance support."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Secure Data \/ Wireless Capability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Reqn"
                                                },
                                                "PerformingActivity": {
                                                    "val": "iGov"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.243"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.023"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.968"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.968"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "TACLAN SUITES"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Secure Data \/ Wireless Capability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S700"
                    },
                    "ProjectTitle": {
                        "val": "Communications Equipment and Electronics Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.264"
                        },
                        "CurrentYear": {
                            "val": "4.230"
                        },
                        "BudgetYearOne": {
                            "val": "6.352"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.352"
                        },
                        "BudgetYearTwo": {
                            "val": "6.266"
                        },
                        "BudgetYearThree": {
                            "val": "6.379"
                        },
                        "BudgetYearFour": {
                            "val": "6.495"
                        },
                        "BudgetYearFive": {
                            "val": "7.579"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for communication systems to meet emergent requirements to support Special Operations Forces (SOF). Communications Equipment and Electronics Systems is a continuing effort to develop smaller, lighter, more efficient and more robust SOF Command, Control, Communications, and Computer (C4) capabilities.   \n\nUSSOCOM's C4 systems comprise an integrated network of systems providing positive command and control and the timely exchange of information to all organizational echelons.  The C4I systems that support this new architecture employ the latest standards and technology by transitioning from separate systems to full integration within the Global Information Grid (GIG). The GIG is a multitude of existing and projected national assets that allows SOF elements to operate with any force combination in multiple environments. \n\n  • SOF Deployable Node (SDN) is a family of deployable, super high frequency, multi-band, Satellite Communications (SATCOM) systems providing the transport path for high-capacity, voice, data, video tele-conferencing (VTC), and full motion video at all levels of classification.  It consists of SDN subprograms, transport for intelligence variants, technology insertions and capital equipment replacement.\n\n•  The Special Communications Enterprise (SCE) program includes organizations, practices, processes, services, networks, systems and subsystems that manage and provide clandestine exchange of information between elements (field-to-field, field-to-base, base-to-field) for worldwide deployed SOF units, often in austere environments with heavy adversarial monitoring.  This program transitioned from Program Element 1160402BB, Special Operations Advanced Technology Development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SDN"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.092"
                                            },
                                            "Text": {
                                                "val": "Continued to develop, test and evaluate next generation systems and components to enhance the SDN family of systems and integrate Evolutionary Technology Insertions (ETI), such as a wide-band SATCOM-on-the-Move ground capability, extension of SOF Information Enterprise services, and acceleration hardware and software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.394"
                                            },
                                            "Text": {
                                                "val": "Assess, test and evaluate advanced antenna design and performance. Conduct market research on multi-level security solutions for SDN application.  Conduct testing using wideband global SATCOM and Global Express. Assess Advanced Extremely High Frequency band."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.806"
                                            },
                                            "Text": {
                                                "val": "Assesses, tests and evaluates advanced antenna design and performance. Continues to integrate ETIs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.172"
                                            },
                                            "Text": {
                                                "val": "Began segment development for the SCE enterprise; developed means and methods to provide near-term impact to operators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.836"
                                            },
                                            "Text": {
                                                "val": "Continue segment development for the SCE enterprise; develop means and methods to provide near-term impact to operators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.546"
                                            },
                                            "Text": {
                                                "val": "Continues segment development for the SCE enterprise; develops means and methods to provide near-term impact to operators.  Increases emphasis on developing anti-intrusion\/anti-tamper capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/0204Warrior"
                                    },
                                    "Title": {
                                        "val": "Warrior Systems<$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "216.732"
                                        },
                                        "CurrentYear": {
                                            "val": "270.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "215.839"
                                        },
                                        "BudgetYearThree": {
                                            "val": "196.301"
                                        },
                                        "BudgetYearFour": {
                                            "val": "202.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "201.373"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•  SDN is a fielded program with ETIs into all variants:  heavy, medium, and light, wideband SATCOM-On-The-Move, Mobile SOF Strategic Entry Point, and airborne Intelligence Surveillance Reconnaissance transport variants.  Commercial and government agency sources will be leveraged for required certifications, functional and operational tests, and acceptance support.\n\n•  SCE is an ETI effort to provide and support multiple field segment kits.  Commercial and government agency sources will be leveraged for required certifications, functional and operational tests, and acceptance support."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOF Deployable Node (SDN) Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.092"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.496"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.496"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SDN Market Research & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.310"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.310"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Special Communications Enterprise (SCE) Enterprise and Field Segment Capability Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.612"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.272"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.978"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.978"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SCE Base End Segment Capability Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.282"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.284"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.284"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SCE Independent Verification and Validation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.282"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.284"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.284"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "SOF Deployable Node"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "SOF Deployable Node (SDN) Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SDN Market Research and Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Communications Enterprise (SCE) Program"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Enterprise Segment Services Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Field Segment Kit Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Base-End Segment Capabilities Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S725"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Radio Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.811"
                        },
                        "CurrentYear": {
                            "val": "3.670"
                        },
                        "BudgetYearOne": {
                            "val": "2.618"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.618"
                        },
                        "BudgetYearTwo": {
                            "val": "1.692"
                        },
                        "BudgetYearThree": {
                            "val": "1.687"
                        },
                        "BudgetYearFour": {
                            "val": "1.710"
                        },
                        "BudgetYearFive": {
                            "val": "4.717"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is for development of all SOF tactical radio programs.  Tactical Radios provide the critical Command, Control, Communications (C3) link between SOF Commanders and SOF Teams involved in overseas contingency operations (OCO) and training exercises.  They also provide interoperability with all Services, various agencies of the U.S. Government, Air Traffic Control, commercial agencies, and allied foreign forces.  Tactical Radios, which includes SOF Tactical Communications, and Blue Force Tracking, rapidly and seamlessly establish and maintain mobile and fixed Command and Control (C2) communications between infiltrated\/operational elements and higher echelon headquarters, allowing SOF to operate with any force combination in multiple environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Tactical Communications (STC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.811"
                                            },
                                            "Text": {
                                                "val": "Continued developing and testing DoD on-orbit capacity in order to enhance C2 capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.672"
                                            },
                                            "Text": {
                                                "val": "Develop and test new capability in tactical radio equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.653"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.653"
                                            },
                                            "Text": {
                                                "val": "Develops and tests new capability in tactical radio equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Force Tracking (BFT)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.998"
                                            },
                                            "Text": {
                                                "val": "Develop and test new capability in BFT equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.965"
                                            },
                                            "Text": {
                                                "val": "Continues to develop and test new capability in BFT equipment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0204Warrior"
                                    },
                                    "Title": {
                                        "val": "Warrior Systems<$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "216.732"
                                        },
                                        "CurrentYear": {
                                            "val": "270.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "215.839"
                                        },
                                        "BudgetYearThree": {
                                            "val": "196.301"
                                        },
                                        "BudgetYearFour": {
                                            "val": "202.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "201.373"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•  STC is a Commercial-Off-The-Shelf\/Now-Development Item program with evolutionary technology insertions (ETIs).  Commercial and government agency sources will be leveraged for required certifications, functional and operational tests, and acceptance support. \n\n•  BFT is a fielded program with ETIs leveraging commercial and other government agency sources for required certifications, functional and operational tests, and technology updates."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOF Tactical Communications Radio Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.811"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.672"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.653"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.653"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Blue Force Tracking Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.998"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.965"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.965"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.970"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.933"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.933"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "SOF Tactical Communications (STC)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "STC Radio Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Force Tracking (BFT)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "BFT Capability Improvement Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S385"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protection and Survival Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.441"
                        },
                        "CurrentYear": {
                            "val": "2.554"
                        },
                        "BudgetYearOne": {
                            "val": "2.898"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.898"
                        },
                        "BudgetYearTwo": {
                            "val": "2.096"
                        },
                        "BudgetYearThree": {
                            "val": "1.871"
                        },
                        "BudgetYearFour": {
                            "val": "2.372"
                        },
                        "BudgetYearFive": {
                            "val": "2.348"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides specialized equipment to meet the unique soldier protection and survival requirements of Special Operations Forces (SOF) to include: Army Rangers; Army Special Forces; Navy Sea, Air, Land (SEAL) teams; Navy Special Boat Units; Air Force Operators; and Marine Forces Special Operations Command.  Specialized equipment improves survivability protection from the environment by providing the operator with hearing protection and clothing systems as well load bearing equipment to improve the mobility of SOF while conducting varied missions and personnel safety equipment such as harnesses and safety retention devices.  These missions are generally conducted in harsh environments, for unspecified periods and in locations requiring small unit autonomy. \n\nSOF Personal Equipment Advanced Requirements (SPEAR) provides for the research, development, testing and evaluation of a variety of individual and survival equipment to include: ballistic and environmental protective systems, combat uniforms, load carriage systems, communications headsets, and visual augmentation system mounts.  \n\nTactical Combat Casualty Care (TCCC) provides medical devices, ancillary equipment and Casualty Evacuation (CASEVAC) sets for SOF. The CASEVAC procures a suite of Food and Drug Administration approved medical items including, but not limited, to intraosseous infusion devices, patient monitoring and assessment devices, emergency airway kits, as well as devices that provide SOF the capability to support extraction, extrication, mobility, transportation, and sustainment of casualties in forward areas.  This program fields tactical medical and CASEVAC capabilities with the intention to transition capabilities developed under the National Mission Force Tactical Medical Programs.  This capability provides significant ability to lessen battlefield losses by providing timely, critical lifesaving and evacuation capabilities to the forward-deployed SOF operators. \n\nCounter Radio Controlled-Improvised Explosive Device (RC-IED) program provides SOF with the ability to counter current and future radio controlled improvised explosive devices threats used by terrorist networks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SPEAR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.080"
                                            },
                                            "Text": {
                                                "val": "Continued profile refinement to support signature management, reactive fiber testing and material research for uniforms.  Continued research and development solicitation for an advanced maritime communications system material solution.  Continued testing and development of lightweight, high performance textiles for enhanced material solutions that support SPEAR requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.917"
                                            },
                                            "Text": {
                                                "val": "Continue profile refinement to support signature management and material research for uniforms.  Continue testing and development of lightweight, high performance textiles for enhanced material solutions that support SPEAR requirements.  Continue on-going prototype testing. Address emerging SOF-unique requirements as SOF transitions from heavy deployments in Iraq and Afghanistan to a global focus. Continue maritime communication headset solicitation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.384"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.384"
                                            },
                                            "Text": {
                                                "val": "Initiates research and development of a land communications material solution, safety belt and lanyard solicitations, Arctic capability gap solutions, and subsurface operations equipment.  Continues materials testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TCCC"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.333"
                                            },
                                            "Text": {
                                                "val": "Provided for test support to include program management, market surveys, test article acquisition, test and evaluation and systems engineering in direct support of the CASEVAC.  Evaluated lightweight enhanced patient packaging litter systems for inclusion in the CASEVAC.  Supported system prototype development, testing and research on advanced tactical medical equipment to lessen battlefield losses, with the goal of transitioning these medical technology items to a program of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.560"
                                            },
                                            "Text": {
                                                "val": "Provide for test support to include program management, market surveys, test article acquisition, test and evaluation and systems engineering in direct support of the CASEVAC.  Continue evaluation, airworthiness certification and miniaturization of TCCC CASEVAC components. Support system prototype development, testing and research on advanced tactical medical equipment to lessen battlefield losses, with the goal of transitioning these medical technology items to a program of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.444"
                                            },
                                            "Text": {
                                                "val": "Provides for test support to include program management, market surveys, test article acquisition, test and evaluation and systems engineering in direct support of the CASEVAC.  Supports the evaluation of enhanced medical monitoring systems for incorporation into the CASEVAC.  Develops and tests water resistant solutions for maritime operations of components within the CASEVAC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RC-IED"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.028"
                                            },
                                            "Text": {
                                                "val": "Provided for National Assessment Group test support to the Counter RC-IED program.  Supported system engineering, test and evaluation, test article acquisition, and market research of the RC-IED programs.  Maintained range effectiveness and currency, ensuring the ability to accurately test against current and emerging threat systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.077"
                                            },
                                            "Text": {
                                                "val": "Provide for National Assessment Group test support to the Counter RC-IED program.  Support system engineering, test and evaluation, test article acquisition, and market research of the RC-IED programs.  Maintain range effectiveness and currency, ensuring the ability to accurately test against current and emerging threat systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.070"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.070"
                                            },
                                            "Text": {
                                                "val": "Provide for National Assessment Group test support to the Counter RC-IED program.  Supports system engineering, test and evaluation, test article acquisition, and market research of the RC-IED programs.  Maintains range effectiveness and currency, ensuring the ability to accurately test against current and emerging threat systems.  Initiates development and testing of ECM systems capability and advanced software technique counter measures."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Warrior Systems<$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "216.732"
                                        },
                                        "CurrentYear": {
                                            "val": "270.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "215.839"
                                        },
                                        "BudgetYearThree": {
                                            "val": "196.301"
                                        },
                                        "BudgetYearFour": {
                                            "val": "202.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "201.373"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOF Personal Equipment Advanced Requirements (SPEAR) - MICH\/Land Maritime Communication System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.218"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.240"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.415"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.415"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Protective Combat Uniform (PCU)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.095"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.139"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Load Carriage System (LCS) and Backpacks"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.035"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.035"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Modular Glove System (MGS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.040"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.040"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SPEAR - PCU testing\/P3I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM\/SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.135"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.070"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.070"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Signature Management Profile Characteristics"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.065"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.065"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.097"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.097"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - LCS\/Body Armor Vest\/Backpack Material and Prototype Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.018"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.028"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - MGS Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.043"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.043"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Maritime Comms Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.442"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.424"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.592"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.592"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TCCC CASEVAC Sets"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, Ma"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.333"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.560"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.444"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.444"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Counter RC-IED Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "National Assessment Group"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.077"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.070"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.070"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "SPEAR-Protective Combat Uniform (PCU)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "PCU Testing\/Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR-Signature Management"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Signature Management Profile Characterization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR-Modular Glove System"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Development and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR-MICH Comms"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Market Research\/Interoperability Assessment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR-Maritime Comms"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Various tests"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR-Load Carriage System\/Vests and Backpacks"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Material Research and Prototype testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Combat Casualty Care Evacuation Kits -CASEVAC"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype development testing and Airworthiness Certification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Controlled-Improvised Explosive Device"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "National Assessment Group Test Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S385A"
                    },
                    "ProjectTitle": {
                        "val": "Body Armor and Associated Equipment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.504"
                        },
                        "CurrentYear": {
                            "val": "1.973"
                        },
                        "BudgetYearOne": {
                            "val": "1.547"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.547"
                        },
                        "BudgetYearTwo": {
                            "val": "1.349"
                        },
                        "BudgetYearThree": {
                            "val": "1.299"
                        },
                        "BudgetYearFour": {
                            "val": "1.299"
                        },
                        "BudgetYearFive": {
                            "val": "1.649"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides specialized equipment to meet the unique soldier protection and survival requirements of SOF, to include: Army Rangers; Army Special Forces; Navy Sea, Air, Land (SEAL) teams; Navy Special Boat Units; Air Force Operators; and Marine Forces Special Operations Command. Specialized ballistic equipment improves survivability and load bearing equipment impacting the mobility of SOF while conducting varied missions. These missions are generally conducted in harsh environments, for unspecified periods and in locations requiring small unit autonomy. \n\nThis project enhances the SOF Personal Equipment Advanced Requirement (SPEAR) program by supporting body armor plates, soft armor, helmets, and eye protection.  It also provides for the research, development, and testing of a variety of body armor and personal protective equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SPEAR-Ballistic Protection"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.504"
                                            },
                                            "Text": {
                                                "val": "Continued foreign ammunition testing and threat validation to assess armor effectiveness.  Continued the helmet behind armor effects studies to develop a helmet test methodology and corresponding performance metrics.  Continued lightweight body armor material research and testing to include clandestine. Continued evaluation of transparent armor products which include ballistic and optical testing of photochromic, electrochromic and laser lenses.  Continued work on anti-fogging technologies and testing. Tested mature soldier worn sensors and non-destructive inspection technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.973"
                                            },
                                            "Text": {
                                                "val": "Continue foreign ammunition testing and threat validation to assess armor effectiveness.  Research and test soldier worn sensors. Continue lightweight body armor material research and improved performance ballistic plates.  Continue evaluation of transparent armor products which include ballistic and optical testing of photochromic, electrochromic and laser lenses.  Continue work on anti-fogging technologies and testing. Address emerging SOF-unique requirements as SOF transitions from heavy deployments in Iraq and Afghanistan to a global focus."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.547"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.547"
                                            },
                                            "Text": {
                                                "val": "Continues foreign ammunition testing and threat validation to assess effectiveness of currently fielded personal protective equipment.  Continues development and testing of lightweight body armor and helmets to upgrade systems that have been fielded.  Continues evaluation of transparent armor products which include variable light transmission, anti-fogging, ballistic, and laser lenses to upgrade systems that have been fielded.  Develops and tests soldier worn sensors to upgrade armor systems that have been fielded and to refine SOF peculiar requirements.  Addresses emerging SOF unique requirements as SOF transitions from deployments in Iraq and Afghanistan to a global focus."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Warrior Systems<$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "216.732"
                                        },
                                        "CurrentYear": {
                                            "val": "270.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "215.839"
                                        },
                                        "BudgetYearThree": {
                                            "val": "196.301"
                                        },
                                        "BudgetYearFour": {
                                            "val": "202.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "201.373"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOF Personal Equipment Advanced Requirement (SPEAR) - Body Armor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.421"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Lightweight Ballistic Helmets"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.365"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.365"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Eye Protection"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.030"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.040"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Body Armor Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.489"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.211"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.211"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Lightweight Helmet Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.725"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPEAR - Transparent Armor Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.035"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.058"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "SOF Personal Equipment Advanced Requirements (SPEAR)-Body Armor"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Body Armor Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Body Armor Material Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR Eye Protection"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Transparent Armor Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Transparent Armor Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR-Helmet"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Lightweight Ballistic Helmet Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Lightweight Ballistic Helmet Materials Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S395"
                    },
                    "ProjectTitle": {
                        "val": "Visual Augmentation, Lasers and Sensor Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.709"
                        },
                        "BudgetYearOne": {
                            "val": "2.333"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.333"
                        },
                        "BudgetYearTwo": {
                            "val": "0.743"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for development, testing and integration of specialized visual augmentation, binocular and monocular night vision devices, laser markers, laser designators, geo-location systems, weapon optics, weapon aiming lasers, sensor systems, visible lights, infrared imagers, clandestine pointers, and accessories to meet the unique requirements of SOF.  Sensor technology being developed includes image intensification (I2) thermal imaging, short wave infrared (SWIR), multi-spectral, fusion, and other sensor types.  Developments will decrease weight, increase range, increase situational awareness, provide data, image processing, image filtering, determine wind speed, observe bullet trace, and sensor fusion to be able to detect, identify, classify and engage targets at greater ranges.  These projects ensure SOF systems shall remain technologically superior to enemy threats to ensure mission success."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Visual Augmentation Systems"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.709"
                                            },
                                            "Text": {
                                                "val": "Continue the development of visual augmentation and laser devices to improve situational awareness, sharing of data\/images and target acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.333"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.333"
                                            },
                                            "Text": {
                                                "val": "Continues to develop visual augmentation and laser devices to improve situational awareness, sharing of data\/images and target acquisition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/1"
                                    },
                                    "Title": {
                                        "val": "Warrior Systems<$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "216.732"
                                        },
                                        "CurrentYear": {
                                            "val": "270.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "215.839"
                                        },
                                        "BudgetYearThree": {
                                            "val": "196.301"
                                        },
                                        "BudgetYearFour": {
                                            "val": "202.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "201.373"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "To develop prototypes for the next generation SOF operator-borne visual augmentation devices.  These developmental efforts will leverage Science and Technology projects to develop prototype systems for SOF to evaluate and an Indefinite Delivery Indefinite Quantity production contract."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Visual Augmentation Systems (VAS) Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USSOCOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.709"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.709"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "VAS Testing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USSOCOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.333"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.333"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Visual Augmentation System (VAS)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "VAS Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "VAS Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S800"
                    },
                    "ProjectTitle": {
                        "val": "Munitions Advanced Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.386"
                        },
                        "CurrentYear": {
                            "val": "0.519"
                        },
                        "BudgetYearOne": {
                            "val": "0.522"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.522"
                        },
                        "BudgetYearTwo": {
                            "val": "0.529"
                        },
                        "BudgetYearThree": {
                            "val": "0.535"
                        },
                        "BudgetYearFour": {
                            "val": "0.541"
                        },
                        "BudgetYearFive": {
                            "val": "0.542"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds advanced engineering, operational system development and qualification efforts related to specialized munitions and equipment to meet the unique requirements of SOF.\n\nMunitions Advanced Development. This program provides for Insensitive Munitions (IM) technology development and evaluations that allows SOF munitions to pass testing which includes bullet impact, sympathetic detonation, fast cook off, slow cook off and shaped charge test.  Testing is in accordance with the United States Special Operations IM Testing Plan.  Munitions product improvements are tested in accordance with command priorities. \n\nStand-Off Precision Guided Munitions (SOPGM) provides for the development and improvement of SOF-unique SOPGMs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Advanced Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.453"
                                            },
                                            "Text": {
                                                "val": "Conducted proof of concept and IM testing on various munitions.  Continued full scale testing to satisfy safety requirements in Military Standard 2105C (Department of Defense Test and Method Standard:  Hazard Assessment Test for Non-Nuclear Munition, 26 Sep 2006)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.519"
                                            },
                                            "Text": {
                                                "val": "Conduct proof of concept and IM testing on various munitions.  Continue full scale testing to satisfy safety requirements in Military Standard 2105C (Department of Defense Test and Method Standard:  Hazard Assessment Test for Non-Nuclear Munition, 26 Sep 2006)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.522"
                                            },
                                            "Text": {
                                                "val": "Conducts proof of concept and IM testing on various munitions.  Continues full scale testing to satisfy safety requirements in Military Standard 2105C (Department of Defense Test and Method Standard:  Hazard Assessment Test for Non-Nuclear Munition, 26 Sep 2006)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOPGM"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.933"
                                            },
                                            "Text": {
                                                "val": "Completed efforts to integrate target seeker, warhead and guidance system technology upgrades for precision guided munitions, and evaluates first pass lethality performance improvements in laboratory and test range inert round, captive carry and live-fire flight tests."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Ordnance Items"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "168.037"
                                        },
                                        "CurrentYear": {
                                            "val": "173.209"
                                        },
                                        "BudgetYearOne": {
                                            "val": "142.724"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "142.724"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "133.977"
                                        },
                                        "BudgetYearThree": {
                                            "val": "125.920"
                                        },
                                        "BudgetYearFour": {
                                            "val": "148.245"
                                        },
                                        "BudgetYearFive": {
                                            "val": "151.383"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Munitions Advanced Development:  Munitions and packaging redesign shall take place within government laboratories, as well as in industry, depending on the munitions.  IM solutions shall be tested on a small scale for proof of principle.\n\nSOPGM:  Using incremental approach to increase munitions performance, leverage industry's Internal Research and Development innovative efforts and existing and new contracts to improve warhead, seeker, guidance navigation and control system, and missile delivery packaging.  Solutions will be tested at comparative demonstrations and\/or flight test events."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Munitions Advanced Development - Obtain Munitions Test Articles"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics:"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Canada"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.141"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.141"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Munitions Advanced Development - Insensitive Munitions (IM) Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Air Force Air Armaments Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin, AFB, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.055"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.057"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.057"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Munitions Advanced Development - IM Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC:"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.278"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.325"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.324"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.324"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Stand-Off Precision Guided Munitions"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.933"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Munitions Advanced Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Purchase Test Articles"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Evaluation of Munition test articles"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Munitions Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stand-Off Precision Guided Munitions"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Evaluate Lethality Upgrades"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D476"
                    },
                    "ProjectTitle": {
                        "val": "Military Information Support Operations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.477"
                        },
                        "CurrentYear": {
                            "val": "4.895"
                        },
                        "BudgetYearOne": {
                            "val": "6.610"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.610"
                        },
                        "BudgetYearTwo": {
                            "val": "4.746"
                        },
                        "BudgetYearThree": {
                            "val": "3.517"
                        },
                        "BudgetYearFour": {
                            "val": "1.096"
                        },
                        "BudgetYearFive": {
                            "val": "1.118"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and acquisition of Military Information Support Operations (MISO) equipment. MISO are planned operations to convey selected information and indicators to foreign audiences to influence their emotions, motives, objective reasoning, and ultimately, the behavior of foreign governments, organizations, groups, and individuals. This project funds transformational systems and equipment to conduct MISO in support of combatant commanders. \n\n• Prior to FY 2015, the MISO Broadcast Systems (MISOB) consisted of the Media Production Center (MPC) Family of Systems (FoS); Product Distribution System (PDS); Fly Away Broadcast System (FABS); and the Long Range Broadcast System (LRBS). Starting in FY 2015 the MISO Broadcast System will be split into these individual programs of records.  These systems provide fixed or deployable technologies that fulfill the requirements of the MISO seven phase processes in support to theater commanders. This project is comprised of several interfacing systems that can stand alone or inter-operate with other MISO systems as determined by mission requirements and includes:\n\n• Media Production and Broadcast Systems support the MPC and FABS MISO missions.  The MPC includes the fixed site MPC with light and medium media production capability.  FABS is a transit case fly-away broadcast system that consists of a combination of amplitude modulation (AM), frequency modulation (FM), shortwave (SW), and television (TV) transmitters, and radio\/TV production systems. \n\n• LRBS is a family of broadcast systems intended to be integrated to multiple unmanned, long-loiter aerial systems with the capability of broadcasting in AM, FM, SW,TV, Very High Frequency (VHF), TV Ultra High Frequency (UHF) and cellular (Short Message Service, Multi-Media Messaging Service, and Voice).  This system provides the capability of broadcasting MISO messages via multiple mediums into denied foreign areas.\n\n• PDS provides the satellite communications (SATCOM) transport path for the worldwide Military Information Support Operations (MISO) architecture. PDS consists of three variants that are used at different levels of command from the Media Operations Complex (MOC) to the Tactical MISO Teams in order to link MISO planners with review\/approval authorities, production facilities, and dissemination elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Media Production and  Broadcast System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.477"
                                            },
                                            "Text": {
                                                "val": "Continued primary hardware development, systems engineering, and test and evaluation on product distribution technology. Tested and evaluated new systems and components to enhance MISO product. Integrated and disseminated new analytical software tools to enhance production supporting MISO target audience assessment and measures of effectiveness requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.280"
                                            },
                                            "Text": {
                                                "val": "Continue primary hardware development, systems engineering, and test and evaluation on product distribution technology. Test and evaluate new systems and components to enhance MISO product. Integrate and disseminate new analytical software tools to enhance production supporting MISO target audience assessment and measures of effectiveness requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.074"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.074"
                                            },
                                            "Text": {
                                                "val": "Tests and evaluates new systems and components to enhance MISO product. Integrates and disseminates new analytical software tools to enhance production supporting MISO target audience assessment and measures of effectiveness requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LRBS"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.416"
                                            },
                                            "Text": {
                                                "val": "Begin primary hardware development, system engineering, and test and evaluation of pod-based FM and cellular broadcast, power, and antenna technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.536"
                                            },
                                            "Text": {
                                                "val": "Continues with primary hardware development, systems engineering, and test and evaluation of pod-based FM and cellular broadcast, power, and antenna technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PDS"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.199"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate advance technology, and test and evaluate new PDS \/ SOF Deployable Node (SDN-P) components integrating audio\/visual capabilities for enhanced distribution and delivery of MISO products."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1\/0204OTHER"
                                    },
                                    "Title": {
                                        "val": "OTHER ITEMS <$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.141"
                                        },
                                        "CurrentYear": {
                                            "val": "106.675"
                                        },
                                        "BudgetYearOne": {
                                            "val": "79.149"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "79.149"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "70.287"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.149"
                                        },
                                        "BudgetYearFour": {
                                            "val": "84.526"
                                        },
                                        "BudgetYearFive": {
                                            "val": "80.958"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•  The Media Production and Broadcast system program has an evolutionary acquisition strategy.  Commercial and government agency sources will be leveraged for required certifications, functional and operational tests, and acceptance support.\n\n•  The LRBS program has an evolutionary acquisition strategy.  Commercial and government agency sources will be leveraged for required certifications, functional and operational tests, and acceptance support.\n\n•  The PDS program has an evolutionary acquisition strategy.  Commercial and government agency sources will continue to be leveraged for required certifications, functional and operational tests, and acceptance support."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Media Production and Broadcast Systems"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.477"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.074"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.074"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Distribution System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.199"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.199"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Long Range Broadcast System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.416"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.536"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.536"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Media Production and Broadcast Systems"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Hardware development and systems engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Broadcast System"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Material Research and Prototype"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Distribution System"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Hardware Development and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S375"
                    },
                    "ProjectTitle": {
                        "val": "Weapons Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.565"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.494"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.494"
                        },
                        "BudgetYearTwo": {
                            "val": "1.492"
                        },
                        "BudgetYearThree": {
                            "val": "1.492"
                        },
                        "BudgetYearFour": {
                            "val": "1.486"
                        },
                        "BudgetYearFive": {
                            "val": "1.487"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for development and testing of specialized, individual, assault, crew-served weapons, and fire control\/surveillance devices to meet the unique requirements of Special Operations Forces (SOF).  SOF often deploys as small, independent, quick reaction, foot-mobile teams independent of primary logistics support. Existing weapons and combat equipment are frequently unsuited to these conditions.  This project enhances all SOF weapons, both individual and crew served, by leveraging the latest technological advances in optional accessories (up to 30 different functions\/capabilities) such as day scopes, clip-on night scopes, active aiming laser module, visible lights, grenade launchers, suppressors, hand grips, and close quarters battle sights. Miniature Day-Night Sight for Crew-served Weapons enhances all SOF weapons, by leveraging existing image intensification and thermal technology to improve combat effectiveness for all crew served weapon systems.  Development efforts include test and evaluation of the Advanced Target Pointer Illuminator Aiming Laser hardening to withstand the live-fire shock profiles for the Combat Assault Rifle along with other improvements, Visual Augmentation Systems, and Family of Muzzle Breaks and Suppressors.  Leveraging extensive modeling and simulation efforts executed by National Labs, competitively award RDT&E contracts to select vendors to develop suppressors and flashhiders for select SOF weapon systems. These accessories greatly improve the combat effectiveness of the weapon systems and the survivability of the SOF operator."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapons Accessary (WPNAC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.565"
                                            },
                                            "Text": {
                                                "val": "Continued small arms signature reduction development and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.494"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.494"
                                            },
                                            "Text": {
                                                "val": "Develops enhanced capabilities to improve performance of individual and crew serve SOF weapons."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Warrior Systems <$5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "216.732"
                                        },
                                        "CurrentYear": {
                                            "val": "270.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "186.009"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "215.839"
                                        },
                                        "BudgetYearThree": {
                                            "val": "196.301"
                                        },
                                        "BudgetYearFour": {
                                            "val": "202.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "201.373"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Weapons accessory development will take place within government laboratories as well as industry depending on the weapons system."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Small Arms Signature Reduction"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.565"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.494"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.494"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Weapons Systems"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Small Arms Signature Reduction Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Small Arms Signature Reduction Qualification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Small Arms Weapon Improvement Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}