{
    "id": "5d5ad9b5d531281e0b5761981ed886f04321c8ba",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605853N"
        },
        "ProgramElementTitle": {
            "val": "Management, Technical & Intl Supt"
        },
        "R1LineNumber": {
            "val": "158"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "81.919"
            },
            "CurrentYear": {
                "val": "87.038"
            },
            "BudgetYearOne": {
                "val": "78.143"
            },
            "BudgetYearOneBase": {
                "val": "78.143"
            },
            "BudgetYearTwo": {
                "val": "106.144"
            },
            "BudgetYearThree": {
                "val": "105.268"
            },
            "BudgetYearFour": {
                "val": "101.754"
            },
            "BudgetYearFive": {
                "val": "103.764"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "International Cooperative RDT&E: provide program management, execution, and support to implement a broad range of cooperative Naval Research and Development, Test and Evaluation initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, and identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches, coordinating with partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership initiative.\n\nNaval War College Strategic Studies Support:  Provides research, analysis and gaming activities which serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, joint and interagency communities.  These efforts generate strategic and operational alternatives, quantitative analysis, war gaming and political military assessments, and provide recommendations regarding the formulation and execution of maritime options .  The War Gaming Department plans, designs, executes, analyzes and reports on the Navy's Title 10 war games.  These war games provide analytical input to the Navy's Strategic Plan, assessments of future concepts, and recommendations to the Navy's Quadrennial Defense Review, force design, and strategy process.  The War Gaming Department also designs, executes and analyzes war games for theater security cooperation plans and operational war fighting issues.  \n\nAssessment Program: The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense (DoD) M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.  It develops tools and analytical methodologies that assist in evaluating Navy programs and provides technical leadership for the analysis functional area of Naval Modeling and Simulation.\n\nMid-Range Financial Improvement Plans: This project supports the Research Development Test & Evaluation, Navy (RDTEN) portion of the larger DoD and Navy-wide effort to implement the financial improvement plan.  Funding is for the sustainment of clean and auditable statements for RDTEN.\n\nOperations Integration Group:  Classified\n\nCHENG: Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability and Anti-Tamper initiatives.\n\nNaval Research Laboratory (NRL)Facilities Modernization: This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old.\n\nThe Joint Information Environment (JIE) initiative provides the supporting IT capability framework comprised of shared information technology infrastructure, enterprise services, interoperability with coalition partners and a single security architecture that enables mission commanders to execute mission partnered operations.  JIE provides the U.S. configuration controls necessary for enterprise capabilities.  By utilizing a U.S enterprise-wide secure Identity and Access Management system, JIE ensures that authorized users at the right classification level gain access to only the data and services they are entitled.  The continued development and refinement of a Joint Information Environment will provide for a significant improvement in data sharing within, and between, coalition maritime elements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.494"
                },
                "CurrentYear": {
                    "val": "72.070"
                },
                "BudgetYearOne": {
                    "val": "76.569"
                },
                "BudgetYearOneBase": {
                    "val": "76.569"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "81.919"
                },
                "CurrentYear": {
                    "val": "87.038"
                },
                "BudgetYearOne": {
                    "val": "78.143"
                },
                "BudgetYearOneBase": {
                    "val": "78.143"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.575"
                },
                "CurrentYear": {
                    "val": "14.968"
                },
                "BudgetYearOne": {
                    "val": "1.574"
                },
                "BudgetYearOneBase": {
                    "val": "1.574"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.032"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.576"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "12.530"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.530"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.956"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.956"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2016 funding request was reduced by -$14.5 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0149"
                    },
                    "ProjectTitle": {
                        "val": "International Coop RDT&E"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.288"
                        },
                        "CurrentYear": {
                            "val": "3.608"
                        },
                        "BudgetYearOne": {
                            "val": "2.584"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.584"
                        },
                        "BudgetYearTwo": {
                            "val": "3.818"
                        },
                        "BudgetYearThree": {
                            "val": "3.758"
                        },
                        "BudgetYearFour": {
                            "val": "3.520"
                        },
                        "BudgetYearFive": {
                            "val": "3.642"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides program management, execution, and support to implement a broad range of cooperative naval Research and Development, Test and Evaluation (RDT&E) initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches in coordination with combatant commanders (COCOMs), and appropriate partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership Initiative.\n\nThe project scope supports the strategic shift to the Pacific Region with emphasis on Maritime Domain Awareness (MDA) and Coalition Interoperability.  Relationships have been, and are being initiated with a greatly expanded and diverse group of maritime countries, particularly those with nascent and littoral navies.  The project was restructured internally to both maintain ongoing international relationships and projects, while preparing to facilitate support for a global network of maritime nations under MDA and Coalition Interoperability requirements. \n\nOngoing cooperative RDT&E programs, projects and exchanges are pursued to identify cooperative acquisition programs, enhance OCO efforts and MDA development, fill capability gaps, improve US\/coalition interoperability, and set standardization with international partners. Such efforts have resulted in:\n1. Negotiating and developing approximately 57 international RDT&E Agreements annually with allied and friendly nations;\n2. Executing approximately 300 Information Exchange Annexes (IEAs) with foreign partners;\n3. Improving IEA information dissemination with allied and friendly countries and within Department of the Navy (DoN);\n4. Coordinating Navy inputs to the Office of the Under Secretary of Defense (OUSD) Acquisition, Technology, and Logistics (AT&L) Foreign Comparative Test (FCT) Program, and Coalition Warfare Program (CWT) as well as the DoN Technology Transfer Security Assistance Review Boards (TTSARB). \n5. Represent the US Navy in Office of the Secretary of Defense (OSD) directed Armaments Cooperation Forums, including the Conference of NATO Armaments Directors' groups {NATO Naval Armaments Group (NNAG)}, and Senior National Representative-Maritime (SNR-M);\n6.  Funding of various international RDT&E support databases including Technical Project Officer (TPO), International Agreement Generators, Information\/Data Exchange Agreements, and Project Agreements\/Memorandums of Understanding;\n7.  Leading the Engineering and Scientist Exchange Program (ESEP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Coop RDT&E"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to support Maritime Theater Missile Defense (MTMD) Forum that obtained $8.1M in R&D monies from Partner Nation contributions.  The multi-lateral forum (9 Maritime Partner countries and the US Navy) entered into four international agreements (Battle Management Command, Control, Communications, Computers and Intelligence (BMC4I); Distributed Engineering Plant; Open Architecture; and Modeling and Simulation (M&S).  The MTMD has a goal of an at-sea capability demonstration in 2015.\n-Continue execution of approximately 300 Information Exchange Agreements\/Date Exchange Agreements (IEA\/DEA)with more than 30 countries.\n-Continue execution and support in placement of US Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP).\n-Continue to coordinate US Navy participation in OUSD(AT&L)Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Fund various evolving potential cooperative exchanges and projects contribution to Maritime Domain Awareness (MDA) and irregular warfare including Multi-Mission Aircraft (MMA), Broad Area Maritime Surveillance (BAMS), Submarine Littoral Weapons System, and Swimmer Engagement.  Coordinate US Navy Support to OUSD (AT&L) International Cooperation Office.\n-Support new CNO-Initiated Strategy Dialogue with Australia, including Air and Expenditionary Warfare Working Groups for mutual development of requirements and projects.  Support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs including harbor protection, electronic warfare, and Defense Against Terrorism (DAT) trials.\n-Continue execution of Expenditionary Warfare Working Group (EWWG).\n-Execution of Assured Precision Strike (APS) Study.\n-Execution of Above Water Working Group(AWWG).\n-Execution of Undersea Warfare Working Group (UWWG).\n-Exeuction of Commnication and Information Warfare Working Group (CIWWG).\n-Execution of Amphibious Operations Working Group (AOWG)\n-Execution of Pre-International Agreement Work.\n-Continue execution and support of NATO Maritime EW Trials\/NATO Travel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.608"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY14.\n- Continue to support Maritime Theater Missile Defense (MTMD) Forum that obtained $8.1M in R&D monies from Partner Nation contributions.  The multi-lateral forum (9 Maritime Partner countries and the US Navy) entered into four international agreements (Battle Management Command, Control, Communications, Computers and Intelligence (BMC4I); Distributed Engineering Plant; Open Architecture; and Modeling and Simulation (M&S).  The MTMD has a goal of an at-sea capability demonstration in 2015.\n-Continue execution of approximately 300 Information Exchange Agreements\/Date Exchange Agreements (IEA\/DEA)with more than 30 countries.\n-Continue execution and support in placement of US Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP).\n-Continue to coordinate US Navy participation in OUSD(AT&L)Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Fund various evolving potential cooperative exchanges and projects contribution to Maritime Domain Awareness (MDA) and irregular warfare including Multi-Mission Aircraft (MMA), Broad Area Maritime Surveillance (BAMS), Submarine Littoral Weapons System, and Swimmer Engagement.  Coordinate US Navy Support to OUSD (AT&L) International Cooperation Office.\n-Support new CNO-Initiated Strategy Dialogue with Australia, including Air and Expenditionary Warfare Working Groups for mutual development of requirements and projects.  Support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs including harbor protection, electronic warfare, and Defense Against Terrorism (DAT) trials.\n-Continue execution of Expenditionary Warfare Working Group (EWWG).\n-Execution of Assured Precision Strike (APS) Study.\n-Execution of Above Water Working Group(AWWG).\n-Execution of Undersea Warfare Working Group (UWWG).\n-Exeuction of Commnication and Information Warfare Working Group (CIWWG).\n-Execution of Amphibious Operations Working Group (AOWG)\n-Execution of Pre-International Agreement Work.\n-Continue execution and support of NATO Maritime EW Trials\/NATO Travel."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.584"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.584"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY15\n-Continue to support Maritime Theater Missile Defense (MTMD) Forum that obtained $8.1M in R&D monies from Partner Nation contributions.  The multi-lateral forum (9 Maritime Partner countries and the US Navy) entered into four international agreements (Battle Management Command, Control, Communications, Computers and Intelligence (BMC4I); Distributed Engineering Plant; Open Architecture; and Modeling and Simulation (M&S).  \n-Continue execution of approximately 300 Information Exchange Agreements\/Date Exchange Agreements (IEA\/DEA)with more than 30 countries.\n-Continue execution and support in placement of US Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP).\n-Continue to coordinate US Navy participation in OUSD(AT&L)Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Fund various evolving potential cooperative exchanges and projects contribution to Maritime Domain Awareness (MDA) and irregular warfare including Multi-Mission Aircraft (MMA), Broad Area Maritime Surveillance (BAMS), Submarine Littoral Weapons System, and Swimmer Engagement.  Coordinate US Navy Support to OUSD (AT&L) International Cooperation Office.\n-Support new CNO-Initiated Strategy Dialogue with Australia, including Air and Expenditionary Warfare Working Groups for mutual development of requirements and projects.  Support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs including harbor protection, electronic warfare, and Defense Against Terrorism (DAT) trials.\n-Continue execution of Expenditionary Warfare Working Group (EWWG).\n-Execution of Assured Precision Strike (APS) Study.\n-Execution of Above Water Working Group(AWWG).\n-Execution of Undersea Warfare Working Group (UWWG).\n-Exeuction of Commnication and Information Warfare Working Group (CIWWG).\n-Execution of Amphibious Operations Working Group (AOWG)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy International Cooperative RDT&E project supports the implementation of many international cooperative program activities throughout the Department of the Navy (DoN) RDT&E communities. The project funds DoN participation in NATO and OSD lead Armaments Cooperation as well as DoN lead international cooperation that promotes coalition interoperability and set standards with international partners. The focused activities under this project maximize the DoN's efforts by leveraging international technologies and funding to fill capabilities gaps, gain access to foreign research and testing data, and avoid duplication of research and development efforts. The performance goals and metrics are, in cooperation with Maritime Partner nations, to set and harmonize requirements, utilize respective technologies, encourage financial contributions and facilities use, and support forums and work that reduce DoN funding requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1767"
                    },
                    "ProjectTitle": {
                        "val": "Naval War Col Strategic Studies Supt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.313"
                        },
                        "CurrentYear": {
                            "val": "4.762"
                        },
                        "BudgetYearOne": {
                            "val": "4.386"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.386"
                        },
                        "BudgetYearTwo": {
                            "val": "4.459"
                        },
                        "BudgetYearThree": {
                            "val": "4.578"
                        },
                        "BudgetYearFour": {
                            "val": "4.696"
                        },
                        "BudgetYearFive": {
                            "val": "4.794"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Naval War College (NWC) research, analysis and gaming activities serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, Joint and Interagency communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analysis, war gaming, political-military assessments, and provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Studies"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts research in strategic studies in response to tasking from the Secretary of the Navy (SECNAV), Chief of Naval Operation (CNO), Fleet Commanders, numbered Fleet Commanders, and Combatant Commanders.  NWC also hosts the activities of the CNO's Strategic Studies Group (SSG).  The CNO SSG is a select group of senior naval officers handpicked by the CNO, who report to him in the development of revolutionary warfighting and operational concepts, such as Sea Strike and FORCEnet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.483"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy \n  Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- Continue CNO SSG tasking from the CNO to SSG XXXII to generate revolutionary operating and warfighting \n  concepts for future Navy and maritime operations.  Follow up on CNO and OPNAV actions resulting from SSG \n  XXXI Final Report. \n- Continue research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global \n  developments and provide studies and advice for the CNO and the fleet. \n- Conduct research in support of the refresh to the Navy's Strategy \"Cooperative Strategy for the 21st Century.\""
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy \n  Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- Continue CNO SSG tasking from the CNO to SSG XXXIII to generate revolutionary operating and warfighting \n  concepts for future Navy and maritime operations.  Follow up on CNO and OPNAV actions resulting from SSG \n  XXXII Final Report. \n- Continue research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global\n  developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provided supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- CNO SSG tasking from the CNO to SSG XXXV to generate revolutionary operating and warfighting concepts for future Navy and maritime operations.   Following up on CNO and OPNAV actions resulting from SSG XXXIV Final Report. \n- Conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval War Gaming Support"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts strategic and operational war gaming and research for Office of the Chief of Naval Operations (OPNAV), the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Each year, 55-60 major war games and associated events provide support to efforts that explore and analyze military, political, informational and economic aspects of differing strategic and operational scenarios and tactical imperatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.721"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the\n  Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war\n  gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such\n  as MDA, Irregular Warfare, cyber, and C4ISR. \n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming,\n  research, and analysis. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC). \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for the\n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives \n  for the Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime\n  security, and sea control. \n- Continue International War Gaming in support of Maritime Security Cooperation and implementation of Cooperative\n  Strategy for 21st Century Seapower.  \n- Continue to conduct research and analysis on key operational challenges such as theater anti-submarine Warfare,\n  maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea\n  basing. \n- Develop educational materials for the Maritime Advanced Warfighting School."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.528"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the\n  Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war\n  gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such \n  as MDA, Irregular Warfare, cyber, and C4ISR.\n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming,\n  research, and analysis. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC). \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical \n  infrastructure protection.\n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for the\n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for\n  Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime \n  security, and sea control. \n- Continue to develop educational materials for the Maritime Advanced Warfighting School. \n- Continue to conduct research and analysis on key operational challenges such as theater ASW, IAMD, global maritime\n  security, maritime homeland defense, MDA, and sea basing.\n- Continue to conduct research, analysis, and gaming on current area denial and anti access issues confronting naval\n  forces.\n- Conduct research, analysis, and war gaming of emerging concepts such as anti access and area denial and air sea\n  battle.\n- Provide research, analysis, and war gaming in support of Navy and Marine Corps issues identified by the Naval Board.\n- Conduct analytic research on maritime security cooperation planning for forward based fleets. \n- Lead the effort to conduct analytical research in operational concepts of Cyber Warfare. \n- Advance the concept of cyber war gaming, including development of cyber Common Operational Picture.\n- Support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure\n  protection and counter piracy. \n- Support Fleet Commanders with high quality Course of Action Analysis and war games of operational plans.  \n- Provide direct support to Navy operational level programs such as the maritime staff Operators Course, Executive \n  Leaders Operational Course, CFMCC Course, and JFMCC Course.\n- Develop advanced war gaming analytical methods and tools such as the use of multi touch multi user boards and web\n  based applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.023"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.023"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 45-50 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such as MDA, Irregular Warfare, cyber, and C4ISR.\n- Continue to conduct research, analysis, and war gaming of emerging concepts such as anti access and area denial and air sea battle.\n- Continue to provide research, analysis, and war gaming in support of Navy and Marine Corps issues identified by the Naval Board.\n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming, research, and analysis. \n- Continue to conduct analytic research on maritime security cooperation planning for forward based fleets. \n- Continue to lead the effort to conduct analytical  research in opeational concepts of Cyber Warfare. \n- Continue to advance the concept of cyber war gaming, including development of cyber Common Operational Picture\n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection and counter piracy. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC).  \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection.\n- Continue to support Fleet Commanders with high quality Course of Action Analysis and war games of operational plans.  \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime security, and sea control. \n- Continue to develop educational materials for the Maritime Advanced Warfighting School.  \n- Continue to provide direct support to Navy operational level programs such as the maritime staff Operators Course, Executive Leaders Operational Course, CFMCC Course, and JFMCC Course.\n- Continue to conduct research and analysis on key operational challenges such as theater ASW, IAMD, global maritime security, maritime homeland defense, MDA, and sea basing.    \n- Continue to conduct research, analysis, and gaming on current area denial and anti access issues confronting naval forces.\n- Continue to develop advanced war gaming analytical methods and tools such as use of multi touch multi user boards and web based applications."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) supports senior decision-makers from the Department of Defense, Department of the Navy, the numbered Fleets, Fleet Commanders and Combatant Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the \n  Combatant Commanders.  Projects are in direct support of warfighting analysis requirements for numbered fleet\n  commanders and will expand to include the Commander Seventh Fleet (C7F) with particular focus on India and the \n  Indian Ocean.   \n- Continue to conduct analytical research on key strategic and operational challenges such as maritime ballistic \n  missile defense, proliferation security initiative, global maritime security, maritime situational awareness,\n  maritime operations headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Continue to conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- 25-30 major decision events will be conducted in support of these efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the\n  Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet\n  commanders and will expand to include the Commander Seventh Fleet (C7F) with particular focus on India and the \n  Indian Ocean.   \n- Continue to conduct analytical research on key strategic and operational challenges such as maritime ballistic \n  missile defense, proliferation security initiative, global maritime security, maritime situational awareness, \n  maritime operations headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Continue to conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- 30-40 major decision events will be conducted in support of these efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet commanders and were expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian Ocean.   \n- Conduct analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- 25-30 major decision events will be conducted in support of there efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NWC Student Research Projects"
                                    },
                                    "Description": {
                                        "val": "Selected top performing Naval War College (NWC) students to conduct focused research and analysis of current and future strategic and operational challenges and tactical imperatives.  These students are organized under the supervision of the Mahan Scholars Program and the Halsey Group Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct focused research, analysis and war gaming of current and future strategic\/operational challenges\n  and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future \n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial\n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command \n  CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue \n  in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational \n  deception, and countering information denial and missile defense at the theater joint operational level.    \n- Continue to Conduct research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.118"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct focused research, analysis and war gaming of current and future strategic\/operational challenges\n  and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future\n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial\n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command \n  (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts \n  continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, \n  operational deception, and countering information denial and missile defense at the theater joint \n  operational level.    \n- Continue to conduct research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level.    \n- Conduct research for Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Headquarters \/ Maritime Operations Center (MOC) Analysis"
                                    },
                                    "Description": {
                                        "val": "Formerly JFMCC\/Worldwide Naval Component Commanders (WNCC).  Naval War College (NWC) conducts research and analysis at the operational level of war, including direct support for the Maritime Headquarters (MHQ) and Maritime Operations Centers (MOC), as well as Combined\/Joint Forces Maritime Component Commander (C\/JFMCC) activities.  These activities include support for concept and doctrine development of numbered fleet war games, exercises, education, research and analysis.  NWC is responsible for development of Professional Military Education for Naval Component Commanders and Numbered Fleet Staff personnel, and the Numbered Fleet Commander, including education and research initiatives in support of concept of operations development, training and C\/JFMCC advisory and assist team."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.612"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maritime Staff Operators Course (MSOC):\n- Expand research into the required competencies for Maritime Staff Operations Course for officer and enlisted\n  personnel to successfully operate at the operational level of war.\n- Actively participate in creation and review of existing and emerging doctrine, and have active involvement in  \n  development of evolving operational level issues.\n- Incorporate more interactive technologies for staff collaboration while conducting distributed operations.\n- Conduct research in advanced adaptive intelligence, information warfare, and other advanced decision-support tools,\n  including adapting Spiral-developed systems into the MOC classroom environment. \n- Conduct research to improve coalition-related MOC education programs for International Officers and senior officers\n  (continued improvements). Includes support for Maritime Advanced Warfighting School (MAWS) and alignment with all\n  other operational level of education at NWC and other Service educational facilities.\n- Examine gaps in education at the Operational Level of War (OLW); develop Course of Instructions (COI) to close same\n  gaps (Information management\/knowledge management, et al).\nAssist and Assess Team (AAT):\n- Expand research and analysis into integrating lateral and vertical operations of Commander, TENTH Fleet MOC with\n  operations at existing numbered fleet MOCs, USFFC and US Pacific Fleet, as well as upward to the new USCYBERCOM\n  and downward to subordinate CTFs and commands.\n- Conduct research and analysis into potential methods for integration of information operations (to include cyber\n  operations) with traditional kinetic joint fires operations.  Cyber operations (network attack, defense, and \n  exploitation) present unique challenges due to the global nature of the domain, the potential effects on other MOCs\n  and the importance of alignment for effective strategic communication.\n- Conduct research into how Navy units worldwide can support the Commander, TENTH Fleet in the execution of the full \n  spectrum of information and cyber operations. \n- Provide tailored assistance to Commander, TENTH Fleet and Commanders of other MOCs to communicate results of \n  above research and analysis efforts and to strengthen staff knowledge of joint information operations planning, \n  execution, and assessment.\nJoint\/Combined Forces Maritime Commanders Course (J\/CFMCC):\n- Conduct development\/research in national and international implications of maritime commander leadership roles, and\n  development of new flag course curriculum accordingly.\n- Conduct research in the impacts of transition from contract to government employee support for senior mentors with\n  regards to the implementation of CNO's priorities on operational level leadership and flag academics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maritime Staff Operators Course (MSOC):\n- Continue research as noted, including expansion of undertsanding of emergent warfare areas in MOC development and\n  education.\n- Continue research\/development on understanding and mitigation of gaps in education at the OLW.\n- Continue research to develop COI to close same gaps (Information management\/knowledge management, et al). \nAssist and Assess Team (AAT):\n- Conduct research and analysis into integrating emerging doctrinal issues, thus improving the effectiveness of\n  operations at existing numbered fleet MOCs, USFFC and US Pacific Fleet, as well as upward to the new USCYBERCOM \n  and downward to subordinate CTFs and commands.\nJoint\/Combined Forces Maritime Commanders Course (J\/CFMCC):\n- Continue development\/research in national and international implications of evolving maritime commander leadership roles, emergent doctrine and national\/international relationships, and development of new flag course curriculum accordingly.\n- Continue research on other senior leader development within MOCs, including deputy, chiefs of staff, and other executives responsible for team leadership and decision making.\n- Continue research to improve JFMCC integration with component commanders (JFLCC, JFACC, JSOCC) with respect to emerging joint and service doctrine"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "All activities\n- Remain credible, relevant and focused through continued development of MOC processes, doctrine and edcucational products\nMSOC\n- Continue research as noted, including expansion of undertsanding of emergent warfare areas in MOC development and education\n- Continue research\/development on understanding and mitigation of gaps in  education at the OLW\n- Continue research to  develop COI to close same gaps (Information management\/knowledge management, et al) \nAssist and Assess Team (AAT):\n- Conduct research and analysis into integrating emerging doctrinal issues, thus improving the effectiveness of operations at existing numbered fleet MOCs, USFFC and US Pacific Fleet as well as upward to the new USCYBERCOM and downward to subordinate CTFs and commands.\n- Conduct research and analysis into potential methods for integration of emerging doctirinal issues with traditional MOC operations.  \nJoint\/Combined Forces Maritime Commanders Course (J\/CFMCC):\n- Continue development\/research in national and international implications of evolving maritime commander leadership roles, emergent doctrine and national\/international relationships, and development of new flag course curriculum accordingly.\n- Continue research on other senior leader development within MOCs, including deputy, chiefs of staff, and other executives responsible for team leadership and decisionmaking.\n- Continue esearch to improve JFMCC integration with component commanders (JFLCC, JFACC, JSOCC) with respect to emerging joint and service doctrine"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This project provides research, analysis and war gaming to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of war games, analysis and the extent to which demand for war games and research products can be accommodated within funding levels.  Results of research products and war games are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2098"
                    },
                    "ProjectTitle": {
                        "val": "Navy Postgraduate School (NPS) Studies Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.757"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "8.924"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.924"
                        },
                        "BudgetYearTwo": {
                            "val": "13.846"
                        },
                        "BudgetYearThree": {
                            "val": "13.230"
                        },
                        "BudgetYearFour": {
                            "val": "12.000"
                        },
                        "BudgetYearFive": {
                            "val": "12.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational thought within the Navy communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments.  Also, provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States.  Research will be conducted to support graduate students theses determination and completion as part of Faculty projects.  These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Faculty and Student Studies, Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Navy Postgraduate School (NPS) supports senior decision-makers from the Department of the Navy, the Office of the Chief of Naval Operations, Budget Submission Offices and Fleet Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools.  Student Theses will be an integral part of this program in support of the critical analysis and research conducted by the Faculty."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted over 90 Faculty Research projects in support of Navy and Marine Corps in a full gamut of subject areas that include Manpower, Personnel, Training, Education, Logistics, Navy Plans and Policy, Warfare Requirements, Financial Management, and Information Technology and Dominance.\n\n- Conducted studies in support of OPNAV N1\n- Conducted studies in support of Naval Education and Training Command\n- Conducted studies in support of Bureau of Naval Personnel\n- Conducted studies in support of Navy Personnel Command\n- Conducted studies in support of Navy Recruiting Command\n- Conducted studies in support of Navy Service Training Command\n- Conducted studies in support of Navy Manpower Analysis Center\n- Conducted studies in support of OPNAV N2\/N6\n- Conducted studies in support of OPNAV N3\/N5\n- Conducted studies in support of OPNAV N4\n- Conducted studies in support of OPNAV N9\n- Conducted studies in support of US Fleet Forces Command\n- Conducted studies in support of the Secretary of the Navy"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct over 40 Faculty Research projects in support of Navy and Marine Corps in a full gamut of subject areas that include Manpower, Personnel, Training, Education, Logistics, Navy Plans and Policy, Warfare Requirements, Financial Management, and Information Technology and Dominance\n\n- Conduct studies in support of OPNAV N1\n- Conduct studies in support of OPNAV N2\/N6\n- Conduct studies in support of OPNAV N3\/N5\n- Conduct studies in support of OPNAV N4\n- Conduct studies in support of OPNAV N8\n- Conduct studies in support of OPNAV N9\n- Conduct studies in support of US Fleet Forces Command\n- Conduct studies in support of the Secretary of the Navy"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.924"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.924"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct over 70 Faculty Research projects in support of Navy and Marine Corps in a full gamut of subject areas that include Manpower, Personnel, Training, Education, Logistics, Navy Plans and Policy, Warfare Requirements, Financial Management, and Information Technology and Dominance.\n\n- Conduct studies in support of OPNAV N1\n- Conduct studies in support of OPNAV N2\/N6\n- Conduct studies in support of OPNAV N3\/N5\n- Conduct studies in support of OPNAV N4\n- Conduct studies in support of OPNAV N8\n- Conduct studies in support of OPNAV N9\n- Conduct studies in support of US Fleet Forces Command\n- Conduct studies in support of the Secretary of the Navy"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This Project provides funding to support continuing need for studies and analysis to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, Resource Sponsors, Major Commands and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of the studies, research and analysis products that can be accommodated within funding levels. Results of research products are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process.  This project supports research of both Naval Postgraduate School faculty and students,"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2221."
                    },
                    "ProjectTitle": {
                        "val": "JT Mission Assessment Studies"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "22.500"
                        },
                        "CurrentYear": {
                            "val": "24.880"
                        },
                        "BudgetYearOne": {
                            "val": "17.063"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.063"
                        },
                        "BudgetYearTwo": {
                            "val": "28.335"
                        },
                        "BudgetYearThree": {
                            "val": "28.120"
                        },
                        "BudgetYearFour": {
                            "val": "26.802"
                        },
                        "BudgetYearFive": {
                            "val": "27.350"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations, Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.\n\nBeginning in FY 2014, this project also includes funding for Concept Formulation (CONFORM) efforts.  This is a shift of funding from PE 0605152N, Studies and Analysis Support, Project 2092, Naval Warfare Studies.  CONFORM for ships, boats and unmanned maritime vehicles must be continuously exercised to remain viable. It takes years to train competent practitioners, and knowledge currency is quickly lost without practice. Evolving threats and technologies drive concepts (and the tools, processes, and skills needed to produce them) towards obsolescence without constant attention. Capability Based Assessments and Analysis of Alternatives (AoA) timelines are insufficient for establishing potential material solution cost versus capability relationships without significant concept formulation work beforehand. Active collaboration between the Office of the Chief of Naval Operations requirement sponsors, Program Offices, and the various System Command (Naval Sea Systems Command, Naval Air Systems Command and Space and Naval Warfare Systems Command) engineers is critical for fully exploring the trade space by conducting analysis for affordability, effectiveness and risk.  \nThe majority of Total Ownership Cost (TOC) is locked into a design before it is even a program. In the later stages of a program it becomes much more costly to make changes that will significantly impact TOC. Investment up front in concept design can have a high payoff in TOC reduction over the life of a platform class.\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship and associated platform force structure along with development of the tools to accomplish these efforts. Advanced platform concept studies and systems technology assessments will be conducted as will the development and upgrade of concept design and engineering tools, methods, and criteria.\nOutputs include concept costing and performance parameterization for comparative assessment against capability objectives and synthesis to quantify overall (Fleet) capabilities. These products (expressions of cost vs. capability) will serve as the basis of requirements and Joint Capabilities Integration and Development System analysis, define the trade space for AoA efforts, and underpin discussion of force architecture\/structure during Quadrennial Defense Review, Long Range Shipbuilding Strategy builds, and Joint Requirements Oversight Council reviews.\n\nThe majority of Total Ownership Cost (TOC) is locked into a design before it is even a program. In the later stages of a program it becomes much more costly to make changes that will significantly impact TOC. Investment up front in concept design can have a high payoff in TOC reduction over the life of a platform class.\n\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship and associated platform force structure along with development of the tools to accomplish these efforts. Advanced platform concept studies and systems technology assessments will be conducted as will the development and upgrade of concept design and engineering tools, methods, and criteria.   \n\nOutputs include concept costing and performance parameterization for comparative assessment against capability objectives and synthesis to quantify overall (Fleet) capabilities. These products (expressions of cost vs. capability) will serve as the basis of requirements and Joint Capabilities Integration and Development System analysis, define the trade space for AoA efforts, and underpin discussion of force architecture\/structure during Quadrennial Defense Review, Long Range Shipbuilding Strategy builds, and Joint Requirements Oversight Council\nreviews.\n\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions. This analysis includes evaluation of integration and\ninteroperability gaps of current weapons systems.\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions. This analysis includes evaluation of integration and interoperability gaps of current weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Standard Scenarios with Warfare and Warfare Support Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Develop and continue to update and maintain detailed level Navy Standard scenarios based on DPG.-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Develop, update, and maintain analytic baselines for the MCO based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training,development, deployment,retention,etc.) accross the Navy's warfighting platforms(aircraft,ships,submarines,etc.),facilities and personnel development centers. \n-Develop and continue to maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data were defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.289"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update, and maintain analytic baselines for the MCO) based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data were defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, continue to script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update, and maintain analytic baselines for the MCO) based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data were defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, continue to script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Perform collaborative assessment with capability sponsors. \n-Proactively participate in Capability Sponsors' Integrated Process Teams. \n-Present opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Develop CNO investment strategy recommendations and assessments for Program Review and POM. \n-Assess capability sponsors' products for senior leadership decision forums. \n-Conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Conduct OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Conduct independent assessment of Anti-Submarine Warfare. \n-Conduct weapons safety and sea basing capability assessments. \n-Conduct ISR and METOC assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Perform CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the Planning, Programming, Budgeting Execution process. \n-Perform analyses and provide technical and engineering support, including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Conduct cost analyses, cost-effectiveness analyses, and analyses of new technologies in support of Sponsor Program Proposal, Navy POM or Warfare Capability Plan. \n-Develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Perform analyses for accreditation of models, use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct ISR and METOC assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to perform CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the PPBES process. \n-Continue to perform analyses including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.584"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.584"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct ISR and METOC assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to perform CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the PPBES process. \n-Continue to perform analyses including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Campaign Analysis-Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.702"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Identify, develop, and improve data and modeling. \n-Lead Navy's participation in the OSD\/Joint Staff analytic agenda, baseline development, and collection of data. \n-Provide coordination across the Navy. \n-Broker agreements upon assumptions, CONOPS, scenarios, and data. \n-Lead campaign analysis for OPNAV. \n-Conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop and improve data and modeling.\n-Continue to lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to provide coordination across the Navy.\n-Continue to broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.977"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.977"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop and improve data and modeling.\n-Continue to lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to provide coordination across the Navy.\n-Continue to broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OSD\/Joint Staff Study Analysis and Assessment with Investment Strategy Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Provide overarching PPBES analyses and guidance. \n-Provide analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Provide the lead requirements and acquisition for OPNAV. \n-Coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Participate in OSD and JS analysis assessment and provided structure for coordination across the Navy. \n-Coordinate and support Joint Analytical Model Improvement Program. \n-Develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching PPBES analyses and guidance. \n-Continue to provide analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to provide the lead requirements and acquisition for OPNAV. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to participate in OSD and JS analysis assessment and provided structure for coordination across the Navy. \n-Continue to coordinate and support Joint Analytical Model Improvement Program. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching PPBES analyses and guidance. \n-Continue to provide analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to provide the lead requirements and acquisition for OPNAV. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to participate in OSD and JS analysis assessment and provided structure for coordination across the Navy. \n-Continue to coordinate and support Joint Analytical Model Improvement Program. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Class Modeling, Simulation, and Capability Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.716"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Address the one-year backlog of Modeling and Simulation (M&S) efforts due to the lack of FY13 funding. Specifically modeling or analysis gaps that have been corporately deemed critical to improving POM decision-making.\n-Develop and improve analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement include mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts will address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.791"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement include mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts will address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement include mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts will address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CONFORM"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.998"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct ship, boat and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs). Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n- Collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level. Warfare Systems effectiveness assessment tools will be continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems. Additionally, collaboration with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands will refine fleet level requirements.\n- Refine platform concept stage cost analysis tools to predict cost better in areas where weight-based algorithms may not be appropriate. It will continually enhance tools to estimate total ownership cost more accurately at the ship and weapons system concept development stage. Conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts. Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms. Develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n- Conduct future force structure concept formulation. Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired. Among the areas to be examined are interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies.\n-Continue CBA's for off-board data transfer for mine warfare systems, Navy Salvage, adversary aircraft, and uunderwater breathing apparatus.  Commence CBA for surface connector replacement and undergraduate flight training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools will be continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaboration with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands will refine fleet level requirements.\n-Refine platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  It will continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms.  Develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n-Conduct future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Among the areas to the examined are interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies.\n-Complete CBA's for undergraduate flight training and surface connector replacement, and commence CBA's for candidate systems such as neutralization of sea mines in the near-surface zone and the active RF free-fall expendable decoy.  Expand warfighting gap assessments to address interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct.  Provide analysis support for development of the Inegrated Sponsor Program Guidance to Develop the Force Direction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.766"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.766"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools will be continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaboration with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands will refine fleet level requirements.\n-Refine platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  It will continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms.  Develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n-Conduct future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Among the areas to the examined are interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Mission Assessment Studies"
                                    },
                                    "Description": {
                                        "val": "CBA - The CBA is the JCIDS analysis process that includes three phases: the FAA, the FNA, and the FSA. The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval war fighting capabilities and force structure needed to support the JROC\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue CBA's for off-board data transfer for mine warfare systems, Navy salvage, adversary aircraft, and underwater breathing apparatus. Commence CBA for surface connector replacement and undergraduate flight training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete CBA's for undergraduate flight training and surface connector replacement, and commence CBA's for candidate systems such as neutralization of sea mines in the near-surface zone and the active Radio Frequency free-fall expendable decoy. Expand warfighting gap assessments to address interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.724"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.724"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Capabilities-Based Assessments (CBA) such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A.\nN\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goal is to conduct analysis to support the Navy decisions needed to turn strategy and guidance into the Fleet needed within acceptable risk. The May 2007 revision of the Joint Chiefs of Staff's Joint Capabilities Integration and Development System (JCIDS) instruction (CJCSI 3170.01F) requires a Capabilities-Based\nAssessment (CBA) to assess new requirements. A CBA instruction has been developed by the Chief Navy Office's warfare integration office that prescribes a procedure and structure to this warfighting requirements generation process (JCIDS). A CBA is required to address and validate capability shortfalls or gaps as defined by combatant commanders. It is an analytical process that includes three phases: the Functional Area Analysis, the Functional Needs Analysis, and the Functional Solution Analysis. This process is designed to address future warfighting requirements and analysis needs and improve the quality of Analysis of Alternatives. CBA supports Navy programming decisions and provides the means to develop the analytic underpinning to support the determination of Naval capabilities and force structure recapitalization investments required to fulfill the Maritime Strategy.\nThe May 2007 revision of the Joint Chiefs of Staff's Joint Capabilities Integration and Development System (JCIDS) instruction (CJCSI 3170.01F) requires a CBA to assess new requirements. A CBA instruction has been developed by the Chief Navy Office's warfare integration office that prescribes a procedure and structure to this warfighting requirements generation process (JCIDS). A CBA is required to address and validate capability shortfalls or gaps as defined by combatant commanders. It is an analytical process that includes three phases: the Functional Area Analysis, the Functional Needs Analysis, and the Functional Solution Analysis. This process is designed to address future warfighting requirements and analysis needs and improve the quality of Analysis of Alternatives. CBA supports Navy programming decisions and provides the means to develop the analytic underpinning to support the determination of Naval capabilities and force structure recapitalization investments required to fulfill the Maritime Strategy."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2801"
                    },
                    "ProjectTitle": {
                        "val": "Anti-Tamper"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.374"
                        },
                        "BudgetYearOne": {
                            "val": "1.374"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.374"
                        },
                        "BudgetYearTwo": {
                            "val": "1.374"
                        },
                        "BudgetYearThree": {
                            "val": "1.374"
                        },
                        "BudgetYearFour": {
                            "val": "1.374"
                        },
                        "BudgetYearFive": {
                            "val": "1.401"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Realignment from PU 3039 to 2801 starting in FY15."
                        },
                        "ProjectMissionDescription": {
                            "val": "Perform as the Navy Technical Process Owner for the Anti-Tamper (AT) systems engineering activity that is intended to prevent and\/or delay the exploitation of critical technologies in U.S. Systems. Manage the research, design, development, implementation, and testing of AT measures. Coordinate with Department of Defense AT Executive Agent and implement Department of Navy AT policy in conjunction with the Deputy Assistant Secretary Navy.  Manage Security and Information Security requirements commensurate with the requirements of ALL Navy Programs throughout their lifecycles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Tamper (AT)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Champion new technology with a focused and disciplined approach of development, assessment, evaluation, and transition to meet Navy program AT requirements. Maintain role in AT policy development for implementation and execution by the SYSCOMs incorporating Navy program AT requirements. Provide secure facilities, networks, computers, video\/telephone conference and support personnel for collateral and Special Program operational environments to enable Anti-Tamper implementation and execution by SYSCOM's programs, incorporating AT requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue championing new technology with a focused and disciplined approach of development, assessment, evaluation, and transition to meet Navy program AT requirements. Maintain role in AT policy development for implementation and execution by the SYSCOMs incorporating Navy program AT requirements. Provide secure facilities, networks, computers, video\/telephone conference and support personnel for collateral and Special Program operational environments to enable AT implementation and execution by SYSCOM's programs, incorporating AT requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Manage the research, design, development, implementation and testing of Anti-Tamper measures for the Department of the Navy.  Manage Information Security for all navy programs throughout their lifecycles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3025"
                    },
                    "ProjectTitle": {
                        "val": "Mid-Range Financial Improvement Plans"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.819"
                        },
                        "CurrentYear": {
                            "val": "0.717"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.536"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "One of DoD's and Navy's priority goals is to gain a clean and auditable financial statement.  The Office of the Secretary of Defense (OSD) Comptroller, in his 8 August 2003 memorandum, directed the Military Departments and Defense Agencies, in coordination with the Defense Finance and Accounting Service (DFAS), to prepare a comprehensive mid-range financial improvement plan to identify measurable steps to ensure each material line is auditable, and ensure all major deficiencies are resolved.  \n\nThis project supports the Research, Development, Test and Evaluation, Navy (RDT&E,N) portion of the larger DoD and Navy-wide effort to implement the Financial Improvement Plan (FIP).  Corrective actions required to resolve known deficiencies and determine resource requirements (people and systems) are being identified."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mid-Range Financial Improvement Plans"
                                    },
                                    "Description": {
                                        "val": "Increase from FY13 to FY14 due to increased effort for audit assertion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.819"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to participate in the Navy Financial Management Office (FMO) Business Process Standardization (BPS) initiatives.\n- Continued to participate in the FMO segment testing which includes Reimbursable Work Order (RWO) Grantor, RWO-Performer, transportation of people, CivPay, and Funds Distribution and Reporting for the Navy's assertion of Audit readiness.\n- Continued eliminating problem disbursements older than 120 days, narrowing to 60 days, and potentially narrowing even further.\n- Continued performing obligation validations ensuring accuracy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.717"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- The Mid-Range Financial Improvement Plan effort was transferred to PE 0605861N Project 0135 for FY16 and out."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Financial records are compliant in accordance with the Chief Financial Officers Act."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3027"
                    },
                    "ProjectTitle": {
                        "val": "Defense Critical Infrastructure Program"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.800"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.800"
                        },
                        "BudgetYearTwo": {
                            "val": "6.170"
                        },
                        "BudgetYearThree": {
                            "val": "6.603"
                        },
                        "BudgetYearFour": {
                            "val": "7.107"
                        },
                        "BudgetYearFive": {
                            "val": "7.100"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds received pursuant to the transfer of budget authority from OUSD Policy (OUSD (P)) Homeland Defense Mission Assurance Directorate will be used for infrastructure analysis, assessment, and research required to support execution of the Defense Critical Infrastructure Program (DCIP). Additionally, the transferred budget authority will be used to provide in-depth\/cross-cutting analysis to the Mission Assurance (MA)\/DCIP programs at the Office of the Secretary of Defense (OSD), Joint Staff, Military Departments\/Services, Defense Sector Lead Agencies (DSLAs), and Combatant Commands. NSWC-MAD will also perform cyber mission assurance research and provide expertise in infrastructure mitigation techniques."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DCIP Onsite Assessment, Analysis Support, and Reports"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mission Assurance Division (MAD) will conduct vulnerability assessments for the Combatant Commanders (CCMDs), Services, and Agencies as directed by Office of the Assistant Secretary of Defense for Homeland Defense (OASD HD) and in coordination with the Joint Staff. For the performance period, the MAD will support the Joint Mission Assurance Assessment Pilot (JMAAP) assessments as well as other critical infrastructure assessments based on OASD HD priorities. These on-site assessments of DCI are required to meet annual policy requirements and to ensure assets nominated as Defense Critical Asset (DCA) are fully vetted and validated. Assessment teams will normally consist of a mission analyst and four infrastructure analysts, but team composition may be modified based on the site and assessment requirements. The assessments include pre-site work, on-site work, and post-site report writing. The final assessment report will include collected research such as Baseline Elements of Information (BEI), Benchmarks and Standards, characterizing infrastructure \/ identifying vulnerabilities to missions, and completing the vulnerability portion of the Risk Decision Package. The MAD will work with U.S. Air Force Criticality and Risk Assessment (CARA) and other service teams to supplement data evaluation for Critical Infrastructure Protection (CIP) offices as negotiated between OASD HD's MA Director, the Joint Staff J34 and Service CIP offices"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Central Analytic Capability (CAC) for Research and Data Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.970"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.970"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The MAD will serve as a centralized analytical arm and fusion center for DoD-owned infrastructure information and also for worldwide commercial and host nation owned infrastructure that DoD depends upon for MA. They will provide actionable analytic products and share infrastructure information with DCIP stakeholders and MA partners to meet requirements identified in Policy. They will continue to work with OASD HD to refine and mature the Critical Asset Identification Process (CAIP), including working with DCIP community members to document suggested improvements and identify interdependency trends and remediation opportunities. They will work with CCMDs, Services, Sectors, and Agencies to conduct deep-dive infrastructure research and develop web services to transfer data between DCIP Systems. The MAD will provide reachback desktop analysis support of regions and\/or specific countries across CCMD areas of responsibility (AORs), with focus in U.S. Central Command (USCENTCOM), U.S. Pacific Command (USPACOM), and U.S. Southern Command (USSOUTHCOM) AORs in the upcoming period. \n\nIn addition, the MAD will provide analytical and on-site assistance, as required, to look at the defense continuity aspects of MA. Additional tasks can include on-site analysis based on OASD HD and CCMD prioritization of needs \/ requirements. Tasks can range between full infrastructure analysis across particular countries for operational planning, to specific infrastructure analysis involving telecommunication assets, the Global Information Grid (GIG), and electric power infrastructure security. The MAD will assist Office of the Secretary of Defense (OSD) Policy, Acquisition Technology and Logistics Installations and Environment (AT&L I&E) and AT&L Operational Energy in developing and refining Energy Security documents, presentations, plans, and procedures, and refining lists of potential mitigation options for energy-related vulnerabilities. They will serve as an integrating function by providing a source for historical and ongoing DCIP analysis information \/ assessment research data and feedback, geospatial information, and threat and hazard mapping. They will update and revise MA benchmark standards in conjunction with Joint Staff, Defense Thread Reduction Agency (DTRA), and selected assessment service teams. They will continue to update the DCIP benchmarks and standards data \/ information to support MA program execution requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DoD Cyber Critical Infrastructure Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The MAD will continue to work with OSD Cyber Policy and OASD HD on the Cyber dependencies in the Pacific region. In addition, they will be asked to provide follow on analysis of additional cyber studies in other regions. They will also assist in looking at how to better synchronize nascent cyber processes and capabilities, such as cyber assessments and cyber key terrain analysis, into the DCIP methodology.\nMAD will engage with CCMDs and Sector Agencies on identifying and developing cyber key terrain data and resilience metrics as they pertain to key critical assets in both public and private domains They will gather technical and situational Cyber Security information (all threats, particularly industrial control systems) from intelligence message traffic, internet, private sources, other government agencies, national labs, and industry that address cyber security threats and vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dependency Analysis for MA and Infrastructure Network Operations"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The MAD will provide dependency analysis to the DCIP Community. This analysis may include identifying CCMD and Sector dependencies upon specific DoD-owned infrastructure, and commercial critical infrastructure to include the Defense Industrial Base (DIB). Specific priorities in the performance period will include research of intelligence and mission continuity of assets, as well as COCOM mission assurance and infrastructure dependency reports. They will research Task Critical Asset (TCA) prioritization and perform analysis to develop the final nomination list for review by Chairman of the Joint Chiefs of Staff (CJCS) and to be signed by the OASD HD. This process will include identifying duplicative nominations and\/or similar assets and work with stakeholders to de-conflict, and also work with Joint Staff to develop a vulnerability assessment schedule. The task will synchronize efforts for criticality, threat \/ hazard and vulnerability assessment, and risk response via risk decision packages."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crisis Support, Exercise Support and Emergent Requirements Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.440"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.440"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The MAD will provide deep dive technical analysis on critical infrastructure issues related to specific crises affecting DoD missions and Defense Security Cooperation Agency (DSCA) response efforts. They will develop inputs and provide the Global Situational Awareness Facility (GSAF) \/ National Military Command Center (NMCC) \/ Joint Staff J33 personnel and senior leaders with actionable analytic products and value-added strategic risk management recommendations for critical decision making during events. They will provide quick response infrastructure research and analysis to the OASD HD and Americas' Security Affairs (OASD(HD&ASA)), CCMDs, Services, Sectors, and Agencies in the form of technical analysis and recommendations to the OASD (HD&ASA) and the DCIP Community on infrastructure networks and points of service related to pre-event and post-event analysis for manmade or natural disaster incidents and intelligence relating to threats. The crisis response \/ preparation of infrastructure analysis to the DCIP Community will also be utilized during planned exercises.\nThrough this support, the MAD's infrastructure analysis will help identify the potential crisis impact and will support risk management recommendations during and after the exercises. They will support emergent requirements for DoD and National initiatives at the direction of the OASD (HD&ASA). This support may include infrastructure research and subject matter expertise (SME) analysis, participation in DoD or interagency working groups, and infrastructure-related inquiries by congress. They will identify emerging threat vectors and CIP-related gaps in coordination with CCMDs and DoD agencies related to MA and Critical Infrastructure Sectors, and their impacts via white papers and briefings. U.S. Northern Command (USNORTHCOM) submissions and on-site liaisons provided per request and approval; participation in USNORTHCOM outreach sessions is anticipated as part of this tasking."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "On-Site Liaison to OASD (HD&ASA) and Data Exchange Working Groups Leadership and Participation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The MAD will provide one liaison to reside within the OASD (HD&ASA) offices. The liaison will provide temporary support as team leader for the DCIP within the OASD HD&ASA's Mission Assurance Directorate. The liaison will assist with DCIP policy development, facilitate stakeholder meetings, coordinate annual program reviews, and perform other inherently government functions as directed. Responsibilities include tasking and monitoring of progress by contractor personnel supporting the Mission Assurance Directorate on cyber, energy and other critical infrastructure projects. The liaison will manage tasking and deliverables of infrastructure analysis, geospatial products, vulnerability assessments, and technology development performed by MAD-Dahlgren in support of the OASD HD&ASA and Mission Assurance Directorate. The liaison may also be asked to represent Homeland Defense at meetings, working groups and conferences."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Knowledge Management and Technical Information and Dissemination Support and Maintenance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This support provides for the network backbone and information technology support required for day-to-day operations, and to respond to crises and exercise events in near real-time with accurate and actionable information. Typical tasks provide an early and deep look at an event informing senior leaders and allowing for follow on tailored research. The MAD will develop classified web-based geospatial visualization and data gathering and dissemination capabilities to promote data sharing of MA information. Research will entail enhancing knowledge management, community awareness, and the effectiveness of crisis response and other decision support activities. This task supports the delivery mechanism for the analysis provided by the MAD to multiple CCMDs, Services, Sector Leads, the Department of Homeland Security (DHS) \/ Department of Energy (DoE), and the platforms upon which several MA-supporting systems reside. This task also assists in providing a Common Operational Picture for MA and brokers \/ shares data to MA partners on behalf of the OASD HD&ASA. The MAD will provide development support working with in-house information technology (IT) personnel to update and administrate the portal \/ tool interfaces and ensure appropriate data exchange and data gathering is able to occur within DCIP systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Program cost, schedule, and performance are measured using a systematic approach with approved program management methods.  The results are presented in a monthly financial execution status report. Reports are to be submitted to the Director, MA and the Policy Resource Management Office in OSD Policy and DUSN (P) by the 15th of each succeeding month.  The reports will reflect the progress made on each of the project tasks by deliverable and a separate accumulated cost report.  Actual versus planned costs will be reflected in the reports at the request of the sponsor."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3039"
                    },
                    "ProjectTitle": {
                        "val": "CHENG"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "18.186"
                        },
                        "CurrentYear": {
                            "val": "13.241"
                        },
                        "BudgetYearOne": {
                            "val": "10.827"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.827"
                        },
                        "BudgetYearTwo": {
                            "val": "16.002"
                        },
                        "BudgetYearThree": {
                            "val": "15.724"
                        },
                        "BudgetYearFour": {
                            "val": "14.904"
                        },
                        "BudgetYearFive": {
                            "val": "15.215"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Standards, Policy, and Guidelines"
                                    },
                                    "Description": {
                                        "val": "Standards, Policy and Guidelines conducts and provides policy analysis, and studies, Policy issue identification and resolution. Additionally, management and execution of the Information Support Plan (ISP) process for the DON.  Assists program offices with ISP planning & development guidance and assistance, conducts ISP reviews; provides comments\/recommendations.  Liaison with DoD, Joint Staff, and Other Service acquisition\/Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.537"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued policy analysis, studies and guidance to include issue identification and resolution \n-Continued Program Office ISP planning and development support\n-Continued ISP Reviews"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continuation of FY14 efforts and initiatives"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued policy analysis, studies and guidance to include issue identification and resolution \n-Continued Program Office ISP planning and development support"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval System Engineering Resource Center (NSERC)"
                                    },
                                    "Description": {
                                        "val": "Development and implementation of the Navy Enterprise Architecture Repository (NEAR) as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.805"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed Phased Delivery (Phase II) of NEAR"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.213"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue Phased Delivery (Phase III) of NEAR"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue Phased Delivery of NEAR"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering"
                                    },
                                    "Description": {
                                        "val": "Provide the framework for making engineering decisions by war fighting capability at the Family of Systems\/System of Systems level and supports consistent engineering and investment decision making across Navy and Marine Corps programs within-capability based acquisition portfolio"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.844"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed and Deliver the Systems Engineering Human Resource Competency Model\n- Continued Corrosion Prevention and Control initiatives\n- Continued Integration & Interoperability (I&I) initiatives\n- Continued Program Office SEP review and support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue Corrosion Prevention and Control initiatives \n- Complete and transition I&I initatives to OPNAV\/Fleet components\n- Continue Program Office SEP review and support"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.253"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.253"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Program Office SEP review and support\nContinue Corrosion Prevention and Control initiatives"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Standards, Policy, and Guidelines: - Alignment of SPGs across the Naval Enterprise and with OSD and Joint organizations will support standard acquisition implementation and improve compatibility and interoperability thereby lowering development and maintenance costs across programs\t\t\t\t\t\t\t\t\t\t\t\t\n- Aggregating systems for the purpose of conducting certification and accreditation and consolidating mandatory documentation for aggregations versus individual systems will optimize (cost tradeoffs and focus on high priority issues) certifications, reduce paperwork and associated costs, and put attention on systems engineering, IA, and ISPs for systems in their aggregated operational state vice just the individual system development state.   Document costs for major programs are $1 to $3.5 Million per system.  An aggregation may include 15 or more systems with four or more being major systems.  Aggregation presents a high potential for Return on Investment.\t\t\t\t\t\t\t\t\t\t\t\t\n- NR-KPP processes will clarify requirements and capabilities (including their metrics) that acquisition programs need to develop systems.  This clarification will eliminate guesses in terms of operational needs, thereby reducing the risk of program failure and reducing program and life-cycle costs.\t\t\t\t\t\t\t\t\t\t\t\t\nNaval Collaborative Engineering Environment (NCEE): Number of customers\/ users.\t\t\t\nPercentage of time the tool is available.\t\t\t\t\t\t\t\t\t\nNumber of tools integrated into the system.\t\t\t\t\t\t\t\t\t\t\t\t\nSystems Engineering:\t\t\t\t\t\t\t\t\t\t\t\nReviews and comment on all ACAT I system engineering plans presented to ASN (RDA) within 30 days of receipt to provide system engineering and system of system engineering guidance to the Acquisition Program Manager.\t\t\t\t\t\t\t\t\t\t\t\t\nReview 80% of the MDAP Gate reviews held in FY10 to provide software acquisition process improvement guidance, system of systems engineering guidance and integration and interoperability management guidance to the Acquisition Program Managers."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3330"
                    },
                    "ProjectTitle": {
                        "val": "Naval Research Laboratory (NRL) Facilities Modernization"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.392"
                        },
                        "CurrentYear": {
                            "val": "1.611"
                        },
                        "BudgetYearOne": {
                            "val": "13.849"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.849"
                        },
                        "BudgetYearTwo": {
                            "val": "16.429"
                        },
                        "BudgetYearThree": {
                            "val": "16.449"
                        },
                        "BudgetYearFour": {
                            "val": "16.207"
                        },
                        "BudgetYearFive": {
                            "val": "16.801"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NRL Facilities Modernization"
                                    },
                                    "Description": {
                                        "val": "Critical Science and Technology research cannot be sustained or succeed in deteriorated facilities.  World class research can only be accomplished in facilities that are at a minimum \"adequate\", but preferably \"state-of-the-art.\"  Due to their advanced age and deterioration, funds are planned to restore\/modernize various laboratory facilities at the Naval Research Laboratory.  \n\nThe FY 2016 funding increase will support the restoration\/modernization the Naval Research Laboratory, the Navy's world class corporate research laboratory, to ensure they can meet future technological threats.  Due to advanced age and deterioration of the facilities, the increase in funding is needed to update various laboratory facilities to further the critical science and technology research for the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the modernization efforts for the electronics science and technology laboratories, equipment, and specialized facilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Starting in FY16 the Naval Research Laboratory, the Navy's only Corporate Research Laboratory, will be completing the first phase of its Corporate Facility Investment Plan (CFIP), a comprehensive plan through FY25, to modernize its laboratory to ensure they can meet future technological threats. The funds will be used for specific studies, evaluations, and the special handling of highly critical and sensitive laboratories that will be relocated into refurbished buildings. This includes planning, consolidating and relocating of over 100 laboratories into less than 80 laboratories; careful disassembly of one-of-a-kind facilities and equipment by in-house scientists and experts and contractor support with specialized skills to devise unique plans to disassemble, transport, and reassemble the facilities; and the recalibration and specialized reassembly of the highly specialized equipment (e.g., solid-state electronic devises, lasers, vacuum tubes, electrical connections, reactors, gas sensors and chambers, and chemical connectors and distribution systems)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        },
                        "PerformanceMetrics": {
                            "val": "Restoration and modernization of the laboratory facilities will begin in a phased approach until completion."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3363"
                    },
                    "ProjectTitle": {
                        "val": "PACOM Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "7.664"
                        },
                        "CurrentYear": {
                            "val": "7.945"
                        },
                        "BudgetYearOne": {
                            "val": "13.336"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.336"
                        },
                        "BudgetYearTwo": {
                            "val": "15.711"
                        },
                        "BudgetYearThree": {
                            "val": "15.432"
                        },
                        "BudgetYearFour": {
                            "val": "15.144"
                        },
                        "BudgetYearFive": {
                            "val": "15.461"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This funding is for a classified effort."
                        },
                        "ProjectMissionDescription": {
                            "val": "This funding is for a classified effort."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PACOM Initiative"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.664"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a classified initiative."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.945"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a classified initiative."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a classified initiative."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This funding is for a classified effort."
                        },
                        "PerformanceMetrics": {
                            "val": "This funding is for a classified effort."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3381"
                    },
                    "ProjectTitle": {
                        "val": "JIE Initiiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "8.900"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.900"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Information Environment (JIE) initiative provides the supporting IT capability framework comprised of shared information technology infrastructure, enterprise services, interoperability with coalition partners and a single security architecture that enables mission commanders to execute mission partnered operations.  JIE provides the U.S. configuration controls necessary for enterprise capabilities.  By utilizing a U.S enterprise-wide secure Identity and Access Management system, JIE ensures that authorized users at the right classification level gain access to only the data and services they are entitled.  The continued development and refinement of a Joint Information Environment will provide for a significant improvement in data sharing within, and between, coalition maritime elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategies for Defense of Data"
                                    },
                                    "Description": {
                                        "val": "The Joint Information Environment (JIE) initiative provides the supporting IT capability framework comprised of shared information technology infrastructure, enterprise services, interoperability with coalition partners and a single security architecture that enables mission commanders to execute mission partnered operations.  JIE provides the U.S. configuration controls necessary for enterprise capabilities.  By utilizing a U.S enterprise-wide secure Identity and Access Management system, JIE ensures that authorized users at the right classification level gain access to only the data and services they are entitled.  The continued development and refinement of a Joint Information Environment will provide for a significant improvement in data sharing within, and between, coalition maritime elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and integrate analytic methodologies and supporting elements that address cyber capabilities, innovations, and strategic engagements in order to produce a strategy for a more defensible and secure cyber architecture specifically designed for U.S. Pacific Command, joint, and coalition mission partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize an existing Army contract to develop capabilities to identify and provide risk management for critical infrastructure system vulnerabilities as a result of cyber based attacks in the U.S. Pacific Command area of responsibility.  This information is for presentation to the Office of the Under Secretary of Defense for Intelligence (OUSD(I))."
                        },
                        "PerformanceMetrics": {
                            "val": "Develop scenario based, interactive exercise simulations to supplement existing table top, command post, and full scale incident response training and exercise programs.  The completion date for the strategy and cyber architecture recommendations is September 2015."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "7.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds execution of DoD's Executive Agent (EA) for Printed Circuit Board (PrCB) Technologies as established by the 2009 National Defense Authorization Act (Section 256, PL 110-417).  The primary deliverable from this effort will be a PrCB and Interconnect Technology Roadmap, or strategic plan, identifying domestic technology gaps, future research and development needs, and any policy changes required to ensure that the DoD has access to PrCB manufacturing capabilities and technical expertise necessary to meet future military requirements.  As mandated, the EA will also address DoD PrCB supply chain issues, including diversity and vulnerabilities, and develop trustworthiness requirements for PrCBs used in defense systems."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Printed Circuit Board Executive Agent"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "- Complete domestic technology gap analysis & identification of future R&D needs\n- Complete assessment of vulnerabilities, trustworthiness, and diversity of the PrCB supply chain\n- Complete joint common strategic weapons systems study\/research and development to demonstrate \"trusted\" PrCB principles and implement proven \"trust\" measures\n- Complete establishment of strategic electronic parts commonality framework and strategic parts library to reduce program risk and costs\n- Complete development of PRCB and interconnect technology roadmap\/strategic plan"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "- Complete domestic technology gap analysis & identification of future R&D needs\n- Complete assessment of vulnerabilities, trustworthiness, and diversity of the PrCB supply chain\n- Complete joint common strategic weapons systems study\/research and development to demonstrate \"trusted\" PrCB principles and implement proven \"trust\" measures\n- Complete establishment of strategic electronic parts commonality framework and strategic parts library to reduce program risk and costs\n- Complete development of PRCB and interconnect technology roadmap\/strategic plan"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In 2005, the National Academies national research council (NRC) conducted a study and subsequently issued a report relating to manufacturing trends in printed circuit technology.  Within that report, the NRC detailed four critical issue areas that needed to be addressed in the interest of national security.  Those issue areas included; Trust, Supply Chain, Organic (DoD) Capability Sustainment, and Technology Development.  \n\nIntense global competition in the Printed Circuit Board (PrCB) industry has resulted in a significant reduction in the number of United States PrCB companies, leaving the domestic PrCB industrial base \"fragile\" and progressively declining in capability and health.  Implementation of the strategies developed by the EA for PrCB Technologies will proactively ensure that the U.S. PrCB industry is capable of supporting future DoD electronics requirements.  The strategic plan is expected to indentify technology gaps and research and development needs, as well as identify and recommend policy changes.\n\nIn addition to benefiting DoD by ensuring access to leading edge PrCB technology, it is expected that the EA program will help the struggling domestic PrCB industry by indentifying future technology research and development needs and securing the domestic military market."
                        }
                    }
                }
            ]
        }
    }
}