{
    "id": "5f65b2b23cac19f5bbe2f10b0fec463a3013294b",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605801A"
        },
        "ProgramElementTitle": {
            "val": "Programwide Activities"
        },
        "R1LineNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "81.013"
            },
            "CurrentYear": {
                "val": "64.160"
            },
            "BudgetYearOne": {
                "val": "60.319"
            },
            "BudgetYearOneBase": {
                "val": "60.319"
            },
            "BudgetYearTwo": {
                "val": "63.148"
            },
            "BudgetYearThree": {
                "val": "65.882"
            },
            "BudgetYearFour": {
                "val": "68.601"
            },
            "BudgetYearFive": {
                "val": "75.874"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program funds the continued operation of non-Army Management Headquarters Activities (AMHA) management and administrative functions at U.S. Army Research, Development and Standardization Groups overseas, Army Research, Development, Test, and Evaluation (RDTE) commands, centers and activities required to accomplish overall assigned general research and development missions and international research and development not directly related to specific research and development projects.  The Standardization Groups play an integral role in the U.S. Army efforts for international cooperative research, development and interoperability, and fulfill international memoranda of understanding requirements (especially the American, British, Canadian and Australian Armies' Standardization Programs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "81.993"
                },
                "CurrentYear": {
                    "val": "64.169"
                },
                "BudgetYearOne": {
                    "val": "64.243"
                },
                "BudgetYearOneBase": {
                    "val": "64.243"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "81.013"
                },
                "CurrentYear": {
                    "val": "64.160"
                },
                "BudgetYearOne": {
                    "val": "60.319"
                },
                "BudgetYearOneBase": {
                    "val": "60.319"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.980"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-3.924"
                },
                "BudgetYearOneBase": {
                    "val": "-3.924"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.980"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.924"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.924"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "M02"
                    },
                    "ProjectTitle": {
                        "val": "Med Cmd Spt (Non-AMHA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.932"
                        },
                        "CurrentYear": {
                            "val": "25.453"
                        },
                        "BudgetYearOne": {
                            "val": "24.769"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.769"
                        },
                        "BudgetYearTwo": {
                            "val": "23.454"
                        },
                        "BudgetYearThree": {
                            "val": "24.260"
                        },
                        "BudgetYearFour": {
                            "val": "25.390"
                        },
                        "BudgetYearFive": {
                            "val": "28.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for authorized civilian workforce performing medical research, development,acquisition management and oversight that support the medical research, development, test, and evaluation (RDTE) programs at the U.S. Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, Maryland to: (1) perform planning, programming, and budgeting; (2) manage resources; and (3) ensure compliance with U.S. Food and Drug Administration (FDA) and other regulatory and safety requirements.  It also provides for continued operations of contracting and acquisition management functions performed by the U.S. Army Medical Research Acquisition Activity (USAMRAA) in support of the USAMRMC Medical RDTE Program.    \n    \nAdditionally, this project provides funding for the special immunization program (SIP).  The SIP program provides FDA licensed vaccines and investigational new drug (IND) vaccines under informed consent to laboratory workers at the US Army Medical Research Institute of Infectious Diseases, and to other military, government, or contractor personnel who may be at risk of exposure to highly hazardous pathogenic microorganisms or toxins"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Authorized Salaries and other operational requirements"
                                    },
                                    "Description": {
                                        "val": "Funding was provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.932"
                                            },
                                            "Text": {
                                                "val": "Funded authorized civilian salaries and associated expenses (supplies, equipment, travel, etc.) at HQ, USAMRMC, and USAMRAA.  Total civilian count reflects increased authorizations added in FY12 due to an administrative change to add authorizations for Army acquisition positions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.453"
                                            },
                                            "Text": {
                                                "val": "Funds authorized civilian salaries and associated expenses (supplies, equipment, travel, etc) USAMRMC and USAMRAA.  Also, provides regulatory, clinical monitoring and data support for the Special Immunization Program (SIP).  This program provides non licensed vaccines under FDA oversight to personnel at risk of exposure to selected infectious diseases"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.769"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.769"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries and associated expenses (supplies, equipment, travel, etc) USAMRMC and USAMRAA.  Also, will provide regulatory, clinical monitoring and data support for the Special Immunization Program (SIP).  This program will provide non licensed vaccines under FDA oversight to personnel at risk of exposure to selected infectious diseases"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M15"
                    },
                    "ProjectTitle": {
                        "val": "ARI Mgmt\/ADM Act"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.338"
                        },
                        "CurrentYear": {
                            "val": "3.443"
                        },
                        "BudgetYearOne": {
                            "val": "3.493"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.493"
                        },
                        "BudgetYearTwo": {
                            "val": "3.552"
                        },
                        "BudgetYearThree": {
                            "val": "3.614"
                        },
                        "BudgetYearFour": {
                            "val": "3.681"
                        },
                        "BudgetYearFive": {
                            "val": "3.752"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The U.S. Army Research Institute for the Behavioral and Social Sciences (ARI) is the only Science and Technology (S&T) laboratory that conducts research to enhance the Soldier lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion).  This project supports the non-Army Management Headquarters Activity (non-AMHA) management and administrative functions to enable ARI to accomplish its research mission and includes activities such as budget execution, procurement oversight, RDT&E program planning and evaluation, management control, security\/safety, logistics, information technology, and personnel\/manpower execution and oversight.  ARI's behavioral and social science research provides effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ARI"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.338"
                                            },
                                            "Text": {
                                                "val": "Provided operation of management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.443"
                                            },
                                            "Text": {
                                                "val": "Continue to provide operation of management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.493"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.493"
                                            },
                                            "Text": {
                                                "val": "Will provide operation of management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M16"
                    },
                    "ProjectTitle": {
                        "val": "Standardization Groups"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.250"
                        },
                        "CurrentYear": {
                            "val": "5.306"
                        },
                        "BudgetYearOne": {
                            "val": "3.496"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.496"
                        },
                        "BudgetYearTwo": {
                            "val": "3.606"
                        },
                        "BudgetYearThree": {
                            "val": "4.147"
                        },
                        "BudgetYearFour": {
                            "val": "4.230"
                        },
                        "BudgetYearFive": {
                            "val": "4.312"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project M16 supports nine International Technology Centers (formerly known as Standardization Groups) (Australia, United Kingdom, Canada, France, Germany, Japan, Chile, Argentina, and Singapore) for personnel, travel and overhead costs, leases on buildings, and mandatory permanent change of station.  \n\nThe mission of the International Technology Centers is to represent the Army and serve as in-country\/region focal point for all international armaments cooperation in their areas (countries) of responsibility to government agencies, academia, and defense industries."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Technology Centers Management"
                                    },
                                    "Description": {
                                        "val": "Management \/ administrative support to International Technology Center"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.250"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at the nine International Technology Centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.306"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at the nine International Technology Centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.496"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.496"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at the nine International Technology Centers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M42"
                    },
                    "ProjectTitle": {
                        "val": "ARDEC Cmd\/Ctr Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.402"
                        },
                        "CurrentYear": {
                            "val": "5.847"
                        },
                        "BudgetYearOne": {
                            "val": "6.965"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.965"
                        },
                        "BudgetYearTwo": {
                            "val": "6.647"
                        },
                        "BudgetYearThree": {
                            "val": "6.820"
                        },
                        "BudgetYearFour": {
                            "val": "7.092"
                        },
                        "BudgetYearFive": {
                            "val": "7.223"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funding supports the Non-Army Management Headquarters Activity (AMHA) management and administrative functions at the U.S. Army Armament Research, Development and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "U.S. Army Armament Research, Development and Engineering Center (ARDEC) management \/ administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.402"
                                            },
                                            "Text": {
                                                "val": "Provided continued management and administrative functions at a level consistent with mission requirements and support needs at ARDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.847"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at ARDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.965"
                                            },
                                            "Text": {
                                                "val": "Will provide continued management and administrative functions at a level consistent with mission requirements and support needs at ARDEC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M44"
                    },
                    "ProjectTitle": {
                        "val": "CECOM Cmd\/Ctr Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.658"
                        },
                        "CurrentYear": {
                            "val": "3.975"
                        },
                        "BudgetYearOne": {
                            "val": "4.167"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.167"
                        },
                        "BudgetYearTwo": {
                            "val": "4.513"
                        },
                        "BudgetYearThree": {
                            "val": "4.643"
                        },
                        "BudgetYearFour": {
                            "val": "4.825"
                        },
                        "BudgetYearFive": {
                            "val": "4.916"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the Non-Army Management Headquarters Activity management and administrative functions at the U.S. Army Communications-Electronics Research Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "U.S. Army Communications-Electronics Research Development and Engineering Center (CERDEC) management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.658"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at CERDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.975"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at CERDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.167"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.167"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at CERDEC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M46"
                    },
                    "ProjectTitle": {
                        "val": "AMCOM Cmd\/Ctr Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.229"
                        },
                        "CurrentYear": {
                            "val": "8.739"
                        },
                        "BudgetYearOne": {
                            "val": "3.634"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.634"
                        },
                        "BudgetYearTwo": {
                            "val": "7.014"
                        },
                        "BudgetYearThree": {
                            "val": "7.881"
                        },
                        "BudgetYearFour": {
                            "val": "8.467"
                        },
                        "BudgetYearFive": {
                            "val": "11.787"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Protection Technology (PT) Program - no FY 2016 funding."
                        },
                        "ProjectMissionDescription": {
                            "val": "Supports the Non-Army Management Headquarters Activity (AMHA) management and administrative functions at the U.S. Army Aviation and Missile Research and Development Center (AMRDEC), Redstone Arsenal, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "U.S. Army Aviation and Missile Research and Development Center (AMRDEC) management and administrative efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.229"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at AMRDEC"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.639"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at AMRDEC"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.634"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.634"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide management and administrative functions at a level consistent with mission requirements and support needs at AMRDEC"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protection Technology (PT) Program"
                                    },
                                    "Description": {
                                        "val": "The PT Program is a DoD program that encompasses the systems engineering activities intended to prevent and\/or delay exploitation of critical technologies in U.S. weapon systems.  These activities involve the entire life-cycle of systems acquisition, including research, development, implementation, and testing of PT measures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Maintained the core team of subject matter experts (SMEs) available for this mission and to conduct technical assessments of micro-electronic parts used in the electronic designs of a number of critical Army weapons systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Maintain the core team of subject matter experts (SMEs) available for this mission and to conduct technical assessments of micro-electronic parts used in the electronic designs of a number of critical Army weapons systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M47"
                    },
                    "ProjectTitle": {
                        "val": "TACOM Cmd\/Ctr Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.891"
                        },
                        "CurrentYear": {
                            "val": "2.734"
                        },
                        "BudgetYearOne": {
                            "val": "3.382"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.382"
                        },
                        "BudgetYearTwo": {
                            "val": "3.429"
                        },
                        "BudgetYearThree": {
                            "val": "3.334"
                        },
                        "BudgetYearFour": {
                            "val": "3.385"
                        },
                        "BudgetYearFive": {
                            "val": "3.448"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the Non-Army Management Headquarters Activity management and administrative functions at the U.S. Army Tank-Automotive Research Development Engineering Center (TARDEC), Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "U.S. Army Tank-Automotive Research Development Engineering Center (TARDEC) management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.891"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at TARDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.734"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at TARDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.382"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.382"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at TARDEC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M55"
                    },
                    "ProjectTitle": {
                        "val": "Edgewood Chemical Biological Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.060"
                        },
                        "CurrentYear": {
                            "val": "6.483"
                        },
                        "BudgetYearOne": {
                            "val": "6.550"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.550"
                        },
                        "BudgetYearTwo": {
                            "val": "7.025"
                        },
                        "BudgetYearThree": {
                            "val": "7.223"
                        },
                        "BudgetYearFour": {
                            "val": "7.503"
                        },
                        "BudgetYearFive": {
                            "val": "8.110"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the Non-Army Management Headquarters Activity (AMHA)management and administrative functions at the U.S. Army Edgewood Chemical Biological Center (ECBC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "U.S. Army Edgewood Chemical Biological Center (ECBC) management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.060"
                                            },
                                            "Text": {
                                                "val": "Provided continued management and administrative functions at a level consistent with mission requirements and support needs at ECBC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.483"
                                            },
                                            "Text": {
                                                "val": "Provide continued management and administrative functions at a level consistent with mission requirements and support needs at ECBC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.550"
                                            },
                                            "Text": {
                                                "val": "Will provide continued management and administrative functions at a level consistent with mission requirements and support needs at ECBC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M58"
                    },
                    "ProjectTitle": {
                        "val": "SECOM CMD\/CTR Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.898"
                        },
                        "CurrentYear": {
                            "val": "0.936"
                        },
                        "BudgetYearOne": {
                            "val": "2.146"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.146"
                        },
                        "BudgetYearTwo": {
                            "val": "2.171"
                        },
                        "BudgetYearThree": {
                            "val": "2.201"
                        },
                        "BudgetYearFour": {
                            "val": "2.234"
                        },
                        "BudgetYearFive": {
                            "val": "2.200"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the Non-Army Management Headquarters Activity (AMHA) management and administrative functions at the Natick Soldier Research, Development and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "Natick Soldier Research, Development and Engineering Center  (NSRDEC) management and administrative functions"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.898"
                                            },
                                            "Text": {
                                                "val": "Provided continued management and administrative functions at a level consistent with mission requirements and support needs at NSRDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.936"
                                            },
                                            "Text": {
                                                "val": "Provide continued management and administrative functions at a level consistent with mission requirements and support needs at NSRDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.146"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.146"
                                            },
                                            "Text": {
                                                "val": "Will provide continued management and administrative functions at a level consistent with mission requirements and support needs at NSRDEC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M76"
                    },
                    "ProjectTitle": {
                        "val": "Armament Group Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.355"
                        },
                        "CurrentYear": {
                            "val": "1.244"
                        },
                        "BudgetYearOne": {
                            "val": "1.717"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.717"
                        },
                        "BudgetYearTwo": {
                            "val": "1.737"
                        },
                        "BudgetYearThree": {
                            "val": "1.759"
                        },
                        "BudgetYearFour": {
                            "val": "1.794"
                        },
                        "BudgetYearFive": {
                            "val": "1.826"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "NATO Defense Against Terrorism (DAT) Pays the U.S. share of the NATO Civil Budget (mandatory bill) \nand NATO Industrial Advisory Group (NIAG) Studies Pays the U.S. portion of the NATO NIAG bill (a must fund bill)  \nNATO Army Armaments Group (NAAG), AR-34-1 Multinational Force Compatibility. Supports Land Capability Group scientifica and technological exchange and development with NATO allies."
                        },
                        "ProjectMissionDescription": {
                            "val": "The goal of this program is to expand worldwide allied standardization and interoperability through cooperative research and development (R&D) and technology sharing per SECDEF guidance and especially in support of the U.S. Army. This program partially funds the travel costs and administrative support (studies, analysis, interpretation, equipment, etc.) required to participate in international fora, such as the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG), Defense Against Terrorism (DAT) and to pursue new cooperative R&D initiatives and international cooperative agreements such as memoranda of understanding. This program also includes:  the United States' share of costs of the NATO Civil Budget, Chapter IX, which funds the NATO Industrial Advisory Group (NIAG) and the Special Fund for Cooperative Planning (U. S. Army is Executive Agent for this NATO bill); partially funds the Five Power Senior National Representatives, Army [SNR (A)], the Technical Cooperative Program, Bilateral SNR(A)s, and Army armaments working groups with many nations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army scientific support NATO Army Armaments Group (NAAG)"
                                    },
                                    "Description": {
                                        "val": "Funded support Army subject matter experts to attend scientific and technological exchange, meetings, demonstrations, and\/or simulations having military application and mutual benefits to the United States and its Allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.313"
                                            },
                                            "Text": {
                                                "val": "Funds support Army experts to attend scientific and technological exchange meetings. This meetings will enable senior Army officials to attend senior level NATO meetings (e.g., CNAD and NAAG) and Army SMEs attend Land Capability Group and other working group scientific and technology exchange and development meetings, demonstrations, simulations having military applications and mutual benefits to the U.S. and its allies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.349"
                                            },
                                            "Text": {
                                                "val": "Will fund supported Army experts to attend scientific and technological exchange, meetings, demonstrations, and\/or simulations having military application and mutual benefits to the United States and its Allies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.304"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.304"
                                            },
                                            "Text": {
                                                "val": "Funds will support Army Subject Matter Experts (SME) to attend scientific and technological exchange, meetings, demonstrations, and\/or simulations having military application and mutual benefits to the United States and its Allies. FY16 funds will fund 16 different working\/capability  groups that will meet twice a year."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Executive Agent"
                                    },
                                    "Description": {
                                        "val": "Fund the United States' share of the NATO Civil Budget, Chapter IX (Defense Support Programs).  U. S. Army is Executive Agent for this NATO bill."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.042"
                                            },
                                            "Text": {
                                                "val": "Provided the United States' share of the NATO Civil Budget, Chapter IX (Defense Support Programs).  U. S. Army is Executive Agent for this NATO bill."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.895"
                                            },
                                            "Text": {
                                                "val": "Provide the United States' share of the NATO Civil Budget, Chapter IX (Defense Support Programs).  U. S. Army is Executive Agent for this NATO bill."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.413"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "Will provide the United States' share of the NATO Civil Budget, Chapter IX (Defense Support Programs).  U. S. Army is Executive Agent for this NATO bill."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}