{
    "id": "5fc190648da91fa685650e75e5cd80c2370c4d9d",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA7_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203726A"
        },
        "ProgramElementTitle": {
            "val": "Adv Field Artillery Tactical Data System"
        },
        "R1LineNumber": {
            "val": "170"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.120"
            },
            "CurrentYear": {
                "val": "1.273"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "25.393"
            }
        },
        "ProgramElementNote": {
            "val": "The Army Acquisition Executive (AAE) determined that AFATDS Increment 2 (program element 0203726A project code DU5) is a software modernization effort of the existing AFATDS program. Therefore, the Army moved funding for AFATDS Increment 2 from program element 0203726A project code DU5 (PB2015 BLIN 163), to the current AFATDS funding (program element 0203728A project code EF8) as AFATDS version 7.0.  Previous \"AFATDS Increment 1\" efforts are delineated as V6.x in program element 0203728A project code EF8.\n\nFY14:  \nOther Adjustment 1:  Program element 0203726A project code DU5 (PB2015 BLIN 163) reduced by $1.169 million due to change in the AFATDS development effort.\nOther Adjustment 2:  Program element 0203726A project code F19 reduced by $0.218 million.\nNote:  $5.547 million moved from program element 0203726A project code DU5 (PB2015 BLIN 163) to program element 0203726A project code 322 due to change in the AFATDS development effort.\n\nFY15:\nOther Adjustment 1: Program element 0203726A project code DU5 (PB2015 BLIN 163) reduced by $21.101 million due to change in the AFATDS development effort.\n\nFY16:  \nOther Adjustment 1: Program element 0203726A project code DU5 (PB2015 BLIN 163) reduced by $41.034 million due to change in the AFATDS development effort."
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Field Artillery Tactical Data System (AFATDS) provides the Army, Navy, and Marine Corps automated fire support command, control and communications. AFATDS is used to plan, execute, and deliver lethal and non-lethal effects. AFATDS provides Joint\/Coalition Situational Awareness for fires execution and mission management. The system interoperates and integrates with over 80 different battlefield systems, including Navy and Air Force command and control weapon systems; and the German, French, Turkish, and Italian fire support systems. AFATDS automates the planning, coordination, and control of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars). AFATDS provides eleven core services that manage user input and handle dissemination of complex fires processes. These core services are: Attack\/Engagement Analysis, Fire Support Planning, Mission Guidance, Target Definition, Mission Area Definition, Cross-System Graphics\/Mapping management, Unit Task Organization Data, Fires Conflict Detection, Mobile Air\/Ground Tracking, Mission Execution and Mission Trigger Events. These AFATDS services promote situational awareness of data, intelligence information and targeting data, in near real time, in order to effectively manage target selection and target engagement in accordance with the Maneuver Commanders guidance and priorities. \n\nJoint Automated Deep Operations Coordination System (JADOCS) is a Joint and Coalition targeting, coordination, and de-confliction mission management software application. It links Command and Control (C2), Intelligence, and Air operations information with execution systems using real time collaborative targeting managers, customized for each service or specific functional area.  JADOCS is used to significantly enhance the Joint Force and Component Command's capability to simultaneously develop, coordinate and execute dynamic and Time Sensitive Targets as well as planned targets and fire missions. JADOCS provides coordination and de-confliction of targeting information at all levels of command structure for the military as well as enabling common system information exchange to coordinate, collaborate, and de-conflict missions. The JADOCS' system–to–system interface enables automated communications with Joint and Coalition systems to minimize targeting process time and increase dynamic targeting accuracy. JADOCS coordination managers provide operators and commanders with a clear definition of the targeting cycle's workflow process steps, responsibilities and status. JADOCS is used by Air, Ground, Maritime, and Special Operations forces supporting time sensitive and dynamic targeting, battle space coordination, search and rescue, and disaster relief \/ recover operations worldwide. It provides horizontal (across Services) as well as vertical (within Services) coordination of missions to ensure a common picture of targeting operational status across the entire Joint force. Mission Summary windows display the coordination and targeting status of each mission using intuitive color coded indicators referred to as coordination status. As a software application, JADOCS can be configured and customized for each user and location. The client and server software can be installed on typical Windows OS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.507"
                },
                "CurrentYear": {
                    "val": "22.374"
                },
                "BudgetYearOne": {
                    "val": "41.034"
                },
                "BudgetYearOneBase": {
                    "val": "41.034"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.120"
                },
                "CurrentYear": {
                    "val": "1.273"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.387"
                },
                "CurrentYear": {
                    "val": "-21.101"
                },
                "BudgetYearOne": {
                    "val": "-41.034"
                },
                "BudgetYearOneBase": {
                    "val": "-41.034"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.169"
                                },
                                "CurrentYear": {
                                    "val": "-21.101"
                                },
                                "BudgetYearOne": {
                                    "val": "-41.034"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-41.034"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.218"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "322"
                    },
                    "ProjectTitle": {
                        "val": "Adv Field Artillery Tactical Data System(AFA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.778"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.778"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Effective for PB2015: funds ($5.425 million) were transferred to program element 0203728A project code EF8 from program element 0203726A project code 322 (PB2014 BLIN 161) due to Major Automated Information System (MAIS) transparency requirements; funds ($12.300 million) were transferred to program element 0203728A project code EF8 from program element 0203726A project code DU5 (PB2015 BLIN 163) due to Army requested transfer; funds ($8.800 million) were removed from program element 0203726A project code DU5 (PB2015 BLIN 163) due to program delays. \n\nThe Army Acquisition Executive (AAE) determined that AFATDS Increment 2 (program element 0203726A project code DU5) is a software modernization effort of the existing AFATDS program. Therefore, the Army moved funding for AFATDS Increment 2 from program element 0203726A project code DU5, to the current AFATDS funding (program element 0203728A project code EF8) as AFATDS version 7.0. Previous \"AFATDS Increment 1\" efforts are delineated as V6.x in program element 0203728A project code EF8."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Advanced Field Artillery Tactical Data System (AFATDS) provides the Army, Navy, and Marine Corps automated fire support command, control and communications. AFATDS is used to plan, execute, and deliver lethal and non-lethal effects. AFATDS provides Joint\/Coalition Situational Awareness for fires execution and mission management. The system interoperates and integrates with over 80 different battlefield systems, including Navy and Air Force command and control weapon systems; and the German, French, Turkish, and Italian fire support systems. AFATDS automates the planning, coordination, and control of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars).\n\nAFATDS provides eleven core services that manage user input and handle dissemination of complex fires processes. These core services are: Attack\/Engagement Analysis, Fire Support Planning, Mission Guidance, Target Definition, Mission Area Definition, Cross-System Graphics\/Mapping management, Unit Task Organization Data, Fires Conflict Detection, Mobile Air\/Ground Tracking, Mission Execution and Mission Trigger Events. These AFATDS services promote situational awareness of data, intelligence information and targeting data, in near real time, in order to effectively manage target selection and target engagement in accordance with the Maneuver Commanders guidance and priorities. \n\nNetwork Assisted GPS for Precision Fires (NA GPS) is a development effort to improve performance and mission reliability for GPS-guided munitions.  Regardless of terrain-constrained operational conditions and GPS degraded environments, NA GPS will permit Precision Fires Mission availability.  NA GPS is tailored to support standardized messaging with Joint Battle Command-Platform (JBC-P), AFATDS, M777A2 Towed Howitzer Digital Fire Control System and Mortar Fire Control System.\n\nFY15 funding for program element 0203726A project code 322 (PB2014 BLIN 161) was moved to program element 0203728A project code EF8."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Support Costs for AFATDS software development"
                                    },
                                    "Description": {
                                        "val": "Provide program support for AFATDS software development efforts for Versions 6.8.0.1 and  6.8.1."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.720"
                                            },
                                            "Text": {
                                                "val": "Program management functions include oversight, planning, engineering, funds execution, and contract management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AFATDS software development efforts"
                                    },
                                    "Description": {
                                        "val": "Development of AFATDS requirements - including Version 6.8.0.1 and 6.8.1"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.013"
                                            },
                                            "Text": {
                                                "val": "Initiated and completed release V6.8.0.1 to implement AN\/PRC-150 Long Range Communication capabilities.\n\nContinued the design and development of V6.8.1 to implement Common Operating Environment (COE) client authentication and Web Map Service, Munitions\/Platform integration and data updates, Link 16 protocol, Artillery System Cooperation Activities (ASCA) communications configurations, Digital Fires Support Training System (DFSTS) integration,  Targeting and Tracking enhancements, Enhanced Battlefield graphics and map display, Air tasking and visualization, Global Command and Control System Joint (GCCS-J) Interface, Graphical User Interface (GUI) convergence, Electronic Intelligence (ELINT) management and JADOCS-like functionality\/capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Assisted GPS for Precision Fires"
                                    },
                                    "Description": {
                                        "val": "Define system architecture and standardize tactical GPS Satellite data exchange solutions. Initiate WAN and LAN based system-of-systems Network Assisted GPS capability for PGMs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continued development and testing of individual SW products for JBCP, AFATDS, M777A2 Towed Howitzer Digital Fire Control System and Mortar Fire Control System.  Continued standard message exchanges between systems in a laboratory test environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational and Developmental Testing"
                                    },
                                    "Description": {
                                        "val": "Conduct and support test activities for AFATDS development of V6.8.1 requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.045"
                                            },
                                            "Text": {
                                                "val": "AFATDS V6.8.1:  Conduct Army Interoperability Certification (AIC), Government Confidence Demonstration (GCD), Network Integration Evaluation (NIE) and Air Force Operation Testing; Development Testing (DT): Independent Verification and Validation (IV&V), System-of-system (SoS) testing, and Air Force Developmental Testing"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B28620"
                                    },
                                    "Title": {
                                        "val": "MOD OF IN-SVC EQUIP, AFATDS  B28620"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.701"
                                        },
                                        "CurrentYear": {
                                            "val": "8.163"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.048"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.048"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.829"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.776"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.280"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "30.797"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AFATDS version 6.7 is the current fielded version of software.  Product Director, Fire Support Command and Control (PdD FSC2) fielded AFATDS version 6.8.0 to the International Security Assistance Force (ISAF) in June 2013.  PdD FSC2 fielded AFATDS version 6.8.0.1 in September 2014 to maintain compatibility with the fielded Joint Automated Deep Operations Coordination System (JADOCS) version 1.0.5.2.  AFATDS version 6.8.1.1 remains under development with a Full Materiel Release projected for 3QFY2016.  The PM projects that AFATDS version 6.8.1.1, the final software improvement under the superseded AFATDS Operational Requirements Document (ORD), will achieve Full Operational Capability (FOC) in 4QFQ2016.\n\nBased on the approved AFATDS Increment 2 Capability Development Document (CDD), the Army Acquisition Executive approved the development of AFATDS version 7.0.  This is a modernization of the existing software code to meet the approved key performance parameters as well as meet Army Common Operating Environment (COE) standards.  The PM will re-design AFATDS version 7.0 to provide the operator role\/duty-based interaction, a dynamic embedded training capability, and allowance for more efficient insertion of future capabilities.  The PM will competitively award this contract for this effort in 3QFY2016 with fielding projected for FY2019.\n\nDevelopment of future AFATDS capabilities will be considered based on requirements approved through the Fires Center of Excellence (FCoE) Tactical Software Requirements Governance Board."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management for AFATDS Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.728"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.560"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.288"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.838"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS 6.7 Requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "311.020"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "311.020"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 6.8"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "38.476"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "38.476"
                                                    },
                                                    "TargetValue": {
                                                        "val": "310.361"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 6.8.1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.171"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.254"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "35.425"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.188"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Network Assisted GPS for Precision Fires Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Combat Ammunition Systems (PM CAS), PM Mission Command, and various Army agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Information Assurance and Engineering Support  for AFATDS V6.8.x requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.090"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.245"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.405"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support for AFATDS V6.8.x requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Engility and various contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.105"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.525"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.630"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.030"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Confidence Demo for AFATDS V6.8.1 requirements"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command (ATEC)\/Fires Test Directorate (FTD)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.477"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.284"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.761"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.232"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76680-24.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Development and Testing V6.8.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development and Testing Nework Assisted GPS for Precision Fires."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DU5"
                    },
                    "ProjectTitle": {
                        "val": "AFATDS Increment II"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.273"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.273"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Effective for PB2015: funds ($5.425 million) were transferred to program element 0203728A project code EF8 from program element 0203726A project code 322 (PB2014 BLIN 161) due to Major Automated Information System (MAIS) transparency requirements; funds ($12.300 million) were transferred to program element 0203728A project code EF8 from program element 0203726A project code DU5 (PB2015 BLIN 163) due to Army requested transfer; funds ($8.800 million) were removed from program element 0203726A project code DU5 (PB2015 BLIN 163) due to program delays. \n\nThe Army Acquisition Executive (AAE) determined that AFATDS Increment 2 (program element 0203726A project code DU5) is a software modernization effort of the existing AFATDS program. Therefore, the Army moved funding for AFATDS Increment 2 from program element 0203726A project code DU5, to the current AFATDS funding (program element 0203728A project code EF8) as AFATDS version 7.0. Previous \"AFATDS Increment 1\" efforts are delineated as V6.x in program element 0203728A project code EF8."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Advanced Field Artillery Tactical Data System (AFATDS) provides the Army, Navy, and Marine Corps automated fire support command, control and communications. AFATDS is used to plan, execute, and deliver lethal and non-lethal effects. AFATDS provides Joint\/Coalition Situational Awareness for fires execution and mission management. The system interoperates and integrates with over 80 different battlefield systems, including Navy and Air Force command and control weapon systems; and the German, French, Turkish, and Italian fire support systems. AFATDS automates the planning, coordination, and control of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars).\n\nAFATDS provides eleven core services that manage user input and handle dissemination of complex fires processes. These core services are: Attack\/Engagement Analysis, Fire Support Planning, Mission Guidance, Target Definition, Mission Area Definition, Cross-System Graphics\/Mapping management, Unit Task Organization Data, Fires Conflict Detection, Mobile Air\/Ground Tracking, Mission Execution and Mission Trigger Events. These AFATDS services promote situational awareness of data, intelligence information and targeting data, in near real time, in order to effectively manage target selection and target engagement in accordance with the Maneuver Commanders guidance and priorities.  \n\nAFATDS FY15 funding in the amount $1.273 million will support efforts to finalize AFATDS V7.0 requirements through market studies and contracted research, and contracting efforts (Request For Information, Request For Proposal, Performance Work Statement, etc).\n\nFunding in FY16 through FY20 was moved from program element 0203726A project code DU5 (PB2015 BLIN 163), formerly known as AFATDS Increment 2. The Army Acquisition Executive (AAE) decided that AFATDS Increment 2 was a software modernization effort instead of a new acquisition program. The AAE determined that AFATDS Increment 2 reflected a modernization of the software code for the current AFATDS Project Manager (PM) Mission Command presented a Software Change Proposal for the current AFATDS as the appropriate approach to execute this effort. PM Mission Command will execute AFATDS software version 7.0 development effort as a follow on to the current AFATDS program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Support Costs for AFATDS software development"
                                    },
                                    "Description": {
                                        "val": "Provide program support for AFATDS software development efforts for Version 7.0"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.140"
                                            },
                                            "Text": {
                                                "val": "Provide program support for AFATDS software development efforts for Version 7.0.  Program managements functions include oversight, planning, engineering, business, funds execution and contract management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AFATDS V7.0 Acquisition and Contracting Efforts"
                                    },
                                    "Description": {
                                        "val": "Risk reduction analysis, solution refinement and initiate software development of version 7.0."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.133"
                                            },
                                            "Text": {
                                                "val": "Conduct Risk Reduction Analysis, Solution Refinement, Requirements Development, RFP Development for AFATDS V7.0."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B28620"
                                    },
                                    "Title": {
                                        "val": "MOD OF IN-SVC EQUIP, AFATDS  B28620"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.701"
                                        },
                                        "CurrentYear": {
                                            "val": "8.163"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.048"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.048"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.829"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.776"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.280"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "30.797"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AFATDS version 6.7 is the current fielded version of software.  AFATDS version 6.8.0 was fielded to the International Security Assistance Force (ISAF) in June 2013.  Product Director, Fire Support Command and Control (FSC2) fielded AFATDS version 6.8.0.1 in September 2014 to maintain compatibility with the fielded Joint Automated Deep Operations Coordination System (JADOCS) version 1.0.5.2.  AFATDS version 6.8.1 remains under development with a Full Materiel Release projected for 3QFY2016.  AFATDS version 6.8.1.1, the final software improvement under the superseded AFATDS Operational Requirements Document (ORD), is projected to achieve Full Operational Capability (FOC) in 4QFQ2016.\n\nBased on the approved AFATDS Increment 2 Capability Development Document (CDD) (CARDS # 04031), the Army Acquisition Executive approved the development of AFATDS version 7.0.  This is a modernization of the existing software code to meet the approved key performance parameters as well as meet Army Common Operating Environment (COE) standards.  AFATDS version 7.0 will be re-designed to provide the operator role\/duty-based interaction with a dynamic embedded training capability, as well as allow for more efficient insertion of future capabilities.  The contract for this effort will be competitively awarded with fielding projected for FY2019.\n\nDevelopment of future AFATDS capabilities will be considered based on requirements approved through the Fires Center of Excellence (FCoE) Tactical Software Requirements Governance Board."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management for AFATDS Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground (APG), MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.140"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.140"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Risk Reduction Analysis, Solution Refinement, Requirements Development, RFP Development, Contracting efforts (RFI, RFP)."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Definition Efforts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.133"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.133"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76680-25.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Infrastructure Initial Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F19"
                    },
                    "ProjectTitle": {
                        "val": "JADOCS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.342"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.342"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project code F19 funding for FY15 and beyond was transferred to program element 0203728A project code EF6 due to the Major Automated Information System (MAIS) transparency requirements."
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Automated Deep Operations Coordination System (JADOCS) software provides joint fire support management, and common operational picture (COP) capabilities.  JADOCS complements the Mission Command architecture with joint and collaborative capabilities that can be employed and tailored based on the unit mission and operational situation.  JADOCS software provides integration between multiple joint command and control (C2) systems of the uniformed services involved in the targeting process at US Army, US Air Force, US Navy, US Marine Corps, Combatant Commands, and Special Operations Command.\n\nProject F19 funds development of JADOCS Version(v) 2.0 software which is the final version of JADOCS to be developed with new functionality.  JADOCS v2.0 is required to incorporate critical Joint requirements into JADOCS.  These requirements include modification and updates for joint user interfaces, updates to targeting databases, and creation of non-kinetic targeting resources.  JADOCS v2.0 development is being completed by CECOM Life Cycle Management Command, Software Engineering Center (SEC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JADOCS Software Development Efforts costs."
                                    },
                                    "Description": {
                                        "val": "JADOCS Increment 1 (Version 2.0) software development effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.709"
                                            },
                                            "Text": {
                                                "val": "JADOCS V2.0 software development awarded to CECOM Life Cycle Management Command, Software Engineering Center (SEC). Conducted Software Development Process Activities (i.e requirement analysis) and began V2.0 development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support Costs for JADOCS Software Development Efforts"
                                    },
                                    "Description": {
                                        "val": "Program support for JADOCS software development efforts for JADOCS software version 2.0."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Continued the program support for JADOCS software version 2.0 software development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing"
                                    },
                                    "Description": {
                                        "val": "Conduct and Support Army and Joint Testing Activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Continued support of Army and Joint testing activities for JADOCS software. Including Army Interoperability Certification Testing and Air Force Air Operations Center interface testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Management Services and Support."
                                    },
                                    "Description": {
                                        "val": "Funds Systems Engineering and Technical Assistance support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.073"
                                            },
                                            "Text": {
                                                "val": "Continued program support for JADOCS training activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Project code F19 funding for FY15 and beyond was transferred to program element 0203728A project code EF6 due to Major Automated Information System (MAIS) transparency requirements."
                        },
                        "AcquisitionStrategy": {
                            "val": "JADOCS is a software only development effort that will produce JADOCS Version(v) 2.0 software, which includes software updates that will address Joint Users technical requirements that were generated by the Joint Services that align with the CPD. JADOCS v2.0 will be the last major version of JADOCS software and will be the follow-on version to the development and fielding of the JADOCS 1.0.5.2 software versions. JADOCS v2.0 will be interoperable with AFATDS.\n\nProgram Executive Officer, Command, Control, Communications -Tactical (PEO C3T) signed the JADOCS Milestone C Acquisition Decision Memorandum (ADM) on 2 December 2013. The ADM approved MS C and authorized entrance into the Production and Deployment phase. The ADM also approved the acquisition strategy, APB and established the MS C exit criteria.  JADOCS v2.0 reflects continued software enhancements to meet joint requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Business\/Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Chenega Federal Systems & Other"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.254"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.073"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.327"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development & Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oberon Associates INC."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Manassas, Virginia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.897"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.897"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development & Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM LCMC SEC C2SD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.709"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.709"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.055"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.260"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.315"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Army and Joint Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Joint Service Testing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.897"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.197"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76680-26.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Software Capability Testing - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Final Integration Test - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Interoperability Certification 11.9 - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award - Support Agreement (DD1144) - V2.0 SW Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development and Testing - V2.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}