{
    "id": "6300336504d639912f53f8a03c93eb879aa21ec8",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604854A"
        },
        "ProgramElementTitle": {
            "val": "Artillery Systems - EMD"
        },
        "R1LineNumber": {
            "val": "109"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "117.241"
            },
            "CurrentYear": {
                "val": "1.911"
            },
            "BudgetYearOne": {
                "val": "1.953"
            },
            "BudgetYearOneBase": {
                "val": "1.953"
            },
            "BudgetYearTwo": {
                "val": "1.973"
            },
            "BudgetYearThree": {
                "val": "1.991"
            },
            "BudgetYearFour": {
                "val": "10.639"
            },
            "BudgetYearFive": {
                "val": "20.896"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning FY15, 0604854A, project 516 has been moved to new APE 0210609A, project ED8."
        },
        "ProgramElementMissionDescription": {
            "val": "Paladin Integrated Management (PIM) is an ACAT 1D Acquisition Program. The program will replace the current fleet of M109 Family of Vehicles (FoV) consisting of the M109A6 Paladin Self Propelled Howitzer and M992A2 Field Artillery Ammunition Supply Vehicle (FAASV). PIM is an Army Modernization Program that addresses a critical capability gap created by the Non-Line of Sight Cannon termination in June of 2009 as well as obsolescence and Space, Weight,\nand Power (SWAP) issues in the M109 FoV current fleet. The PIM system integrates current Bradley Fighting Vehicle suspension and drive train items, Future Combat Systems (FCS) developed Electric Gun Drive systems and current fleet (M109A6) fire control systems into a new chassis providing better force protection, survivability and increases electrical power over the current fleet. PIM is a two vehicle system:  Self Propelled Howitzer (SPH) and Carrier Ammunition Tracked (CAT).  The SPH has all characteristics listed above.  The CAT utilizes all these same components and traits less those that relate directly to the cannon system. The PIM system replaces the current M109 FoV on a one for one basis, in the cannon fires battalions in the Armored Brigade Combat Team Formations and the Echelons above Brigade (EAB). The overall intent is to increase Soldier force protection, vehicle survivability, provide an appropriate amount of SWAP capacity to add future capabilities, increase vehicle reliability, reduce life cycle costs and extend the life of the M109 FoV through FY 2050.\n\nThe Lightweight 155mm Howitzer (LW155), also known as the M777A2, provides direct, reinforcing, general support fires to maneuver forces and direct support artillery. It replaces all howitzers in all missions in the USMC and replaces the M198 howitzer as the general support artillery for light forces in the Army. The LW155 fires unassisted projectiles to a range of 15 miles and assisted projectiles to 19 miles. The addition of the digital fire control system enables the weapon to program and fire the improved Excalibur precision-guided munitions to ranges in excess of 25 miles with better than 10-meter Circular Error Probable (CEP) accuracy. The LW155 is the first ground combat system whose major structures are made of high strength titanium alloy and the system makes extensive use of hydraulics to operate the breech, load tray, recoil and wheel arms. The combination of titanium structures and the use of hydraulic systems resulted in a significant weight savings of 7000 lbs over the M198 system. Compared to the M198, the LW155 emplaces three-times faster and displaces four-times faster. It traverses 32 percent more terrain worldwide and is 70 percent more survivable than the M198. It is a successful joint service program between the Marine Corps and Army working together to develop, produce, field, and sustain the howitzer. The LW155 was first introduced into the Marine Corps in April 2005 and the Marines have now fielded the howitzer to all active units. The Army has fielded the howitzer to its Stryker Brigade Combat teams (SBCT), Fires Brigades and National Guard. Fielding of the Infantry Brigade Combat Teams (IBCT) commenced in FY14 and will continue through 2018. The LW155 saw extensive action in Afghanistan, receiving high marks for its performance. Having now been in the field for almost 10 years, the howitzer will be going through obsolescent replacement of electronic components in its digital fire control system.  \n\nFunding supports engineering studies for capabilities identified in the Joint U.S. Army, U.S. Marine Corps Operational Requirements Document (JORD) for the Advanced Towed Cannon System but deferred during Engineering Manufacturing and Development due to technology maturity, cost and schedule as well as government sustainment activities requiring RDTE. This includes a digital direct fire sight for the Digital Fire Control System; low temperature, high density power solutions; and electric elevation drives and auto loader to achieve full operational requirements. Efforts in FY2015-FY2018 will be centered on researching technical solutions while efforts in FY2019-FY2020 will involve developing technology demonstrator prototypes."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "121.270"
                },
                "CurrentYear": {
                    "val": "1.912"
                },
                "BudgetYearOne": {
                    "val": "1.938"
                },
                "BudgetYearOneBase": {
                    "val": "1.938"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "117.241"
                },
                "CurrentYear": {
                    "val": "1.911"
                },
                "BudgetYearOne": {
                    "val": "1.953"
                },
                "BudgetYearOneBase": {
                    "val": "1.953"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.029"
                },
                "CurrentYear": {
                    "val": "-0.001"
                },
                "BudgetYearOne": {
                    "val": "0.015"
                },
                "BudgetYearOneBase": {
                    "val": "0.015"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-0.001"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.029"
                                },
                                "BudgetYearOne": {
                                    "val": "0.015"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.015"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "509"
                    },
                    "ProjectTitle": {
                        "val": "LIGHTWEIGHT 155M HOWITZER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.911"
                        },
                        "BudgetYearOne": {
                            "val": "1.953"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.953"
                        },
                        "BudgetYearTwo": {
                            "val": "1.973"
                        },
                        "BudgetYearThree": {
                            "val": "1.991"
                        },
                        "BudgetYearFour": {
                            "val": "10.639"
                        },
                        "BudgetYearFive": {
                            "val": "20.896"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Lightweight 155mm (LW155) Towed Howitzer is a jointly managed program with the Marine Corps."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Lightweight 155mm Howitzer (LW155), also known as the M777A2, provides direct, reinforcing, general support fires to maneuver forces and direct support artillery. It replaces all howitzers in all missions in the USMC and replaces the M198 howitzer as the general support artillery for light forces in the Army. The LW155 fires unassisted projectiles to a range of 15 miles and assisted projectiles to 19 miles. The addition of the digital fire control system enables the weapon to program and fire the improved Excalibur precision-guided munitions to ranges in excess of 25 miles with better than 10-meter Circular Error Probable (CEP) accuracy. The LW155 is the first ground combat system whose major structures are made of high strength titanium alloy and the system makes extensive use of hydraulics to operate the breech, load tray, recoil and wheel arms. The combination of titanium structures and the use of hydraulic systems resulted in a significant weight savings of 7000 lbs over the M198 system. Compared to the M198, the LW155 emplaces three-times faster and displaces four-times faster. It traverses 32 percent more terrain worldwide and is 70 percent more survivable than the M198. It is a successful joint service program between the Marine Corps and Army working together to develop, produce, field, and sustain the howitzer. The LW155 was first introduced into the Marine Corps in April 2005 and the Marines have now fielded the howitzer to all active units. The Army has fielded the howitzer to its Stryker Brigade Combat teams (SBCT), Fires Brigades and National Guard. Fielding of the Infantry Brigade Combat Teams (IBCT) commenced in FY14 and will continue through 2018. The LW155 has seen extensive action in Afghanistan, receiving high marks for its performance. Having now been in the field for almost 10 years, the howitzer will be going through obsolescent replacement of electronic components in its digital fire control system. \n\nFunding supports engineering studies for capabilities identified in the Joint U.S. Army, U.S. Marine Corps Operational Requirements Document (JORD) for the Advanced Towed Cannon System but deferred during Engineering Manufacturing and Development due to technology maturity, cost and schedule as well as government sustainment activities requiring RDTE. This includes a digital direct fire sight for the Digital Fire Control System; low temperature, high density power solutions; and electric elevation drives and auto loader to achieve full operational requirements. Efforts in FY2015-FY2018 will be centered on researching technical solutions while efforts in FY2019-FY2020 will involve developing technology demonstrator prototypes."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Funding supports management services within the Program Management Office, Towed Artillery Systems"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.194"
                                            },
                                            "Text": {
                                                "val": "Funding supports management and coordination with the Armaments Research Development and Engineering Center to conduct trade studies to determine the best material solution for the digital direct fire sight and low temperature, high density power solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.197"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.197"
                                            },
                                            "Text": {
                                                "val": "Funding supports management and coordination with the Armaments Research Development and Engineering Center to conduct modeling, simulation, analysis and trade studies to characterize the M777A2 for performance improvements. The data generated from these efforts will be used to establish a database to support government sustainment activities as well as future technology demonstrations focused on achieving current JORD objective capabilities as well as Force 2025 and Beyond Initiatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Funds engineering support from the Armaments Research Development and Engineering Center"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.717"
                                            },
                                            "Text": {
                                                "val": "Funding supports conducting trade studies to determine the best material solution for digital direct fire sight for the Digital Fire Control System and low temperature, high density power solutions to achieve full operational requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.756"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.756"
                                            },
                                            "Text": {
                                                "val": "Funding will support modeling, simulation, analysis and trade studies to characterize the M777A2 for performance improvements. ARDEC will establish a technical database that will support PM initiated sustainment activities and future technology demonstrations.  Begins preliminary designs efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "M777 Mods"
                                    },
                                    "Title": {
                                        "val": "M777 Mods - Modification of Weapons and Other Combat Vehicles SSN GZ1700"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.800"
                                        },
                                        "CurrentYear": {
                                            "val": "18.166"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.070"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.070"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.009"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.581"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "76.626"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Procurement Funding supports active retrofits for previously contracted Digital Fire Control System components, addressing obsolescence."
                        },
                        "AcquisitionStrategy": {
                            "val": "This will be a collaborative effort between the Program Management Office, Towed Artillery Systems, and the Armaments Research Development and Engineering Center at Picatinny Arsenal."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program Management Towed Artillery Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.197"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.197"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Armaments Research & Developmet Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.717"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.756"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.756"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-159.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Feasibility and Concept Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Preliminary Designs"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fabrication Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Technology Demonstrator"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "516"
                    },
                    "ProjectTitle": {
                        "val": "Paladin\/FAASV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "117.241"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "117.241"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting FY15, 0604854A, project 516 has been moved to new APE 0600609A, project ED8."
                        },
                        "ProjectMissionDescription": {
                            "val": "Paladin Integrated Management (PIM) is an ACAT 1D Acquisition Program. The program will replace the current fleet of M109 Family of Vehicles (FoV) consisting of the M109A6 Paladin Self Propelled Howitzer and M992A2 Field Artillery Ammunition Supply Vehicle (FAASV). PIM is an Army Modernization Program that addresses a critical capability gap created by the Non-Line of Sight Cannon termination in June of 2009 as well as obsolescence and Space, Weight, and Power (SWAP) issues in the M109 FoV current fleet. The PIM system integrates current Bradley Fighting Vehicle suspension and drive train items, Future Combat Systems (FCS) developed Electric Gun Drive systems and current fleet (M109A6) fire control systems into a new chassis providing better force protection, survivability and increases electrical power over the current fleet. PIM is a two vehicle system:  Self Propelled Howitzer (SPH) and Carrier Ammunition Tracked (CAT).  The SPH has all characteristics listed above.  The CAT utilizes all these same components and traits less those that relate directly to the cannon system. The PIM system replaces the current M109 FoV on a one for one basis, in the cannon fires battalions in the Armored Brigade Combat Team Formations and the Echelons above Brigade (EAB). The overall intent is to increase Soldier force protection, vehicle survivability, provide an appropriate amount of SWAP capacity to add future capabilities, increase vehicle reliability, reduce life cycle costs and extend the life of the M109 FoV through FY 2050."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Paladin\/FAASV Integrated Management (PIM) Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following developmental efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "84.969"
                                            },
                                            "Text": {
                                                "val": "Continued developmental fixes, sub-system qualification, and testing for production.  Continued engineering development for Corrective Actions, Producibility, and Obsolescence (CPOs) and Software Phase III efforts required for LRIP production-continue Software Phase II maintenance efforts for CPO functionality.  Executed Software Developmental Qualification Testing (DQT) for Software Phase III.  Developed of an Objective Underbelly Kit per guidance of the Defense Acquisition Executive (DAE.)   Continued development of logistical support products (manuals and training) required for fielding.  Execution of First Article Testing (FAT) of production vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following government test efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.900"
                                            },
                                            "Text": {
                                                "val": "Planned and executed continued DT including qualification of subsystems, system safety, performance testing, live fire exploitation testing, and logistics demonstration.  Key developmental tests events included verification of CPO changes to validate the LRIP production configuration.  This testing consisted of full load cooling test, software DQT, and automotive and firing performance testing on a production representative vehicle.  Key live fire test events included final exploitation testing on a BH&T and production representative vehicle, component ballistic testing, and testing of the Automatic Fire Extinguisher System (AFES).  Logistics demonstration is integrated with the test plan as CPO changes are verified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following program management support:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.455"
                                            },
                                            "Text": {
                                                "val": "Government System Engineering and Program Management for the total program including: OEM management consisting of weekly, monthly, and quarterly program management reviews; continued contract execution management for the EMD phase contract until completion of all efforts in FY 16.  Managed Government Developmental Test and Evaluation program.  Management of the program cost, schedule, and performance metrics including making programmatic trade-off decisions.  Management of Other Governmental Agencies (OGAs) that supported the PIM program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following training government and contractor efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.864"
                                            },
                                            "Text": {
                                                "val": "Continue PIM training developmental efforts that support TADSS for crew and maintainers, NET, and fielding plans."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following data contractor efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.053"
                                            },
                                            "Text": {
                                                "val": "Contractor Technical Data Package Updates and Technical Publications"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Paladin\/FAASV"
                                    },
                                    "Title": {
                                        "val": "Paladin\/FAASV Mod"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.769"
                                        },
                                        "CurrentYear": {
                                            "val": "45.411"
                                        },
                                        "BudgetYearOne": {
                                            "val": "60.079"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "60.079"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "67.428"
                                        },
                                        "BudgetYearThree": {
                                            "val": "66.925"
                                        },
                                        "BudgetYearFour": {
                                            "val": "56.415"
                                        },
                                        "CostToComplete": {
                                            "val": "109.000"
                                        },
                                        "TotalCost": {
                                            "val": "410.027"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Paladin Integrated Management (PIM)"
                                    },
                                    "Title": {
                                        "val": "PIM Mod In Service"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "199.477"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "199.477"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Starting FY15, 0604854A, project 516 has been moved to new APE 0600609A, project ED8."
                        },
                        "AcquisitionStrategy": {
                            "val": "The PIM Program was initiated on 16 August 07 under the BAE Systems, Inc., System Technical Support (STS) Contract W56HZV-07-C-0096.  Subsequent work directives were awarded under BAE STS contract W56HZV-07-C-0256 to further define the configuration of the PIM vehicles.  On 14 August 2009, a Research, Development, Test and Evaluation (RDT&E) Contract W56HZV-09-C-0550 was awarded to BAE Systems Inc. for the Prototype Development and Fabrication of 7 prototype vehicles (5 PIM Self Propelled Howitzer (SPH) Systems and 2 PIM Carrier Ammunition Tracked (CAT) vehicles).  A Comprehensive Contract Modification (CCM) award to the RDT&E contract was accomplished on 6 Jan 2012.  This modification allows for the completion of the design engineering and initial developmental test portion of the Engineering and Manufacturing Development (EMD) Phase and transfers the system responsibility for the program from the Government to BAE Systems Inc.   An additional modification to the EMD contract was awarded on 18 Jul 2014 to extend the contract until 31 Mar 2017 to cover contractor support to Production Qualification Testing (PQT), the Logistics Demonstration, and Initial Operational Test & Evaluation (IOT&E).  The awarded Low-Rate Initial Production (LRIP) contract is of a Fixed Price Incentive Firm Target (FPIF) contract type for procurement of vehicles with a period of performance running from Nov 2013 through approximately Jun 2019.  The LRIP contract will provide for three LRIP years with the initial base year including 19 SPHs and 18 CATs and the remaining two option years with 18 sets and 30 sets, respectively (each set consisting of one each SPH and CAT) of PIM vehicles.  The Full Rate Production (FRP) contract is planned as a FPIF contract that converts to a Firm Fixed Price (FFP) contract after the second year of FRP.  The FRP contract provides for the remaining PIM vehicles to fulfill the requirement up to the Army Acquisition Objective of 580 sets."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMO Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Paladin\/FAASV"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny, NJ\/TACOM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "106.191"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "18.455"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Funding has been moved to new PE 650609 and PROJECT ED8."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "York, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.428"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.864"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "York, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.788"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.053"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small Business Innovative Research\/Small Business Technology Transfer Program"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.668"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PIM Development - Contractor"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE, Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "York, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "487.871"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "84.969"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PIM Development - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various OGAs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Level Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various OGAs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "45.991"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-160.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Contractor Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Government Development Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Low Rate Initial Production Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Low Rate Initial Production Deliveries"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Up System Live Fire Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOTE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}