{
    "id": "664cb718d441dc06e24eb93863df8c306c9eda9d",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602308A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Simulation"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.364"
            },
            "CurrentYear": {
                "val": "27.423"
            },
            "BudgetYearOne": {
                "val": "27.862"
            },
            "BudgetYearOneBase": {
                "val": "27.862"
            },
            "BudgetYearTwo": {
                "val": "28.288"
            },
            "BudgetYearThree": {
                "val": "29.931"
            },
            "BudgetYearFour": {
                "val": "31.345"
            },
            "BudgetYearFive": {
                "val": "31.970"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and designs enabling technologies to create effective training capabilities for the Warfighter and  supports the underpinning technologies and understanding to establish architecture standards and interfaces necessary for realizing the Army vision of creating a realistic synthetic \"electronic battlefield\" environment for use across the spectrum of doctrine, organization, training, leader development, materiel, personnel, and facilities (DOTLM-PF).  Project C90 focuses on advancing component technologies required for real time interactive linking within and among constructive, virtual, and live simulation and training by refining technologies for advanced distributed interactive simulation.  Project D02  further develops concepts for immersive training and learning environments with the Institute for Creative Technologies (ICT) at the University of Southern California, Los Angeles, California. \n\nWork in this PE complements and is fully coordinated with PE 0601104A (University and Industry Research Centers), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602786A (Clothing & Equipment Technology), PE 0602787A (Medical Technology), PE 0603001A (Future Warrior Technology Integration), PE 0603007A (Manpower, Personnel and Training Advance Technology), PE 0603015A (Next Generation Training & Simulation Systems) and PE 0603710A (Night Vision Advanced Technology).   \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n \nWork in this PE is performed by the U.S. Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.051"
                },
                "CurrentYear": {
                    "val": "27.435"
                },
                "BudgetYearOne": {
                    "val": "28.059"
                },
                "BudgetYearOneBase": {
                    "val": "28.059"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.364"
                },
                "CurrentYear": {
                    "val": "27.423"
                },
                "BudgetYearOne": {
                    "val": "27.862"
                },
                "BudgetYearOneBase": {
                    "val": "27.862"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.687"
                },
                "CurrentYear": {
                    "val": "-0.012"
                },
                "BudgetYearOne": {
                    "val": "-0.197"
                },
                "BudgetYearOneBase": {
                    "val": "-0.197"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.012"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.687"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.197"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.197"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C90"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.086"
                        },
                        "CurrentYear": {
                            "val": "20.933"
                        },
                        "BudgetYearOne": {
                            "val": "21.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.041"
                        },
                        "BudgetYearTwo": {
                            "val": "21.189"
                        },
                        "BudgetYearThree": {
                            "val": "24.503"
                        },
                        "BudgetYearFour": {
                            "val": "24.820"
                        },
                        "BudgetYearFive": {
                            "val": "25.315"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and designs enabling technologies for advancing distributed simulation and training (live, virtual and constructive) environments. This includes networking of models representing complex human behavior, complex data interchange between simulations, synthetic natural environments, medical training simulations, ground platform training, adaptive tutoring for individuals and teams, and collaborative training.  The project researches the ability to create a virtual representation of combined arms environments, with the Warfighter-in-the-loop that constructive (event driven) simulations cannot simulate.  \n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n    \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Live, Virtual, Constructive (LVC) Simulations"
                                    },
                                    "Description": {
                                        "val": "This effort develops and investigates Live, Virtual and Constructive (LVC) training technologies (tools and methods) to inform an interactive, seamless training environment.  Live training refers to personnel and systems performing an exercise mission on real terrain; virtual training refers to personnel using simulators; and constructive training refers to computer based models representing real world behaviors that introduce a wider control of virtual forces.  Developed methods and technologies are transitioned to PE 0603015A\/Project S29."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.524"
                                            },
                                            "Text": {
                                                "val": "Explored technologies and methods to provide Soldiers with an adaptive learning environment, tailored to the individual Soldier; conducted assessments of a prototype training development environment that delivered training content to various software environments on different hardware platforms, including mobile devices;  conducted assessments on common processes and technologies for LVC to ease the difficulty and expense of using LVC distributed simulation for Joint and Coalition Warfare training; and designed components in laboratory for real-time, physics-based terrain that replicated the operational environment and was distributed to support collective training for use in mobile devices and embedded systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.201"
                                            },
                                            "Text": {
                                                "val": "Develop the architecture for the Soldier-Centered Army Learning Environment (SCALE); investigate the next generation simulation architectures and environments for the integration and execution of LVC simulations to be employed by joint and coalition warfare forces during collective training and mission rehearsal exercises; complete and implement component designs of natural and man-made synthetic terrain effects such as  craters, building rubble, etc.; and assess the training effectiveness of the attained levels of realism and immersion.  The SCALE architecture will integrate mobile and social media technologies to enhance the training effectiveness of individual Soldiers.  The architecture development will be consistent with the Army Learning Model (ALM)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.124"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.124"
                                            },
                                            "Text": {
                                                "val": "Will investigate various component designs and developmental concepts of real world (physics-based) dynamic effects in terrain representation for use in the Army's One World Environment; research, develop and assess the use of the SCALE architecture in relevant use cases supporting the ALM; develop next generation simulation architectures and environments for the integration and execution of LVC simulations to be employed by joint and coalition warfare forces during collective training and mission rehearsal exercises; validate the effectiveness of select experimental tools and virtual environments on Soldier learning during joint and coalition training and mission rehearsal exercises; research the effect of technologies such as interoperable performance assessment, mobile application use, data analytics, and social media on the capability to conduct training and education on operational systems in support of TRADOC Army Learning Concept 2020-2040 goals; and develop a technique to measure, track, and manage general learning outcomes that will feed a continuous adaptive learning model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Training Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates future simulation and training technologies across a variety of domains, requirements, and applications.  It will include new technologies that can be applied to military domains such as live and medical training.  Included in this effort will be the development of new medical training simulations to train medical personnel across all levels of care and the development of live training technology that can be applied across all military levels and training environments.  The effort will address the training effectiveness of the simulation and training technologies being researched and how they will contribute to the overall effectiveness of new training capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.389"
                                            },
                                            "Text": {
                                                "val": "Researched enabling technologies for medical training combining appropriate fidelity, physiology, movement, and tissue (silicon vs. simulated biological structures), integrated and dissipated smells, sensors, varying pathologies, and fluids using an open source, platform agnostic methodology; and designed hybrid position-navigation sensor to simulate electronic bullet to replace laser based system for live fire training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.530"
                                            },
                                            "Text": {
                                                "val": "Continue next generation Multiple Integrated Laser Engagement System (MILES) research in support of a live training program of record for home station and combat training center supporting Force-on-Force (FOF) training for Brigade Combat Teams (BCTs), battalions, companies, platoons, squads, crews and individuals; research, measure, and characterize real human and simulated human tissue to derive performance requirements for future simulated tissue; research embedded and external sensors to autonomously measure student performance inside and outside of the body; and investigate advanced 3-D visualization technologies and measure the impact on anatomical cognition for medical training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.528"
                                            },
                                            "Text": {
                                                "val": "Will design the laser component of the next generation MILES for a live training program of record at home stations and combat training centers supporting Force-on-Force training for BCTs; apply measured tissue properties to experimental simulations and validate its performance; apply sensors to simulated tissue to objectively measure human performance and validate tissue performance;  research and develop immersive technologies to engage learners in game-based medical training."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative and Immersive Environment Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates adaptive tutoring and immersive learning environments with social simulations to conduct kinetic and non-kinetic training for individuals and teams."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.173"
                                            },
                                            "Text": {
                                                "val": "Conducted research to develop best practices for authoring computer-based tutoring systems (CBTS), managed instruction provided by CBTS, and assessed learning gains (e.g., knowledge and skill acquisition, retention and accelerated learning); researched learner modeling and instructional strategy\/tactics selection by autonomous CBTS to reduce the cost to develop, deliver, and assess self-regulated training\/tutoring for individuals and teams required under the Army Learning Model (ALM) for 2015;  captured research results in the Generalized Intelligent Framework for Tutoring (GIFT) to promote standards and reuse; and conducted efficacy studies on virtual world and game based learning techniques for a blended learning approach to kinetic and non-kinetic training as well as human-unmanned systems teaming."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.202"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop best practices for automatically authoring, assessing, managing instruction, and deploying CBTS; design and develop domain models (e.g., content, human interaction, and assessment standards); determine effectiveness for CBTS technologies; develop techniques and identify technologies that will lower the skills required to author CBTS (per ALM); continue to incorporate research results in GIFT tutoring framework to enhance overall training effectiveness; conduct follow-on efficacy studies on virtual world and game-based learning techniques for a blended learning approach to conduct kinetic and non-kinetic training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.189"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.189"
                                            },
                                            "Text": {
                                                "val": "Will conduct initial user validation studies of usage of CBTS authoring tools to supplement traditional classroom training with computer-guided tutoring per ALM; conduct research to expand intelligent tutoring system domain models to represent Army training domains; research, develop, and evaluate instructional models for unit-level team tutoring."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "Research and develop simulation architecture to represent the Soldier as a System considering physiological effects, cognitive load, and Soldier culture in the context of Soldier-materiel interactions supporting training effectiveness, experimentation, and materiel development.  The architecture will advance computational strategies to enable the integration and interaction of new and existing Soldier models into a seamless Soldier as a System simulation. This effort is coordinated with and complements PE 0602785\/project 790, PE 0602786\/project H98, PE 0602787\/project 869, PE 0603001\/J50, and PE 0603710\/project K70."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Research and design a simulation architecture that supports the development of a Soldier as a System simulation; develop novel simulation solutions to link and synchronize models of human and system components; and establish groundwork for implementing echelons of metrics to create trade space data for analyzing factors to include Soldier individual and team performance, system effectiveness, training requirements, and cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Will investigate the design of a simulation architecture that supports the development of a Soldier as a System simulation; investigate novel simulation solutions developed to link and synchronize models of human and system\/equipment components;  develop metrics to analyze design tradeoffs between factors such as individual and team performance, system effectiveness, training requirements and cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Autonomy – Optimizing Training Strategies"
                                    },
                                    "Description": {
                                        "val": "This effort will research and develop simulation architectures, tools, and models that can represent current and future semi and fully autonomous systems.  The architecture, tools and models will enable the evaluation of the training impacts (i.e., cognitive, physiological, and team coordination) of future autonomous systems and technologies on individual, crew, and unit tasks.  The training demands of systems that are increasingly complex, intelligent, and self-adaptive far exceed those of legacy systems that require training of primarily procedural tasks.  This is compounded by parallel increases in autonomy and responsibility at lower echelons."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Research and develop simulation architectures that can represent current and future autonomous systems.  The architectures will incorporate current autonomous system attributes that will enable the evaluation of their effects on individual and unit training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Will research, develop and evaluate models, methods and tools to identify best practices for training with autonomous systems\/technology to assess the effectiveness of various training strategies consistent with Army doctrine."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D02"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation For Training And Design"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.278"
                        },
                        "CurrentYear": {
                            "val": "6.490"
                        },
                        "BudgetYearOne": {
                            "val": "6.821"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.821"
                        },
                        "BudgetYearTwo": {
                            "val": "7.099"
                        },
                        "BudgetYearThree": {
                            "val": "5.428"
                        },
                        "BudgetYearFour": {
                            "val": "6.525"
                        },
                        "BudgetYearFive": {
                            "val": "6.655"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort transitions basic research into applied research.  This project investigates and designs training applications to enable the Army to train any time and any place.  Efforts include designing virtual humans that embody natural language, speech recognition in noisy environments, gesture, gaze, and conversational speech.  Techniques and methods are assessed for integrating different sensory cues into virtual environments that result in enhanced training and leader development. The project leverages the capabilities of industry and the research and development community through the synthesis of creativity and technology, including work at the Army Research Institute and the Army Research Laboratory. \n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nDeveloped technologies and techniques are transitioned for maturation and demonstration to PE 0603015A\/project S28  (Immersive Learning Environments).     \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n \nWork in this project is performed by the U.S. Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Technology Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that enables responsive and reconfigurable environments that immerse human senses such as sight, sound, and touch in mixed reality environments to include physical elements providing touch and feel to simulate objects such as obstacles and walls."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.139"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to better understand how humans both perceive and interact with virtual environments; developed technologies for improved, low-cost immersive displays to reduce cost of training equipment and reduce the physical footprint needed for training facilities; enhanced small team training; and provided improved small unit leadership and capabilities using virtual environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.244"
                                            },
                                            "Text": {
                                                "val": "Research techniques for human spatial perception within virtual environment; investigate the effect of display configurations on social responses to virtual humans to increase immersive effects; and investigate outfitting displays with audio transducers and using psycho-acoustical effects methodologies to increase immersion and effectiveness during interactions with virtual humans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.411"
                                            },
                                            "Text": {
                                                "val": "Will investigate the effect on trainee learning and emersion experience within a virtual environment when low-cost scanning sensors and data capture techniques are used to rapidly capture and insert avatars representing the appearance and behaviors of actual trainees; experiment with adding mobile communication devices to the virtual human architecture to examine long-term interactions with virtual coaches and mentors; and determine the effectiveness of using virtual humans for interviewing patients in support of assessing Post Traumatic Stress Disorder (PTSD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Immersive Technology Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, techniques and technologies for improving the immersion of human senses within simulation environments and therefore creating enhanced realism."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.139"
                                            },
                                            "Text": {
                                                "val": "Determined how computer agents may be used to track a Soldier's career learning experiences and be used to provide training feedback and career guidance; finalized the development of a tool that automatically detects poorly synthesized segments of speech for the purpose of improving synthesized speech and dialogue for virtual humans; and finalized and implemented model that automatically adapts the dialogue intent recognition to each user."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.246"
                                            },
                                            "Text": {
                                                "val": "Research and evaluate situational authoring tools designed to enable non-technical users to create content for inclusion into intelligent tutoring systems; investigate new animation and natural language techniques for the development of web-based virtual humans to support on-line immersive learning environments; and explore techniques to rapidly recreate training scenario content."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.410"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop learner models for adaptive training environments focusing on strategies to increase learner attention and engagement; and investigate natural language computer processing techniques to translate real-world narratives into authorable interactive narratives for immersive environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}