{
    "id": "679fab51e28514de7f9caa7cc2b186251dfd981e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2016.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0607828J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integration & Interoperability"
        },
        "R1LineNumber": {
            "val": "185"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "4.200"
            },
            "PriorYear": {
                "val": "11.847"
            },
            "CurrentYear": {
                "val": "11.968"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "28.015"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.652"
                },
                "CurrentYear": {
                    "val": "11.968"
                },
                "BudgetYearOne": {
                    "val": "11.594"
                },
                "BudgetYearOneBase": {
                    "val": "11.594"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.847"
                },
                "CurrentYear": {
                    "val": "11.968"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.805"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-11.594"
                },
                "BudgetYearOneBase": {
                    "val": "-11.594"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Carry-over from FY2014"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.805"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "PE Consolidation"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.594"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.594"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY2016, PE 0607828J - Joint Integration and Interoperability is realigned to PE 0604826J."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P818"
                    },
                    "ProjectTitle": {
                        "val": "Joint Integration & Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.200"
                        },
                        "PriorYear": {
                            "val": "11.847"
                        },
                        "CurrentYear": {
                            "val": "11.968"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.015"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY2016 this PE will be realigned to PE 0604826J - Joint C5 Capability Development, Integration and Interoperability Assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Integration & Interoperability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.847"
                                            },
                                            "Text": {
                                                "val": "(1) Completed 343 Joint Capabilities Integration and Development System (JCIDS)\/ Information Support Plan reviews.\n\n(2) Provided C4\/Cyber Functional Capabilities Board Action Officer support for 13 programs.\n\n(3) Completed Mission Partner Environment (MPE) implementation milestones on schedule:\n      - Coordinated MPE governance and management forums as required, to include annual Executive Steering Committee (ESC) sessions\n      - Maintained and evolved the U.S. Joining Membership and Exiting Instructions (JMEI) as required\n      - Ensured continued MPE implementation by conducting bi-weekly Coordination Meetings\n\n(4) Participated in multinational engagement forums as required to support the DD C5I mission:\n      - Supported NATO Federated Mission Networking (FMN) governance, management and implementation events as scheduled to ensure continued alignment with MPE\n      - Supported semi-annual NATO C3 Board meetings, helping to evolve alliance C2 strategies\n      - Sponsored capability development events such as the semi-annual TIDE Sprint and the NATO Computer Assisted Exercise (CAX) Forum\n      - Coordinate with the NATO C2 and Modeling and Simulation (M&S) Centres of Excellence (COEs) to ensure their respective Programs of Work (POWs) align with DD C5I priorities, including participating in their annual Steering Board\/Steering Committee meetings which approve the POWs.\n\n(5) Developed a Department-wide integrated cyber range capability involving multiple mission partners and capabilities to address cyber vulnerabilities and risks:\n      - Developed representations of Combatant Command (CCMD) and Joint Functional Component Commands' C2 architectures to foster cyber capability development and training.\n      - Developed an operational relevant environment for Combatant Commanders and decision-makers to address the cyber threat with minimum impact on operations.\n      - Developed a distributed and realistic collective training environment for TTP development and pre-deployment team training for National Mission Force CPTs.\n      - Conducted planning and execution of three C4 Cyber Assessment events consisting of nine phases between March 2013 and July 2014 enabled accelerated teamwork, engineering, data collection, analysis, and interoperability across the Department's cyber ranges and mission partners.\n\n(6) Performed C2 capability prioritization and sequencing via the OUSD(AT&L) and DoD CIO-sponsored Joint C2 Sustainment and Modernization Planning process, with follow-on C2 capability production, integration, fielding and sustainment for FY13\/14 approved priorities.  Provided direct engagement with Component materiel developers to operationally shape C2 products and solutions while ensuring requirements traceability through the Net-enabled Requirements Identification Database, the Decision Support Tool (with operator use cases), and JCIDS requirements documents.  JCIDS documents included twelve Capability Definition Packages (CDPs) and Capability Packages (CPs) supporting the mission areas of force employment, situational awareness, security cooperation, air event information sharing, joint planning & execution, cyber C2 and cross-functional capabilities.  JCIDS documents included functional requirements for mission services, cross domain enterprise services, cyber security, and coalition data exchange-heavily influenced Service acceptance of new JCIDS Manual's Information Technology (IT) Box process for IT requirements management.\n\n(7) Developed, staffed, and received approval for key Chairman Joint Chiefs of Staff documents, i.e., Chairman, Joint Chiefs of Staff Instruction (CJCSI) 3265.01, C2 Governance and Management (Oct 2013), and Chairman, Joint Chiefs of Staff Manual (CJCSM) 3265.01, Joint C2 Requirements Management Process and Procedures (Nov 2013) which guide DoD's Joint C2 capability needs development and management across the Combatant Commands, Services and Agencies.  Developed the FY2014 Requirements Prioritization and Sequencing Plan and JROC-approved FY15 Joint C2 Operational Priorities (JROCM 024-14) which are the Warfighters' demand signal for the annual Joint C2 Sustainment and Modernization Plan (SMP)—approved by OUSD\/AT&L and guides the sustainment of current C2 capabilities and the synchronized development of future C2 capabilities (modernization)—a $750M materiel investment. \n\n(8) FY2014 Joint C2 materiel capability delivery included:  1) Initial fielding of the Global-Theater Security Cooperation Management \nFY2014 Accomplishments (cont’d)\n\nInformation System to Combatant Commands (Mar 2014)—provides a common web-based, single, centrally-hosted enterprise capability that serves as the information focal point for DoD security cooperation while sun-setting nine disparate stand-alone \napplications; 2) delivery of 30+ Joint C2 Common User Interface (CUI) widgets focused on situational awareness, intel support to C2, targeting, and Global Force Management—available to warfighters through a web-enabled, thin-client marketplace; 3) delivery of Agile Client capabilities (focused on situational awareness) with modular thick-client applications and plug-ins to enhance \nCommon Operational Picture capabilities; 4) enabled increased access to USNORTHCOM's Air Event Information Sharing Service—provides time-sensitive exchange of decision  support & air track data for air defense and air security partners (U.S. Federal, DoD, and North American national agencies) supporting Operation NOBLE EAGLE (ONE) air events; and 5) fielding of Global Command & Control System-Joint (GCCS-J) Global software version 4.3 for improved COP message formats, new targeting capabilities, and COP track data tagging enhancements (reduces ghost tracks).\n\n(9) Conducted Joint Staff sponsored Bold Quest Coalition Capability Demonstration and Assessment involving 12 partner nations, all US Services and U.S. Special Operations Command successfully demonstrating the integration of Mode 5 interoperability and live, virtual, construction dismounted operations at Ft Benning GA, White Sands Missile Range, NM, Holloman AFB, NM, and Ft Bliss, TX.  Systems of systems interoperability assessment focused on command and control missions from a multi-national perspective at the tactical level. Led interoperability efforts across DOD and partner nations at the operational and tactical level for mission partner operations, fire support, Combat Identification (CID), and Friendly Force Tracking (FFT) capabilities.\n\n(10) Led Accreditation visits to 5 Joint Terminal Attack Controller (JTAC) 1 Forward Air Controller (Airborne), and 2 Joint Fires Observer (JFO) Schoolhouses.\n\n(11) Validated a significant number Joint Information Environment (JIE) solutions architectures consisting of Unified Capabilities, Enterprise Operations Centers (EOC), Core Data Center (CDC), Single Security Architecture, Installation Processing Node (IPN), Installation Service Node, Network Normalization Transport and Engineering Design Specifications for EOC, CDC and IPN for the Director Joint Staff J6.\n\n(12) Developed, staffed and produced Joint Common Systems Function List Version 6.0.\n\n(13) Developed the Capability to Gap Analysis for the JIE Initial Capabilities Document (ICD), assisted in the development of sections of the ICD and the metrics for the capability requirements and the ICD integrated architectures – approved by JROCM 075-14.\n \n(14) Successfully engaged combatant command representatives in JIE through the use of engagement meetings and staffing of JIE architectures.\n \n(15) Developed and successfully applied criteria for the use of JCIDS for JIE capability development and refinement.   \n \n(16) Identified a SOF best practice for En-route Mission Command Capability (EMCC) and developed, demonstrated via Tactics, Techniques and Procedures (TTP) improved en-route C2 capability to facilitate planning and situational awareness (SA) during forcible entry operations for all DoD Global Response Forces.\n\n(17) Developed and fielded JIE Integrated Dictionary (AV-2) Development Guidance to provide standardized processes to support normalization and synchronization of over 4000 terms and definitions. \n\n(18) Hosted and provided Quality Assurance and Configuration Management for over 1500 JIE architecture views in the WMA Architecture Federation and Integration Portal (AFIP)\n\n(19) Developed and implemented of WMA Architecture Development Standards Guide (June 2014) and received first time C\/S\/A concurrence on standardized processes and methodologies for sharing of architecture.\n\n (20) Made significant improvements to the portal code, at virtually no additional cost to the Joint Staff or WMA partners, supporting scalability for hosting of architectures for the USAF, USNORTHCOM, USSOUTHCOM, USCENTCOM, and USSOCOM, resulting in annual savings of over $5 million to those organizations.\n\n (21) Developed updated Joint C2 CDD supporting architectures (ver. 1.4).\n\n (22) Started the Acquisition Technology and Logistics (AT&L) co-sponsored cross-cutting study of the JSEAD mission area with the effort during this year centering on the data collection and Mission analysis – final report due in FY15. \n\n (23) Introduced Joint Mission Thread concepts to NATO as a baseline for development of NATO and National level mission threads. First step in developing methods for interoperable and reusable architecture data across mission partners. \n\n (24) Shared Joint Mission Thread methodology with Department of Homeland Security (DHS) resulting in development of first DHS Operations Mission Thread, Maritime Interdiction.\n\n (25) Led the development of the JS J6 inputs for the Joint Command and Control Reference Architecture.\n\n (26) Completed 3 Data & Services Steering Committees (DSSC);  Established new IT Governance Body, Enterprise Service & Data Panel (ESDP) and held 7 sessions; Led two Data Management Syndicate (DMS) sessions; generated a NATO Core Data Framework Vision paper; led one Data Tagging & Labeling (DATAL) tiger team with the five eye nations:  Established the National Information Exchange Model (NIEM) Military Operations (MILOPS) Domain V1.0; held two Configuration Control; Generated a NIEM conformance test paper for JIE;  Established the Tactical Infrastructure Enterprise Service (TIES) Joint Capability Technology Demonstration (JCTD) and Coalition Warfare Program (CWP); demonstrated a tactical coalition identity management solution in CWIX14;  Provided quarterly authoritative data sources (ADS) exposure metrics to the Joint Capability Board (JCB); mapped the ADS to FY14 operational priorities and to the existing warfighter joint mission threads; Generated CYBER Situational Awareness data needs;  Completed revision of MIL-STD-2525D, Joint Military Symbology and CJCSM 6120.01 Joint Multi-TDL Operating Procedures and their associated NATO Allied Procedural Publications,  (APP)-06 and ADatP 33;  Voting representation \nFY 2014 Accomplishments (cont’d)\n\nor subject matter expert in 10 tactical data link forums, three as Lead, four as Co-Lead; and seven NATO TDL sessions, one as \nLead; for US Message Text Format (USMTF) in 6 MTF forums; 3 Geospatial Working Groups and 7 sub working group meetings to \ninclude the Country Code WG that finalized version 2 of the US Geopolitical Entities, Names, and Codes (GENC);  Launched the Interoperability Enhancement Process (IEP) capability in the Defense Enterprise Computing Center (DECC) at Ogden, Utah."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.968"
                                            },
                                            "Text": {
                                                "val": "(1) Serve as DoD’s capability sponsor, requirements lead, and Warfighter advocate for Joint C2 family of programs encompassing mission focus areas for situational awareness\/common operational picture, intelligence support to C2\/targeting, force employment, planning & execution, cyber C2, and core-enabling\/cross-functional capabilities.  Sustain and utilize the Net-Enabled Requirements Identification Database (NRID) and the Decision Support Tool (DST) to provide accessibility and visibility into C2 capability needs (gaps, shortfall), defined requirements (old, new, emerging), and potential solutions for C2 stakeholders and decision-makers to consider.  Lead C2 working groups and O6-level forums to synchronize C2 requirements development and Service program synchronization.   Develop\/coordinate the annual Joint C2 Operational Priorities (encompassing sustainment and modernization needs) as the warfighter’s demand signal for required capability needs and obtain JROC-approval.  Develop\/staff the FY16 Requirements Prioritization and Sequencing Plan and JCIDS documents (Capability Definition Packages and Capability Packages) to sustain and modernize the Joint C2 family of programs—supports C2 capability prioritization and sequencing via the OUSD(AT&L)-sponsored Joint C2 Sustainment and Modernization Plan (SMP) process, with follow-on C2 capability production, integration, fielding and sustainment.   Perform direct engagement\/collaboration with Component materiel developers to ensure requirements traceability throughout the materiel development process.   Engage with Joint and mission partners to improve coalition C2 data exchange. \n\n(2) Validate JIE Architectures for Director Joint Staff J6.  Provide Joint Staff representation and positions for the JIE JTRB.  Conduct analysis, Identify integration, synchronization and risk issues as they pertain to JIE Architectures and Engineering Design Standards.  Develop architectures for Joint Information Environment (JIE) requirements development, acquisition of capabilities and conformation of JIE compliance.   Provide analysis and recommendations to the JTSO IDTs and CIO RA Working Groups.  Coordinate staffing of JIE Architectures, Integrated Dictionary and EDSs with the CCMDs, Services and Agencies via JSAP.   Maintain and refine the Joint Common Systems Function List V 7.0 for use in reference and solutions architectures required for JCIDS, ISPs and JIE.  Analyze JCIDS Capability Documents and ISPs and their architectures for interoperability, integration, performance, cost and schedule.  Develop integrated architectures for the Joint Staff Warfighting Mission Area.    \n\n(3) Continue to lead implementation and integration efforts for DoD Joint Information Environment (JIE) \/ Mission Partner Environment (MPE) capabilities, including piloting and implementation efforts with COCOMs, Services, Agencies, and Coalition partners. Continue the integration of JIE\/MPE and Cyber capabilities into joint and coalition training. Extend development of JIE\/ MPE architecture products to enhance linkage with Coalition partners. Leverage the Joint C4I Partnership to manage capability development, assessment, test, and certification of COCOM and JTF C4I systems and capabilities. Continue development of C4\/ Cyber requirements and assessment of systems providing capabilities to joint missions in an operational environment to verify interoperability earlier in the development cycle. Continue to develop, prioritize, and sequence C4\/Cyber capability requirements and enterprise mission services.\n\n(4) Continue to lead interoperability efforts across DOD and partner nations at the operational and tactical level for mission partner operations, fire support, Combat Identification (CID), and Friendly Force Tracking (FFT) capabilities. Execute Joint Staff- sponsored Bold Quest 2015 assessment demonstration, including integration of Cyber capabilities with command and control of Conventional and Special Operations Force missions from a multi-national perspective at the tactical level.\n\n(5) Support DOD CIO efforts to refine and implement the DOD Data Framework and lead the implementation of the NIEM Military Operations Domain, data exchange standards. Continue JROC-directed Authoritative Data Source (ADS) work with emphasis on the Cyber mission area. Begin transition of Tactical Infrastructure Enterprise Services (TIES) Joint Capability Technology Demonstration (JCTD) to automate DOD meta-data tagging and identity access capabilities.\n\n(6) Continue to lead implementation and integration efforts for DoD Joint Information Environment (JIE) \/ Mission Partner Environment (MPE) capabilities, including piloting and implementation efforts with COCOMs, Services, Agencies, and Coalition partners. Continue the integration of JIE\/MPE and Cyber capabilities into joint and coalition training. Extend development of JIE\/ MPE architecture products to enhance linkage with Coalition partners. Leverage the Joint C4I Partnership to manage capability development, assessment, test, and certification of COCOM and JTF C4I systems and capabilities. Continue development of C4\/ Cyber requirements and assessment of systems providing capabilities to joint missions in an operational environment to verify interoperability earlier in the development cycle. Continue to develop, prioritize, and sequence C4\/Cyber capability requirements and enterprise mission services.\n\n(7) Continue to lead interoperability efforts across DOD and partner nations at the operational and tactical level for mission partner operations, fire support, Combat Identification (CID), and Friendly Force Tracking (FFT) capabilities. Execute Joint Staff-\nsponsored Bold Quest 2015 assessment demonstration, including integration of Cyber capabilities with command and control of Conventional and Special Operations Force missions from a multi-national perspective at the tactical level.\n\n(8) Support DOD CIO efforts to refine and implement the DOD Data Framework and lead the implementation of the NIEM Military Operations Domain, data exchange standards. Continue JROC-directed Authoritative Data Source (ADS) work with emphasis on the Cyber mission area. Begin transition of Tactical Infrastructure Enterprise Services (TIES) Joint Capability Technology Demonstration (JCTD) to automate DOD meta-data tagging and identity access capabilities.\n\n(9) Continue development of joint mission threads in accordance with JROC and C4\/Cyber FCB guidance to expand development of solutions architectures for enterprise mission services in support of DOD JIE\/MPE and Cyber capabilities. Provide joint mission thread data via web-enabled portal capability to enable operational context data reuse for testing, training, programming, and program development. Continue to refine the quantity and quality of WMA architecture data available to support DOD CIO architecture requirements and Joint Staff capability analysis, assessments, and modeling and simulation processes. Analyze NR KPP architectures and capabilities for interoperability and integration, and provide NR KPP waiver recommendations based on operational\/systems requirements analysis."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A - FY2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A - FY2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "FY 2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Consolidation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "PE Consolidation."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "FY 2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        }
                    }
                }
            ]
        }
    }
}