{
    "id": "6bf2ddfec2c64130039fc48a7e29e60309f20af8",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603286E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED AEROSPACE SYSTEMS"
        },
        "R1LineNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "146.789"
            },
            "CurrentYear": {
                "val": "129.723"
            },
            "BudgetYearOne": {
                "val": "185.043"
            },
            "BudgetYearOneBase": {
                "val": "185.043"
            },
            "BudgetYearTwo": {
                "val": "193.011"
            },
            "BudgetYearThree": {
                "val": "176.089"
            },
            "BudgetYearFour": {
                "val": "187.521"
            },
            "BudgetYearFive": {
                "val": "189.156"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "144.804"
                },
                "CurrentYear": {
                    "val": "129.723"
                },
                "BudgetYearOne": {
                    "val": "178.043"
                },
                "BudgetYearOneBase": {
                    "val": "178.043"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "146.789"
                },
                "CurrentYear": {
                    "val": "129.723"
                },
                "BudgetYearOne": {
                    "val": "185.043"
                },
                "BudgetYearOneBase": {
                    "val": "185.043"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.985"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.000"
                },
                "BudgetYearOneBase": {
                    "val": "7.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.923"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.938"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.\n\nFY 2016: Increase reflects maturation of the Vertical Take-Off and Landing (VTOL) Technology Demonstrator and subsequent transfer from Budget Activity 2 to the Advanced Aerospace Systems Program Element, offset by completion of the Aerial Reconfigurable Embedded Systems (ARES) and Persistent Close Air Support (PCAS) programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AIR-01"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED AEROSPACE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "146.789"
                        },
                        "CurrentYear": {
                            "val": "129.723"
                        },
                        "BudgetYearOne": {
                            "val": "185.043"
                        },
                        "BudgetYearOneBase": {
                            "val": "185.043"
                        },
                        "BudgetYearTwo": {
                            "val": "193.011"
                        },
                        "BudgetYearThree": {
                            "val": "176.089"
                        },
                        "BudgetYearFour": {
                            "val": "187.521"
                        },
                        "BudgetYearFive": {
                            "val": "189.156"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactically Exploited Reconnaissance Node (TERN)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Tactically Exploited Reconnaissance Node (TERN) program, a joint effort with the Office of Naval Research, is to develop a systems approach for, and perform technical demonstration of, a Medium-Altitude, Long-Endurance Unmanned Aerial Vehicle (MALE UAV) capability from smaller ships.  The program will demonstrate the technology for launch and recovery of large unmanned aircraft capable of providing persistent 24\/7 Intelligence, Surveillance, and Reconnaissance (ISR) and strike capabilities at long radius orbits.  By extending the ISR\/strike radius and simultaneously increasing time on station beyond current capabilities from smaller ships, TERN will enable novel operational concepts including maritime surveillance and responsive, persistent deep overland ISR and strike, without requirement for forward basing.  To achieve these goals, the program will create new concepts for aircraft launch and recovery, aircraft logistics and maintenance, and aircraft flight in regimes associated with maritime operating conditions.  The program will culminate in a launch and recovery demonstration.  Application of TERN technologies and operational concepts will enable a novel and cost efficient approach for multiple mission sets.  The transition partner is the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.934"
                                            },
                                            "Text": {
                                                "val": "-  Defined the launch and recovery technique through evaluations and trade studies.\n-  Completed studies on integration with existing Service systems and systems architectures.\n-  Studied aircraft design trades and approaches to best meet performance goals at minimum lifecycle cost.\n-  Began development of simulation and control schemes to achieve high precision approach.\n-  Identified equipment and interface requirements for ship launch and recovery systems.\n-  Initiated risk reduction simulations and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue technology maturation and complete preliminary design.\n-  Continue integrated aircraft risk reduction simulations and testing.\n-  Initiate subscale testing of propulsion system.\n-  Commence integrated ship-aircraft simulation activity.\n-  Conduct large-scale demonstration of select technology development elements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Commence procurement of long-lead demonstrator system components.\n-  Complete detailed design of demonstrator aircraft.\n-  Begin fabrication and testing of demonstrator system hardware.\n-  Complete subscale testing of propulsion system.\n-  Initial testing of ship relative navigation system.\n-  Perform subsystem risk reduction demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Operations in Denied Environment (CODE)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Collaborative Operations in Denied Environment (CODE) program is to enhance mission performance, reduce cost, confound adversaries, and reduce reliance on space assets for navigation and communication by distributing mission functions such as sensing, communication, precision navigation, kinetic, and non-kinetic effects to small platforms and increasing their level of autonomy.  Collaboration of multiple assets offers new possibilities to conduct military missions using smaller air platforms to enhance survivability, reduce overall acquisition cost, create new effects, increase communications range and robustness in denied environments, increase search area, increase areas held at risk, reduce target prosecution reaction time, and provide multi-mission capabilities by combinations of assets.  This effort will specifically focus on developing and demonstrating approaches that will expand the mission capabilities of legacy air assets though autonomy and collaborative behaviors, within a standard based open architecture.  Potential transition partners include the Air Force, Army, and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated systems engineering phase, selected candidate missions, and defined security framework.\n-  Began work on open architecture for distributed system and very low communication constraints."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform trade studies and decompose selected missions.\n-  Develop collaborative algorithms, autonomous tactics, concepts for communication, and supervisory interface.\n-  Develop software module specifications compliant with standard based open architecture including OSD unmanned aircraft system control segment.\n-  Evaluate algorithms, tactics, communication and interfaces, in high fidelity non-real time simulation against key performance parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.043"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.043"
                                            },
                                            "Text": {
                                                "val": "-  Implement algorithms in first release of flightworthy software (release 1) hosted in mission computer compatible with demonstration platform and objective operational platforms.\n-  Modify demonstration platform to include mission computer and mesh network capable radio.\n-  Demonstrate in-flight capabilities of release 1 focused on vehicle level autonomy, including on-board real time sensor processing, contingency management, and complex flight path planning.\n-  Demonstrate release 1 collaboration algorithms in real time simulation, including low bandwidth sensor fusion and collaborative tasking that maximizes system effectiveness.\n-  Develop collaborative algorithms, tactics, concepts for communication, and human interface.\n-  Evaluate algorithms, tactics, communication and interfaces, in non-real time simulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Air-breathing Weapon Concept (HAWC)"
                                    },
                                    "Description": {
                                        "val": "The Hypersonic Air-breathing Weapon Concept (HAWC) program is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies to enable transformational changes in responsive, long-range strike against time-critical or heavily defended targets.  HAWC will pursue flight demonstration of the critical technologies for an effective and affordable air-launched hypersonic cruise missile.  These technologies include advanced air vehicle configurations capable of efficient hypersonic flight, hydrocarbon scramjet-powered propulsion to enable sustained hypersonic cruise, thermal management approaches designed for high-temperature cruise, and affordable system designs and manufacturing approaches.  HAWC technologies also extend to reusable hypersonic air platforms for applications such as global presence and space lift.  The HAWC program will leverage advances made by the previously funded Falcon, X-51, and HyFly programs.  This is a joint program with the Air Force, and HAWC technologies are planned for transition to the Air Force after flight testing is complete."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.200"
                                            },
                                            "Text": {
                                                "val": "-  Conducted hypersonic air-breathing missile objective system trades studies and conceptual design definition.\n-  Derived hypersonic air-breathing missile demonstration system design from the objective system and began developing the suite of enabling technologies.\n-  Began developing flight testing plans for the hypersonic air-breathing missile demonstrator.\n-  Initiated risk reduction testing of enabling subsystem technologies for the hypersonic air-breathing missile demonstrator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Continue risk reduction testing of subsystem technologies for hypersonic air-breathing missile demonstrator.\n-  Complete technology demonstration system requirements review and initiate preliminary design of hypersonic air-breathing missile flight demonstration system.\n-  Conduct full-scale freejet propulsion system design and fabrication and initiate testing.\n-  Initiate detailed plans for flight testing of the air-breathing missile demonstration system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete preliminary design of hypersonic air-breathing missile flight demonstration system.\n-  Begin fabrication and testing of thermal protection system materials.\n-  Begin detailed design of the hypersonic air-breathing missile flight demonstration system.\n-  Begin test-validated performance databases to anchor demonstration vehicle design.\n-  Conduct final full-scale freejet propulsion system testing.\n-  Complete software architecture and algorithm design, and begin software-in-the-loop testing for the demonstration vehicle.\n-  Begin procurement of long lead hardware for hypersonic air-breathing missile flight demonstration vehicle.\n-  Initiate flight certification reviews with the test range.\n-  Continue detailed plans for flight testing of the air-breathing missile demonstration system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Boost Glide"
                                    },
                                    "Description": {
                                        "val": "The Tactical Boost Glide (TBG) program is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies to enable air-launched tactical range hypersonic boost glide systems, including a flight demonstration of a vehicle that is traceable to an operationally relevant weapon that can be launched from current platforms.  The program will also consider traceability to, and ideally compatibility, with the Navy Vertical Launch System (VLS).  The metrics associated with this objective include total range, time of flight, payload, accuracy, and impact velocity.  The program will address the system and technology issues required to enable development of a hypersonic boost glide system considering (1) vehicle concepts possessing the required aerodynamic and aero-thermal performance, controllability and robustness for a wide operational envelope, (2) the system attributes and subsystems required to be effective in relevant operational environments, and (3) approaches to reducing cost and improving affordability for both the demonstration system and future operational systems.  TBG capabilities are planned for transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed trade space analysis for tactical range hypersonic boost glide systems.\n-  Began development of TBG Concept of Operations (ConOps).\n-  Began development of TBG Operational System (OS) conceptual designs and system capabilities.\n-  Completed a baseline operational analysis of the Government Reference Vehicle (GRV). \n-  Began operational analysis of the TBG performers operational systems.\n-  Began booster range and energy management study. \n-  Began aerodynamic and aerothermodynamic GRV risk reduction testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete TBG ConOps, Operational System conceptual design reviews and system capability documentation.\n-  Complete operational analysis of the performer TBG operational systems.\n-  Complete operational analysis of evolved GRV.\n-  Complete TBG Demonstration System conceptual design and systems requirements reviews.\n-  Complete initial Technology Maturation Plans (TMPs).\n-  Complete initial Risk Management Plan (RMP).\n-  Select booster and launch platforms.\n-  Conduct initial test range and range safety coordination.\n-  Begin Phase I aerodynamic and aerothermal concept testing.\n-  Begin development of first generation aero databases.\n-  Complete aerodynamic and aerothermal GRV risk reduction testing. \n-  Complete booster range and energy management study."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Select TBG demonstration test range.\n-  Develop initial flight test plan.\n-  Complete Preliminary Design Reviews (PDR).\n-  Complete first generation aero databases. \n-  Continue risk reduction and qualification testing.\n-  Begin TBG concept refinement testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Reconfigurable Embedded System (ARES)"
                                    },
                                    "Description": {
                                        "val": "Current and future land and ship-to-shore operations will require rapid and distributed employment of U.S. forces on the battlefield.  The Aerial Reconfigurable Embedded System (ARES) program will develop a vertical take-off and landing (VTOL), modular unmanned air vehicle that can carry a 3,000 lb useful load at a range of 250 nautical miles on a single tank of fuel.  ARES will enable distributed operations and access to compact, high altitude landing zones to reduce warfighter exposure to hostile threats and bypass ground obstructions.  ARES  modular capability allows for mission modules to be quickly interchanged and deployed at the company level.  This enables the flexible employment of many different capabilities including: cargo resupply, casualty evacuation, reconnaissance, weapons platforms, and other types of operations.  ARES vehicles could be dispatched to resupply isolated small units.  ARES is well suited for enhanced company operations concepts that would provide the warfighter\/team increased situational awareness for operations in an urban environment.  The enabling technologies of interest being developed under the ARES program include vertical and translational flight, conversion between powered lift and wing borne lift, ducted fan propulsion systems, lightweight materials, tailless configuration, modularity, and advanced flight controls for stable transition from vertical to horizontal flight.  Additionally, the program will explore opportunities for the design, development, and integration of new, key technologies and capabilities.  These include adaptable landing gear concepts to enable operations from irregular landing zones and moving launch\/recovery platforms, and autonomous take off and landing.  The anticipated transition partners for this effort are the Army, Marine Corps, and Special Operations Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed Critical Design Review for the ARES system.\n-  Fabricated custom components, acquired powerplant and drivetrain components.\n-  Performed one third scale powered tunnel test of flight module with cargo module.\n-  Conducted component testing and static propulsion testing, showing feasibility and function of critical technology components.\n-  Updated flight control software using tunnel data with cargo module control derivatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete drive train testing with flight components.\n-  Complete development of flight control software to ensure successful flight and ground testing.\n-  Conduct subsystem testing and integration of components into the full scale prototype ARES system.\n-  Complete hardware-in-the-loop and software-in-the-loop testing with fully integrated full scale prototype ARES system.\n-  Conduct a test readiness review in preparation for ground and test demonstrations of the prototype vehicle.\n-  Conduct ground demonstrations of the prototype vehicle in preparation for flight testing.\n-  Conduct flight tests to demonstrate that the vehicle meets program objectives by flying with and without a cargo module to show cargo delivery.\n-  Continue flight test to validate flight envelope and expand speed and altitude performance.\n-  Conduct demonstration flights for communities of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace System Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program examine and evaluate emerging aerospace technologies and system concepts for applicability to military use.  This includes the degree and scope of potential impact\/improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging aerospace threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include: methods of defeating enemy anti-aircraft attacks; munition technologies to increase precision, range, endurance, and lethality of weapons for a variety of mission sets; novel launch systems; air vehicle control, power, propulsion, materials, and architectures; and payload and cargo handling systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated study for the integration of hypersonic propulsion technologies, and a flowpath assessment for engine mode transition.\n-  Validated sub-system performance and conducted sub-system risk reduction testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.510"
                                            },
                                            "Text": {
                                                "val": "-  Completed hypersonic propulsion integration and flowpath assessments.\n-  Initiate studies of emerging concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform feasibility experiments of candidate technologies and system concepts.\n-  Conduct trade studies and modeling and simulation for novel technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology for Enriching and Augmenting Manned - Unmanned Systems"
                                    },
                                    "Description": {
                                        "val": "The Technology for Enriching and Augmenting Manned - Aircraft (TEAM-US) project seeks to increase lethality, survivability, payload, and reach of combat aircraft by: (i) teaming them (wingmen) with advanced Unmanned Aerial Vehicles (UAVs), and (ii) enabling swarming employment and operations of manned and unmanned airborne systems.  The synergy between the mission tailored UAV wingmen and the less survivable, but decision making manned platforms will provide access to contested airspace and enhance force projection.  UAV wingmen will reduce air dominance lifecycle costs by dramatically reducing training costs.  Legacy manned platforms will train with virtual unmanned teammates saving operations, maintenance, and logistics costs associated with manned wingmen.  Unmanned wingmen can be developed for a wide variety of missions including penetrating intelligence, surveillance, and reconnaissance (ISR), electronic attack (EA), and weapons delivery. Mixed operations of manned and unmanned systems in a swarming configuration can be developed to support missions against networked-integrated air defenses and to support operations in highly contested environments.  A common core will enable reduced development and integration costs.  Finally, leveraging existing platforms for command, control, and battle management recapitalizes existing investments, making these 4th and 5th generation platforms viable participants in future anti-access, area denial scenarios where they may have limited survivability.  Balancing in situ battle management with highly capable, mission specific unmanned teammates will offset new threat technologies, enabling more cost effective mission execution, and increasing the survivability of the manned platform team leader."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform operational analysis and technology maturity assessments to determine the minimum set of critical platform attributes and technology advances required of an unmanned teammate.\n-  Create a technology development and system attributes demonstration roadmap.\n-  Develop and refine the final unmanned vehicle design and concept.\n-  Perform system and system-of-system trades."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vertical Take-Off and Landing (VTOL) Technology Demonstrator"
                                    },
                                    "Description": {
                                        "val": "The Vertical Take-Off and Landing (VTOL) Technology Demonstrator program will demonstrate revolutionary improvements in (heavier than air) VTOL air vehicle capabilities and efficiencies through the development of subsystem and component technologies, aircraft configurations and system integration.  The program will build and flight test an unmanned 10,000 - 12,000 lb aircraft capable of sustained speeds in excess of 300 kt, demonstrate system level hover efficiency within 25 percent of the ideal, and a lift-to-drag ratio no less than ten.  Additionally, the demonstrator will be designed to have a useful load of no less than 40 percent of the gross weight.  A strong emphasis will be placed on the development of elegant, multi-functional subsystem technologies that demonstrate net improvements in aircraft efficiencies to enable new and vastly improved operational capabilities.  Technologies developed under this program will be made available to all Services for application to future air systems development.  This program is a continuation of applied research efforts funded in PE 0602702E, Project TT-07."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete subscale model flight testing for flight controls verification and validation.\n-  Complete preliminary design of all subsystems.\n-  Complete system preliminary design reviews and select performer for detailed design, fabrication, and flight test.\n-  Conduct detailed analyses and design refinements for all subsystems.\n-  Perform subsystem testing necessary for subsystem design validation and critical design reviews.\n-  Initiate aircraft assembly and manufacturing processes to include tooling design and fabrication.\n-  Procure long-lead items for aircraft fabrication."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Close Air Support (PCAS)"
                                    },
                                    "Description": {
                                        "val": "The Persistent Close Air Support (PCAS) program will significantly increase close air support (CAS) capabilities by developing a system to allow continuous CAS availability and lethality to the supported ground commander.  The enabling technologies are: manned\/unmanned attack platforms, next generation graphical user interfaces, data links, digital guidance and control, and advanced munitions.  PCAS will demonstrate the ability to digitally task a CAS platform from the ground to attack multiple\/simultaneous targets.  PCAS will allow the Joint Tactical Air Controller (JTAC) the ability to rapidly engage multiple moving targets simultaneously within the area of operation.  PCAS's ability to digitally task a CAS platform to attack multiple\/simultaneous targets would improve U.S. ground forces operations and speed of attack.  The system will be designed to reduce collateral damage and potential fratricide to friendly forces.  The anticipated transition partners are the Air Force, Special Operations Command, and the United States Marine Corps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.108"
                                            },
                                            "Text": {
                                                "val": "-  Performed ground test of A-10 demonstration aircraft architecture, networking, and avionics.\n-  Completed hardware\/software fabrication and field tested prototype PCAS kit for dismounted JTAC.\n-  Conducted technical readiness review of PCAS aircraft systems and JTAC kit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.713"
                                            },
                                            "Text": {
                                                "val": "-  Prepare for and commence live fire demonstrations of PCAS prototype system.\n-  Complete flight testing of PCAS prototype system.\n-  Transition elements of PCAS air and ground systems to targeted Service partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Fires (DFires)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Distributed Fires (DFires) program is to create a capability which would allow for precision fires from extended ranges (>500 km) to be rapidly accessed by lower echelon units.  The DFires system would be a stand-alone system that would be transported by light trucks, rotorcraft, or small boats and delivered to supporting locations on the battlefield.  Small units would use tactical radios to call for support fire which would greatly shorten the time required to receive artillery fire or to call in close air support.  The modular base unit would provide the communications link and pass along targeting commands to the onboard stores.  The onboard stores would consist of multiple tube launched munitions.  As envisioned, different stores could be developed that would enable the small unit to rapidly access different capabilities.  For example, in a direct fire mission, target information would be fed to a fast missile which would engage the target at that location.  Alternatively, an Intelligence, Surveillance and Reconnaissance (ISR) request could be quickly accomplished by launching a loitering munition which would rapidly fly to the requested area and loiter while feeding ISR data to the warfighters.  A loitering attack munition could also be called which would loiter in an area while searching for a target or waiting for final targeting commands.  Technology areas to be developed include the overall system architecture, the communications requirements and protocols, and specific stores."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade space analysis and develop overall system architecture.\n-  Preliminary design of multiple types of onboard stores.\n-  Develop communications architecture and targeting protocols."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Domain Unmanned System (UxS)"
                                    },
                                    "Description": {
                                        "val": "The Multi-Domain UxS program will develop capabilities to enable both individual and teams of unmanned systems to span the various physical domains (ground-air, ground-sea, air-sea).  The purpose of the Multi-Domain UxS is to enable affordable and efficient disruptive capabilities that the U.S. military does not possess today.  The program will develop morphing, cross domain structures (mechanical and hydrodynamic) utilizing efficient power and propulsion systems.  It will leverage emerging collaborative algorithms and approaches, while developing novel attachment and detachment mechanisms to support cross domain sensing, traversal, and mission execution.  The systems prototype will demonstrate deployment from one domain and then modification in deployment to execute missions in another physical domain."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct systems architecture trades and cost studies.\n-  Initiate design studies of candidate systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Anti-Ship Missile Demonstration (LRASM)"
                                    },
                                    "Description": {
                                        "val": "In response to emerging threats, DARPA built upon recent technology advances to develop and demonstrate standoff anti-ship strike technologies to reverse the significant and growing U.S. naval surface strike capability deficit.  The Long Range Anti-Ship Missile (LRASM) program invested in advanced component and integrated system technologies capable of providing a dramatic leap ahead in U.S. surface warfare capability focusing on organic wide area target discrimination in a network denied environment, innovative terminal survivability in the face of advanced defensive systems, and high assurance target lethality approaches.  Specific technology development areas included: robust precision guidance, navigation and control with GPS denial, multi-modal sensors for high probability target identification in dense shipping environments, and precision aimpoint targeting for maximum lethality.  Component technologies were developed, demonstrated, and integrated into a complete weapon system.  The program resulted in a high fidelity demonstration to support military utility assessment.  LRASM is a joint DARPA\/Navy effort that has transitioned to a program of record."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.547"
                                            },
                                            "Text": {
                                                "val": "-  Completed missile and canister integration for a surface launched system.\n-  Completed subsystem testing to reduce risks of integration, interference, and flight failure.\n-  Validated booster adapter and separation device designs through analysis and testing.\n-  Completed ground test vehicle end-to-end simulation testing for successful flight predictions.\n-  Finalized supporting documentation including flight test and safety plans in preparation for flight demonstration.\n-  Completed final integration and checkout of controlled test vehicle in preparation for flight testing.\n-  Completed end-to-end system flight demonstration.\n-  Performed one controlled test vehicle flight from the vertical launching system.\n-  Validated system performance via free flight test event.\n-  Completed end-to-end system flight demonstrations on final test missiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Air Dominance Study"
                                    },
                                    "Description": {
                                        "val": "The Next Generation Air Dominance study defined the projected threat domains and capability gaps for the 2020-2050 timeframe.  DARPA conducted a study of current air dominance efforts in coordination with the United States Air Force and Navy and explored potential technology developmental areas to ensure the air superiority of the United States in the future.  The study considered roles of manned and unmanned platforms; the relative performance of alternative integrated systems concepts that combine various mixes of capabilities networked together; and the cost effectiveness of alternative balances of platforms and systems that provide surveillance, command and control, electronic warfare, and weapons functions.  Innovative concepts for platform, propulsion, sensors, weapons integration, avionics, and active and passive survivability features were explored as part of the concept definition effort.  This effort explored the expanded development and use of automated and advanced aerospace engineering design tools, modeling, and simulation in areas that can increase the likelihood of producing more capable products with improved efficiency.  Following the initial multi-agency study, DARPA presented technical challenges to industry to allow them to explore and present potential solutions as part of the technical feasibility and system integration studies.  Enabling technologies are advanced networking capabilities, reliable navigation, passive and active defense, electronic attack, area denial, advanced sensors, and cyber technologies.  After the study, it is envisioned that high-potential prototype programs will emerge to develop technologies for future air dominance.  Early planning for future technologies will also help to define the funding baselines for DoD research and development and acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted technology feasibility and system integration studies of identified high value technologies.\n-  Conducted Technical Interchange Meeting (TIM) to coordinate between development efforts.\n-  Briefed senior leadership on results of technology development efforts, with high-potential prototype programs recommendations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}