{
    "id": "6e1892ba80dfaae4c76b0ec78545bcc327e26936",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602712A"
        },
        "ProgramElementTitle": {
            "val": "Countermine Systems"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.019"
            },
            "CurrentYear": {
                "val": "29.428"
            },
            "BudgetYearOne": {
                "val": "25.068"
            },
            "BudgetYearOneBase": {
                "val": "25.068"
            },
            "BudgetYearTwo": {
                "val": "26.497"
            },
            "BudgetYearThree": {
                "val": "26.663"
            },
            "BudgetYearFour": {
                "val": "26.996"
            },
            "BudgetYearFive": {
                "val": "27.531"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates, designs, and evaluates technologies to improve countermine\/counter improvised explosive device, signature management and counter-sensors capabilities. The focus is on sensor components, sub-components and software algorithms to improve detection of mines, explosive threats and directed energy; novel methods to defeat mines and explosive threats; and signature management technologies to reduce reconnaissance capabilities of the enemies. Project H24 advances state of the art Countermine technologies to accurately detect threats with a high probability, reduce false alarms, and enable an increased operational tempo. Project H35 evaluates and develops advanced sensor protection, signature management and deception techniques for masking friendly force capabilities and intentions.  \n\nWork in this PE is related to and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602709A (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), and PE 0603710A (Night Vision Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the U.S. Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.563"
                },
                "CurrentYear": {
                    "val": "25.939"
                },
                "BudgetYearOne": {
                    "val": "25.251"
                },
                "BudgetYearOneBase": {
                    "val": "25.251"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.019"
                },
                "CurrentYear": {
                    "val": "29.428"
                },
                "BudgetYearOne": {
                    "val": "25.068"
                },
                "BudgetYearOneBase": {
                    "val": "25.068"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.544"
                },
                "CurrentYear": {
                    "val": "3.489"
                },
                "BudgetYearOne": {
                    "val": "-0.183"
                },
                "BudgetYearOneBase": {
                    "val": "-0.183"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.011"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "3.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.544"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.183"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.183"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H24"
                    },
                    "ProjectTitle": {
                        "val": "Countermine Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.038"
                        },
                        "CurrentYear": {
                            "val": "20.900"
                        },
                        "BudgetYearOne": {
                            "val": "19.445"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.445"
                        },
                        "BudgetYearTwo": {
                            "val": "20.821"
                        },
                        "BudgetYearThree": {
                            "val": "20.930"
                        },
                        "BudgetYearFour": {
                            "val": "21.238"
                        },
                        "BudgetYearFive": {
                            "val": "21.658"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and evaluates new countermine components, sub-components and software algorithms for detection, discrimination and neutralization of individual mines, minefields and other explosive threats. The goal of this project is to accurately detect threats with a high probability, reduce false alarms and enable an increased operational tempo.  \n\nThis project supports Army science and technology efforts in the Ground Maneuver, Command, Control, Communications and Intelligence, Air and Soldier portfolios. \n         \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate, Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense Unexploded Ordnance (UXO) Center of Excellence (UXOCOE)"
                                    },
                                    "Description": {
                                        "val": "The Army serves as executive agent of the Unexploded Ordnance (UXO) Center of Excellence (COE), which provides for the coordination of UXO activities across the Department of Defense (DoD) Army, Navy, Air Force and Marine Corps programs. The UXOCOE serves as the focal point for research, development, testing and evaluation (RDT&E) for UXO detection, clearance technologies, remediation and sensor\/signature\/DOD program database development. Technologies investigated for mitigating UXO are oriented to land and underwater approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.453"
                                            },
                                            "Text": {
                                                "val": "Researched a high power laser neutralization source that enables safe standoff removal of wire obstacles while on the move."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Sensors for Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the challenges of sensing and confirming potential in-road and\/or roadside targets at standoff range such as reduced resolution and grazing angle effects. This effort focuses on understanding phenomenologies that impact sensor design concepts and steer novel technologies that provide primary anomaly search sensing leading to higher-confidence target detection and clutter\/background filtering. Examples of candidate technologies include forward looking Electro-Optic\/Infrared (EO\/IR) and Ground Penetrating Radar (GPR) sensors for surface and shallow buried targets. These efforts also investigate new sensor phenomenologies to confirm buried threats at deeper depths including multispectral, low frequency electro-magnetic (EM), and doppler interferometric sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.359"
                                            },
                                            "Text": {
                                                "val": "Validated designs of component antenna arrays and conducted experiments for a multi-band forward looking GPR; investigated EO forward projecting Laser Radar (LADAR) to assist forward looking radar; developed advanced detection algorithms utilizing high resolution surface terrain information obtained from the integration with LADAR; conducted field data collections of standoff vibration technology in combination with the EM, electromagnetic interference (EMI)  and EO based sensor for detection of shallow and deeply buried explosive hazards; enhanced visualization workstation software to incorporate available sensor inputs in real time."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.409"
                                            },
                                            "Text": {
                                                "val": "Integrate dual band Forward Looking (FL) GPR and EO\/IR sensors on a brassboard demonstrator; conduct phenomenology studies to determine feasibility of fusion of multiple sensor modalities for improved detection; extend detection depth of low parity Doppler interferometer using seismic sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.961"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.961"
                                            },
                                            "Text": {
                                                "val": "Will validate dual band FL GPR components using new phased arrays; explore polarization phenomenologies with Short Wave IR through Long Wave IR sensors to discriminate man-made objects; investigate vibration sensors to distinguish targets from clutter; explore ground profiling sensors (LIDAR, X-band radar) to improve FL GPR data by removing surface clutter; study new identification and confirmation sensors such as autonomous Neutron Gamma sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemically Specific Detection of Explosive Threats"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging chemically-specific explosive hazards (to include Home Made Explosives (HMEs)) and detection technologies to address Warfighter needs. The effort will provide technologies for standoff detection and confirmation of emerging threats and production facilities and is complimentary to the work being accomplished under PE 0602622A\/Project 552."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.834"
                                            },
                                            "Text": {
                                                "val": "Investigated and validated standoff spectroscopic technologies capable of detecting explosive hazards and HME production facilities; conducted technical experiments using eye safe, low-Size, Weight, and Power (SWaP), Quantum Cascade Laser (QCL) technology to effectively sample the residues for trace amounts of explosives for identification and standoff illumination for disturbed earth detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.815"
                                            },
                                            "Text": {
                                                "val": "Improve algorithms and signal processing to maximize discrimination and reduce false alarms of explosive components; conduct data collections in various conditions to determine detection and identify capabilities against explosive compounds using quantum dots for close proximity sensing and QCLs for stand-off trace detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.858"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.858"
                                            },
                                            "Text": {
                                                "val": "Will analyze data collected in various conditions and optimize sensitivity and spectral selectivity of new polymer based quantum dot sensors using remote and hand held excitation sources; investigate new technologies to extract surface vapor signals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates threat and common clutter phenomenologies enabling investments in emerging component technologies to enhance detection of explosive hazards, including metallic and non-metallic landmines, Improvised Explosive Devices (IEDs), Home Made Explosives (HMEs), and Explosively Formed Penetrators (EFPs). Emphasis will be on increased coverage area, higher detection and discrimination probabilities. Low Size, Weight, and Power (SWaP) enabling technologies will be considered and studied to ensure solutions are viable for Soldier-portable applications. This effort also investigates advanced signal processing and real time algorithms utilizing candidate sensors including Ground Penetrating Radar (GPR), and metal detector position, for increased real-time feedback on threat detection and enhanced identification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.392"
                                            },
                                            "Text": {
                                                "val": "Optimized and validated emerging technologies such as advanced GPR antennas; compact metal detectors with target identification; position measurement sensors and see-thru displays as part of a portable handheld sensor suite for detection of explosive hazards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.495"
                                            },
                                            "Text": {
                                                "val": "Conduct laboratory data collections using GPR, wide bandwidth metal detectors, and position measurement sensors mounted in a handheld emulation platform to establish a correlated dataset; conduct experiments to determine highly accurate sensor position to improve display of sweep location and subsurface threats; develop near real-time detection and processing capability; conduct trade studies to determine the best combination of novel components and sensors for real-time detection and identification of buried explosive hazard threats using Nuclear Quadrupole Resonance (NQR), GPR and frequency domain metal detectors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.626"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.626"
                                            },
                                            "Text": {
                                                "val": "Will conduct data collections in relevant simulated environments to refine the best combination of novel components and sensors for real-time detection and identification of buried explosive hazard threats including atomic magnetometers for NQR, GPR, and frequency domain metal detectors; explore advanced signal processing approaches using correlated data from various modalities and determine optimal data processing and algorithm techniques; utilize outcome of optimal datasets as feedback to sensor redesigns and experimentation; determine highly accurate sensor position to improve feedback, reduce the operator's cognitive burden, and improve clutter rejection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Neutralization Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging neutralization technologies and techniques to effectively neutralize explosive hazards (to include HMEs) to address Warfighter needs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.181"
                                            },
                                            "Text": {
                                                "val": "Investigate fiber laser based techniques for low or high-order neutralization of explosive threats at standoff ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Explosive Hazard Phenomonology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates potential long term solutions to the asymmetric explosive hazard threats. It leverages recent lessons learned to investigate new ideas and emerging technologies to counter explosive hazards through better understanding, detection, neutralization and mitigation of the threat."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Instigate a series of knowledge capture events with industry and academia; develop novel and innovative research  efforts in counter-Improvised Explosive Device (IED) detection; begin analysis of research areas focusing on non-traditional approaches (such as crowd sourcing and novel sensors) identified as having high potential for significant breakthroughs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will continue the series of knowledge capture events with industry and academia; focus efforts on characterizing counter-IED detection phenomenology; continue analysis and begin validation of research areas focusing on non-traditional approaches."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H35"
                    },
                    "ProjectTitle": {
                        "val": "Camouflage  & Counter-Recon Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.981"
                        },
                        "CurrentYear": {
                            "val": "5.028"
                        },
                        "BudgetYearOne": {
                            "val": "5.623"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.623"
                        },
                        "BudgetYearTwo": {
                            "val": "5.676"
                        },
                        "BudgetYearThree": {
                            "val": "5.733"
                        },
                        "BudgetYearFour": {
                            "val": "5.758"
                        },
                        "BudgetYearFive": {
                            "val": "5.873"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and evaluates advanced signature management and deception techniques for masking friendly force capabilities and intentions. Technologies pursued under this effort reduce the cross section of sensor systems. Technologies such as decentered field lens, wavefront coding and spectral filtering and threat sensing algorithms are investigated along with next generation camouflage coatings and paints. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence and Ground Maneuver portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate, Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage and Counter-Reconnaissance Technology for Advanced Spectral Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and advances new techniques to reduce Electro-Optical (EO) susceptibility of sensors and camouflage. The two primary objectives are to reduce the optical cross section of currently fielded and emerging EO and Infrared (IR) sensors and investigate technologies that will enable enhanced spectral signature reduction for next generation camouflage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.981"
                                            },
                                            "Text": {
                                                "val": "Continued development of solutions to reduce optical cross section of large format (EO\/IR) arrays; developed and investigated hardware\/software, filters and coatings for currently fielded large format EO and uncooled IR sensors; camouflage effort focused on implementation of thermal signature reduction coatings and methodologies suitable for nets and uniforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.028"
                                            },
                                            "Text": {
                                                "val": "Investigate uncooled Focal Plane Array (FPA) vulnerabilities and exploitation against multiple laser threats; conduct initial studies into adaptive protection for Long Wave (LW) IR sensors; incorporate large format array sensor protection solution into hardware\/software demonstrators; evaluate multispectral camouflage to include thermal signature reduction technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.623"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.623"
                                            },
                                            "Text": {
                                                "val": "Will study uncooled FPA resiliency against laser threats; investigate uncooled FPA protection including Micro-electromechanical Systems (MEMS) devices and tunable IR filters; investigate best approach to laser harden DayTV cameras; investigate methods of laser protection for high performance (cooled) IR sensors, including linear and non-linear optical approaches.  Explore spectral response of next generation two sided ultra lightweight camouflage and netting (ULCAN)s as well as different methods to imbed a thermal pattern; optimize the performance of multispectral camouflage to counter emerging threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB2"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "3.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Countermine Systems applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Unexploded Ordinance and Landmine Detection Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Further developed technologies that address counter-improvised explosive device (IED) requirements attributed to route clearance patrols and entry control points for mounted and dismounted applications.  The four thrust areas were Sensors for Explosive Threat Identification (Buried\/Concealed Configurations); Standoff Side Attack\/Squint Angle Threat Detection; Standoff (Pinpoint) Neutralization; and Advanced Signal and Image Processing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.500"
                                        },
                                        "Text": {
                                            "val": "Program increase for countermine technology research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}