{
    "id": "71490fd732932af96610b4b7c4ba5652954cc98e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605805A"
        },
        "ProgramElementTitle": {
            "val": "Munitions Standardization, Effectiveness and Safety"
        },
        "R1LineNumber": {
            "val": "150"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "56.543"
            },
            "CurrentYear": {
                "val": "64.027"
            },
            "BudgetYearOne": {
                "val": "32.604"
            },
            "BudgetYearOneBase": {
                "val": "32.604"
            },
            "BudgetYearTwo": {
                "val": "24.915"
            },
            "BudgetYearThree": {
                "val": "26.799"
            },
            "BudgetYearFour": {
                "val": "30.577"
            },
            "BudgetYearFive": {
                "val": "31.236"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016 reduction attributed to realignment to other higher priority Army programs."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element supports continuing technology investigations.  It provides a coordinated tri-service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.  It provides for NATO interchangeability testing (F21); Joint munition effectiveness manuals used by all services; development of standardization agreements (STANAGS) and associated Manuals of Proof and Inspection (MOPI); operation of the North American Regional Test Center (NARTC); evaluation of demilitarization methods for existing conventional ammunition (F24); evaluation of useful shelf life, safety, reliability and producibility of pyrotechnic munitions; and improvement of explosives safety criteria for DOD munitions via the DOD Explosives Safety Board (857).  Pyrotechnic Reliability and Safety (296) supports pyrotechnic research, development and testing to identify, characterize and resolve reliability, safety, storage and manufacturing issues that impact production availability and field use of pyrotechnics.  Project 296 will result in the development and demonstration of new, safe, reliable and environmentally acceptable munitions.  Munitions Survivability and Logistics (297) will make Army units more survivable by applying technologies to reduce the sensitivity of munitions to unplanned stimuli (e.g. bullet impacts, fragment impacts, fast cook off, slow cook off, sympathetic detonation, shaped charge jets) and by testing and demonstrating munitions logistics system solutions that prevent or minimize catastrophic explosive events and accelerate ammunition resupply.  Project 297 also supports the Army Insensitive Munitions (IM) Board's reviews.  The Army Explosives Safety Management Program (858) was established in FY01. The U.S. Army Technical Center for Explosives Safety uses the funds in this project to evaluate current explosives safety standards and develop new, scientific and risk-based standards to meet U. S. Army explosives requirements.  The Life Cycle Pilot Program (LCPP) (859) will assess production base capabilities and needs over the acquisition life cycle of various munitions and will address the producibility of ammunition including the transition to type classification and production, and the ability of the production base to cost effectively produce quality products on schedule.  The Fuze Technology Integration program (862) will improve performance and lower the costs of existing proximity fuzes and enable new applications in submunitions and medium caliber fuzes, addressing advanced proximity fuze sensor technology, Micro-electromechanical Systems (MEMS), Safety and Arming (S&A) technology, and Electronic S&A (ESA) technology for smart munitions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.309"
                },
                "CurrentYear": {
                    "val": "49.052"
                },
                "BudgetYearOne": {
                    "val": "45.484"
                },
                "BudgetYearOneBase": {
                    "val": "45.484"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "56.543"
                },
                "CurrentYear": {
                    "val": "64.027"
                },
                "BudgetYearOne": {
                    "val": "32.604"
                },
                "BudgetYearOneBase": {
                    "val": "32.604"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.766"
                },
                "CurrentYear": {
                    "val": "14.975"
                },
                "BudgetYearOne": {
                    "val": "-12.880"
                },
                "BudgetYearOneBase": {
                    "val": "-12.880"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.025"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.766"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-12.880"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.880"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "296"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.077"
                        },
                        "CurrentYear": {
                            "val": "4.717"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project 296 Close Combat Technology transferred to PE 0607131A - Weapons and Munitions Product Improvement Programs, Project ER2 in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project will support research, development and testing to identify, characterize and resolve reliability, safety, storage and manufacturing issues that impact production availability and field use of demolitions, grenades, shoulder launched munitions, mines and mine clearing charges and pyrotechnics, including training realism.  Project will result in the development and demonstration of new, safe, reliable and environmentally acceptable munitions."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Radio Frequency (RF) Remote Activation Munitions (RAM)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.450"
                                        },
                                        "Text": {
                                            "val": "A low cost reusable RF-RAMS MK16 receiver was re-designed with state of the art controller and safety circuitry to reduce its size, cost and enhance safety."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.722"
                                        },
                                        "Text": {
                                            "val": "A low cost reusable RF-RAMS MK16 receiver will be re-designed with state of the art controller and safety circuitry to reduce its size, cost and enhance safety.  The current RF-RAMS receiver contract cost is approximately $3,000 in quantities above 930. The goal of this effort is to update the existing receiver design and implement improved manufacturing processes to reduce the cost.  The low cost MK16 receiver will integrate several manufacturing and producibility improvements to reduce production costs from approximately $3,000 to a production unit cost goal of less than $1,000."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Grenade Fuze Sychronization Effort"
                                    },
                                    "Description": {
                                        "val": "Program effort to adapt a M201 Fuze body with an interchangable Pyrotechnic delay cartridge that can be utilized as an M228, M208 or M213 Fuze.  Program is a product effeciency which would significantly reduce manufacturing cost of fuzes, logistic burden, and engineering support cost while reducing critical inspections and pull force requirements across all grenades."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.150"
                                            },
                                            "Text": {
                                                "val": "One Fuze across multiple grenades at a much lower cost.  Preliminary design and drawings are available from the FTI (Fuze Technology Integration) and this would be a follow on effort to verify the production readiness and grenade integration impacts across multiple programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Discriminating Passive Infrared Sensor (PIR) for the M4A1 Selectable Lighweight Attack Munition (SLAM)"
                                    },
                                    "Description": {
                                        "val": "The M4A1 SLAM has four modes of operational engagement of its vehicle targets.  One of the modes is a Side-Attack Mode which utilizes the SLAM's built-in passive infrared (PIR) sensor to detect the thermal signatures of passing vehicles to trigger and fire its explosively formed penetrator (EFP) warhead to defeat the target.  If the current US Landmine Policy were to exceed to the Ottawa Convention Treaty, then the existing M4A1 SLAM's PIR feature will render the SLAM non-compliant to the Ottawa restrictions.  The current PIR design does not have the ability to discriminate between vehicle and personnel when a potential target is detected. Without a replacement PIR design, the SLAM will lose one of its four operation modes to engage vehicle targets and unable to meet all of its intented missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.055"
                                            },
                                            "Text": {
                                                "val": "Continue Side Attack Mode development"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Payload (M206)"
                                    },
                                    "Description": {
                                        "val": "Add an extended source (Infrared Cloud) material to the M206 Flare. Justification: Test data has shown single flare effectiveness can be increased with the addition of an extended IR (Infrared) source.  Impact: increased number of countermeasure dispenses and reduce logistical burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.145"
                                            },
                                            "Text": {
                                                "val": "Added an extended source (Infrared Cloud) material to the M206 Flare"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.012"
                                            },
                                            "Text": {
                                                "val": "M206 countermeasure flare effectiveness will be improved by adding Special Material.\nPerformance - Increased effectiveness by doubling the countermeasure engagements that can respond to missile threat. \nPerformance & Efficiency - Increases mission flight profiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Degradable Chaff & Low Frequency Chaff (M1\/M839)"
                                    },
                                    "Description": {
                                        "val": "Develop chaff that will: \n1) After dispense, lose its RF (Radio Frequency) component.  2) Disperse and bloom rapidly with minimal clumping and birdnesting even when used at low speeds from a hovering helicopter.  3) Enhance coverage in the low frequency range.  4) Type classify RR170 Chaff for Army use.  Justification: the long persistence of Chaff causes interference with fire control and air traffic control radar.  Impact: Chaff will continue to interfere with control and tracking radar, limiting its use in the field and training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.818"
                                            },
                                            "Text": {
                                                "val": "Degradable Chaff & Low Frequency Chaff"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "The operationally degradable chaff will address operational and training issues with chaff persistence. \nPerformance - Increase frequency coverage where current Chaff lacks.  \nPerformance - Reduction of clumping and birdnesting will make the chaff more effective. \nSafety - Reduce interference with Traffic Control radars and aircraft radar systems. \nEnvironmental - Mitigates impact to farm animals that eat active dipoles after chaff deployment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demolition Initiator Packaging - Skin Pack (MDI DODICS)"
                                    },
                                    "Description": {
                                        "val": "Current spool design is bulky, hard to conceal in urban environments and has potential for tangling.  This project will develop a lighter, easily deployable and more reliable deployment method.  It will have the added advantage of being compatible with Explosive Ordnance Disposal robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.055"
                                            },
                                            "Text": {
                                                "val": "Develop a lighter, easily deployable and more reliable deployment method"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                    },
                                    "Description": {
                                        "val": "This effort incorporates modern materials and insensitive explosives to provide a safer, producible concussion grenade. Use of the MK3A2 offensive grenade has been suspended due to age and safety issues. The current MK3A2 can expose the Soldier to toxic levels of asbestos. War fighters cannot safely employ the offensive grenade. Alternate munitions such as the M84 do not satisfy User needs for incapacitation of the enemy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Finalized the redesign of the MK3A2 grenade;perform residual tests to justify the ECPs required to update the TDPL (Technical Data Package List); update associated documents (SDZ (Surface Danger Zone), FHC (Final Hazard Classification) etc.); Justification: There was  funding to remove the existing safety hazard (asbestos) in the MK3A2.  In addtion, the User has stated this capability is still required.  Impact: If not funded, the MK3A2 redesign would not occur and the safety Hazard would still exist. In additon, no new MK3A2s would be allowed to be manufactured to the old TDP (Technical Data Package)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "1) Fabrication of Multi Cavity Die and proveout.  2) Fuze and Packaging procurement.  3) Injection molding of 250 grenades.  4) LAP and Marking of grenades.  5) Engineering level testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Claymore Force-on-Force TADSS Trainer"
                                    },
                                    "Description": {
                                        "val": "Claymore Force-on-Force TADSS Trainer"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.204"
                                            },
                                            "Text": {
                                                "val": "Developed an improved Claymore Force-on-Force Trainer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "Develop an improved Claymore Force-on-Force Trainer.  While the Claymore is one of the most popular items used by the soldier, the system does not have a TADSS trainer with sight, sound & MILES capability. Development of an improved Claymore trainer will allow Claymore to be trained at CTCs and will provide more realistic and effective training for the user when they are training Claymore as an end item and when training Claymore as initiated by Spider."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "297"
                    },
                    "ProjectTitle": {
                        "val": "Mun Survivability & Log"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.974"
                        },
                        "CurrentYear": {
                            "val": "13.804"
                        },
                        "BudgetYearOne": {
                            "val": "7.544"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.544"
                        },
                        "BudgetYearTwo": {
                            "val": "6.012"
                        },
                        "BudgetYearThree": {
                            "val": "5.752"
                        },
                        "BudgetYearFour": {
                            "val": "9.094"
                        },
                        "BudgetYearFive": {
                            "val": "9.350"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply.  Key thrusts are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements.  Within each thrust, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness.  Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated.  The early stages of force deployment are especially critical.  Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets.  These areas and distribution nodes contain the only available munitions stocks in theater.  Loss of these munitions could cripple the force, jeopardize the mission, and result in high loss of life.  This project mitigates vulnerabilities and ensures a survivable fighting force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Predictive Life"
                                    },
                                    "Description": {
                                        "val": "This program will demonstrate technologies and algorithms that can help assess munitions serviceability based upon aggregate environmental exposures, system cycling and munition degradation models.  The program will provide life cycle management tools for risk mitigation strategies, while reducing testing, inspection & surveillance required and improving weapon system reliability & and warfighter effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.990"
                                            },
                                            "Text": {
                                                "val": "Completed International Standards Organization (ISO) container extreme climatic location thermal data collection and simulation for development of algorithms that accurately estimate the temperature exposure of munitions based on location, storage area type, and munition type.  Based on reliability and risk threshold levels developed from ammunition database analysis, developed algorithmic procedures that can be applied periodically to evaluate reliability and risk and determine functionality inspection requirements for the .50 caliber ammunition family.  Conducted accelerated aging of propellant and calibrated an embedded propellant reliability sensor that enables real-time monitoring of the effects of environmental exposure on ammunition propellant stability\/reliability.  Conducted validation testing of passive credit card sized temperature sensor prototypes (Therm-E-Log)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.530"
                                            },
                                            "Text": {
                                                "val": "Complete all ISO container thermal data collection and incorporate temperature exposure algorithmic models of munitions based on location, storage area type, and munition type into the Munitions History Program.  Conduct validation testing of the reliability and risk evaluation algorithmic procedures for .50 caliber ammunition family and begin development of threshold levels for 5.56mm and 7.62mm caliber ammunition families.  Integrate propellant sensor device with propellant packaging, and prepare to conduct demonstration.  Develop imaging based application to increase the fidelity of the estimation of ammunition time\/temperature exposure for Therm-E-Log passive temperature sensor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.059"
                                            },
                                            "Text": {
                                                "val": "Develop reliability and risk algorithms and conduct validation testing for 5.56mm and 7.62mm caliber ammunition families and develop threshold levels for hand grenades and 40mm caliber ammunition families.  Conduct brilliant green propellant sensor demonstration.  Conduct long term propellant sensor validation testing for resistance based sensor.  Conduct market survey of passive Radio Frequency Identification and low cost active environmental sensors for munitions, select viable candidates, and test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Containerization Program"
                                    },
                                    "Description": {
                                        "val": "This program will demonstrate next generation packaging, with standardized dimensions\/interfaces, that considers unit of issue, permits easy reconfiguration and that is reusable, nestable, automation friendly, and survivable. This new packaging (Ammoblocks) will permit the safe packing and shipping of more and different types of ammo together in user tailored loads; facilitate rapid, less labor intensive reconfiguration and resupply; and facilitate automation upgrades of load\/assemble\/pack and battlefield resupply operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Fabricated hardware and test designs for flexible ammunition palletized load unitization techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Munitions Packaging"
                                    },
                                    "Description": {
                                        "val": "This program will demonstrate upgrades to existing  packaging components and materials to improve legacy ammunition survivability.  These upgrades will enhance ammunition survivability and reliability, improve field ammunition operations, and improve packaging producibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.644"
                                            },
                                            "Text": {
                                                "val": "Fabricated prototypes of high density polyethylene (HDPE) cylindrical containers as replacements for current 120mm tank and 120mm\/81mm mortar packaging.  Down-selected final design and initiated fabrication of improved prototype low cost ammunition bandoleers.  Conducted a redesign of plastic sealed pouches for 5.56mm ammunition that will reduce production costs and improve container volume usage efficiency.  Conducted testing and determined best candidates of alternative Environmental Protection Agency registered preservatives for wood ammunition packaging materials that if validated will increase the quantity and types of preservative available and reduce life-cycle costs.  Conducted evaluation of packaging test requirements and identified requirements to challenge through a down-selection process; identified any potential changes that will streamline ammunition packaging test plans and procedures and eliminate redundancies while reducing time and resources required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.362"
                                            },
                                            "Text": {
                                                "val": "Conduct engineering testing of HDPE cylindrical containers as lighter, less expensive replacements for current 120mm tank and 120mm\/81mm mortar packaging and complete design modifications.  Develop the design of a plastic polymer container for 5.56mm ammunition containers to be used in conjunction with plastic sealed ammunition pouches to reduce packaging weight and production costs.  Develop updates to military and commercial standards and specifications for alternative Environmental Protection Agency registered preservatives for wood ammunition packaging materials.  Implement packaging test requirement changes that eliminate redundancies while continuing to research the feasibility of changing more technically complex physical characteristic requirements.  Perform a market research study on readily available Eco-Friendly packaging solutions in industry as well as technologies in development for potential application to ammunition packaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.502"
                                            },
                                            "Text": {
                                                "val": "Complete design and testing of a plastic polymer container for 5.56mm ammunition containers to be used in conjunction with plastic sealed ammunition pouches to reduce packaging weight and production costs.  Coordinate the review and approval of updates to military and commercial standards and specifications for alternative Environmental Protection Agency registered preservatives for wood ammunition packaging materials.  Incorporate packaging test requirement changes for more technically complex physical characteristic requirements into military standards and coordinate the specification review and approval process.  Perform a phase II study of Eco-Friendly packaging solutions that will include further development of promising technologies as well as performance testing on candidate products that may be incorporated into actual end item designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM) Integration Program"
                                    },
                                    "Description": {
                                        "val": "Demonstrate multiple IM technologies and integrate into end item(s) to improve munitions survivability and warfighter safety.  IM Technologies, using State-of-the-Art materials, will be developed in the areas of warhead, propulsion and propellants, explosives, packaging, and barriers.  In addition, modeling and simulation will be used to reduce development and testing costs.  Efforts will increase the number of IM compliant ammunition items fielded to mitigate munitions reaction to unplanned stimuli such as fire, fragments, cook-off, bullets, adjacent munitions reaction (sympathetic detonation), and shape charge jet attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.199"
                                            },
                                            "Text": {
                                                "val": "Optimized the pressing parameters and waxing content of pressed IMX-104 explosive for use in M795 IM Precision Guidance Kit (PGK) compatible projectiles.  Produced a melt cast Insensitive Munition (IM) explosive to replace Comp B explosive in the M67 Grenade; conducted individual grenade lethality and sensitivity tests; developed first generation packaging designs and concepts to allow grenade venting technology to function correctly.   Manufactured Modular Artillery Charge System (MACS) Containers with Sealed Seam Technology (SST) and completed IM and limited sequential rough handling tests.  Developed the corner testing apparatus, for the 30mm M789, to determine the effectiveness of PAX-30 explosive and completed 2D modeling and simulation of the M789 liner.  Performed slow-cook-off test and validated cartridge case design for 30mm ammo. Developed, for Hand Held Signals, a packaging container Catch Cage enclosure and conducted multiple IM testing and modeling and initiated simulation effort of tether design for cover of container.  Fabricated and tested, for the 105mm M1 Artillery round, a Cartridge Case Adapter kit, IM enhanced dunnage, Ionomer Vent Window packaging container, and meltable plastic projectile plug.  Validated Pallet barrier design and performed limited rough handling for the 105mm round.  Developed and performed engineering test of IM enhanced internal container dunnage for the 30mm M789 and 40mm M430A1.  Demonstrated the viability of producing DEMN explosive in a one step process.  Determined the maximum ratio of HMX (a less sensitive explosive) to DNMT explosive to use in formulation for munitions requiring IM explosives with small critical diameter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.300"
                                            },
                                            "Text": {
                                                "val": "Transition to PMs optimized IMX-101 loading parameters and methods for M795 Artillery rounds.  Down select the most beneficial tank ammunition container IM venting technology between seal seamed or precision metallic bonding.  Finalize and perform IM and engineering performance test of pressed IMX-104 explosive and transition pressed IMX-104 for use in M795 IM Precision Guidance Kit (PGK) compatible projectiles.  Transition to M67 Grenade IM Program a melt cast IM explosive to replace Comp B explosive.  Transition to PM IM enhanced Flexible explosive for Demo items.  Conduct, in the M67 Grenade, grenade lethality and sensitivity tests and finalize packaging design.  Prove out multiple propellant bed configurations for large caliber ammunition.  Down select most optimal two formulations for medium caliber ammunition.  Finalize first phase to prove out propellant high sheer process to enhance IM propellants for medium caliber.  Down select methods and equipment to produce eutectic components for IM munitions requiring eutectic venting technology.  Develop, for the 30mm M789, IM enhanced internal dunnage and perform engineering and IM tests.  Perform IM tests and transition a pressed explosive to the 30mm M789 IM Program.  Finalize design and testing, for Hand Held Signals, of the packaging container Catch Cage enclosure and produce final prototypes with production level quality.  Conduct, for the 30mm M789 program, performance testing and validate final design of IM enhanced cartridges cases and warhead adapter to separate fuze from projectile body.  Initiate, for 30mm Cartridge, IM integration tests and transition technology to PM.  Initiate integrated IM and performance tests for the 40mm M430A1 Cartridge.  Finalize Pallet barrier design and perform rough handling for the IM enhanced 105mm M1.  Produce DEMN explosive in a one step process and initiate IM and performance tests.  Produce 100 lbs of DNMT explosive to use in formulation for munitions requiring IM explosives with small critical diameter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.379"
                                            },
                                            "Text": {
                                                "val": "Transition technologies to produce IM compliant 105mm M1 Rounds.  Finalize, for 30mm Cartridge, IM integration tests and transition technology to PM.  Complete final integration IM and performance tests for the 40mm M430A1 Cartridge. Finalize propellant lab scale methodologies and testing hardware.  Transition processing methodologies and IM propellants to medium and large caliber ammo programs.  Transition to PMs base process and methodologies to produce affordable eutectic components.  Prove out optimized DNMT and transition to applicable munitions requiring small critical diameter explosives.  Update and revise the PEO Ammunition IM Strategic Plan to determine the current IM compliance status of all ammunition families and identify opportunities for improvement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammo Provider"
                                    },
                                    "Description": {
                                        "val": "This program demonstrates technologies that will assure a survivable munitions logistics system by increasing distribution velocity and protecting ammo storage areas.  Technology areas to be investigated include ammunition asset visibility (including environmental sensors, marking technologies, and supply chain modeling), ammunition management (including improvements in stockpile surveillance and condition based management), sustainment (including pre-configured loads (soldier to unit size), field ammo reconfiguration capability, robotic handling, and improved load building capability ), and force protection (including site planning software and field storage protection)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.641"
                                            },
                                            "Text": {
                                                "val": "Incorporated re-warehousing time and cost planning capability and conducted system testing and demonstration of a prototype ammunition igloo storage optimization software tool.  Completed operational testing and warfighter evaluation of the helicopter delivered enhanced speedbag.  Conducted engineering testing and performed design modifications of a munitions environmental health monitoring system.  Completed modeling and simulation of the reaction of tactical ammunition configured loads to unplanned stimuli in order to assess the propagation potential and degree of violence expected.  Completed market survey of commercial airbags for use as a replacement for wood dunnage in ammunition shipping containers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.612"
                                            },
                                            "Text": {
                                                "val": "Perform development work to adapt developed speedbag technologies to new mission areas that include heavier payloads, higher drop heights, and variable impact velocities.  Complete updated design qualification testing on the munitions environmental health monitoring system.  Conduct bullet and fragment impact testing for best and worst case scenario reactions and develop guidelines for building more survivable tactical ammunition configured loads.  Complete performance and user testing and evaluation of commercial airbags for use as a replacement for wood dunnage in ammunition shipping containers and develop business case analysis for implementation.  Evaluate the feasibility of utilizing Raman spectroscopy to determine the remaining useful life of ammunition propellants and significantly reduce the cost of surveillance testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.604"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.604"
                                            },
                                            "Text": {
                                                "val": "Conduct safety testing on the speedbag variants that will validate the new system designs.  Conduct fragment impact testing on various materials to determine possible integration into Joint Modular Intermodal Container (JMIC) panels to provide enhanced survivability JMICs.  Conduct safety testing of airbag dunnage systems and coordinate the review and approval of changes to DOD ammunition transportation procedures allowing their use in van trailer shipments.  Verify that the evaluation of the remaining useful life of ammunition propellants using Raman spectroscopy is possible with a handheld reader in a field environment and implement for surveillance testing.  Determine concept for utilizing additive manufacturing to produce ammunition packaging dunnage on the battlefield to reduce logistics footprint and conduct market survey."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "857"
                    },
                    "ProjectTitle": {
                        "val": "DoD Explosives Safety Standards"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.959"
                        },
                        "CurrentYear": {
                            "val": "1.835"
                        },
                        "BudgetYearOne": {
                            "val": "1.826"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.826"
                        },
                        "BudgetYearTwo": {
                            "val": "1.757"
                        },
                        "BudgetYearThree": {
                            "val": "1.759"
                        },
                        "BudgetYearFour": {
                            "val": "1.794"
                        },
                        "BudgetYearFive": {
                            "val": "1.829"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "No FY 2016 Funding: Explosive and Munitions Test and Analysis Tools."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program supports the Research, Development, Test, and Evaluation efforts of the DoD Explosive Safety Standards Board.  It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards.  Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion-resistant facility design procedures, and personnel hazard\/protection criteria."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive and Munitions Tests"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Text": {
                                                "val": "Developed improved explosives and munitions tests and characterization data.  Specifically, continue development  of improved gap tests for rocket motors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.113"
                                            },
                                            "Text": {
                                                "val": "Develop improved explosives and munitions tests and characterization data.  Specifically, continue development of  improved gap tests for rocket motors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safety Guidelines"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.485"
                                            },
                                            "Text": {
                                                "val": "Developed improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Prepared revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.130"
                                            },
                                            "Text": {
                                                "val": "Develop improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Prepare revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.826"
                                            },
                                            "Text": {
                                                "val": "Will develop improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Prepare revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety Database"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.385"
                                            },
                                            "Text": {
                                                "val": "Conducted other hazards analyses and expand\/automate explosives safety databases.  Developed improved Explosives Safety Mishap Analysis Module with links to accident reports."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis Tools"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.929"
                                            },
                                            "Text": {
                                                "val": "Developed and improved risk based analysis tools for explosives safety.  Developed sequence of operations prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.592"
                                            },
                                            "Text": {
                                                "val": "Develop and improve risk based analysis tools for explosives safety.  Develop sequence of operations prototype."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "858"
                    },
                    "ProjectTitle": {
                        "val": "Army Explosives Safety Management Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.537"
                        },
                        "CurrentYear": {
                            "val": "0.547"
                        },
                        "BudgetYearOne": {
                            "val": "0.542"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.542"
                        },
                        "BudgetYearTwo": {
                            "val": "0.546"
                        },
                        "BudgetYearThree": {
                            "val": "0.543"
                        },
                        "BudgetYearFour": {
                            "val": "0.643"
                        },
                        "BudgetYearFive": {
                            "val": "0.655"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project establishes, validates or modifies explosives technical safety requirements per Department of Defense Pamphlet 385-64, Ammunition and Explosives Safety Standards.  Project activities promote RDT&E of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Risk based explosives safety criteria"
                                    },
                                    "Description": {
                                        "val": "Development of risk based explosives safety criteria that will aid commanders and safety personnel in the transition from regulation to risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.130"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.135"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.130"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.130"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of enhanced protective structure designs"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced protective structure designs that improve the survivability of Army personnel, facilities and equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.196"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of explosive safety tools"
                                    },
                                    "Description": {
                                        "val": "Develop explosive safety tools for use by Army personnel. Explosive safety tools allow commanders and safety personnel to make explosive safety decisions using risk management methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.211"
                                            },
                                            "Text": {
                                                "val": "Continued development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.212"
                                            },
                                            "Text": {
                                                "val": "Continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.212"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.212"
                                            },
                                            "Text": {
                                                "val": "Will continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "859"
                    },
                    "ProjectTitle": {
                        "val": "Life Cycle Pilot Process"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.405"
                        },
                        "CurrentYear": {
                            "val": "19.608"
                        },
                        "BudgetYearOne": {
                            "val": "5.101"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.101"
                        },
                        "BudgetYearTwo": {
                            "val": "5.053"
                        },
                        "BudgetYearThree": {
                            "val": "5.434"
                        },
                        "BudgetYearFour": {
                            "val": "5.523"
                        },
                        "BudgetYearFive": {
                            "val": "5.610"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the implementation of the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan through technology investigations, model based process controls, pilot prototyping, and industrial assessments.  It will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements, and address the ability of the production base to rapidly and cost effectively produce quality products.  Cost Reduction is an important part of the Life Cycle Pilot Process (LCPP).  LCPP provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the Munitions Industrial Base transformation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "FY 2014 Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Completed development and demonstration of a neutron generator and digital radiography imaging system for the non-destructive testing of ammunition items.  Completed R&D, testing, characterization, and prototype development of advanced materials and manufacturing technologies to address Army Additive Manufacturing technology gaps.  Effort also includes in-house engineering costs to support to Congressional Add."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2015 Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "FY 2015 Congressional Add titled Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Cost Thrust Area"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks out new opportunities to reduce overall manufacturing costs of ammunition and ammunition components.  RDTE efforts will review and analyze legacy manufacturing processing for opportunities to integrate new technology and lean manufacturing processes to reduce cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.794"
                                            },
                                            "Text": {
                                                "val": "Completed multi-use ultrasound probe modifications and installed at Holston Army Ammunition Plant (AAP).  Baselined current configurations of foamed starter patch.  Established stakeholder support and finalized execution plan for Insensitive Munitions Explosive (IMX) waste-water simulation phase 1.  Completed design of multi-use ultrasound probe for explosive process control project.  Evaluated new technology for legacy processes to reduce overall production costs for the Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.837"
                                            },
                                            "Text": {
                                                "val": "Complete multi-use ultrasound probe explosive process control project, foamed starter patch and Nitrocellulose (NC) model verification.  Develop and implement process to de-lump nitroguanidine cake.  Initiate shape charge jet disrupter manufacturing process development. Evaluate new technology for legacy processes to reduce overall production costs for the Army."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.319"
                                            },
                                            "Text": {
                                                "val": "Will complete shape charge jet disrupter.  Evaluate new technology for legacy processes to reduce overall production costs for the Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Single Point Failures (SPFs)"
                                    },
                                    "Description": {
                                        "val": "Project thrust area efforts will employ manufacturing technologies to address SPFs.  These projects are part of the overall strategy to reduce the number of SPFs in the National Technology Industrial Base (NTIB).  Additionally, thrust area efforts address ammunition manufacturing capability shortfalls.  This area leverages RDTE accomplishments and product knowledge to satisfy manufacturing requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.853"
                                            },
                                            "Text": {
                                                "val": "Completed environmentally benign colored smoke project.  Completed Phase 1 of Commercial Off the Shelf (COTS) primer for grenade project.  Completed initial efforts for mitigation of single point failure for HF-1 steel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.012"
                                            },
                                            "Text": {
                                                "val": "Complete mitigation of High Fragmentation-1 (HF-1) Steel single point failure.  Complete COTS primer project.  Initiate mitigation of antimony sulfide and smoke pot lid SPFs.  Continue development of manufacturing technology and processes for SPFs.  Efforts will address source of supply problems within the NTIB.  Initiate antimony sulfide and smoke pot lid mitigation plans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.749"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.749"
                                            },
                                            "Text": {
                                                "val": "Will complete mitigation of single point failures for antimony sulfide and smoke pot lid.  Continue development of manufacturing technology and processes for SPFs.  Efforts will address source of supply problems within the NTIB."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Technology for Industrial Base Transformation"
                                    },
                                    "Description": {
                                        "val": "Project thrust area identifies and develops technologies that can be utilized at multiple government and private ammunition manufacturing locations to transform the NTIB."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.758"
                                            },
                                            "Text": {
                                                "val": "Completed method to mark Insensitive Munition (IM) filled munitions, IMX waste treatment pilot process at Iowa AAP and improved Fluid Energy Mill (FEM) for High Melt Explosives (HMX) based formulations.  Installed ultrasound analyzer and initiated testing.  Completed kick off and site selection phases for Counter Current Ion Exchange project.  Completed in-house government engineering efforts for NC nitration model verification.  Investigated potential technologies to transform key manufacturing processes in the NTIB."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.759"
                                            },
                                            "Text": {
                                                "val": "Complete ultrasound analyzer for process control in explosives manufacturing, NC model verification and Counter Current Ion Exchange for nitrate laden waste treatment.  Initiate multi-axis platform for energetic manufacture, ultrasound applications to propellant extrusion and Metastable Interstitial Composite (MIC)\/green primer pilot scale manufacturing.  Investigate potential technologies to transform key manufacturing processes in the NTIB.  Continue investigations, develop and document manufacturing technology for transition to the NTIB."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.033"
                                            },
                                            "Text": {
                                                "val": "Will complete multi-axis platform for manufacture of energetic systems and ultrasound inspection of propellant during extrusion.  Continue MIC\/green primer pilot scale manufacturing.  Continue investigations, develop and document manufacturing technology for transition to the NTIB."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "862"
                    },
                    "ProjectTitle": {
                        "val": "Indirect Fire And Fuze Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.334"
                        },
                        "CurrentYear": {
                            "val": "7.894"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project 862 Indirect Fire and Fuze Technology transferred to PE 0607131A - Weapons and Munitions Product Improvement, Project ER5 in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "In FY 2014 and 2015, this program will identify, study, analyze and support enhanced lethality, range extension and standardization to improve target engagement effectiveness; increase reliability, safety, and exportability; and reduce taxpayer costs including elimination of sole source supply of indirect fires ammunition materials as well as studies and analyses of such technology solutions in comparison to current stock pile indirect fire conventional munitions and their associated production processes. Additionally, environmental impacts of legacy propellants, explosives and metal parts will be studied. Replacement of hazardous materials such as Ammonium Perchlorate, Diphenylamine, Lead, etc. and addition of propellant anti-tubewear additives will remain a focus. This program supports the standardization and interoperability of legacy and new production ammunition to maximize munitions battlefield interchangeability\/compatibility between 52 and 39 caliber guns under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU) as well as rifled and smooth-bore mortars. Maximizing standardization, interchangeability, and exportability will potentially increase FMS sales of US products to maintain domestic production and economies of scale.\n\nThis program will also identify, study, analyze and support fuzing and safe and arm devices. This program will implement these technologies into fuzing systems to preclude obsolescence, maximize standardization, enhance performance, and improve the safety and exportability of existing munitions. The project addresses two major areas: (1) analysis and (2) block upgrades. Analysis efforts will identify second sources for fuzing systems that may reduce cost by providing competition, and maintain production when sources or parts are no longer available. It will also allow for the performance enhancement of current ammunition items by conducting studies of major fuze components to detect and identify latent defects. The second major area is block upgrades, which will identify and perform studies on improvements to fuzes; increase commonality of fuze components and requirements. Block upgrades will enable the introduction of the latest technologies into fuzing, keep the fuzing design current to avoid obsolescence issues, and add capabilities.\n\nIn FY 2016, this program supports operations, studies, and analyses required for integration of fuze technology improvements into munitions as well as general research, development, test and evaluation of indirect fire weapons and munitions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Indirect Fire & Fuze ARDEC Support."
                                    },
                                    "Description": {
                                        "val": "Analysis: Evaluated Micro Electro-mechanical Systems (MEMS) component alternatives to increase sources of supply and lower cost; affects 40mm High Explosive Point Detonating grenade munitions. Conduct engineering test to verify MEMS component alternatives. Study improvements on M734A1\/M783 mortar fuze delay primer. Block Upgrades: Determined that Proximity Sensor can physically fit in existing 30mm HEDP M789 round and continued fabrication of fuze components.  Integrate new Proximity Sensor components and conduct engineering test to prove-out design. Analyze proximity fuze electronic upgrades for High Explosive and White Phosphorus mortar rounds. Test packing clip improvement on full range mortar training rounds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades: Evaluated Micro Electro-Mechanical Systems (MEMS) component fabrication improvements to increase yield and lower cost. Conducted engineering tests to verify MEMS fabrication improvements. Studied improvements on M734A1\/M783 mortar fuze delay primer for increased delay mode reliability. Conducted evaluations on electronics upgrades to M734A1 mortar fuze for improved safety and increased performance reliability. Conducted evaluations and prove-out packing clip improvement on mortar training rounds.  Studied M734A1\/M783 impact switch upgrade concept for performance improvements. Identify 40mm M550 setback spring interface improvements for increased throughput. Study improvements on fuze setter interface."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.808"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades: Evaluated Micro Electro-Mechanical Systems (MEMS) component fabrication improvements to increase yield and lower cost. Conduct engineering tests to verify MEMS fabrication improvements. Study improvements on M734A1\/M783 mortar fuze delay primer for increased delay mode reliability. Conduct evaluations on electronics upgrades to M734A1 mortar fuze for improved safety and increased performance reliability. Conduct evaluations and prove-out packing clip improvement on mortar training rounds.  Study M734A1\/M783 impact switch upgrade concept for performance improvements. Identify 40mm M550 setback spring interface improvements for increased throughput. Study improvements on fuze setter interface."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Indirect fire & Fuze PM CAS Support"
                                    },
                                    "Description": {
                                        "val": "Indirect Fire: \nActivities include study, analyze and support of enhanced lethality technology to improve effectiveness and eliminate sole source High Fragmentation -1 steel in indirect fires. Activities include examination of alternative technologies, materials and processes. Study, analyze and support of candidate nonlethal, nontoxic multispectral smoke technologies to eliminate hazardous smoke in indirect fires screening missions. Activities include examination of alternative technologies, materials and processes. Study, retain and validate the effectiveness of M821 mortar cartridge lethality due to use of Insensitive Munitions in lieu of comp B HE fill. Safety improvements to conventional munitions. Joint NATO\/Allied Cannon Munitions Interchangeability analysis and support of battlefield interchangeability\/compatibility of munitions and associated enabling technologies between 52 and 39 caliber 155mm guns. Activities include ballistic testing including firing tables, safety, reliability and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.534"
                                            },
                                            "Text": {
                                                "val": "Activities included study, analyze and support of enhanced lethality technology to improve effectiveness and eliminate sole source High Fragmentation -1 steel in indirect fires. Activities included examination of alternative technologies, materials and processes. Studied, analyze and support of candidate nonlethal, nontoxic multispectral smoke technologies to eliminate hazardous smoke in indirect fires screening missions. Activities included examination of alternative technologies, materials and processes. Studied, retain and validate the effectiveness of M821 mortar cartridge lethality due to use of Insensitive Munitions in lieu of comp B HE fill. Made safety improvements to conventional munitions. Joint NATO\/Allied Cannon Munitions Interchangeability analyzed and supported of battlefield interchangeability\/compatibility of munitions and associated enabling technologies between 52 and 39 caliber 155mm guns. Activities included ballistic testing including firing tables, safety, reliability and performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.086"
                                            },
                                            "Text": {
                                                "val": "Activities include study, analyze and support of enhanced lethality technology to improve effectiveness and eliminate sole source High Fragmentation -1 steel in indirect fires. Activities include examination of alternative technologies, materials and processes. Study, analyze and support of candidate nonlethal, nontoxic multispectral smoke technologies to eliminate hazardous smoke in indirect fires screening missions. Activities include examination of alternative technologies, materials and processes. Study, retain and validate the effectiveness of M821 mortar cartridge lethality due to use of Insensitive Munitions in lieu of comp B HE fill. Safety improvements to conventional munitions. Joint NATO\/Allied Cannon Munitions Interchangeability analysis and support of battlefield interchangeability\/compatibility of munitions and associated enabling technologies between 52 and 39 caliber 155mm guns. Activities include ballistic testing including firing tables, safety, reliability and performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F21"
                    },
                    "ProjectTitle": {
                        "val": "Direct Fire Technology and NATO Ammo Eval"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.799"
                        },
                        "CurrentYear": {
                            "val": "6.863"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project F21 Direct Fire Technology and NATO Ammo Eval transferred to PE 0607131A - Weapons and Munitions Product Improvement Programs, Project ER6 Close Combat Technology in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program funding will be used to support direct fire ammunition from small caliber ammunition, 40mm grenade, medium caliber cannon ammunition and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy and general product improvements. In addition, this program assures complete interchangeability of direct fire ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance. Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC).  \n\nFY 2015 funds will support small caliber propellant optimization to improve propellant temperature stability, reduce muzzle flash signature and fouling. In addition, lightweight cartridge cases will continue to be investigated. A more lethal and safer design for 40mm grenades will be built and tested. An improved 30mm training round for the Apache helicopter will allow pilots to see where the rounds strike. Warhead improvements for the 30mm Apache ammunition are also under development. A number of studies on potential improvements for training ammunition and better primers will be conducted. A study to improve the safety of the fuzes used in the 120mm Abrams tank cannon will also be initiated.\n\nFY 2016 funds will continue to be used for development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Propellant Optimization"
                                    },
                                    "Description": {
                                        "val": "Develop optimized spherical propellant for reduced muzzle signature, fouling and chamber pressure. Cartridges containing alternate flash suppressants and deterrents will be manufactured and tested to determine optimum propellant composition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Evaluated improvements that reduce hazardous materials in manufacturing, small caliber propellant optimization studies and testing of temperature stability technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.780"
                                            },
                                            "Text": {
                                                "val": "Optimize and evaluate improvements to flash suppression fouling and barrel wear technology for small caliber propellants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Observable Traced Projectiles"
                                    },
                                    "Description": {
                                        "val": "Tracers have a number of drawbacks; largely they give away the position of the shooter during firing. Advancement in technology has improved tracer technology which potentially eliminates, mitigates shortfalls of current tracers and improves safety and soldier survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.539"
                                            },
                                            "Text": {
                                                "val": "Continued engineering prototype manufacturing, development, and testing. Downselected to most promising candidates conducting engineering studies to improve manufacturing readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Ammunition"
                                    },
                                    "Description": {
                                        "val": "Investigate alternate cartridge case materials for cost and weight savings over conventional brass cartridge cases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Text": {
                                                "val": "Continued to develop down selected technology candidates. Worked jointly with other services towards common solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Perform government testing and continued improvement of candidate designs. Two test events using one hundred fifty thousand cartridges are planned."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This program assures complete interchangeability of small caliber and automated cannon-caliber, and 40mm grenade ammunition and weapons among NATO countries to achieve the associated logistic, strategic and tactical advantages."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Supported NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Support NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M433 Warhead Improvement"
                                    },
                                    "Description": {
                                        "val": "40mm: Improve lethality (fragmentation) of the M433 grenade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Initiated qualification of improved M433 cartridge."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.441"
                                            },
                                            "Text": {
                                                "val": "Complete component and integration subsystem and system testing. Three hundred cartridges will be built and tested to complete qualifications of the cartridge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Practice Spotter Technology Insertion"
                                    },
                                    "Description": {
                                        "val": "Training Cartridge with impact initiated spotting charge. Goal is visible signature upon impact under all conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Improved the design to facilitate high volume production and optimize design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Text": {
                                                "val": "The FY 2015 effort is to define and develop a pyrotechnic which will meet the User's reliability requirements. The FY 2015 effort will also focus on a Perchlorate free green pyrotechnic."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved M789 Lethality, Warhead fragmentation improvement"
                                    },
                                    "Description": {
                                        "val": "Improve M789 warhead fragmentation for lethality by utilizing fragmentation sleeves, scoring or other technologies within the warhead to promote more efficient fragmentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Incorporated the best design into the M789 warhead and performed testing to support an air worthiness release.  Provided warheads with shear liners for a combined lethality demonstration with the Proximity sensor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Developmental and demonstration testing of the M789 warhead, TDP development and fragmentation liner integration into shaped charge warhead."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DBX-1 Lead free replacement for Lead Azide"
                                    },
                                    "Description": {
                                        "val": "Integrate environmentally friendly lead free primary explosives into M789. Demonstration in this form factor will enable transition to other munitions of larger size."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Iniate lead free testing into M789."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved .300 caliber sniper ammunition"
                                    },
                                    "Description": {
                                        "val": "Improve .300 caliber sniper ammunition to provide increased capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Refined and evaluated cartridge design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "120mm Fuze Safety Improvement"
                                    },
                                    "Description": {
                                        "val": "Initiate efforts to incorparate a second independant safety into the fuze for current 120mm high explosive ammunition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Focused on modifying fuze to meet current safety standards. Initiated design efforts to incorporate a pressure switch into the current fuze for the M830 and M830A1. Additional efforts was required to address obsolescence issues associated with the fuze."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extruded Propellant"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate a government owned alternate propellant for M855A1 using existing extruded propellant technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.510"
                                            },
                                            "Text": {
                                                "val": "Modeled interior ballistics and develop new formulations for 5.56mm, focusing on improved performance through lower variability, erosivity, and increased range via higher velocity at acceptable pressures. Developed pilot scale manufacturing process, produce samples, and demonstrate performance in subscale development testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.273"
                                            },
                                            "Text": {
                                                "val": "Extruded Propellant will be closing out Phase I by concluding designs, propellant iterations, initial testing and culminating in a Preliminary Design Review (PDR). At the conclusion of PDR, the program will move into Phase II\/III which consists of larger scale testing, production testing, and working actions necessary for TDP finalization and ECP draft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Caliber Ammunition Training Range Impact Reduction Engineering Study"
                                    },
                                    "Description": {
                                        "val": "Perform an engineering study on the feasibility of reducing the surface danger zone of small caliber training ammunition while maintaining a ballistic match to the combat ammunition out to maximum effective range of the combat ammunition. The results of the study will assist in establishing the baseline requirements for future training ammunition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Conducted literature search, develop and run models and simulations, perform material analysis, conduct market survey, prepare recommended requirements and prepare program proposals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Testing of 7.62mm ball and trace potential candidates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "40mm Pyrotechnics Cartridges"
                                    },
                                    "Description": {
                                        "val": "Improve reliability and hang time."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Initial phase of multiyear effort starting with reliability and hang time improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Close Combat Mission Capability Kit (CCMCK)"
                                    },
                                    "Description": {
                                        "val": "CCMCK is a user installed weapons modification system, which allows the Soldier to employ weapons at a short range for force-on-force training using low velocity marking ammunition while precluding the weapon from firing standard service ammunition. The system provides normal environmental\/weapon employment cues and immediate target feedback through force-on-force, interactive live fire scenario tasks, and mission execution."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.010"
                                            },
                                            "Text": {
                                                "val": "Engineering study to analyze unmet user requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metastable Intermolecular Composite (MIC) Primer Lead free primer"
                                    },
                                    "Description": {
                                        "val": "Integrate environmental friendly lead free primary explosives within the primer of the M789 and remove lead Styphnate. Work small caliber 7.62mm and .50cal testing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.109"
                                            },
                                            "Text": {
                                                "val": "Support local functional testing of 7.62mm and .50cal primer mix. Also supports additional contracting cost for 7.62mm and .50cal tooling for pilot line."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F24"
                    },
                    "ProjectTitle": {
                        "val": "Conventional Munitions Demil"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.458"
                        },
                        "CurrentYear": {
                            "val": "8.759"
                        },
                        "BudgetYearOne": {
                            "val": "17.591"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.591"
                        },
                        "BudgetYearTwo": {
                            "val": "11.547"
                        },
                        "BudgetYearThree": {
                            "val": "13.311"
                        },
                        "BudgetYearFour": {
                            "val": "13.523"
                        },
                        "BudgetYearFive": {
                            "val": "13.792"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Conventional Munitions Demilitarization technology program supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service Research and Development (R&D) program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demil and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A).  The program goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demil capabilities and processes.  Project F24 includes activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement R&D projects; (2) to sustain product and process improvement and support for existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition R&D products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out project activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Destruction"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on destruction of munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.588"
                                            },
                                            "Text": {
                                                "val": "Installed, verified and completed evaluation of a decineration process for Cartridge Actuated Devices\/ Propellant Actuated Devices (CADS\/PADS) at Tooele Army Depot (TEAD).  Designed and fabricated subsystems for the upgrade of the Munitions Cryofracture Demilitarization Facility (MCDF) at McAlester Army Ammunition Plant (MCAAP).  Closed out the Mobile Plasma Treatment System (MPTS) project at Crane Army Ammunition Activity (CAAA).  Closed out the Plasma Ordnance Disposal System (PODS) at HWAD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.781"
                                            },
                                            "Text": {
                                                "val": "Continue the Ammonium Perchlorate (AP) rocket motor destruction at Letterkenny Munitions Center (LEMC), and initiated long lead item procurement for Thermal Treatment Capability (TTC) at LEMC.  Conduct Phase I integration testing for AP rocket motor destruction, and complete rocket motor segmenting.  Fabricate and facilitize equipment for AP rocket motor demil facility, and conduct prototype demonstration of TTC.  Evaluate results of UCDT testing and conduct technology demonstration.  Complete integrated demonstration and validation of the MCDF upgrade at MCAAP, and conduct the MCDF Low Rate Initial Production (LRIP).  Initiate Soukos safety assessment for non-thermal demil process of whole munitions.  Conduct throughput study for Static Detonation Chamber (SDC) project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.460"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.460"
                                            },
                                            "Text": {
                                                "val": "Plan and execute transition of production MCDF hardware and processes at MCAAP.  Complete integrated demonstration and validation of the AP rocket motor demil facility, and conduct the AP TTC LRIP.  Initiate Soukos capability design project.  Initiate SDC project.  Initiate Rockeye Demil Capability Project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Recovery and Recycling (R3)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing existing methods of munitions R3."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.087"
                                            },
                                            "Text": {
                                                "val": "Completed integrated demonstration and validation of the Improved Conventional Munitions (ICM) R3.  Conducted the ICM R3 LRIP.  Conducted the High Pressure Water Washout (HPWWO) Phase II equipment purchase and installation at Hawthorne Army Depot (HWAD), and conducted LRIP.  Conducted supportability review of the Projectile Download Work Cell software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "Increase throughput to ICM R3 by updating control system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Removal"
                                    },
                                    "Description": {
                                        "val": "This effort develops technology to remove propellant and energetics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.824"
                                            },
                                            "Text": {
                                                "val": "Designed download equipment for Red Phosphorus (RP) Phase II demil line, and completed prototype demonstration.  Initiated HWAD Autoclave Process Upgrade project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Fabricate components for RP demil line.  Integrate RP demil line into Phosphoric Acid Recovery Plant at CAAA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.741"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.741"
                                            },
                                            "Text": {
                                                "val": "Complete integrated demonstration and validation of the RP demil line.  Conduct the RP demil line LRIP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Waste Stream Treatment"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on handling waste streams from munitions items."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.218"
                                            },
                                            "Text": {
                                                "val": "Complete procurement documentation, initiate Procurement Request, and award contract for upgraded Pollution Abatement System (PAS) on the RKPI project.  Apply process efficiency changes to the environmental permitting process for the RKPI project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.206"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.206"
                                            },
                                            "Text": {
                                                "val": "Install PAS, complete integrated demonstration and validation of RKPI, conduct the RKPI LRIP, and complete other process improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munitions Disassembly"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.959"
                                            },
                                            "Text": {
                                                "val": "Initiated the application of Lean Automation principles in the design and layout for the Cluster Bomb Unit 87 (CBU-87) Disassembly Download project at HWAD.  Established process to detank Liquid Rocket-62 (LR-62) Bullpup motors, and detanked three Bullpup motors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.860"
                                            },
                                            "Text": {
                                                "val": "Initiate project for Family of Scatterable Munitions (FASCAM) processing facility.  Continue design, fabrication and installation of CBU-87 Download hardware.  Plan and execute transition of production demil process for LR-62 Bullpup motors.  Identify a process to dispose of Inhibited Red Fuming Nitric Acid and Mixed Amine Fuel components for Bullpup rockets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.084"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.084"
                                            },
                                            "Text": {
                                                "val": "Continue support of FASCAM demil.  Finalize installation of CBU-87 Download hardware.  Demonstrate and validate process for CBU-87 Download, and conduct LRIP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}