{
    "id": "7738135140af36f05272a0341dea787a5dc40f92",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603121D8Z"
        },
        "ProgramElementTitle": {
            "val": "SO\/LIC Advanced Development"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "67.834"
            },
            "PriorYear": {
                "val": "17.212"
            },
            "CurrentYear": {
                "val": "8.670"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "P206, Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC).  The EOD\/LIC Program develops and delivers advanced capabilities for military Explosive Ordnance Disposal (EOD) operators and Special Operations Forces (SOF) to meet the challenges of improvised explosive devices (IEDs), force protection, and the war on terrorism.  EOD\/LIC efforts focus in two areas:  support to SOF to combat terrorism; and access, detection, identification, and neutralization of all types of conventional explosive ordnance and improvised explosive devices.  Requirements submitted by the Joint Service EOD and Service Special Operations communities are prioritized and approved by OASD (SO\/LIC).  With a decreased budget, CTTSO will proceed with The Improvised Device Defeat (IDD)subgroup expanding its inclusion of joint service EOD operators in its efforts since the Department’s announcement to cancel PE 0603121D8Z.  IDD will absorb the appropriate joint service EOD requirements for prioritization and interagency coordination going forward.  IDD will use the limited resources it possesses to provide the broadest possible capability improvement to the community.\n\n P207, Special Reconnaissance Capabilities (SRC).  The SRC Program exploits, leverages, and integrates DoD’s service and agency efforts to improve surveillance and reconnaissance tools (unattended sensors, tagging and tracking devices, data infiltration\/exfiltration, remote delivery, and mobility\/delivery of sensors), while providing risk reduction for DoD and other agency technology and development programs.  The SRC Program identifies, integrates, and operationalizes the technical tools for the collection of actionable information against a variety of targets and mission requirements, including emerging requirements, and maintains DoD’s on-line catalog of tools in order to minimize crisis response time for special reconnaissance and surveillance. \n\nP208, Information Dissemination Concepts (IDC).  The IDC Program addresses technology capabilities necessary to enable sustained information dissemination campaigns in denied areas.  The IDC program, working as necessary with DoD and the interagency, develops, modifies, and demonstrates concepts, mechanisms, platforms and payloads to propagate themes and messages that convince target audiences to take action favorable to the United States and its allies. The Surveillance, Collection, and Operations Support (SCOS) subgroup has managed the IDC project for CTTSO since gaining oversight of the funding.  The language program orchestrated by SCOS will remain, albeit with a drastic reduction in funding without PE 0603121D8Z.\n \nP209, Irregular Warfare Support (IWS).  The IWS Program (IWSP) develops adaptive and agile capabilities and methodologies to support irregular warfare in the current and evolving strategic environments. IWSP supports joint, interagency, and other partners who conduct or counter irregular warfare through indirect and asymmetric approaches, though they may employ a full range of military and other capabilities, in order to erode an adversary’s power, influence, and will. Solutions include material and non-material operational analysis, concept development, field experimentation, and delivery of capabilities, to defeat the motivations, sanctuaries, and enterprises of targeted state and non-state actors.  As evidenced by every applicable Defense and National Security strategy document, (e.g., 2012 Defense Strategic Guidance (DSG), “Sustaining U.S. Global Leadership: Priorities for 21st Century Defense, Irregular Warfare capabilities are vital to U.S. security.  CTTSO, in coordination with the ASD (SO\/LIC), is in the process of reviewing options to continue the IWS capability that is critical to the combating terrorism community."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.403"
                },
                "CurrentYear": {
                    "val": "8.682"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.212"
                },
                "CurrentYear": {
                    "val": "8.670"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.191"
                },
                "CurrentYear": {
                    "val": "-0.012"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.184"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "CurrentYear": {
                                    "val": "-0.012"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Explosive Ordnance Disposal\/Low-Intensity Conflict"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.601"
                        },
                        "PriorYear": {
                            "val": "3.374"
                        },
                        "CurrentYear": {
                            "val": "1.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P206, Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC).  The EOD\/LIC Program develops and delivers advanced capabilities for military Explosive Ordnance Disposal (EOD) operators and Special Operations Forces (SOF) to meet the challenges of improvised explosive devices (IEDs), force protection, and the war on terrorism.  EOD\/LIC efforts focus in two areas:  support to SOF to combat terrorism; and access, detection, identification, and neutralization of all types of conventional explosive ordnance and improvised explosive devices.  Requirements submitted by the Joint Service EOD and Service Special Operations communities are prioritized and approved by OASD (SO\/LIC).  With a decreased budget, CTTSO will proceed with The Improvised Device Defeat (IDD)subgroup expanding its inclusion of joint service EOD operators in its efforts since the Department’s announcement to cancel PE 0603121D8Z.  IDD will absorb the appropriate joint service EOD requirements for prioritization and interagency coordination going forward.  IDD will use the limited resources it possesses to provide the broadest possible capability improvement to the community."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC)"
                                    },
                                    "Description": {
                                        "val": "P206, Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC).  The EOD\/LIC program develops and delivers advanced capabilities for military EOD operators and Special Operations Forces (SOF) to meet the challenges of improvised explosive devices (IEDs), force protection, and the war on terrorism.  EOD\/LIC efforts focus in two areas:  support to SOF to combat terrorism; and access, detection, identification, and neutralization of all types of conventional explosive ordnance and improvised explosive devices.  Requirements submitted by the Joint Service EOD and Service Special Operations communities are prioritized and approved by Office of the Assistant Secretary of Defense (OASD) (SO\/LIC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.374"
                                            },
                                            "Text": {
                                                "val": "Efforts were focused on Countering Improvised Explosive Devices (C-IED) and Electronic Countermeasures (ECM).  Demonstrated a maritime, electromagnetic, non-lethal capability to disrupt outboard engines of small craft. Developed a global database of commercially manufactured electro–explosive devices, beginning with electric detonators containing characteristics to assist with identification and vulnerability assessment for future research and development efforts. Developed a method to deliver explosive charges that are deployable by mobile platforms and established protocols for effectively neutralizing defined IED threats. Evaluated a lightweight, back-packable robot for use in counter improvised explosive device operations in austere locations. Demonstrated a remote missile launch pod module that provides a precision engagement capability from an unmanned surface vehicle or other small craft. Developed a multi-purpose advanced tactical timer. Initiated development a compact, high-power next generation x-ray generator for EOD use.  Initiated development of techniques and concept render safe tool(s) capable of achieving high order or low order disposal of insensitive high explosive (IHE) munitions. Initiated development a suite of tools for Render Safe Procedures against underwater explosive devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Efforts will focus on tools and equipment to enhance situational awareness and operational capability during incident response, render safe or direct action operations. Continue development of a compact, high-power next generation x-ray generator for EOD use.  Complete development of techniques and concept render safe tool(s) capable of achieving high order or low order disposal of insensitive high explosive (IHE) munitions. Complete development of a suite of tools for Render Safe Procedures against underwater explosive devices.  Demonstrate and evaluate a multi-purpose advanced tactical timer. Develop a hydraulically-actuated, platform-independent arm system for Robotic Platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Remaining EOD\/LIC projects are transitioned to Improvised Device Defeat\/Explosives Countermeasures (IDD\/EC)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "207"
                    },
                    "ProjectTitle": {
                        "val": "Special Reconnaisance Capabilities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "31.457"
                        },
                        "PriorYear": {
                            "val": "6.872"
                        },
                        "CurrentYear": {
                            "val": "4.001"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P207, Special Reconnaissance Capabilities (SRC).  The SRC Program exploits, leverages, and integrates DoD’s service and agency efforts to improve surveillance and reconnaissance tools (unattended sensors, tagging and tracking devices, data infiltration\/exfiltration, remote delivery, and mobility\/delivery of sensors), while providing risk reduction for DoD and other agency technology and development programs.  The SRC Program identifies, integrates, and operationalizes the technical tools for the collection of actionable information against a variety of targets and mission requirements, including emerging requirements, and maintains DoD’s on-line catalog of tools in order to minimize crisis response time for special reconnaissance and surveillance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SPECIAL RECONNAISANCE CAPABILITIES (SRC)."
                                    },
                                    "Description": {
                                        "val": "P207, Special Reconnaissance Capabilities (SRC).  The primary objective of the SRC program is to seek out and identify technical tools for the collection of actionable data and information which will assist DoD in its execution of Overseas Contingency Operations (OCO) tasks.  To accomplish this objective, the program leverages emerging and existing developmental technologies from government and commercial ventures and operationalizes them to meet near term reconnaissance and surveillance operational requirements.  The operational tools transition unattended sensors, tagging devices, data transfer, remote delivery, and mobility\/delivery of sensors into established Programs of Record throughout the DoD.  The program evaluates new and existing technical surveillance technologies and incorporates results into a reference database for future access."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.872"
                                            },
                                            "Text": {
                                                "val": "Continued to identify, develop, integrate, and field promising persistent intelligence, surveillance, and reconnaissance (ISR) advanced technologies and capabilities. High payoff technologies that will be researched and transitioned include: audio and optical technologies; improvement in flexibility and accuracy through integration of disparate technologies into single devices; ultrahigh speed data processing and transmission; next-generation nanotechnology and miniaturization; affordable Application Specific Integrated Circuit (ASIC) technology; low profile enhanced micro-optics; next-generation precision Hostile Forces Tagging, Tracking, and Locating capabilities; low profile, advanced material miniature antennas; placement and concealment of unattended ground sensors; clandestine communications architectures; advanced biometric data collection, including high speed, portable DNA analysis; counter-surveillance systems: and low power, high bandwidth data transmission sub-systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.001"
                                            },
                                            "Text": {
                                                "val": "Continue to identify, develop, integrate, and field promising persistent intelligence, surveillance, and reconnaissance (ISR) advanced technologies and capabilities. High payoff technologies that will be researched and transitioned include: optical data\ntransmission technologies; ultra high speed data processing and transmission; device miniaturization; low profile enhanced micro-optics; next-generation precision Hostile Forces Tagging, Tracking, and Locating capabilities; clandestine communications architectures; advanced biometric data collection; and low power, high bandwidth data transmission subsystems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "208"
                    },
                    "ProjectTitle": {
                        "val": "Information Dissemination Concepts"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.901"
                        },
                        "PriorYear": {
                            "val": "1.425"
                        },
                        "CurrentYear": {
                            "val": "0.637"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P208, Information Dissemination Concepts (IDC).  The IDC Program addresses technology capabilities necessary to enable sustained information dissemination campaigns in denied areas.  The IDC program, working as necessary with DoD and the interagency, develops, modifies, and demonstrates concepts, mechanisms, platforms and payloads to propagate themes and messages that convince target audiences to take action favorable to the United States and its allies. The Surveillance, Collection, and Operations Support (SCOS) subgroup has managed the IDC project for CTTSO since gaining oversight of the funding.  The language program orchestrated by SCOS will remain, albeit with a drastic reduction in funding without PE 0603121D8Z."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "INFORMATION DISSEMINATION CONCEPTS"
                                    },
                                    "Description": {
                                        "val": "Respond to emerging needs for advanced language solutions in the operational environment including data exploitation and analysis of information in languages other than English and technology to enhance language proficiency and cultural skills."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.425"
                                            },
                                            "Text": {
                                                "val": "Enhanced language learning tools capabilities.  Adapted and integrated existing foreign language applications, practices, and tools into a tactical site exploitation capability.  Improved the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theater-wide exploitation of tactical intelligence.  Deployed capabilities to enrich language packet creation with a variety of media sources.  Delivered a capability that supports the automated inbound and outbound integration of available video and audio sources.  Developed novel approaches to query, track, and exploit multimedia from broadcast, radio, offline videos, and web sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.637"
                                            },
                                            "Text": {
                                                "val": "Develop tools that assist the military in foreign language training courses.  Improve foreign language applications, practices, and tools that are deployed in theater.  Expedite methods of collecting and analyzing media sources and evidence more efficiently and timely.  Enhance triage capabilities to store, organize, and query multimedia acquired from various sources.  Deploy automated technologies capable of ingesting and translating video and audio sources for analysts to effectively report intelligence findings."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "209"
                    },
                    "ProjectTitle": {
                        "val": "Irregular Warfare Support (IWS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.875"
                        },
                        "PriorYear": {
                            "val": "5.541"
                        },
                        "CurrentYear": {
                            "val": "2.532"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P209, Irregular Warfare Support (IWS).  The IWS Program (IWSP) develops adaptive and agile capabilities and methodologies to support irregular warfare in the current and evolving strategic environments. IWSP supports joint, interagency, and other partners who conduct or counter irregular warfare through indirect and asymmetric approaches, though they may employ a full range of military and other capabilities, in order to erode an adversary’s power, influence, and will. Solutions include material and non-material operational analysis, concept development, field experimentation, and delivery of capabilities, to defeat the motivations, sanctuaries, and enterprises of targeted state and non-state actors.  As evidenced by every applicable Defense and National Security strategy document, (e.g., 2012 Defense Strategic Guidance (DSG), “Sustaining U.S. Global Leadership: Priorities for 21st Century Defense, Irregular Warfare capabilities are vital to U.S. security.  CTTSO, in coordination with the ASD (SO\/LIC), is in the process of reviewing options to continue the IWS capability that is critical to the combating terrorism community."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "IRREGULAR WARFARE SUPPORT (IWS)"
                                    },
                                    "Description": {
                                        "val": "P209, Irregular Warfare Support (IWS).  The IWS Program (IWSP) develops adaptive and agile capabilities and methodologies to support irregular warfare in the current and evolving strategic environments.  IWSP supports joint, interagency, and other partners who conduct or counter irregular warfare through indirect and asymmetric approaches, though they may employ a full range of military and other capabilities, in order to erode an adversary’s power, influence, and will.  Solutions include material and non-material operational analysis, concept development, field experimentation, and delivery of capabilities, to defeat the motivations, sanctuaries, and enterprises of targeted state and non-state actors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.541"
                                            },
                                            "Text": {
                                                "val": "Under IW Joint Operational Concept (JOC 2.0) and DODD 3000.07 on IW, the IWS Program continued the research and development path in order to conduct operational analysis, concept design, and pilot-project experimentation efforts in support of 2010 QDR and current NSS\/NSCT lines of engagements.    Deployed an enhanced training capability and planned for transition to a program of record a counter- “green on blue” capability for ISAF and U.S. forces. This effort assisted warfighters in detecting and mitigating insider threat attacks in partner, COIN and contingency operations, which is a serious issue that undercuts efforts at training host nation security forces, one of the pillars of Irregular Warfare.   Continued to support an Advanced Situational Awareness Capability that includes instructor-led training and supporting publications for tactical unit leaders at the US Army Maneuver Center of Excellence (MCoE), Ft. Benning, GA.  This capability led to trained units achieving the highest IED discovery rates in the OEF theater and saving coalition lives. This capability was ultimately transitioned to the US Army MCoE and they currently seek to enhance this capability with the training to counter “green on blue” violence that was previously mentioned in a hybrid training course. Continued to support Project LEGACY, a capability that significantly improves host-nation police counterinsurgency and military intelligence capabilities. Conducted and completed a spiral effort of Legacy to provide training that institutionalizes within U.S. Forces and the Interagency the capability developed by the Legacy Program to deliver police\/military investigative training to host nation security forces.  Conducted an assessment of the relevance and applicability of specialized Security Force Assistance doctrine and operational approach for environments outside Operation Enduring Freedom.  Continued to elicit and refine requirements for users within rapid assessment framework in order to successfully pair SOF and Interagency users with off the shelf, high performance technologies and novel capabilities that fulfill specific requirements to share and analyze operational data better and faster.   Continued to research and develop threat group assessments based on open source information that allows operators and decision makers to understand the threats associated within their various areas of operation globally and how these threat groups affect the global security of the US and its allies.  Continued to develop and expand an effort that integrates and fuses heterogeneous social media data for use in strategic and tactical operational planning and preparation of the battlefield with new end users and different support environments. This effort provides a real time data and analysis capability along with mentorship and the analytical tradecraft to understand and monitor critical events and sentiments in open source social media.  Continued to develop frameworks and training to better understand and implement Combatant Command (COCOM) -level Communication Activities.  Delivered Return on Investment Analytic Framework for the COCOM VOICE Program in order to assist in garnering quantifiable measurements of performance, measurements of effectiveness and methods of determining overall return on investment (ROI) of program dollars.  Additionally, this effort also developed training designed to equip decision makers and operators with the knowledge and skills necessary to properly utilize population data and avoid common traps and risks in order to assess and appropriately interpret the population research required in support of these Communications Activities. Conducted deep-dive research and analysis aimed at defining today’s and the near future’s typology of adversaries, their capabilities, intentions, use of terrain, weapons, technologies, proliferation schemes, U.S. technology and operational advantages adversaries will work to offset, and what the U.S. should be looking for to be better prepared when it faces off with these types of threats.  Assisted with further development and understanding of the US Marine Corps concept of the Intelligence Driven Combat, to include international partnership and exchanges with Israel.   Developed enhanced MISO\/PSYOP capabilities in planning, targeting and execution for support to special and unconventional warfare mission requirements.  Researched and started development of enhanced mobile capabilities for assessing and surveying assault and landing zones to support small units conducting distributed operations in remote and austere environments (to include resupply\/drop zones, refueling, and helicopter landing zones). Conducted research, development, operational analysis, and field experimentation of efforts intended to counter emerging and extant threats in the intersection of the digital-physical domains (such as understanding the usage of social media by transnational criminal organizations in order to predict changes in support and influence; measures of effectiveness of social media and understanding how to use this media for intended effects). \nInitiated the Secure Unclassifed Network (SUNet), which provided protected dynamic enclaves of capability for multi-agency users (Law Enforcement, Interagency, Defense, Coalition, and Foreign Nationals) in order to provide inter-organizational collaborative areas and enhanced capabilities of data upload, searching and sharing from headquarters down to smartphones, tablets or laptops.  Research and development of a non-material effort intended to better understand indirect and irregular threats currently facing the US, and how to implement effective measures against them. The studies and related activities undertaken for this project will fall under three broad lines of effort: 1) an analysis of indirect\/irregular actions employed historically and how these capabilities may be applied to today’s threat environment; 2) an analysis of current and the evolving irregular threat environment; and 3) identification and analysis of which of the capabilities the US could apply to prevail against irregular\/indirect threats now and in the future.\nInitiated a research and development effort to assess the degree and quality of organizational learning, adaptation, and innovation in the field over the course of the deployment of specific units engaged in IW; provide an initial framework to speed up and enhance organizational learning in the field; and operationalize framework through instruction\/education aids."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.532"
                                            },
                                            "Text": {
                                                "val": "Continue research and development of material and non-material solutions, promising capabilities, and continuation of project development, delivery, and transition to support the Department of Defense and Interagency Irregular Warfare mission. Complete the deployment of an enhanced training capability and transition to a program of record a counter- “green on blue” capability for ISAF and U.S. forces. This effort assists warfighters in detecting and mitigating insider threat attacks in partner, COIN and contingency operations, which is a serious issue that undercuts efforts at training host nation security forces, one of the pillars of Irregular Warfare.    Continue to support Project LEGACY, a capability that significantly improves host-nation police counterinsurgency and military intelligence capabilities. Mentoring via the Legacy program will continue through FY14, though substantial drawdowns will begin starting in October 2013 with additional reductions occurring throughout 2014.\nComplete the effort that elicited and refined requirements from users within a rapid assessment framework in order to successfully pair SOF and Interagency users with off the shelf, high performance technologies and novel capabilities that fulfill specific requirements to share and analyze operational data better and faster.   Continue to research and develop threat group and geographic assessments based on open source information that allows operators and decision makers to understand the threats associated within their various areas of operation globally and how these threat groups affect the global security of the US and its allies.  Continued to develop and expand an effort that integrates and fuses heterogeneous social medial data for use in strategic and tactical operational planning and preparation of the battlefield with new end users and different support environments. This effort will continue to provide a real time data and analysis capability along with mentorship and the analytical tradecraft to understand and monitor critical events and sentiments in open source social media. Continue to develop and refine frameworks and training to better understand and implement Combatant Command (COCOM) -level Communication Activities to include training designed to equip decision makers and operators with the knowledge and skills necessary to properly utilize population data and avoid common traps and risks in order to assess and appropriately interpret the population research required in support of these Communications Activities. Developed enhanced MISO\/PSYOP capabilities in planning, targeting and execution for support to special and unconventional warfare mission requirements. \nDeliver enhanced mobile capability for assessing and surveying assault and landing zones to support small units conducting distributed operations in remote and austere environments (to include resupply\/drop zones, refueling, and helicopter landing zones). Deliver research, operational analysis, and field experimentation of multiple efforts intended to counter emerging and extant threats in the intersection of the digital-physical domains (e.g. understanding the usage of social media by transnational criminal organizations in order to predict changes in support and influence; measuring the of effectiveness of social media and understanding how to use this media for intended effects). \nContinue to develop and deliver Secure Unclassified Network (SUNet) which provides a unique virtualization of a single hardware suite of servers and software that will provide protected dynamic enclaves of capability for multi-agency users (Law Enforcement, Interagency, Coalition, and Foreign Nationals). This effort enables an inter-organizational collaborative area and enhanced capabilities of data upload, searching and sharing from headquarters down to smartphones, tablets or laptops.\nResearch, develop, test and evaluate material and non-material solutions that build and\/or enhance Military Information Support Operations (MISO) forces’ capabilities that are essential to unconventional warfare missions. Research, develop, test, evaluate and field capabilities that enhance Special Warfare operations and building the capacity of our partner nation forces.\nSpiral development of a non-material effort intended to better understand indirect and irregular threats currently facing the US, and how to implement effective measures against them. This effort will support of the Army Special Operations Command and will include wargaming and experimentation, strategy assessment and recommendations for future operations planning. Initiate research and development effort to understand “Lawfare” or the strategy of “using – or misusing – law as a substitute for traditional military means to achieve an operational objective.” This effort will review current literature and case studies of lawfare, conduct gap analysis and develop recommendations for use in the Lawfare realm by the US and its allies.\nComplete and deliver assessment of the degree and quality of organizational learning, adaptation, and innovation in the field over the course of the deployment of specific units engaged in IW; provide a framework to speed up and enhance organizational learning in the field; and operationalize framework through instruction\/education aids."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}