{
    "id": "7fdcd46e2dd1fc4514e241b25ed1385709e2ef8d",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605130D8Z"
        },
        "ProgramElementTitle": {
            "val": "Foreign Comparative Testing"
        },
        "R1LineNumber": {
            "val": "143"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "33.968"
            },
            "PriorYear": {
                "val": "11.877"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2015, Foreign Comparative Testing funding in Program Element (PE) 0605130D8Z was transferred to PE 0603133D8Z to emphasize Proof of Principle and Pre-Engineering and Manufacturing Development (Pre-EMD) prototypes and Budget Activity alignment."
        },
        "ProgramElementMissionDescription": {
            "val": "The Foreign Comparative Testing (FCT) program supports the warfighter by leveraging technologies and equipment from allied nations and coalition partners to satisfy U.S. defense requirements, thereby accelerating the U.S. acquisition process and lowering development costs.  The FCTs enhance interoperability, facilitate international collaboration, expand opportunities for prototyping to increase competition in innovation and enable more efficient and affordable transition of technologies into acquisition programs of record.  Authorized by Title 10, U.S. Code, Section 2350a (g), the FCT program is managed by the Office of Secretary of Defense (Deputy Assistant Secretary of Defense (DASD) Emerging Capability & Prototyping (EC&P)), Comparative Technology Office (CTO).  The FCT projects are sponsored by the Department, Services and U. S. Special Operations Command (USSOCOM).  Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements, a thorough market survey, and development of a viable acquisition strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.125"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.877"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.248"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.006"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.242"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P130"
                    },
                    "ProjectTitle": {
                        "val": "Foreign Comparative Testing"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.968"
                        },
                        "PriorYear": {
                            "val": "11.877"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Foreign Comparative Testing (FCT) program supports the warfighter by leveraging advanced technologies and equipment from allied nations and coalition partners to satisfy U.S. defense requirements, thereby accelerating the U.S. acquisition process and lowering development costs.  The FCTs enhance interoperability, facilitate international collaboration, expand opportunities for prototyping and enable more efficient and affordable transition of technologies into acquisition programs of record.  Authorized by Title 10, U.S. Code, Section 2350a(g), the FCT program is managed by the Office of Secretary of Defense (OSD), Deputy Assistant Secretary of Defense (DASD) Emerging Capability & Prototyping (EC&P), Comparative Technology Office (CTO).  The FCT projects are sponsored by the Department, Services and U.S. Special Operations Command (USSOCOM).  Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements, a thorough market survey, and development of a viable acquisition strategy.  \n\nThe FCT program is a catalyst for teaming and other business relationships between foreign and U.S. industries.  Many successful FCT projects result in the licensed production of the qualified foreign item in the U.S. Other nations recognize the long-term value of such practices for competing in the U.S. defense market and the resultant strengthening of the \"two-way street\" in Defense procurement.  The end result often translates to the creation of jobs and contributions to local economies throughout the United States.  To date, companies across 34 states benefited from FCT projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "40 millimeter (mm) Counter Defilade Grenade and Fire Control Systems; Armor Processing; Energy Absorbing Material for Improved Blunt Impact\/Trauma Protection; Lightweight M3A1 Recoilless Rifle; and Solar Power Shelter System."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.674"
                                            },
                                            "Text": {
                                                "val": "Completed and Transitioned: 40mm Counter Defilade Grenade and Fire Control Systems, a new prototype 40mm round capable of providing an enhanced lethality solution for defeating personnel targets in defilade.  Completed Armor Processing, Small Arms Protective Inserts (SAPI) plates for personal body armor being fabricated by a new isostatic and high pressure processing technique.  Developed plans for testing Energy Absorbing Material for Improved Blunt Impact\/Trauma Protection, a soft flexible material that stiffens upon impact for use in helmets and body armor to reduce blunt impact forces.  Completed test plans for Lightweight M3A1 Recoilless Rifle, a reliable, battle-proven, reusable shoulder fired weapon system which will significantly reduce the weight burden on the Multi-role Anti-armor Anti-tank Weapon System weapon teams.  Conducted planning meetings for Solar Power Shelter System, a new capability which utilizes renewable energy technology (solar power) as an alternative energy source to diesel fuel for powering equipment supporting Army base camps."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Force Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "Air Portable Hot Mix Asphalt Plant; Web-Based Weather Portal; Rapid Airfield Damage Assessment Systems; Deployable Instrument Landing System (D-ILS); and Advanced Mobile Universal Electrical Tester (AMUET)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.294"
                                            },
                                            "Text": {
                                                "val": "Completed and transitioned: Air Portable Hot Mix Asphalt Plant, a project that tests and qualifies a pre-production Air Portable Hot Mix Asphalt (HMA) Plant for the rapid production and delivery of HMA for airfield repairs using pre-packaged (pelletized) asphalt binder along with locally-available aggregate.  Completed Web-Based Weather Portal, a project that tests and qualifies weather software to provide commercial-off-the-shelf capability to ingest, decode, and graphically display weather observations and forecast products.  Procured test articles for Rapid Airfield Damage Assessment Systems, a project that tests and evaluates a system that detects airfield damage or objects on runways\/taxiways that will damage aircraft.  Evaluated Deployable Instrument Landing System (D-ILS), equipment that combines glideslope and localizer together to provide azimuth and elevation directions to approaching aircraft.  Planned and evaluated Advanced Mobile Universal Electrical Tester (AMUET), a mobile, generic, modular, piece of automated test equipment used to collect test parameters of complete sub-system(s) under both depot and operational maintenance environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "Stabilized Small Arms Mount; Dual Purpose 25mm Ammunition for the Joint Strike Fighter; Seismic Detection System; Secondary Propulsion Thrusters; Multifunctional Information Distribution System (MIDS) Joint Tactical Radio System (JTRS) Radio Frequency Amplifier (RFA); Automatic Target Recognition: Reducing MK18 Unmanned Underwater Vehicles (UUV) Mine Countermeasures Tactical Timeline; Computer Network Defense (CND) Advanced Persistent Threat (APT) Detection; H-1 Crash-resistant, Ballistic-tolerant, Fuel Cell Qualification; Mobile Gunnery Live Fire Monitoring System; and Horizon Reference System, Electroluminescent Panel Replacement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.638"
                                            },
                                            "Text": {
                                                "val": "Completed Stabilized Small Arms Mount, a highly reliable two-man portable system suitable for the harsh maritime and operational environments in which the warfighters of small-to-medium size craft operates.  Completed Dual Purpose 25mm Ammunition for the Joint Strike Fighter, a project that tested the performance, reliability and safety of Armor Piercing Explosive (APEX) 25mm rounds for U.S. Navy, Marine Corps, and Air Force aircraft application.  Completed Seismic Detection System, a project that tested and evaluated a sensor system that can detect the presence of human activity (walking, digging) associated with improvised explosive device emplacement, perimeter\/border intrusion of unauthorized individuals and provides alerts when that activity occurs within a user defined geographical boundary.  Completed Secondary Propulsion Thrusters, an Advanced Submarine Control System using a pump jet propulsion technology to improve ship control and operational performance.  Completed Multifunctional Information Distribution System (MIDS) Joint Tactical Radio System (JTRS) Radio Frequency Amplifier (RFA), a project that tested and evaluated a RFA Shop Replaceable Unit (SRU).  Collected data for Automatic Target Recognition: Reducing MK-18 Unmanned Underwater Vehicles (UUV) Mine Countermeasures Tactical Timeline, system capable of automatically identifying mine-like targets in sonar imagery from the in-service MK-18 Family of UUV Systems.  Formulated Integrated Product Team and issued a Request for Information for Computer Network Defense (CND) Advanced Persistent Threat (APT) Detection, software that provides a critical step towards addressing advanced persistent threats (APTs), which is a current capability gap in the Computer Network Defense (CND) program of record. Developed plans for the H-1 crash-resistant, ballistic-tolerant, fuel cell in order to evaluate crashworthy self-sealing fuel cell technology to U.S. military standards for use on the UH-1Y and AH-1Z aircraft.  Developed plans for Horizon Reference System, Electroluminescent Panel Replacement, a systematic upgrade to modernize the existing electroluminescent (EL) Panel Bar to Light Emitting Diode (LED) Technology on the shipboard Horizon Reference Set."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "United States Special Operations Command (USSOCOM) Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "Electronic Underwater Navigation; Out-of-Band Night Vision Tubes; and Nano-steel"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.271"
                                            },
                                            "Text": {
                                                "val": "Conducted project planning and received test articles for Electronic Underwater Navigation, a project that assures the certainty of combat divers arriving at the intended assigned target, using an extremely accurate underwater navigation system.  Conducted project planning and received test articles for Out-of-Band Night Vision Tubes, a visual augmentation system that expands the range of frequencies.  Purchased test articles and developed test plans for Nano-steel, a material used to verify claims that Nano-steel provides superior ballistic protection at reduced weight and thickness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Since the program's inception in 1980, Office of Secretary of Defense has invested about $1.228 billion in FY 2014 constant year dollars on FCT projects.  Of the evaluations that met the sponsors' requirements, there have been procurements worth over $11.000 billion.  In FY 2014, FCT had a transition rate of 64 percent for completed projects, exceeding the objective of 40 percent for demonstration programs."
                        }
                    }
                }
            ]
        }
    }
}