{
    "id": "89f3eb97a698c8ec386a6a24d00dfdd8f6b4045a",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "101.157"
            },
            "CurrentYear": {
                "val": "96.894"
            },
            "BudgetYearOne": {
                "val": "100.530"
            },
            "BudgetYearOneBase": {
                "val": "100.530"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "109.280"
            },
            "BudgetYearThree": {
                "val": "112.208"
            },
            "BudgetYearFour": {
                "val": "114.902"
            },
            "BudgetYearFive": {
                "val": "117.266"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, and understanding and shaping adversarial behavior.  The Learning and Operational Readiness project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  The Human Dynamics Evaluation project conducts research to advance machine intelligence and operator-aiding technologies by developing and applying airman-focused research for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities and detecting and exploiting human signatures.  The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of airmen and machines.  The Bioeffects project conducts research on the effects of human exposure to electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "104.427"
                },
                "CurrentYear": {
                    "val": "81.957"
                },
                "BudgetYearOne": {
                    "val": "97.212"
                },
                "BudgetYearOneBase": {
                    "val": "97.212"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "101.157"
                },
                "CurrentYear": {
                    "val": "96.894"
                },
                "BudgetYearOne": {
                    "val": "100.530"
                },
                "BudgetYearOneBase": {
                    "val": "100.530"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.270"
                },
                "CurrentYear": {
                    "val": "14.937"
                },
                "BudgetYearOne": {
                    "val": "3.318"
                },
                "BudgetYearOneBase": {
                    "val": "3.318"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.063"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.270"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.318"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.318"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2014, funds were reprogrammed for a higher priority effort.\n\nIn FY 2016, increase for higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.971"
                        },
                        "CurrentYear": {
                            "val": "16.592"
                        },
                        "BudgetYearOne": {
                            "val": "21.275"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.275"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.927"
                        },
                        "BudgetYearThree": {
                            "val": "23.264"
                        },
                        "BudgetYearFour": {
                            "val": "21.149"
                        },
                        "BudgetYearFive": {
                            "val": "21.578"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and cognitive modeling.  The continuous learning effort creates live, virtual, and constructive (LVC) environments for use in developing revolutionary simulation technologies to increase training capabilities and enhance training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive modeling creates realistic models and simulations of human behavior to advance the understanding of how airmen perform complex tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances distributed mission operations (DMO) and LVC environments and identifies technology requirements for training in live and immersive environments.  Continuous learning strategies improve mission training, command and control (C2), ISR, and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.305"
                                            },
                                            "Text": {
                                                "val": "Extended methodologies for managing learning and performance to apply across combat operations, tactical C2 and ISR teams in LVC environments.  Initiated evaluations of technologies required for a complementary family of trainers.  Evaluated rule-sets for training across multiple security levels in LVC environments.  Evaluated scenarios for integrated C2\/ISR\/cyber team training in a Red Flag exercise environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.592"
                                            },
                                            "Text": {
                                                "val": "Complete development of an analyst readiness research testbed for ISR and cyber operators.  Extend learning assessment and management tools to support undergraduate pilot training.  Evaluate different methods for secure, credible LVC training and rehearsal for fourth and fifth generation fighters.  Create and document standards for tactical LVC training and readiness.  Validate methods to quickly generate rule sets for security applications in C2 and ISR domains.  Develop methods to generate realistic representations of adversary tactics for LVC training.  Evaluate methods to rapidly reconfigure training environments for different scenarios and mission sets.  Initiate work to develop agents to manage training activities in LVC.  Begin requirements definition for LVC training applications to support enhancing warfighting in contested environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.275"
                                            },
                                            "Text": {
                                                "val": "Begin to implement multiple agents as synthetic white forces for cost reduction in Air Support Operations Center training. Demonstrate adaptive ISR training in training research exercise. Complete evaluations and develop specifications for in-theater C2 trainer. Demonstrate integrated RPA, C2, and joint terminal attack controller (JTAC) training and assessment in routine DMO events. Demonstrate autonomous agents for asset management in RPA operations. Continue research to create autonomous cognitive models to function in contested environments. Complete development of common scenario generation and readiness assessment methods for joint and coalition distributed training and exercise."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.666"
                                            },
                                            "Text": {
                                                "val": "Completed predictive performance optimization for cognitively valid readiness tracking in Air Force training.  Initiated research in mechanisms of human knowledge learning and seeking and their interaction.  Validated the ability of a first-generation synthetic teammate to perform effectively in a team environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort is moved to Continuous Learning thrust to be consistent with future integration into LVC contexts.\n\nN\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "25.692"
                        },
                        "CurrentYear": {
                            "val": "17.130"
                        },
                        "BudgetYearOne": {
                            "val": "23.544"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.544"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "25.559"
                        },
                        "BudgetYearThree": {
                            "val": "25.566"
                        },
                        "BudgetYearFour": {
                            "val": "26.026"
                        },
                        "BudgetYearFive": {
                            "val": "26.574"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced ISR capabilities. Research is focused in the following areas: human analyst augmentation, human trust and interaction, and human signatures. The human analyst augmentation area develops, integrates, and evaluates human-centric analyst technology to develop cognitive systems engineering solutions for airman data overload, work integration, and mission performance, enhancing operationally effective ISR for the Air Force. The human trust and interaction area seeks to advance human language technologies to benefit military linguists and analysts as well as to understand, quantify, and calibrate trust factors influencing airman interaction with autonomous systems that can be applied to airman-machine teaming in future weapon systems. The human signatures area develops and applies S&T to detect and exploit a variety of human-centered signatures, including behavioral and anthropometric aspects of existing and emerging adversaries as well as nano, bio, and molecular signatures of airman performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to improve human analytic efficiency and effectiveness with fewer personnel and in increasingly complex mission space.  Develop the ability to improve human cognitive performance of the ISR weapon system through improved data exploitation and intelligence content synthesis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.255"
                                            },
                                            "Text": {
                                                "val": "Expanded multi-intelligence analysis prototypes to include autonomous systems and human performance augmentation technologies. Provided robust situation awareness to enhance decision-makers' understanding and knowledge by improving ISR capabilities and data processing, exploitation, and dissemination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.742"
                                            },
                                            "Text": {
                                                "val": "Research and develop human centric approaches to enhance ISR analysts' ability to attend to relevant intelligence data when coupled with autonomous systems and agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.172"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.172"
                                            },
                                            "Text": {
                                                "val": "Apply cognitive systems engineering research methods to airman-centered challenges surrounding contested environments to develop solutions for Air Force ISR analysts. Explore approaches to integrate semiautonomous machine analysis technologies into airman ISR analyst performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research in cross-cultural communication and automated speech translation tools for Air Force missions.  Conduct research to address important aspects of trust in airman-machine teams including investigating how an airman knows an autonomous or semiautonomous system is safe to use and whether the system, data, conclusions, and decision recommendations be trusted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.259"
                                            },
                                            "Text": {
                                                "val": "Matured speech recognition and machine translation capabilities for new languages and domains.  Assessed emerging speech recognition and machine translation technologies against data sets representative of general ISR applications.  Investigated how to adapt these algorithms to evolving contexts such as changing topics.  Investigated strategies and methodologies for combining multiple algorithms simultaneously to optimize system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.774"
                                            },
                                            "Text": {
                                                "val": "Develop guidelines for calibrated trust for symbiotic human-machine teaming.  Develop work aids that enable analysts to think more deeply and methodically about their problem space by accounting for contextual factors including culture, religion, governance, and economy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.139"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.139"
                                            },
                                            "Text": {
                                                "val": "Experiment with guidelines for calibrated trust for symbiotic airman-machine teaming.  Identify and study appropriate levels of transparency between airmen and automated systems.  Experiment with multiple language processing algorithms simultaneously to optimize system performance.  Evaluate current advances in machine processing for new militarily-relevant languages."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Develop nano, bio, and molecular signatures of airman performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.178"
                                            },
                                            "Text": {
                                                "val": "Developed algorithms to detect and characterize adversary human signatures in radar, video, infrared, and hyperspectral modalities for human threat situational awareness.  Developed applications to integrate airman performance sensors into mobile devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.614"
                                            },
                                            "Text": {
                                                "val": "Develop algorithms capable of reliably detecting and characterizing human signatures by leveraging multiple sensing modalities, from multiple platforms, for human threat situation awareness.  Develop sensors for novel molecular signatures for increased threat detection in an operational environment and human performance assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.233"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.233"
                                            },
                                            "Text": {
                                                "val": "Develop advanced molecular and genetic diagnostic methodologies to better assess airman performance.  Develop algorithm capable of reliably detecting and characterizing anthropometric signatures."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "37.267"
                        },
                        "CurrentYear": {
                            "val": "37.912"
                        },
                        "BudgetYearOne": {
                            "val": "29.018"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.018"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.757"
                        },
                        "BudgetYearThree": {
                            "val": "30.915"
                        },
                        "BudgetYearFour": {
                            "val": "31.997"
                        },
                        "BudgetYearFive": {
                            "val": "32.653"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including RPA and adaptive teams of airmen and machines.  Research optimizes airman situational awareness and cognitive performance, improves the airman-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas:  applied neuroscience; human role in semiautonomous systems; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance airman-airman and airman-machine collaborations and system interactions in distributed decision-making environments.  The human role in semiautonomous systems area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the S&T associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to enhance airman performance, airman-airman, and airman-machine collaboration, and system interaction in distributed decision-making environments.  Conduct research to predict physiological impacts of high-stress\/extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.572"
                                            },
                                            "Text": {
                                                "val": "Examined new sense, assess, and augmentation technologies to provide adaptive aiding based on warfighter performance.  Validated team workload and trust measures to enhance effective human-human and human-machine system performance.  Defined team synchronicity and cognitive functional state metrics that aid team performance.  Researched stress-driven processes and their effects on human performance.  Explored psychological and neurophysiological mechanisms and processes for developing unique operational strategies that enhance cognitive resiliency and performance.  Developed physiology models to predict the effects of high-stress\/extreme environments on the human.  Investigated interface technologies and exposure design criteria to protect operators and mitigate injury and performance risks.  Developed on-board oxygen generating technologies to mitigate hypoxia vulnerability risks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "Investigate individual and team state sensing and assessment algorithms and methods to examine augmentation mitigation strategies leading to improved warfighter performance.  Develop team workload and trust models for autonomy, increased human performance monitoring, and performance improvement.  Identify stress-driven metrics and processes that influence human performance.  Define neurophysiological, psychological, and genetic mechanisms and processes for developing guidelines to enhance warfighter cognitive resiliency and performance.  Apply physiology computational modeling methods to predict high-stress\/extreme environmental effects on the human.  Develop augmentation techniques for improving performance in operational environments that include human-machine teaming.  Investigate interface technologies and exposure design criteria to protect operators and mitigate injury and performance risks in current and future weapon systems.  Develop contamination sensor technology for on-board oxygen generation systems for hypoxia vulnerability risk mitigation.  Investigate new technologies for aircraft next generation on-board oxygen generation system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.515"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.515"
                                            },
                                            "Text": {
                                                "val": "Explore novel airman performance sensor and material solutions to increase sensing and assessing capabilities. Mature team workload and trust models for autonomy, increased airman performance monitoring, and performance improvement. Utilize knowledge of stress-driven metrics and processes to optimize airman performance. Apply neurophysiological, psychological, and genetic mechanisms and processes for developing guidelines to enhance airman performance and cognitive resiliency. Explore additional augmentation techniques such as supplementation and physical training for improving performance in operational environments that include airman-machine teaming. Apply interface technologies and exposure design criteria to protect airmen and mitigate injury and performance risks in current and future weapon systems. Refine physiology computational modeling methods to predict high-stress\/extreme environmental effects on airmen. Continue contamination sensor technology development for on-board oxygen generation systems for hypoxia vulnerability risk mitigation. Evaluate new technologies for aircraft next generation on-board oxygen generation system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, decision-aiding algorithms).  Identify best design to direct operator attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.923"
                                            },
                                            "Text": {
                                                "val": "Investigated various automation technologies for the command and control of multiple RPAs.  Examined the interplay between automation technologies and various tools to enable choices between courses of action.  Evaluated advanced visualizations concepts and interaction methods for managing information from on-board and off-board sources to support RPA operator decision-making.  Developed adjustable, adaptive levels of automation to support flexible control of unmanned systems depending on mission and environmental context."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.580"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and quantify the use of selected automation technologies and various tools to enable choices between courses of action for the command and control of multiple RPAs.  Integrate advanced visualization concepts and interaction methods for managing information from on- and off-board sources to support RPA operator decision-making into high-fidelity simulations for test and evaluation.  Perform advanced simulation of adjustable, adaptive levels of automation to support flexible control of unmanned systems depending on mission and environmental context."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.062"
                                            },
                                            "Text": {
                                                "val": "Integrate the current states of the platform, mission, environment, and airman operator into a global state database. Develop guidelines for interface design based upon computational problem solving method.  Investigate ways to represent autonomous system competency against the current task\/situation. Explore airman-autonomy teaming methods and metrics for Air Force applications. Perform advanced simulation of adjustable and adaptive automation to support flexible control of autonomous systems depending on mission and environmental context."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Advances science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.706"
                                            },
                                            "Text": {
                                                "val": "Developed a suite of image enhancement and fusion tools based on human perception and performance.  Designed and evaluated visualizations based on visual analytics to represent and visualize relevant information from large, disparate data sets.  Assessed application of visual analytics to various warfighting domains.  Evaluated the effectiveness of using three-dimensional (3-D) displays to augment human decision-making and situational awareness.  Evaluated the use of various devices that can be used to interact with visualizations to determine their effectiveness in aiding human performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.660"
                                            },
                                            "Text": {
                                                "val": "Evaluate image enhancement and fusion techniques for improving human perception and performance.  Assess visual analytics techniques for visualizing large, disparate data sets.  Investigate cyber operations visualization techniques for transforming numerical data into actionable information.  Explore decision aids for multisource fusion methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.972"
                                            },
                                            "Text": {
                                                "val": "Create cyber operations visualization techniques for transforming numerical data into actionable information. Develop and evaluate cyber operator system interfaces. Design decision aids for multisource fusion methods. Develop experimental test bed for more effective visualization of current and future sensor technologies. Prototype 3-D spatial viewers for mobile devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.066"
                                            },
                                            "Text": {
                                                "val": "Developed auditory interfaces to enable the human operator to respond to cyber attacks.  Developed interface concepts for using multimodal displays and visualizations to support combat search and rescue teams.  Examined the effectiveness of audio displays combined with multimodal interaction techniques to support human operator decision-making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.672"
                                            },
                                            "Text": {
                                                "val": "Validate auditory interfaces that enable the human operator to respond to cyber attacks through persistent auditory displays.  Optimize the use of multimodal displays and visualizations to communicate time critical information to distributed teams.  Validate the combined effectiveness of audio displays and multimodal interaction techniques to support human decision-making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.469"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.469"
                                            },
                                            "Text": {
                                                "val": "Evaluate auditory interfaces that enable airmen to respond to cyber attacks through persistent auditory displays. Validate the use of multimodal displays and visualizations to communicate time-critical information to distributed teams. Enhance the combined effectiveness of audio displays and multimodal interaction techniques to support airman decision-making. Develop communication metrics of intent of communicators compared to receivers' understanding. Develop metrics of airman-machine communication to incorporate emotional context."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "26.227"
                        },
                        "CurrentYear": {
                            "val": "25.260"
                        },
                        "BudgetYearOne": {
                            "val": "26.693"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.693"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.037"
                        },
                        "BudgetYearThree": {
                            "val": "32.463"
                        },
                        "BudgetYearFour": {
                            "val": "35.730"
                        },
                        "BudgetYearFive": {
                            "val": "36.461"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to nanomaterials, EM energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals.  Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and molecular bioeffects.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research investigates basic biological mechanisms of RFR, conducts theoretical and empirical dosimetry, conducts research of bioeffects from short- and long-term exposures, develops methods to counter RFR threats, and performs research for exploitation of directed energy systems for offensive capabilities.  Molecular bioeffects research is conducted to protect airmen from the effects of toxic chemicals and materials and to monitor and enhance cognitive and physiological performance."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed Effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.968"
                                            },
                                            "Text": {
                                                "val": "Integrated operational tasks into laser vision effects models to identify impacts to human operators.  Explored daytime dazzling effects via multiple wavelength stimulation in human subjects.  Enhanced dose-response models to support risk-based hazard analysis for low-power probabilistic laser safety tools.  Expanded models and methods for application to unique approaches for using optical radiation for future weapon systems with scalable, disruptive, and ultra-precise effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.990"
                                            },
                                            "Text": {
                                                "val": "Integrate components of engagement-level simulations for laser bioeffects into broader DoD modeling and simulation products for the purpose of mission-level and campaign level models.  Initiate studies to evaluate bioeffects, protection needs, and collateral effects of emerging directed energy systems concepts.  Complete data collection for currently identified optical radiation damage and transient vision effects for use in next-generation of standardized personnel vulnerability models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.181"
                                            },
                                            "Text": {
                                                "val": "Complete development of scalable effects simulation tool. Complete new standardized evaluation methodology for evaluation of laser devices that cause glare effects in multiple environments. Integrate probabilistic model of individual observer within overall modeling and simulation architecture for evaluating laser collateral effects. Complete integration of new distributed simulation standard into modeling and simulation components to enable risk-based assessment of personnel effects within real-time weapons concept exercises with other Air Force and DoD research organizations. Complete data collection for currently identified optical radiation damage and transient vision effects for use in next generation of standardized personnel vulnerability models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.712"
                                            },
                                            "Text": {
                                                "val": "Conducted empirical laboratory tests on the human behavioral response to combined effects of directed energy sources.  Initiated validation of high-peak power exposure models.  Incorporated THz exposure test results into THz exposure standards and whole-body exposure models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.945"
                                            },
                                            "Text": {
                                                "val": "Conduct empirical laboratory tests on the human behavioral response to combined effects of directed energy sources.  Investigate high peak power human performance effects.  Explore whole-body biological effects of directly applied ultra-short pulses.  Determine effects of RF overexposure on neurological tissue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.301"
                                            },
                                            "Text": {
                                                "val": "Determine the impact of fast thermal gradients on neurological cells. Conduct empirical studies to verify computational tool for radio frequency-induced bio-thermal response. Validate radio frequency dosimetry suite for broad power and frequency range to support next generation high peak power dose determinations. Perform empirical and modeling studies to investigate the feasibility of using short pulse radio frequency energy for standoff membrane poration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct studies to assess human responses to non-lethal weapons and effects\/risks of these weapons.  Conduct bio\/nanotechnology research to advance warfighter performance.  Leverage toxicological\/biological data to improve airman performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.547"
                                            },
                                            "Text": {
                                                "val": "Evaluate the quantitative framework for relating novel-effects technologies to operationally relevant mission outcomes.  Conduct research to define toxicity issues in current and future aircraft environments.  Begin development of models incorporating toxicity data and mechanisms of action to inform sensor development and development of hazard protection.  Conduct research to elucidate novel mechanisms of fundamental interaction of nanomaterials in a biological system.  Begin development of a new prototype of non-traditional effects of nanomaterials under the influence of incidental EM fields."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.325"
                                            },
                                            "Text": {
                                                "val": "Advance toxicity and nanotoxicity research; investigate\/establish toxicity impacts to selected organ systems in the body of advanced fuels, materials, and chemicals used to support existing and future weapon systems.  Define and pursue modulation of major cell pathways affecting human performance using in vitro and in vivo models and modeling and support human studies of the same.  Conduct research to define toxicity issues in current and future aircraft environments.  Begin development of models incorporating toxicity data and mechanisms of action to inform sensor development and development of real-time sensing of pilot and hazard protection of ground crews.  Conduct research to understand novel mechanisms of fundamental interaction of nanomaterials in a biological system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.211"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.211"
                                            },
                                            "Text": {
                                                "val": "Advance knowledge and capability to complete analysis of aerospace fluid(s) toxicity characterization and impacts on high performance aircraft operators. Pursue development and application capabilities of biomarkers for short- and long-term exposure modeling for existing and emerging militarily-relevant chemicals and materials. Examine novel mechanisms of fundamental interaction of nanomaterials in a biological system. Conduct and develop novel research studies to elucidate mechanisms of fundamental interaction of nanomaterials in biological systems. Examine molecular cognition applications used in biomarker development for airman."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}