{
    "id": "8cef0e947802025de6ca6b7a93b114ab4681e5ad",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605502S"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovative Research (SBIR)"
        },
        "R1LineNumber": {
            "val": "157"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5.976"
            },
            "PriorYear": {
                "val": "5.829"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense Logistics Agency’s (DLA's) ability to deliver Americans the right logistics solution in every transaction requires more than successful management of the Department's wholesale supplies and suppliers. It requires supply chain excellence. Our military's ability to generate and sustain combat readiness indefinitely, anywhere on the globe requires that DLA-managed materiel flow seamlessly and as needed from the nation's industrial base to where it is ultimately used.\n\nDLA's Small Business Innovative Research (SBIR) program seeks to solicit high-risk research and development proposals from the small business community. All selections shall demonstrate and involve a degree of technical risk where the technical feasibility of the proposed work has not been fully established. Phase I proposals should demonstrate the feasibility of the proposed technology and the merit of a Phase II for a prototype or at least a proof-of-concept demonstration. Phase II selections will be strongly influenced on future market possibilities and commercialization potential demonstrated."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.829"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.829"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "5.829"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Small Business Innovative Research (SBIR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.976"
                        },
                        "PriorYear": {
                            "val": "5.829"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project explores innovative concepts pursuant to Public Law 106-554 (Small Business Reauthorization Act of 2000) and Public Law 107-50 (Small Business Technology Transfer Program Reauthorization Act of 2001), which mandates a two-phase competition for small businesses with innovative technologies with a defense application as well as a commercial value.   The Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs will develop new dual-use technologies for possible future Defense Logistics Agency (DLA) needs.  Dual-use means the technologies will be judged on their potential for future private sector investment both as a vehicle for reducing development time and cost, unit costs of new DLA technologies, and as a route to national economic growth through new commercial products. DLA will conduct the competition as well as award and manage the contracts.\n\nThe Defense Logistics Agency`s SBIR\/STTR investments are divided into multiple Research Areas identified from within three DLA Elements:\n\nJ3 R&D\n- Advanced Battery Manufacturing (BATTNET): \n- Advanced Castings and Forgings (PRO-Fast):\n- Anti Counterfeiting:\n\nJ6 R&D\n- TBD\n\nDMEA\n- TBD"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.829"
                                            },
                                            "Text": {
                                                "val": "- Continued the execution of the active Phase I and Phase II SBIR Projects, and selected eight new Phase I proposals in FY 14.  The SBIR program included the BATTNET topic in the DOD-wide 2014.2 Broad Agency Announcement. Three Phase I Options were executed in FY14, providing the opportunity to compete for Phase II awards in FY2015."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR:\n\n- To continue execution of all active Phase I and Phase II SBIR Projects.  One or more new SBIR research topics will be developed with a focus on J62 requirements.  Anticipate four Phase I awards per topic.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.\n\n- Anticipate using the new DLA STTR topic supporting advanced anti-counterfeiting technologies in the DOD-wide 2015.2 STTR BAA.  Plan to select four Phase I awards.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.\n\n\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nDMEA SBIR\n\nDMEA will complete testing and demonstration of hardware for a proof-of-concept quadrature mixer with integrated in-phase\/quadrature-phase (I\/Q) mismatch calibration. DMEA will complete testing and demonstration of hardware for a prototype high-speed, high-resolution x-ray system for inspection of integrated circuit cards. DMEA will complete the development of an integrated quantum receiver architecture and design and the analysis of requirements for a quantum cryptography single-photon detector integrated circuit. DMEA will simulate the performance of an Avalanche Photodiode quantum key receiver. DMEA will develop an architecture for differential read-out of balanced Single-Photon Avalanche Photodiode devices, with analysis of the expected performance of the integrated solution.:"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR:\n\n- To continue execution of all active Phase I and Phase II SBIR\/STTR Projects.  Anticipate using the DLA SBIR topic supporting BATTNET in the DOD-wide 2016.2 SBIR BAA.  Anticipate the development of between one and three new SBIR research topic areas for new Phase I projects.  Anticipate four Phase I awards per topic.  Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.\n\n- To continue execution of all active Phase I and Phase II STTR Projects.    Anticipate the development of one new STTR research topic areas for new Phase I projects.  Anticipate four Phase I awards per topic and that the topic will be included in the DOD-wide 2016.A STTR BAA. Upon completion, all active Phase I projects have the opportunity to compete for Phase II awards.  \n\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nDMEA SBIR: \n\nDMEA will continue to seek innovative technical solutions to DoD microelectronics research and development needs and increase private-sector commercialization of these innovations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The SBIR acquisition process seeks to match projects with DLA’s Strategic Focus Areas.  The goal is to align SBIR\/STTR developed technology with current and future DLA requirements.   All new project execution work is solicited through the DoD SBIR Broad Agency Announcement (BAA).  There are three separate solicitation periods throughout each year."
                        },
                        "PerformanceMetrics": {
                            "val": "SBIR \/STTR programs measure performance in two separate metrics\n\n- First in terms of progression from PhaseI to Phase II, to Phase III.  Each successive progression is deamed a success.   DLA Seeks to have a 50% progression from one Phase to the next as a minimum.\n- Second in terms of the congressional definition of “commercialization,” as defined by Office of Secretary of Defense Office of Small Business Programs (OSD\/OSBP) Re-Authorization Policy Directive:\n-- (Investment) The process of developing products, processes, technologies, or services; and\/or \n-- (Sales)  The production and delivery (whether by the originating party or by others) of products, processes, technologies, or services for sale to or use by the Federal Government or commercial markets.    \n\nThe Small Business Administration and OSD\/OSBP assign a Commercialization Index based on progression within the Phases and reported sucesses"
                        }
                    }
                }
            ]
        }
    }
}