{
    "id": "947c12ef6df7632845d56ea690d8b65b24d16996",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602601F"
        },
        "ProgramElementTitle": {
            "val": "Space Technology"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "100.066"
            },
            "CurrentYear": {
                "val": "98.229"
            },
            "BudgetYearOne": {
                "val": "116.122"
            },
            "BudgetYearOneBase": {
                "val": "116.122"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "108.936"
            },
            "BudgetYearThree": {
                "val": "117.514"
            },
            "BudgetYearFour": {
                "val": "120.336"
            },
            "BudgetYearFive": {
                "val": "122.811"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element focuses on four major areas.  First, space survivability and surveillance develops technologies to understand space weather and the geophysics environment for mitigation and exploitation of these effects to Air Force systems.  Second, spacecraft payload technologies improve satellite payload operations by developing advanced component and subsystem capabilities.  Third, spacecraft protection develops technologies for protecting U.S. space assets in potential hostile settings.  The last major area, spacecraft vehicles, focuses on spacecraft platform and control technologies, and their interactions.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "103.955"
                },
                "CurrentYear": {
                    "val": "98.229"
                },
                "BudgetYearOne": {
                    "val": "108.821"
                },
                "BudgetYearOneBase": {
                    "val": "108.821"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "100.066"
                },
                "CurrentYear": {
                    "val": "98.229"
                },
                "BudgetYearOne": {
                    "val": "116.122"
                },
                "BudgetYearOneBase": {
                    "val": "116.122"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.889"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.301"
                },
                "BudgetYearOneBase": {
                    "val": "7.301"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.062"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.827"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.301"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.301"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding realigned in FY14 to support high priority science and technology effort.\n\nIncrease in FY16 is due in part to realignment of research efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621010"
                    },
                    "ProjectTitle": {
                        "val": "Space Survivability & Surveillance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.620"
                        },
                        "CurrentYear": {
                            "val": "35.159"
                        },
                        "BudgetYearOne": {
                            "val": "42.970"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.970"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "32.954"
                        },
                        "BudgetYearThree": {
                            "val": "38.922"
                        },
                        "BudgetYearFour": {
                            "val": "35.447"
                        },
                        "BudgetYearFive": {
                            "val": "35.165"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies to understand and control the space environment for warfighter's future capabilities.  The focus is on characterizing and forecasting the battlespace environment for more realistic space system design, modeling, and simulation, as well as the battlespace environment's effect on space systems' performance.  This includes technologies to specify and forecast the space environment for planning operations, ensure uninterrupted system performance, optimize space-based surveillance operations, and provide capability to mitigate or exploit the space environment for both offensive and defensive operations.  Finally, this project includes the seismic research program that supports national requirements for monitoring nuclear explosions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Environment Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, sensors, and technologies for specifying, monitoring, predicting, and controlling space environmental conditions hazardous to DoD operational space and radar systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.473"
                                            },
                                            "Text": {
                                                "val": "Continued research on energetic space particle dynamics due to distorted magnetic fields and exploited multiple recent data sets to improve quality of spacecraft environmental hazard predictions.  Continued spacecraft material temperature, dose, and aging effects research.  Developed next-generation miniaturized space environment sensor concepts.  Exploited developing solar ultraviolet emission and solar wind models to enable a time-dependent solar wind model capable of handling transients.  Investigated potential alternatives to traditional solar flare specification and prediction to achieve more accurate predictions.  Developed improved solar radio frequency monitoring concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.309"
                                            },
                                            "Text": {
                                                "val": "Take delivery of unique pulsed electroacoustic sensor to measure charging inside materials and begin testing capability to research material susceptibility to internal charging while exploiting continued material aging research.  Exploit new on-orbit data sources to enhance energetic space environment models.  Initiate research on methods for remote measurement of spacecraft material properties.  Begin researching novel techniques for solar energetic particle forecast."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.795"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.795"
                                            },
                                            "Text": {
                                                "val": "Initiate research program to quantify\/predict internal charging for new and aged materials.  Begin analyzing and exploiting data from the on-orbit radiation remediation proof-of-concept experiment, as well as existing on-orbit spacecraft.  Continue developing models to predict the generation and transport of solar energetic particles.  Begin developing predictive model for observable and dielectric spacecraft material property changes.  Continue exploitation of new on-orbit data sources to enhance energetic space environment models supporting spacecraft design and mission planning.  Develop global magnetic field models of the Sun, allowing determination of solar wind conditions used for forecasting solar radiation conditions at Earth. Prior work on solar energetic particles will be assessed for incorporation into predictive space environment model that forecast effects of particle radiation environment on satellites. Techniques for improving the predictions of the timing\/magnitude of geomagnetic storms driven by solar eruptions will be investigated.  Deliver an improved, validated ionospheric scintillation model for the Global Positioning System (GPS) Interference and Navigation Tool (GIANT) software program, the standard for estimating real world operational GPS performance.  Develop a suite of codes that will be used for attribution of satellite communication interference.   Deliver block upgrades to address future needs of the DoD satellite communication user community.   Develop models for error corrections caused by ionospheric disturbances to Over the Horizon Radar (OTHR).  Provide upgrades to the state of the art model currently used for those corrections, focusing on a newly discovered phenomena called traveling ionospheric disturbances, which causes objects located by OTHR to apparently shift in location.  Assess future signature packages that should be added to the hypersonics flow solver.  Continue the assessment of new geometry and material impacts on mission success for strategic systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surveillance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced target detection techniques, spectral signature libraries, and decision aids for space-based sensors and surveillance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.379"
                                            },
                                            "Text": {
                                                "val": "Continued space-based hypertemporal (HT) sensor performance trade studies. Evaluated HT detection methods for concealed activity monitoring. Discontinued hyperspectral imaging work due to increased emphasis in HT sensor technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.534"
                                            },
                                            "Text": {
                                                "val": "Evaluate HT data processing methods and target detection algorithms for space-based, early missile warning. Deliver space-based HT sensor performance trade studies for optimal early missile detection.  Explore and evaluate new innovative HT detection methods for concealed activity monitoring."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.358"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.358"
                                            },
                                            "Text": {
                                                "val": "Expand evaluation of HT data processing methods and target detection algorithms to wider range of real-world and simulated target-background scenes of missile warning scenarios as well as to space-based imagery data that is compressed to reduce satellite downlink problems.  Deliver detailed technical evaluation of potential HT detection methods for concealed activity, including identification of technology gaps needing additional investigation for use in monitoring difficult threats.  Initiate development of HT space-based data collection events and ground truth field campaigns for new HT flight experiment investigating advanced concept for early missile warning and dim target detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ionospheric Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, and sensors for ionospheric specification and forecasting, space-based geolocation demonstrations, and determination of potential radar degradation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.274"
                                            },
                                            "Text": {
                                                "val": "Continued investigations for physics-based improvements of space weather specification and forecast models related to impacts on DoD systems. Developed improved modeling capability for scintillation impacts on communication, GPS, and remote sensing, and for environmentally-induced satellite anomalies, by assimilating space, ground, and unexploited data sources. Began implementing plan for increasing measurements in under-sampled regions for more accurate prediction of radio link degradation. Validated preliminary baseline ionospheric simulation and radio frequency illumination capability for high frequency (HF) geolocation and radar systems; initiated model and data utility trade studies; began development of advanced simulation techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.689"
                                            },
                                            "Text": {
                                                "val": "Continue investigations for physics-based space weather specification and forecast models related to impacts on DoD systems. Validate improved modeling capabilities for scintillation impacts on communications, GPS and remote sensing, and for environmentally-induced satellite anomalies. Begin development of next model increments. Integrate and quantitatively assess environmental models and system impact data across the solar, magnetosphere, and ionosphere domains to expand capabilities for actionable attribution and forecast of environmentally-caused anomalies on DoD satellites and environmental interference with electromagnetic wave propagation. Incorporate advanced ionospheric sounding techniques and traveling ionospheric disturbance effects into simulation model for next generation radar systems.  Conduct application-specific trade studies for model components and data types. Demonstrate high frequency radio geolocation coordinate registration capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This effort has been combined with the Space Environment Research effort in the same project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiation Remediation Research"
                                    },
                                    "Description": {
                                        "val": "Conduct Radiation Belt Remediation (RBR) research through developing and validating analytical performance models for remediation of Earth radiation belts following high altitude nuclear detonation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.366"
                                            },
                                            "Text": {
                                                "val": "Continued ground-based very low frequency (VLF) propagation experiments using national and international assets.  Validated revised VLF ionospheric propagation models for RBR modeling to include natural and man-made VLF sources.  Incorporated results from planned VLF and particle mapping flight experiment to support ground-based and space-based VLF transmitter experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.529"
                                            },
                                            "Text": {
                                                "val": "Validate RBR end-to-end model version 2.0 using ground and space-based measurements with the very low frequency particle mapper and satellite experiments.  Conduct fielded RBR capability assessments to determine rough order fielded system requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.756"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.756"
                                            },
                                            "Text": {
                                                "val": "Validate RBR end-to-end model version 3.0 using ground and space-based measurements with the very low frequency particle mapper and satellite and terrestrial experiments.  Conduct fielded RBR capability assessments to determine rough order fielded system requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seismic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop seismic technologies to support national requirements for monitoring nuclear explosions with special focus on regional distances less than 2,000 kilometers from the sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.824"
                                            },
                                            "Text": {
                                                "val": "Improved resolution of three-dimensional physics-based seismic wave propagation models through scientific and computational advances. Investigated use of these three-dimensional models to match all details of seismic signals. Continued extending coverage of unified model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.292"
                                            },
                                            "Text": {
                                                "val": "Assess relative utility of different scientific and computational advances for improving the accuracy of three-dimensional seismic wave propagation models. Explore use of details of seismic signals in three-dimensional models for discrimination of explosions from earthquakes. Extend coverage and increase resolution of unified model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.532"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.532"
                                            },
                                            "Text": {
                                                "val": "Deliver discrimination capabilities using full seismic waveforms based on three-dimensional models to fill critical capability gaps. Use three-dimensional attenuation models to improve signal loss prediction for seismic signals used in discrimination.  Investigate the use of modern high speed computing capabilities and massive data archives to automate the detection, location, and discrimination of seismic events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Navigation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies based on cold atom physics that provide autonomous jam-proof precision inertial navigation to augment Global Positioning System (GPS) in case of GPS-denial. Develop atomic clocks based on new technologies to replace legacy GPS atomic clocks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.304"
                                            },
                                            "Text": {
                                                "val": "Designed a compact atomic clock that would provide both the accuracy and robustness necessary to replace legacy atomic clocks for GPS with modern sustainable technology. Began construction of a free space cold atom gyroscope\/accelerometer that would enable GPS-free precision navigation. Evaluated design of a confined cold atom gyroscope to reduce size and weight requirements to expand GPS-free navigation to a larger number of Air Force platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.806"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks. Continue construction of a free space, cold atom 3-axis gyroscope\/accelerometer that would enable GPS-free precision navigation. Test a completed free space, cold atom single-axis gyroscope\/accelerometer to learn about its strengths and limitations. Continue development of a confined cold atom gyroscope with reduced size and weight over free space cold atom gyroscopes to expand GPS-free navigation to a larger number of AF platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.529"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks.  Receive clock deliverable from the National Institute of Standards and Technology for testing. Continue construction of a free space, cold atom 3-axis gyroscope\/accelerometer that would enable GPS-free precision navigation. Complete further tests of free space, cold atom single-axis gyroscope\/accelerometer to learn about its strengths and limitations. Develop a confined cold atom gyroscope with reduced size and weight over free space cold atom gyroscopes to provide a GPS-free navigation system for DoD platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624846"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Payload Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.812"
                        },
                        "CurrentYear": {
                            "val": "15.203"
                        },
                        "BudgetYearOne": {
                            "val": "14.478"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.478"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.655"
                        },
                        "BudgetYearThree": {
                            "val": "14.917"
                        },
                        "BudgetYearFour": {
                            "val": "15.175"
                        },
                        "BudgetYearFive": {
                            "val": "15.138"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced technologies that enhance spacecraft payload operations by improving component and subsystem capabilities. The project focuses  on development of advanced, space-qualified, survivable electronics, and electronics packaging technologies; development of advanced space data generation and exploitation technologies, including infrared sensors; and development of high-fidelity space simulation models that support space-based surveillance and space asset protection research and development for the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space-Based Detector Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced infrared device technologies that enable hardened space detector arrays with improved detection to perform acquisition, tracking, and discrimination of space objects and missile warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.098"
                                            },
                                            "Text": {
                                                "val": "Continued to develop innovative alternative materials\/components and technologies to enable new capabilities or enhance existing performance of space sensors. Pursued revolutionary breakthroughs to improve target detection and identification, enable mission configurability, and provide all-weather, all-terrain, dim\/distant target detection and identification while reducing the volume, weight and cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.982"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and mature an alternative sensor material system to include: increased operating temperature, reduced non- uniformity, and reduced cost. Explore novel detector enhancement methodologies (radiation hardening techniques, detector architectures, etc.) to mainstream visible-long wavelength infrared focal plane array developments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.656"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.656"
                                            },
                                            "Text": {
                                                "val": "Continue alternative sensor material architecture development, focused on minimizing yield limitations and producing a lower cost detector that can perform the mission at more cost-effective operating temperatures.  Complete laboratory demonstration of tunable detector technology and validate basic functionality over a militarily significant range of wavelengths.   Initiate development of radiation tolerant detectors to achieve dim object tracking for next-generation space situational awareness systems.  Complete support for novel cloud-penetrating missile warning experiment.  Continue development of foundational sensor modeling and novel detector enhancement methodologies to leverage tactical infrared detector developments for use in space systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness Sensing (SSA) Research"
                                    },
                                    "Description": {
                                        "val": "Develop innovative means for measuring, modeling, and predicting phenomena for SSA and protection applications. Develop new methods to evaluate how well specific data contributes to identifying particular physical and functional information about a space-based object, and ultimately enable decision-makers to pursue courses of action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.091"
                                            },
                                            "Text": {
                                                "val": "Verified and validated predictive modeling capabilities against laboratory and field measurements. Initiated next-generation analysis of sensing methods and phenomena to exploit for space protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.102"
                                            },
                                            "Text": {
                                                "val": "Begin execution of experiment campaign to measure satellite components to verify and validate predictive modeling capabilities against these laboratory and field measurements. Begin systems analysis to establish performance requirements under validated threat scenarios. Initiate next-generation analysis of sensing methods and phenomena to exploit for space protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Note:  In FY16, this effort will be combined with the Threat Warning Research effort in project 625018, \"Spacecraft Protection Technology,\" to better align technical efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Electronics Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for space-based payload components such as radiation-hardened electronic devices, micro- electro-mechanical system devices, and advanced electronics packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.634"
                                            },
                                            "Text": {
                                                "val": "Completed investigation of hardening techniques to protect satellites from high power microwaves. Completed integration model of basic technologies for proof-of-concept system-on-chip integration. Continued research and development of advanced system-on- chip integration for improved performance of space sensor systems. Completed three-dimensional evaluation test devices to prove feasibility of the process within the foundry. Continued development of integrated modules using three-dimensional techniques to reduce size, weight, and power and increase performance. Began investigating multicore processor architectures for integration with three-dimensional and system-on-chip techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.684"
                                            },
                                            "Text": {
                                                "val": "Complete development of integrated modules using three-dimensional techniques to increase throughput while reducing size, weight, and, especially, power. Explore new transistor designs that are compatible with current manufacturing techniques but more efficient and radiation tolerant at ultra-small feature sizes (e.g., 7nm). Expand on-going electronic device reliability research into other failure modes (e.g., hot carrier injection) to understand defects responsible for reduced lifetimes in small feature-size electronic devices. Continue exploration of successful integration techniques for system-on-chip integrated circuits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.580"
                                            },
                                            "Text": {
                                                "val": "Continue research into advanced transistor types for use at ultra-submicron technology nodes. Document initial small-feature-size reliability findings and transition results to device development community to improve spacecraft electronic lifetime predictions.  Complete investigation of Memristor technology and begin transition, if applicable, to development phase.  Initiate development of low-order benchmarking tools for quantifying and assessing the impact that emerging satellite electronics technologies have on component and system-level metrics, such as size, weight, power and cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Tools for Space Applications"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation tools for space-based ground surveillance systems, rendezvous and proximity operations, imaging of space systems, disaggregated satellite architecture, and space control payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.683"
                                            },
                                            "Text": {
                                                "val": "Continued to develop spacecraft and mission simulations in close conjunction with customers across DoD. Integrated state-of-the- art system performance and mission planning algorithms into modeling and simulation software tools. Transitioned validated tools to the data center in preparation for upcoming flight programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.451"
                                            },
                                            "Text": {
                                                "val": "Continue to develop spacecraft and mission simulations in close conjunction with customers across the DoD. Continue to integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation software tools.  Revise flight tools based on recent flight program experience. Support technology development and maturation through capability and mission utility studies and size, weight, and power-cost trade studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.791"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.791"
                                            },
                                            "Text": {
                                                "val": "Continue to develop spacecraft and mission simulations in close conjunction with customers across the DoD and other government agencies. Continue to integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation  tools. Revise flight tools based on recent flight program experience.  Support technology maturation through capability and mission utility studies, size, weight, and power-cost trade studies, and wargaming activities.  Provide utility analysis to future flight experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Positioning, Navigation, and Timing Technology"
                                    },
                                    "Description": {
                                        "val": "Identify and develop technologies that enable new, or enhance existing, U.S. positioning, navigation, and timing (PNT) satellite capabilities by increasing resiliency and availability of accuracy, and\/or increasing the affordability of providing current capabilities. Develop technologies to meet identified Air Force Space Command\/Space and Missile Systems Center PNT space payload technology needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.306"
                                            },
                                            "Text": {
                                                "val": "Began program development activities required to design, fabricate, integrate, test and deliver an advanced technology, high power, high efficiency and reliable L-band Radio Frequency (RF) amplifier that is compatible with Global Positioning Systems L-band navigation signal transmission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.984"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments to establish the sensitivity of PNT payload units\/sub-units to off-nominal operating conditions and to establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments. Conduct studies to identify alternative and innovative technology options for PNT payloads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.451"
                                            },
                                            "Text": {
                                                "val": "Continue experiments establishing the sensitivity of various PNT payload units\/sub-units to off-nominal operating conditions and establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Continue studies to identify alternative and innovative technologies that are viable for PNT payloads."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625018"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Protection Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.568"
                        },
                        "CurrentYear": {
                            "val": "8.498"
                        },
                        "BudgetYearOne": {
                            "val": "15.049"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.049"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.800"
                        },
                        "BudgetYearThree": {
                            "val": "21.964"
                        },
                        "BudgetYearFour": {
                            "val": "23.646"
                        },
                        "BudgetYearFive": {
                            "val": "25.239"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies for protecting U.S. space assets in potentially hostile environments to assure continued space system operation without performance loss in support of warfighter requirements.  The project focuses on identifying and assessing spacecraft system vulnerabilities, developing threat warning technologies, and developing technologies to mitigate the effects of both intentional and unintentional threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Threat Warning Research"
                                    },
                                    "Description": {
                                        "val": "Develop satellite threat warning technologies and tools for space defense. Exploit on-board inherent satellite resources, satellite-as-a-sensor, and self-aware satellite technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.568"
                                            },
                                            "Text": {
                                                "val": "Enhanced satellite-as-a-sensor technology development. Demonstrated improved ability to determine satellite orbital conjunctions and develop proof-of-concept for closed loop situational awareness system. Developed integrated sensor and response system for threat detection, characterization, and warning. Advanced detection sensor technology to improve data-to-information-to- decision capabilities. Developed improved sensor algorithms and data fusion techniques. Continued to reduce size, weight, and power requirements for next generation proximity detection sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.498"
                                            },
                                            "Text": {
                                                "val": "Down select and mature next generation proximity detection sensor technologies and sensor suite integration. Provide technology support for the next Joint Space Operations Center (JSpOC) Mission Systems upgrade. Complete instantiation of JSpOC Mission Systems (JMS) space situational awareness testbed. Develop SSA closed loop simulation showing automated threat detection and response actions. Evaluate technologies to enable better monitoring of space objects in geosynchronous orbit."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.049"
                                            },
                                            "Text": {
                                                "val": "Complete experimental measurements of satellite components to verify and validate predictive modeling capabilities.  Continue analysis of next-generation sensing methods and phenomena to exploit for space protection.  Complete assessments of proximity sensor options and transition findings, as appropriate, to satellite system developers.  Begin new SSA-focused data analysis methods including physics-based sensor model development for use in data filtering; advanced filtering techniques accommodating nonlinear dynamics and non-normal random variable distributions; and data-driven methods applicable where physical models are highly uncertain or altogether unknown.  Initiate development of advanced algorithms for satellite threat detection and response for both ground-based and space-based implementations.  Continue development of capabilities to increase satellite autonomy and perform closed loop demonstration showing threat detection and responsive courses of action."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "628809"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Vehicle Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.066"
                        },
                        "CurrentYear": {
                            "val": "39.369"
                        },
                        "BudgetYearOne": {
                            "val": "43.625"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.625"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "41.527"
                        },
                        "BudgetYearThree": {
                            "val": "41.711"
                        },
                        "BudgetYearFour": {
                            "val": "46.068"
                        },
                        "BudgetYearFive": {
                            "val": "47.269"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on spacecraft platforms (e.g., structures, power, and thermal management); satellite control (e.g., signal processing and control); and space experiments of maturing technologies for space qualification."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Power\/Thermal Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced space platform subsystems such as cryocoolers, compact, high efficiency solar power cells and arrays, and innovative power generation concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.486"
                                            },
                                            "Text": {
                                                "val": "Completed preliminary cryocooler modeling, energy analysis of single and multi-stage coolers, and cross gimbal\/distributed cooling to improve cryocooler efficiency and demonstrate some strategies. Continued to research and advance effective low and zero vibration cryocooler technologies, including solid state coolers. Began moving forward with maturation of most promising technical approaches for greater than 40% efficient solar cells. Continued development of novel flexible array technologies to enable greater launch volume stowage efficiency and higher specific power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.491"
                                            },
                                            "Text": {
                                                "val": "Continue to examine new solid state, zero vibration cryocooler methods. Perform studies on how new solid state technologies may be integrated directly to a focal plane array to show representative thermal loading. Continue development of greater than 40% efficient solar cell approaches. Investigate advanced photon management approaches. Continue optimizing flexible solar array for mass and volume efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.078"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.078"
                                            },
                                            "Text": {
                                                "val": "Complete solid state refrigeration research and document low-temperature semiconductor materials findings.  Focus development of greater than 40% efficient solar cells by demonstrating increased photocurrent using nano-enhanced cells. Continue to investigate advanced photon management approaches to increase efficiency and radiation hardness.  Complete Flex-Array initial development for 60kW\/m3 performance.  Initiate follow-on development for achieving 70-80 kW\/m3 array performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Structures and Controls Research"
                                    },
                                    "Description": {
                                        "val": "Develop revolutionary and enabling technologies, including lighter weight, lower cost, high performance structures for space platforms; guidance, navigation, and controls hardware and software for next generation of space superiority systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.440"
                                            },
                                            "Text": {
                                                "val": "Performed multi-physics characterization of relevant and non-linear structural materials (mechanical, thermal, electromagnetic). Produced flight hardware for experimental de-orbit mechanism for satellites and rocket stages. Completed advanced dynamics analysis methods efforts and demonstrate in relevant environment(s); continued space debris mitigation efforts; continued collaborative autonomous spacecraft guidance, navigation, and control efforts supporting distributed spacecraft missions; initiated efforts to integrate guidance, navigation, and control methods with advanced spacecraft autonomy decision architectures.\nDemonstrated on the ground space-to-space surveillance system with autonomous sensor control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.884"
                                            },
                                            "Text": {
                                                "val": "Improve and refine collaborative autonomous spacecraft guidance, navigation, and control efforts supporting distributed spacecraft missions. Continue efforts to integrate guidance, navigation, and control methods with advanced spacecraft autonomy decision architectures. Integrate multi-spacecraft and autonomous spacecraft efforts to establish multiple autonomous spacecraft technology capability. Develop improved constitutive models for composite materials. Continue research to improve the fabrication and manufacture of precision and high tolerance composite structures. Perform research in thermal management technologies for heat dissipation of high power and high energy density electronics. Deliver and transition analytic and numerical tools and demonstrate multi-physics optimization of satellite structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.037"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.037"
                                            },
                                            "Text": {
                                                "val": "Continue advanced guidance and navigation algorithms integration into advanced autonomous spacecraft software.  Continue collaborative autonomous multi-spacecraft algorithms in laboratory and high-fidelity simulations\/breadboards including embedded processor implementations.  Begin reactive maneuver strategies for spacecraft resiliency in laboratory simulation.  Develop alternative GPS technologies for contested environments.  Transition methods to improve the fabrication and manufacture of precision and high tolerance composite structures to spacecraft prime contractors. Initiate development of technologies to increase the resiliency and affordability of spacecraft structures through the development and test of new, actively-controlled thermal technologies. Continue core research in thermal technologies that increase high-power heat dissipation for high-energy density electronics and radio-frequency components currently slated for Air Force communications and Global Positioning System (GPS) spacecraft. Explore new meta-material technologies to improve the electromagnetic interaction characteristics of Air Force spacecraft structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Experiments"
                                    },
                                    "Description": {
                                        "val": "Develop flight experiments to improve the capabilities of existing operational space systems and to enable new transformational space capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.537"
                                            },
                                            "Text": {
                                                "val": "Continued pre-launch preparations and pre-launch-vehicle integration for on-orbit radiation remediation proof-of-concept experiment. Developed innovative technologies for planned on-orbit experiment using the Evolved Expendable Launch Vehicle Secondary Payload Adaptor to support both platform and payloads, as well as developing advanced interfaces to accommodate partner payloads and technologies. Completed manufacturing and delivery of very low frequency particle mapper (VPM) payload suite, and begin satellite bus integration. Began VPM mission launch readiness actions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.947"
                                            },
                                            "Text": {
                                                "val": "Continue pre-launch preparations, launch the on-orbit radiation remediation proof-of-concept experiment. Perform launch and early orbit activities and then on-orbit satellite experiments operations. Complete science payload designs and long lead procurement for maneuverable geosynchronous space vehicle experiment. Verify system design for science data collections. Verify payload subsystem hardware and software after component\/subsystem delivery. Prepare for component\/subsystem tests, complete experiment planning for maneuverable geosynchronous experimental platform design payload configurations, and begin to prepare for final spacecraft integration and test. Complete VPM space vehicle assembly integration and test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.435"
                                            },
                                            "Text": {
                                                "val": "Complete final integration, testing, and launch vehicle integration of satellite experiment to investigate remediation techniques for \nenhanced space radiation.  Train the operations team and conduct mission rehearsals.  Launch experimental satellite and conduct on-orbit checkout and one year experimental operations.  Complete development and continue testing and verification of a fourth generation geosynchronous orbit (GEO) based missile warning payload to demonstrate HyperTemporal (HTI) capabilities to detect missile launches under sun-lit clouds, potentially enabling all weather early missile detection.  Complete testing and verification of an integrated, on-board sensing, assessment, and autonomy technology demonstration payload at GEO, demonstrating GEO asset resiliency to a specific set of on-orbit events enabling system mission assurance in a degraded space environment.  Identify candidate technologies and payloads for next-generation space experiment.  Determine technical objectives for multiple space experiment payloads and technology maturation necessary in a space experiment planned for the FY19-21 timeframe."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment and methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.603"
                                            },
                                            "Text": {
                                                "val": "Continued applied research and development efforts (modeling, simulation, and laboratory testing) to reduce component technical risks (e.g., functionality and performance) and to meet technology and capability needs for optical (i.e., laser communication), millimeter-wave (i.e., Ka-band, V-band, W-band), and protected satellite communication technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.047"
                                            },
                                            "Text": {
                                                "val": "Continue applied research and development efforts (modeling, simulation, and laboratory testing) to reduce component technical risks and to meet technology needs. Specifically, work to develop a propagation flight experiment to characterize the W and V frequency bands for future military satellite communications. Begin evaluation of optical communication links with small spacecraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.075"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.075"
                                            },
                                            "Text": {
                                                "val": "Complete design phase of W and V frequency band flight experiment.  Establish Continental US ground station receiver network and verify connectivity.  Initiate development of science and experiment plans. Continue development of models, simulations, and laboratory testing to support the flight experiment.  Continue investigations of optical communications options."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}