{
    "id": "954aaed2efe9d81fd29b969e1dcf8fad1a0b01af",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605790D8Z"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovation Research (SBIR)\/Small Business Technology Transfer (STTR)"
        },
        "R1LineNumber": {
            "val": "158"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "3.255"
            },
            "PriorYear": {
                "val": "1.790"
            },
            "CurrentYear": {
                "val": "1.631"
            },
            "BudgetYearOne": {
                "val": "2.169"
            },
            "BudgetYearOneBase": {
                "val": "2.169"
            },
            "BudgetYearTwo": {
                "val": "2.254"
            },
            "BudgetYearThree": {
                "val": "2.393"
            },
            "BudgetYearFour": {
                "val": "2.586"
            },
            "BudgetYearFive": {
                "val": "2.621"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "(U) This Program Element (PE) provides funding for the administration of the Department of Defense (DoD) Small Business Innovation Research (SBIR) Program and the Small Business Technology Transfer (STTR) Program.  The SBIR\/STTR Program funds over one billion dollars annually in mission oriented research and development projects via small technology companies. The purpose of the program is to stimulate technological innovation, increase private sector commercialization of Federal R&D, increase small business participation in Federally funded R&D, foster participation by minority and disadvantaged firms in technological innovation, and foster cooperative research & technology transfer between small business and research institutions. The SBIR\/STTR Program is codified in 15 USC 638. The SBIR\/STTR Programs competitively fund scientific and technical innovation to specifically address the needs of participating DoD components.\n\n(U) DoD components participating in the SBIR Program include the: Army, Navy, Air Force, Defense Advanced Research Projects Agency (DARPA), Missile Defense Agency (MDA), Defense Threat Reduction Agency (DTRA), U.S. Special Operations Command (SOCOM), Joint Science & Technology Office for Chemical & Biological Defense (CBD), National Geospatial-Intelligence Agency (NGA), the Defense Logistics Agency (DLA), the Defense Microelectronics Activity (DMEA), the Defense Health Program (DHP) and the Office of Secretary of Defense (OSD) through the Assistant Secretary of Defense for Research & Engineering. DoD components actively participating in the STTR Program include the: Army, Navy, Air Force, DARPA and MDA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.857"
                },
                "CurrentYear": {
                    "val": "1.634"
                },
                "BudgetYearOne": {
                    "val": "2.183"
                },
                "BudgetYearOneBase": {
                    "val": "2.183"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.790"
                },
                "CurrentYear": {
                    "val": "1.631"
                },
                "BudgetYearOne": {
                    "val": "2.169"
                },
                "BudgetYearOneBase": {
                    "val": "2.169"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.067"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "-0.014"
                },
                "BudgetYearOneBase": {
                    "val": "-0.014"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.067"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.003"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.014"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.014"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P518"
                    },
                    "ProjectTitle": {
                        "val": "SBIR\/Challenge Admin"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.255"
                        },
                        "PriorYear": {
                            "val": "1.790"
                        },
                        "CurrentYear": {
                            "val": "1.631"
                        },
                        "BudgetYearOne": {
                            "val": "2.169"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.169"
                        },
                        "BudgetYearTwo": {
                            "val": "2.254"
                        },
                        "BudgetYearThree": {
                            "val": "2.393"
                        },
                        "BudgetYearFour": {
                            "val": "2.586"
                        },
                        "BudgetYearFive": {
                            "val": "2.621"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) The SBIR\/STTR Program is executed in three phases. The purpose of Phase I is to determine, insofar as possible, the scientific technical and commercial merit, and feasibility of ideas submitted under the SBIR\/STTR Program. Phase II awards are made to firms that have been awarded a Phase I contract on the basis of the results of their Phase I effort and the scientific, technical, and commercial merit of the Phase II proposal. Phase II is the principal research or research and development effort and is expected to produce a well-defined deliverable prototype. Phase III SBIR\/STTR efforts derive from, extend or conclude Phase I or Phase II efforts, and are not funded with SBIR\/STTR funds. Under Phase III, companies participating in the SBIR\/STTR Program are expected to obtain funding from the private sector and\/or non-SBIR\/STTR government sources to develop the prototype into a viable product or non-R&D service for sale in military and\/or private sector markets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR\/Challenge Admin"
                                    },
                                    "Description": {
                                        "val": "(U) Program element (PE) 0605790D8Z is the only source of funds for the coordination, administration and execution of the Department's SBIR\/STTR Programs. The DoD Office of Small Business Programs is tasked with providing Departmental SBIR\/STTR policy guidance, oversight and implementation and therefore requires program element (PE) 0605790D8Z to fund these administrative activities. In addition to funding costs for program administration, coordination and execution, PE 0605790D8Z funds essential elements of the SBIR\/STTR Program that are required by law including: \n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations and receipt of proposal responses; \n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; \n(3) Implement an aggressive outreach program including the execution of two National conferences and outreach to small technology companies, potential investors in such companies, SDBs, WOSBs, Institutions of Higher Learning, underrepresented states, and others, to facilitate participation in the SBIR\/STTR Programs; \n(4) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in the DoD SBIR Commercialization Readiness Program (CRP); and \n(5) Prepare all reports mandated by law and policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.790"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2014 accomplishments include program administrative oversight, coordination and execution for the DoD SBIR\/STTR Programs.  Specifically, DoD OSBP provided policy guidance and program oversight for the execution of 19 DoD Component SBIR\/STTR budgets.   Additional accomplishments include:\n(1) Coordinated and executed all required administrative functions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations, and receipt of proposal responses; \n(2) Developed new DoD outreach and commercialization Program Management Plans (PMP); initiated a DoD outreach working group targeted at increasing SBIR\/STTR outreach to underrepresented states;\n(3) Created and implemented new SBIR\/STTR automated waivers, forms and notifications system; created and documented new and existing SBIR\/STTR processes such as transition benchmarking, topic generation and solicitation process efficiencies which resulted in a reduction of this timeline by 125 days annually;\n(4) Standardized transition planning tools and processes to increase the rate of transition of SBIR\/STTR developed technologies into Programs of Record (POR) and fielded systems;\n(5) Conducted a gap analysis for missing, congressionally required statistical data; incorporated new data collection fields and worked closely with Small Business Administration (SBA) to ensure those fields were included in the annual SBIR and STTR reports to Congress."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.631"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2015 plan includes program administration, coordination, and execution of the SBIR\/STTR Program.  Specifically, provide policy guidance and oversight regarding execution of the FY 2015 DoD SBIR\/STTR budget between 13 Components to include:\n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations, and receipt of proposal responses;\n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Departments’ SBIR\/STTR Programs;\n(3) Improve and implement an outreach program to increase interest and facilitate participation of small technology companies, potential investors in such companies, research organizations, acquisition personnel, prime contractors and others in the SBIR\/STTR Programs;\n(4) Leverage DoD SBIR\/STTR Commercialization and Outreach Working Groups to promote best practices for meeting legislative requirements and optimizing standard processes for improving SBIR\/STTR technology transition and outreach activities;\n(5) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in DoD Commercialization Readiness Program (CRP); and\n(6) Prepare all reports mandated by law and policy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.169"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2016 plan includes program administration, coordination, and execution of the SBIR\/STTR Program.  Specifically, provide policy guidance and oversight regarding execution of the FY 2016 DoD SBIR\/STTR budget between 13 Components to include:\n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations, and receipt of proposal responses;\n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Departments’ SBIR\/STTR Programs;\n(3) Improve and implement an outreach program to increase interest and facilitate participation of small technology companies, potential investors in such companies, research organizations, acquisition personnel, prime contractors and others in the SBIR\/STTR Programs;\n(4) Leverage DoD SBIR\/STTR Commercialization and Outreach Working Groups to promote best practices for meeting legislative requirements and optimizing standard processes for improving SBIR\/STTR technology transition and outreach activities;\n(5) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in DoD Commercialization Readiness Program (CRP); and\n(6) Prepare all reports mandated by law and policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "(U) Performance is in support of the administration of the program and compliance with statutory requirements.  \n\n(U) For PE 0605790D8Z, management and administration of the DoD SBIR\/STTR Programs, the following measures have been established to meet requirements as mandated by law:  1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs, especially the creation of the five solicitions; 2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle; 3) Develop and conduct an aggressive outreach program, especially the planning and execution of an annual government training workshop and one small business conference; 4) Coordinate oversight, collect results, track execution and provide reporting of Phase III technology transition management and support of the DoD SBIR Commercialization Readiness Program; and 5) Prepare all reports required of the SBIR\/STTR Programs as mandated by law and policy."
                        }
                    }
                }
            ]
        }
    }
}