{
    "id": "9bacf553c256347b43704a6bf5b38ef8bb773f2d",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603826D8Z"
        },
        "ProgramElementTitle": {
            "val": "Quick Reactions Special Projects (QRSP)"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "132.975"
            },
            "PriorYear": {
                "val": "69.508"
            },
            "CurrentYear": {
                "val": "59.235"
            },
            "BudgetYearOne": {
                "val": "90.500"
            },
            "BudgetYearOneBase": {
                "val": "90.500"
            },
            "BudgetYearTwo": {
                "val": "76.441"
            },
            "BudgetYearThree": {
                "val": "82.971"
            },
            "BudgetYearFour": {
                "val": "86.943"
            },
            "BudgetYearFive": {
                "val": "95.002"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Quick Reaction Special Projects (QRSP) Program Element has been recast with a focus on producing risk-reducing prototypes designed to address priority Combatant Command (COCOM) threats.  QRSP efforts will support the Department’s goal to provide a hedge against technical uncertainty by leveraging insights gained through mission-focused efforts and by fostering collaboration among government laboratories, academia, and commercial research.  The QRSP portfolio will develop technology that anticipates adversaries’ capabilities through short-term, innovative science and engineering initiatives."
        },
        "ProgramElementMissionDescription": {
            "val": "The QRSP Program Element develops risk-reducing prototypes and conducts demonstrations designed to address immediate COCOM needs.  QRSP efforts support the Department’s goal to provide a hedge against technical uncertainty by supporting the development of potentially game-changing capabilities and by fostering collaboration among other government agencies, DoD laboratories, academia, and the commercial sector.  QRSP enables the Under Secretary of Defense for Acquisition, Technology and Logistics (USD (AT&L)) to respond to emergent DoD issues and time-sensitive threats by selecting projects within the year of execution.  These efforts field new capabilities at low cost in short time-frames, inform the requirements process, and inject innovative technologies into programs of record.  The QRSP Program supports four major project codes that expedite development and transition of new capabilities to the warfighter.  These projects are:  1) Quick Reaction Fund (QRF); 2) Rapid Reaction Fund (RRF); 3) Joint Rapid Acquisition Cell (JRAC) support; and 4) Strategic Multi-Layered Assessment (SMA) support.  Focus areas align to DoD science and technology priorities, including counter anti-access\/area denial; counter weapons of mass destruction; low-cost precision engagement; counter-electronic warfare; and autonomous systems.\n\nThe QRF Program objectives are to develop prototypes in response to emergent conventional warfare needs that take advantage of breakthroughs in rapidly evolving technologies.  The QRF is executed by the Rapid Reaction Technology Office (RRTO).  Examples of the types of projects that are envisioned include:  force protection projects to enhance anti-access and area denial capabilities, undersea offensive capabilities, and broad electronic warfare capabilities.  The QRF initiates projects during the execution year and focuses on maturing technologies critically needed for the COCOMs.  QRF projects are typically 12 months in duration and produce prototypes for demonstration and evaluation.  The QRF consistently exceeds the transition objective of 40 percent for demonstration programs (DoD Strategic Objective 3.5.2D).\n \nThe RRF program objectives, executed by the RRTO, are to develop prototypes to counter emerging irregular warfare threats, anticipate adversaries’ exploitation of new technologies and accelerate the delivery of effective and affordable capabilities to the warfighter.  RRF initiatives support the DoD Research and Engineering Enterprise mission to develop, demonstrate, assess, and rapidly field innovative concepts and technologies that supply critical capabilities to meet time-sensitive operational needs.  RRTO leverages technology developed outside of the DoD in the commercial sector, academia, international arenas, as well as small businesses and non-traditional sources, to address DoD needs as identified by COCOM, Military Service organizations, other Defense organizations, and interagency partners.  Typical RRF programs are six to 18 months in duration and aim to mature a capability to demonstration.  The RRF consistently exceeds the transition objective of 40 percent for demonstration programs (DoD Strategic Objective 3.5.2D).       \n\nThe JRAC Program objectives focus on responding to Joint Urgent Operational Needs (JUONS) and Joint Emerging Operational Needs (JEONS) that have been submitted by COCOMs and validated by the Joint Staff.  In addition, the JRAC’s objectives are to manage the delivery of capabilities as requested by the COCOM in a time frame acceptable to the COCOM.  Efforts, in most instances, utilize contingency and other rapid acquisition authorities.\n\nThe SMA cell’s objective is to support all COCOMs, Joint Force Commanders, and other government agencies by assessing complex operational\/technical challenges, which require multi-agency and multi-disciplinary approaches.  With input from across the United States Government, academia, and the private sector, the SMA cell develops solution options to Joint Staff\/COCOM-generated challenging problems and informs senior leadership.  Each assessment is initiated at the request of COCOM senior leadership.  Priorities for SMA Cell programs are set by the Joint Staff Deputy for Operations.  Products are typically generated within six months and directly contribute to the decision-making process of the Joint Staff\/COCOM’s senior leadership."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "68.524"
                },
                "CurrentYear": {
                    "val": "69.319"
                },
                "BudgetYearOne": {
                    "val": "91.825"
                },
                "BudgetYearOneBase": {
                    "val": "91.825"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "69.508"
                },
                "CurrentYear": {
                    "val": "59.235"
                },
                "BudgetYearOne": {
                    "val": "90.500"
                },
                "BudgetYearOneBase": {
                    "val": "90.500"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.984"
                },
                "CurrentYear": {
                    "val": "-10.084"
                },
                "BudgetYearOne": {
                    "val": "-1.325"
                },
                "BudgetYearOneBase": {
                    "val": "-1.325"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.967"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.983"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.097"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.097"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.084"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.228"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.228"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in funding from FY 2015 to FY 2016 reflects additional funding for prototyping to support the Defense Innovation Initiative (DII).  FY 2016 funding decreases were used to pay for higher priority DoD Bills."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P826"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "38.068"
                        },
                        "PriorYear": {
                            "val": "24.752"
                        },
                        "CurrentYear": {
                            "val": "18.530"
                        },
                        "BudgetYearOne": {
                            "val": "28.939"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.939"
                        },
                        "BudgetYearTwo": {
                            "val": "24.241"
                        },
                        "BudgetYearThree": {
                            "val": "26.405"
                        },
                        "BudgetYearFour": {
                            "val": "27.717"
                        },
                        "BudgetYearFive": {
                            "val": "30.390"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QSRP) Program supports four separate projects that provide rapid funding to expedite development and transition of new prototypical technologies to the warfighter.  The QSRP Program provides the flexibility to mitigate emerging threats and addresses needs that arise outside the two-year budget cycle. \n\nThe Quick Reaction Fund (QRF) Program provides the Services, components, Combatant Commands (COCOMs), and force providers opportunities to capitalize on technologies that are at a relatively high level of technical maturity and to rapidly field-test promising new proof of principle prototypes that can have immediate impact on military operations.  QRF initiatives are limited to those that will deliver a prototype application within 12 months of being funded.\n\nThe QRF Program focuses on projects that have the potential to address conventional, disruptive, catastrophic, and irregular threats.  More specifically, initiatives that serve to maintain a technical advantage over potential adversaries and reduce technical risk barriers in the following interest areas:  counter anti-access and area denial capabilities; base protection; electromagnetic bandwidth and spectrum enhancement; persistent intelligence, surveillance, and reconnaissance; newly emerging national threats; directed energy capabilities; low-cost precision engagement capabilities; operational field demonstrations; unmanned and robotics systems; counter weapons of mass destruction capabilities; and counter-electronic warfare technologies.  \n\nIn FY 2015 and FY 2016, the QRF Program will continue to identify and fund new projects and prototypes that respond to critical operational needs and emerging threats.  Current and future efforts that show significant effectiveness can be leveraged by additional investments in order to accelerate transition to operational forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Morning Express"
                                    },
                                    "Description": {
                                        "val": "This project provides countermeasures to electronic systems to protect forces and infrastructure from attack.  Target systems use electronic components, against which countermeasures were developed.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.354"
                                            },
                                            "Text": {
                                                "val": "The project developed and evaluated a prototype system against a threat emulator.  The program will transition through the Services and the Joint Air-Sea Battle Office as the lead operational advocate in FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Steel Tiger"
                                    },
                                    "Description": {
                                        "val": "The Steel Tiger project developed algorithms that were incorporated into a commercial radar system.  The resulting capability fulfills a COCOM urgent need.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.329"
                                            },
                                            "Text": {
                                                "val": "The project completed enhancements of a prototype system and executed two technical and one operational demonstration.  The system will be deployed to a host site in FY 2015 for further operational evaluation.  The QRF funding for this effort completed in FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Square Dance Collaboration on SENTIENT-R"
                                    },
                                    "Description": {
                                        "val": "Data transfer between different secure networks is challenging and time consuming.  This effort created a single integrated Maritime Domain Awareness (MDA) environment to provide operational users access to MDA sensitive compartmented information (SCI) data.  The project establishes a basis for improved U.S. and Commonwealth nations’ research and development and future intelligence, surveillance, and reconnaissance (ISR) interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.759"
                                            },
                                            "Text": {
                                                "val": "Two sets of hardware and software to support the capability were developed and prepared for transition to the Office of Naval Intelligence (ONI).  Hardware and software developed in FY 2014 will be delivered to the ONI to support operations in mid-FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "U.S. and Australian Enclave Moving Target Cyber Collaboration Experiment"
                                    },
                                    "Description": {
                                        "val": "This project developed a network protect and defend capability demonstrating enclave resiliency during cyber events.  The project conducted experiments to prove the capability will operate through cyber-attack events in U.S. and Australian Defense Department enclaves."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.754"
                                            },
                                            "Text": {
                                                "val": "This project demonstrated approaches to achieve a level of seamless, automated cyber operations support and shared cyber situational awareness, leveraging moving target technologies.  The capability will transition to the Automated Digital Network System Program Office in FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dark Storm"
                                    },
                                    "Description": {
                                        "val": "The program provides advanced Space Situational Awareness (SSA) collection capabilities.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.659"
                                            },
                                            "Text": {
                                                "val": "The project developed a multi-camera system and demonstrated the ability to deliver improved timeliness information to the user community.  The capability transitioned to an operational user.  No further Quick Reaction Fund funding is planned for Dark Storm."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Personnel Landmine Alternative Integration Experiment"
                                    },
                                    "Description": {
                                        "val": "This project demonstrates that prediction, identification, geo-location, and responses to opposing force movements can be made more quickly and effectively with the use of an integrated Intelligence, Surveillance, and Reconnaissance (ISR), and kinetic fires capabilities.  The project provides enhanced battlespace awareness and improved force application capabilities to direct and concentrate fires on opposing forces.  It measures efficacy and latencies associated with detection, identification, and targeting of opposing forces in areas up to 17 kilometers from the control center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.791"
                                            },
                                            "Text": {
                                                "val": "The Anti-Personnel Landmine Alternative Integration Experiment demonstrated lower latencies for detection, identification and targeting; higher probabilities of opposing force detection and identification; and more rapid and accurate targeting of opposing forces when compared to current capabilities.  The project informs anti-personnel landmine alternative modeling, development, and acquisition plans.  Pre-experiment demonstrations were conducted in June 2014, at Fort Belvoir, Virginia.  A full experiment was conducted in August 2014 at Yuma Proving Grounds, Arizona.  The project may continue under the leadership and funding of Army Research Laboratory in FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pacific Pilot"
                                    },
                                    "Description": {
                                        "val": "The Pacific Pilot project integrated network technologies and demonstrated a net-centric approach to bi-directional dissemination of command, control, communications, computers, intelligence, surveillance, and reconnaissance data to find, track, and fix threats supporting U.S. Air Force, Navy, and Special Operations Forces’ tactical communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.729"
                                            },
                                            "Text": {
                                                "val": "The project developed and evaluated a prototype network system.  Follow-on demonstrations will be executed in FY 2015 with future transition to Navy and Air Force program offices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hardware\/Software (HW\/SW) Assurance and Integrity Analysis"
                                    },
                                    "Description": {
                                        "val": "The Department of Defense (DoD) has developed a Trusted Systems strategy that is based upon mission assurance, comprehensive protection planning, industry standards, and advancing the state of practice and DoD capability to identify and mitigate HW\/SW vulnerabilities through techniques and tools, and creation of needed new HW\/SW assurance technology.  This project provides research and development focus to advance capabilities that can be made available to current and future programs in acquisition, operational systems and legacy systems, and infrastructure.\n\nThis Quick Reaction Fund (QRF) effort directly supports the 2014 National Defense Authorization Act (NDAA) Section 937 and adds to current Department work implementing requirements in NDAA 2013 Section 933.  It provides funding for the Department’s capabilities to augment and federate existing HW\/SW assurance expertise, capabilities and facilities within the Services and Agencies, to address existing gaps, as well as emerging threats and vulnerabilities.  The resulting federation will assess and prioritize critical mission vulnerabilities to malicious software, supply chain exploit, and related cyber vulnerabilities, prioritize the use of best practice in Hardware\/Software (HW\/SW) vulnerability assessment, tested tools, proven processes, then promulgate findings and know-how."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.377"
                                            },
                                            "Text": {
                                                "val": "Leveraged and augmented resources in the Services and National Security Agency to develop and deploy HW\/SW tools, evaluation techniques, and best practices to support HW\/SW assurance throughout the lifecycle.  Identified available tools, recommended implementation guidance, and support capabilities.  Identified gaps and addressed with plans and development activities.  Defined a federated approach to ensure HW\/SW security and support to capability development, acquisition, and sustainment activities.  Identified Service and agency expertise and capabilities and developed an overarching framework to enable cross DoD coordination, oversight, and prioritization.  Coordinated risk-based process aimed at efficient development and deployment of assurance and mitigation facilities and capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue development, assessment, recommendation, and promulgation of software test tools and techniques.  Continue maturation of federated approach to ensuring HW\/SW tools, techniques, expertise, and support to acquisition and sustainment programs.  Continue gap identification, assessment, and prioritization.  Continue maturation of cross-DoD Concept of Operations (CONOPS) in delivery of HW\/SW assurance services to programs.  Initiate planning, fact-finding, and cross-Service coordination for software and hardware assurance enterprise license needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Continue development, assessment, recommendation, and promulgation of software test tools and techniques.  Continue maturation of federated approach to ensuring HW\/SW tools, techniques, expertise, and support to acquisition and sustainment programs.  Continue gap identification, assessment, and prioritization.  Continue maturation of cross-DoD CONOPS in delivery of HW\/SW assurance services to programs.  Begin license acquisition, transitioning to centralized inventory and deployment, and operational management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Access\/Area Denial Focus Area"
                                    },
                                    "Description": {
                                        "val": "In FY 2015 and FY 2016, this QRF focus area will support projects that concentrate on developing capabilities and countermeasures in anticipation of emerging needs to monitor and\/or gain access to geographical areas that have been strategically denied by adversarial forces and technologies.  The Rapid Reaction Technology Office will ensure the QRF efforts are not duplicative with other work within DoD or with outside agencies and will seek to leverage such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.106"
                                            },
                                            "Text": {
                                                "val": "Anti-access\/area denial investment decisions during the budget year will respond to Department, COCOM, Service, and other government organization priorities, and new investments will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry, and academia will help identify areas critical to developing future anti-access\/area denial technological enhancement efforts.  Anticipate funding three prototypes in FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.988"
                                            },
                                            "Text": {
                                                "val": "Anti-access\/area denial investment decisions during the budget year will respond to Department, COCOM, Service, and other government organization priorities, and new investments will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, Federally Funded Research and Development Centers, other government agencies, industry, and academia will help identify areas critical to developing future anti-access\/area denial technological enhancement efforts.  Anticipate funding five prototypes in FY 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Electronic Warfare Technologies Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area, in anticipation of emerging needs, will include the maturation of proof of principle prototypes that advance countermeasures against electronic components and systems to protect forces and infrastructure.  In addition, projects may include techniques and methodologies that reduce adversarial electronic attack capabilities and enhance our ability to operate in denied areas.  The Rapid Reaction Technology Office will ensure the QRF efforts are not duplicative with other Counter-Electronic Warfare efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.106"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in counter-electronic warfare technologies during the budget year will respond to Department, COCOM, Service, and other government organizations priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia will help identify areas critical to counter-electronic warfare efforts. Anticipate funding three projects in FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.988"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in counter-electronic warfare technologies during the budget year will respond to Department, COCOM, Service, and other government organizations priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia will help identify areas critical to counter-electronic warfare efforts.  Anticipate funding five projects in FY 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Weapons of Mass Destruction (CWMD) Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area for FY 2015 and FY 2016, in anticipation of emerging needs, will include the development and advancement of prototype technologies that focus on the detection and interdiction of chemical, biological, radiological, nuclear, and high yield explosives threats.  Projects may include techniques and methodologies that improve detection sensitivities, persistent intelligence, surveillance, and reconnaissance, data-to-decision tools, and global situational awareness.  The RRTO will ensure the QRF efforts are not duplicative with other CWMD efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.106"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in CWMD during the budget year will respond to Department, COCOMs, Service, and other government organizations priorities and new projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia will help identify areas critical to CWMD efforts.  Anticipate funding two projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.987"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in CWMD during the budget year will respond to Department, COCOMs, Service, and other government organizations priorities and new projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia will help identify areas critical to CWMD efforts.  Anticipate funding four projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Field Demonstrations Focus Area"
                                    },
                                    "Description": {
                                        "val": "In anticipation of emerging needs, this focus area for FY 2015 and FY 2016 will include proof of principle and pre-Engineering and Manufacturing Development prototyping, and field demonstrations of technologies and fully integrated systems in direct response to critical operational needs and emerging threats.  Emphasis will be on near term demonstration of the feasibility and military utility of integrated capability solutions that support conventional forces.  Projects will transition to operational users within 12 months of initiation.  The RRTO will ensure the QRF efforts are not duplicative with other Operational Field Demonstration efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.106"
                                            },
                                            "Text": {
                                                "val": "Operational Field Demonstrations investment decisions during the budget year will respond to Department, COCOM, Service, and other government organization priorities, and projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the other government agencies, industry, and academia will help identify areas critical to Operational Field Demonstrations efforts.  Anticipate funding three projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.988"
                                            },
                                            "Text": {
                                                "val": "Operational Field Demonstrations investment decisions during the budget year will respond to Department, COCOM, Service, and other government organization priorities, and projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia will help identify areas critical to Operational Field Demonstrations efforts.  Anticipate funding four projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Intelligence, Surveillance, and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "In anticipation of emerging needs, this focus area for FY 2015 and FY 2016, will include capabilities that improve ground, air, sea, and\/or space situational awareness for decision makers.  Technologies may explore new or improved methods for surveillance sensors to operate within denied areas and more effective ISR architectures for rapidly processing, exploiting, and disseminating situational awareness intelligence.  They will ensure the efforts are not duplicative with on-going persistent ISR work and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.106"
                                            },
                                            "Text": {
                                                "val": "Persistent ISR investment decisions during the budget year will respond to Department, COCOM, Service, and other government organization priorities and projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the other government agencies, industry, and academia will help identify areas critical to developing future capabilities.  Anticipate funding three projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.988"
                                            },
                                            "Text": {
                                                "val": "Persistent ISR investment decisions during the budget year will respond to Department, COCOM, Service, and other government organization priorities and projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the other government agencies, industry, and academia will help identify areas critical to developing future capabilities.  Anticipate funding five projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2016, performance metrics applicable to the Quick Reaction Fund (QRF) includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a Strong Technical Foundation Within the Department's Science and Technology (S&T) Program\" and the metric for this objective is to transition 40 percent of completing demonstrations per year.  Each project has a period of performance of approximately six to 18 months.  All QRF projects are monitored for schedule deviation, transition outcome, reporting requirements, and deliverables such as test reports, components, and equipment.  For projects that were completed in FY 2014, the QRF achieved a transition rate of approximately 80 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P828"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "89.419"
                        },
                        "PriorYear": {
                            "val": "41.210"
                        },
                        "CurrentYear": {
                            "val": "37.060"
                        },
                        "BudgetYearOne": {
                            "val": "57.879"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.879"
                        },
                        "BudgetYearTwo": {
                            "val": "48.482"
                        },
                        "BudgetYearThree": {
                            "val": "52.811"
                        },
                        "BudgetYearFour": {
                            "val": "55.433"
                        },
                        "BudgetYearFive": {
                            "val": "60.781"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QSRP) Program supports four separate projects that provide rapid funding to expedite development and transition of new prototypical technologies to the warfighter.  The QSRP Program provides the flexibility to mitigate emerging threats and addresses needs that arise outside the two-year budget cycle.  \n\nThe Rapid Reaction Fund (RRF) is fully executed through the Rapid Reaction Technology Office (RRTO).  RRTO was established to accelerate the development and transition of high-potential science and technology (S&T) projects into operationally useful prototypes in the execution years.  The RRTO:  leverages the Department of Defense (DoD) S&T base and those of the other federal departments, academia, and industry; stimulates interagency coordination and cooperation; accelerates the fielding of prototypical capabilities and concepts to counter emerging threats; and, provides feedback to the S&T community to guide long term developmental strategies.  With projects supporting each Department\/Combatant Command (COCOM) priorities with a global perspective, RRTO anticipates adversaries' exploitation of technology, including available and emerging commercial capabilities.  Prototypes delivered by RRTO provide cost effective capabilities to operational users faster than the typical acquisition cycle.\n\nIn prior years, RRTO has explored methods and approaches of persistent surveillance for counter-insurgency; developed alternate power sources for sensors and systems; provided low-cost capabilities for small-footprint operations; expanded human, social, and cultural knowledge; increased small unit situational awareness; advanced the interface between law enforcement and military operations; developed advanced biometrics and forensics capabilities; supported denied area operations; performed strategic multi-layer assessments; and, established an innovation outreach cell that facilitates better interactions with small companies developing emerging technologies that do not normally do business with the DoD.   \n\nIn FY 2016, RRTO will continue to explore new and emerging capabilities to support irregular warfare operations in support of the Under Secretary of Defense (Acquisition, Technology & Logistics), the Assistant Secretary of Defense (Research and Engineering), and the Deputy Assistant Secretary of Defense (Emerging Capability & Prototyping) goals.  With project selection occurring during the execution year, the RRTO's potential focus areas for FY 2016 projects include:  capabilities to operate in denied areas; navigation in Global Positioning System-denied environments; persistent Intelligence, Surveillance, and Reconnaissance (ISR) architectures; ISR sensors; global warming’s impact on operations in the Arctic; novel power sources for unmanned vehicles; interface of law enforcement and military operations; commercial product vulnerabilities and applications; biometrics and forensics science and technology; autonomous operations; data processing, exploitation and dissemination; cyber security; exploitation of new and emerging cell phone technologies; counter-proliferation initiatives; strategic communications and multi-layer assessments; and, non-traditional approaches to leverage innovative businesses.   \n\nThe typical length of an RRTO project falls within a six to 18 month range in order to more effectively respond to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "Selected, executed, and transitioned multiple low cost projects in the areas of unmanned autonomous vehicles, electromagnetic spectrum agility, space resiliency, detection of explosives and weapons of mass destruction, deterrence of violent extremism, exploitation of off-the-shelf technology, exploitation of communications technologies, small footprint operations, and other emerging technology areas.  These projects delivered proof of principle prototypes for evaluation or assessment to warfighters and interagency users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.910"
                                            },
                                            "Text": {
                                                "val": "•  Covert Unmanned Underwater Vehicle (UUV) Optical Communications Demonstration:  Completed a Covert UUV Optical Communications Demonstration, which developed an optical modem to efficiently exfiltrate mission data without requiring physical recovery of the UUV; project deliverables transitioned to U.S. Navy Commander, Submarine Forces.\n•  Lightweight Intelligent Thermoelectric Energy:  Completed the Lightweight Intelligent Thermoelectric Energy prototype, a man-portable electrical power source that can convert combustion heat, of any heat source, into useful electric power; capability transitioned to U.S. Army Special Operations Command.\n•  Supercavitating Vehicle Hybrid Rocket Motor Technology:  Completed the Supercavitating Vehicle Hybrid Rocket Motor Technology project to demonstrate the potential of inexpensive, reliable off-the-shelf solid rocket motors to augment the controllability and superior performance of liquid rocket motor configurations.  This was an anticipatory effort to enhance the capability of the Office of Naval Research’s Large Diameter Unmanned Underwater Vehicle.\n•  Collapsible Water Charge:  Completed user evaluation of the Collapsible Water Charge prototype to gather critical operational user input and feedback on Tactics, Techniques, and Procedures for the shaped charge concept developed by U.S. Naval Explosive Ordnance Disposal (EOD) Technology Division.  The capability transitioned to Joint EOD operators.\n•  Collaborative Cross Domain Problem Solving:  Completed and transitioned the Collaborative Cross Domain Problem Solving project allowing warfighters to collaborate securely with classified users, law enforcement, coalitional assets, and other government agencies without a large, dedicated collaboration system.\n•  WiFi Geo-Location in Dense Co-Channel Environments:  Completed the WiFi Geo-Location in Dense Co-Channel Environments project, which developed an airborne receiver system to accurately geo-locate WiFi devices in dense urban environments.  Project deliverables transitioned to a U.S. Air Force Research Lab Rapid Innovation Fund program.\n•  Topaz:  Completed and transitioned the Topaz project, a prototype Radio Frequency intrusion detection sensor in support of critical infrastructure protection efforts; details of this project are classified.\n•  Periscope Simulator Demonstration:  Completed the Periscope Simulator Demonstration for Naval Underwater Warfare Center to evaluate the effectiveness of a prototype Non-Acoustic Periscope Simulator payload; project deliverables transitioned to U.S. Navy Commander, Submarine Forces.\n•  Fuel Management and Tailoring Device:  Completed demonstration of the Fuel Management and Tailoring Device, which monitors, tailors, and overcomes fuel inefficient driving habits in tactical vehicles.  The low cost fuel management device reduces fuel requirements by three to five percent.  Project deliverables were transitioned to the U.S. Navy Expeditionary Combat Command and U.S. Marine Corps.\n•  Green Flash:  Completed and transitioned the Green Flash prototype providing a threat event countdown and notification application for smart phones.  Details of this project are classified.\n•  Contingency Communications:  Completed Contingency Communications to develop low visibility mission communications capabilities to protect clandestine operators and information.  Project deliverables transitioned to U.S. Special Operations Command.\n•  Quantum Sensing:  Completed the Quantum Sensing project to explore methods to increase imagery resolution by exploiting quantum mechanical phenomena; details of this project are classified.\n•  Opal:  Completed and transitioned the Opal low power, small form factor software defined radio prototype to support Department of Defense and Department of Homeland Security missions; details of this project are classified.\n•  Operationalizing “Just Doesn’t Look Right.”  Completed the Operationalizing “Just Doesn’t Look Right” demonstration of a capability to give peacekeepers and military police enhanced situational awareness and a better understanding of culturally relevant suspicious behaviors, potentially reducing the learning curve for new missions and facilitating personnel safety and mission completion.  Project deliverables transitioned to U.S. Southern Command.\n•  Omni laser communications prototype:  Completed and transitioned the Omni laser communications prototype, a system capable of:  operating from battery power; supporting multiple concurrent links; operating in radio frequency jamming environments; and, automatically acquiring and tracking multiple sources.  Details of this project are classified.\n•  Fusion Acquisition to Support Targeting:  Completed and transitioned the Fusion Acquisition to Support Targeting prototype to provide more accurate, real-time, and Size, Weight, and Power (SWAP)-efficient processing of Light Detection and Ranging (LiDAR) and Hyperspectral data to improve targeting capabilities for the warfighter.  Project deliverables transitioned to the Naval Oceanographic Office as an upgrade to the Coastal Zone Mapping and Imaging LiDAR.\n•  Social Network Aided Geo-Location:  Completed and transitioned enhancements to the Social Network Aided Geo-Location program; details of this project are classified.\n•  Distributed Full Motion Video (FMV) Exploitation prototype:  Completed Distributed FMV Exploitation project, which developed a prototype software system to enable FMV exploitation in near real time; project deliverables transitioned to the National Geospatial-Intelligence Agency.\n•  Controlling Cooperative Unmanned Aerial Vehicles (UAV) Using Brainwaves:  Completed the Controlling Cooperative UAV Using Brainwaves project to develop and demonstrate core technologies to enable a warfighter to conduct simple military missions using UAVs controlled by brainwaves.\n•  Counter Smuggling Weapons of Mass Destruction (WMD) Analysis, Training, and Technology (C-SWATT):  Completed C-SWATT effort to provide national security forces in friendly\/allied nations with the capability to detect and interdict Chemical, Biological, Radiological, and Nuclear (CBRN) materials and other illicit traffic; project deliverables transitioned to the Counter-Terrorism Technical Support Office and Defense Threat Reduction Agency.\n•  Tracking and Recognizing Disruptive Innovative Science:  Completed the Tracking and Recognizing Disruptive Innovative Science project, which developed prototype software to identify countermeasures to our core military capabilities via open source data exploitation.\n•  Distributed Precision Geo-location System:  Completed the Distributed Precision Geo-location System demonstration, which leveraged a large number of existing fielded sensors to rapidly provide a robust capability to detect, identify, and track targets of interest.  Details of this project are classified.\n•  Event Notification System:  Completed and transitioned the Event Notification System in support of U.S. Northern Command; details of this project are classified.\n•  Fourth Option:  Completed the Fourth Option project to develop a novel capability to track and trail threat vessels; details of this project are classified.\n•  Operate to Know:  Completed the Operate to Know project demonstrating a layered sensing and real-time situational awareness technology for the U.S. Marine Corps.  This effort brought the prototype architecture to a live wargaming environment to evaluate the concept.  Follow-on experimentation will be supported by the U.S. Marine Corps to enhance the capability and develop an application testbed.\n•  Net Zero Engagement:  The Net Zero Engagement project identified pilot locations in the U.S. Africa Command Area of Responsibility, compiled proven engagement approaches, and coordinated participation and planned efforts with the DoD, warfighters, and host nation partners.  The project developed frameworks, tools, and training for U.S. Service personnel to build partner capacity and achieve better engagement outcomes in unstable and transitioning states at significantly lower cost.\n•  ACME+:  Completed the ACME+ project to adapt sensor technology to the emerging 3G\/4G High Speed Packet Access (HSPA) and High Speed Packet Access Evolved (HSPA+) communication protocols.  This effort will allow the warfighter to address emerging threats, such as terrorist activities.  This effort transitioned to the end user in support of the warfighter.\n•  Arctic Cooperation:  Completed the Arctic Cooperation project to assess the value added of Canadian commercial source data compared to data from classified U.S. sources for situational awareness in the Arctic.  This effort will allow a quantitative measure of current sensing, fusion, and analysis capabilities.  Details of this project are classified.\n•  Contingency Communications:  Completed the Contingency Communications project which aimed to provide Special Operations Forces (SOF) with tools to both communicate and collect intelligence data as required in a post Afghanistan environment focused on “Special Warfare” while providing protection to the data associated with those transmissions.  Transitioned to end user.\n•  Future Infrared Search and Track Phase Two:  Completed Future Infrared Search and Track (FIRST) Phase Two which followed the successful completion of the initial phase tasks for an advanced infrared search and track (IRST) sensor.  Phase Two expands the effort to demonstrate a novel sensor design that can detect targets with high resolution over a wide field of view with few pixels.  The project transitioned to DoD partners. \n•  Flume:  Completed Phase One of the Flume assured data delivery software project which provided assured delivery of data over existing networks used by U.S. Special Operations Command (SOCOM).  Phase One consisted of technical discovery, testing, and documentation.  The project will continue in FY 2015 with FY 2014 funding until the software and support services to be delivered to SOCOM in FY 2015.\n•  Forward Firing Flare:  Completed the Forward Firing Flare project which delivered two ALE-47 Chaff\/Flare Buckets in the forward firing configuration for nonstandard aircraft.  Transitioned products to U.S. Central Command (USCENTCOM).\n•  Lithium-ion Battery State-of-Health Monitor:  Completed Phase 1 of the Lithium-ion Battery (LiB) State-of-Health Monitor project, which aimed to create a diagnostic device for LiBs to detect irreversible chemical damage and prevent catastrophic failures.  This capability will reduce the threat of sudden LiB failures, enabling safe use of efficient, energy-dense LiBs in a variety of platforms including unmanned systems.  Prototype development will complete in FY 2015 using FY 2014 funds. \n•  Laser Threat Detection and Defeat:  Completed the Laser Threat Detection and Defeat (LTDD) project, which integrated advanced sensing technologies and mathematical algorithms into a prototype system capable of automatically identifying both the location and threat characteristics of offensively employed laser devices against U.S. Government personnel and facilities.  The system will enable Warfighters to effectively employ sensors and imagers to automatically detect, characterize, and locate the laser threat so that it can be defeated.  The technology transitioned to the Technical Surveillance Counter Measures (TSCM) Operational Units for fielding and maintenance.\n•  Pacific Pilot:  Completed Pacific Pilot, which sought to develop a prototype and testing of component technologies to demonstrate a net-centric approach to bidirectional dissemination of C4ISR to find, track, and fix threats supporting tactical communication.  The technology transitioned to Navy and Air Force end users.\n•  Perseus III:  Completed the Perseus III project, which aimed to enhance the understanding of the capabilities and limitations of inexpensive, homemade Unmanned Aerial Vehicles (UAVs) and how they may place DoD personnel, equipment and infrastructure at risk.  College students participated in an exercise to identify low cost UAV solutions.  The effort taps into nontraditional sources and provides DoD and the Intelligence Community with a fresh look at a growing problem. \n•  Radio Frequency Interference:  Completed the Radio Frequency Interference project which supported designing, executing, and analyzing laboratory tests of radio frequency interference from a new class of low-power radio frequency devices on communications systems.  The details of this project are classified. \n•  Solid State Neutron Detector:  Completed the Solid State Neutron Detector (SSND) project which leveraged the single solid state detector previously developed by National Aeronautics and Space Administration (NASA) and Department of Energy (DoE) to design, fabricate, and test a two neutron detector package with associated electronics.  This technology, which reduces material cost and false alarm rate while providing a 10-fold increase in neutron detection, has been transitioned to end users.\n•  Tactical–Human Powered Submarines (T-HPS):  Completed the baseline testing of a previously developed T-HPS hull.  The testing will develop\/validate proposed, tactics, techniques, and procedures (TTP) for man-portable clandestine maritime insertion or operations of up to four hours with gear in international waters anywhere in the world.  The hull forms were transitioned to United States Navy Special War Command and United States Naval Academy. \n•  Visualization, Summarization, and Recommendation (VISR) for Audio\/Visual Data:  Completed Phase One of the VISR for Audio\/Visual Data project, which sought to create an integrated tool to incorporate basic data ingest tools into a framework capable of digesting and analyzing large amounts of data and making recommendations to the user for other sources on topic.  This project will be completed in FY 2015 with FY 2014 funds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Calderaevent"
                                    },
                                    "Description": {
                                        "val": "Calderaevent is a novel approach to provide situational awareness by integrating commercially available hardware with government developed algorithms.  Technologies leveraged by this effort include precise timing equipment, military-grade radio sets, and government developed algorithms.  This capability will enable the warfighter to seamlessly operate from permissive to denied environments.  Further details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Calderaevent prototypes were successfully demonstrated in the Trident Spectre and Gypsy India exercises in FY 2014.  The system evaluation report was delivered to the sponsor and training manuals and user guides were delivered to the customer organization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Cell"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell provides planning support to COCOMs and U.S. government agencies and provides actionable, systems orientation to complex operational\/technical challenges.  SMA efforts require multi-agency, multi-disciplinary approaches to address requirements that are not within the customer organization’s core competency.  The SMA cell identifies solutions from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Staff\/J-3 and are executed by the RRTO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The Drivers of Conflict and Convergence in the Asia-Pacific Region in the Next Five to 25 Years effort executed by SMA assessed stability in the broader East Asian region.  Using a variety of methodologies and disciplinary approaches, the research teams for this project built a qualitative and quantitative framework for understanding the drivers of conflict and convergence in the Asia-Pacific region.  Project teams used content analysis, historical comparison, expert elicitation, and quantitative modeling to identify key variables that influence conflict and cooperation, with particular attention to the U.S.-China relationship in context with other key actors.  These analyses informed the development of a systems dynamic model and decision support tool.  The overall objective of the suite of projects contained in this effort was to inform U.S. Pacific Command decision makers in the development of intermediate and long-term strategies to manage risk and engage opportunities in the Asia-Pacific region.  In addition to the insights provided by each project team, the projects also informed a systems dynamic model and decision support tool for COCOMs.  These assessments are intended to be combined with unclassified (e.g., academic, subject matter expert, etc.) input not generally found in U.S. government work."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Based on the analytical methods, the framework development and systems dynamics models developed during the Drivers of Conflict and Convergences project, the U.S. Security Coordinator (USSC) for Israel and the Palestinian Authority has requested that the SMA cell conduct a Coordinator’s Mission Review.  The goal is to evaluate strategic risks and identify knowledge gaps in order to provide an increased understanding of potential future security environments and their implications for Palestinian security sector reform.  The SMA team will conduct a multi-disciplined review of USSC questions and provide to the USSC staff a series of insights and recommendations that will enable them to derive a rich contextual understanding of the socio-political, social-cultural, security, and economic dynamics of the region.  The SMA cell will also continue to actively work with the COCOMs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the COCOMs and may include areas such as:  counter terrorism; transnational criminal organizations; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; regional stability assessments; and, individual state or national level deterrence studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The SMA cell will continue to actively work with the COCOMs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the COCOMs and may include areas such as:  counter terrorism; transnational criminal organizations; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; regional stability assessments; and, individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biometrics and Forensics Science and Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "The focus area for Biometrics and Forensics Science and Technology projects will field prototypes that address the technology gaps that limit our ability to quickly and accurately identify anonymous individuals who threaten our physical and virtual assets, overseas or in the Homeland.  Additionally, the biometrics and forensics projects will collaborate with interagency partners to attribute enemy activity to a specific individual; and, will operationally evaluate and test biometrics and forensics systems and technologies.  The biometrics and forensics projects will mature emerging technologies that support evolving identity operations and forensic capabilities required by commanders and warfighters in ongoing and future military activities.  Projects for both portfolios are selected after coordination throughout the DoD and across other U.S. government departments and agencies to maximize collaborative investment and prevent redundant research.  Deliverables are shared throughout the biometrics and forensics communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "The Biometrics and Forensics Science and Technology Focus Area engaged with warfighters and commanders from across the COCOMs and Services to identify common technology gaps within the respective enterprises.  In accordance with these requirements, the biometric portfolio developed improved fingerprint matching algorithms between two-dimensional, three-dimensional, and latent fingerprints; delivered a prototype facial recognition system for vehicle check points; conducted an evaluation of emerging contactless fingerprint collection systems; developed the first stage of a Biometrically Enabled Watch List (BEWL) Dissemination Management Server to improve speed and accuracy of Biometric Watchlists; developed a Next Generation Mobile Identification application for the iPhone; and, developed a multi-sensor process to remotely detect and monitor clandestine gravesites.  The forensic portfolio developed several advancements for the exploitation of genetic material beginning with an expert deoxyribonucleic acid (DNA) interpretation software package to evaluate complex mixtures of DNA sources; a next generation system for human identification and physical trait characterization; a DNA sequence exploitation system for investigative genetics; and an ultra-rapid hand-held DNA system.  After successful development and testing, three rapid DNA devices capable of generating human DNA identifications in 82 minutes were transitioned to U.S. Special Operations Command and the U.S. Army for operational use."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "The biometric portfolio will develop technologies to close gaps identified by commanders and operational users in the areas of increasing standoff distance for collection of biometric data, exploration of the use of emerging biometric identification modalities, collection of biometric data from non-cooperative subjects, and improving the matching accuracy of non-ideal biometric data.  The biometric portfolio will also support the final phases of testing evaluations and technology transfer of the BEWL Dissemination Management Server.  The forensic portfolio will support development of capabilities to close gaps identified by commanders in the areas of faster collection of forensic data, improving accuracy of analysis of data, expanding the types of forensic data collected, and increasing the amount of analysis that can be done in a field environment vice a laboratory environment.  The forensic portfolio will manage the technology development efforts required to enable human identification and characterization capabilities and development of next generation genomic analysis technology.  Additional projects for biometrics and forensics portfolios will be selected after coordination throughout DoD and across other U.S. Government departments and agencies to maximize collaborative investment and prevent unnecessary redundant research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "The biometric portfolio will continue to mitigate gaps identified by commanders and operational users in the areas of increasing standoff distance for collection of biometric data, exploration of the use of emerging biometric identification modalities, collection of biometric data from non-cooperative subjects, and improving the matching accuracy of non-ideal biometric data.  The biometric portfolio will also support the final phases of testing evaluations and technology transfer of the BEWL Dissemination Management Server.  The forensic portfolio will mitigate gaps identified by commander’s capabilities documents in the areas of faster collection of forensic data, improving accuracy of analysis of data, expanding the types of forensic data collected, and increasing the amount of analysis that can be done in a field environment vice a laboratory environment.  The forensic portfolio will manage the technology development efforts required to enable human identification and characterization capabilities and development of next generation genomic analysis technology.  Additional projects for biometrics and forensics portfolios will be selected after coordination throughout DoD and across other U.S. Government departments and agencies to maximize collaborative investment and prevent unnecessary redundant research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Faster Short Tandem Repeat (FaSTR) Human DNA Profiling System"
                                    },
                                    "Description": {
                                        "val": "FaSTR uses a different approach to achieve faster, inexpensive, and portable Human DNA analysis.  This two phase project will develop a portable Compact Disc player-sized instrument to control the flow of human DNA and chemistry through centrifugal speed.  The goal is to generate a DNA profile from “sample in” to “answer out” in sub-30 minutes and provide a match probability of one in five million people."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.050"
                                            },
                                            "Text": {
                                                "val": "Phase I focused on sub-system design of a microfluidic system that:  (1) probes five Short Tandem Repeat (STR) loci (eventually six to nine), yielding a random match probability of one in five million, (2) demonstrated functionality of all major subsystems, including instrument, chemistry, and software control, (3) is small and easily ported and weighs < 30 pounds, (4) has simplified microfluidic architecture; and, finally, (5) exploits passive (not mechanical) valves to control fluid flow from “sample in” extraction through to electrophoresis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Phase II will integrate the subsystems and seek opportunities to probe additional STR loci.  In addition, this phase will consist of testing and design modifications and optimizations to the initial prototypes delivered from Phase I.  Test results will be reported back to project leaders for additional hardware and chemistry design modifications and optimizations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovation Outreach Program"
                                    },
                                    "Description": {
                                        "val": "The Innovation Outreach Program supports the Department of Defense Better Buying Power objectives by leveraging technology and emerging products developed by small, innovative businesses in the commercial sector.  Solutions will be sought to meet needs identified by COCOMs, Military Service organizations, other Defense agencies, and interagency partners.  The Innovation Outreach Focus Area will support the Department's objectives of promoting effective competition and fielding affordable capabilities by developing new sources of innovation from commercial research and development investments.  The Innovation Outreach Focus Area will include support of emerging capabilities in Communications, Data and Data Analysis, Alternative Energy, Imagery, Sensors, Social Networking, and other areas identified during the execution years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, Innovation Outreach supported the Defense Prisoner of War\/Missing Personnel Office, the U.S. Marine Corps’ Amphibious Combat Vehicle and Improvised Explosive Detection offices, the U.S. Army’s Dismounted Soldier Operational Energy office, the U.S. Special Operations Command’s Tactical Assault Light Operator Suit (TALOS) office, and the Office of the Secretary of Defense’s Anti-Personnel Landmine effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Innovation Outreach plans five engagements in FY 2015 including the Naval Warfare Systems Command, Department of State, and Department of Homeland Security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Innovation Outreach will plan five engagements with DoD users and interagency partners based on priorities identified in the execution year."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source Data Analysis and Applications Focus Area"
                                    },
                                    "Description": {
                                        "val": "Open Source Data Analysis and Applications projects include the development of capabilities, software, and tools to analyze open source information.  The data can be structured or unstructured and will include inputs from a broad spectrum of sources.  Technologies developed within this focus area will reduce cost and manpower requirements to provide meaningful intelligence in support of Counter-Weapons of Mass Destruction and Counter-Improvised Explosive Device missions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.937"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications.  The program anticipates supporting three to four projects.  Deliverables will include capabilities and tools to exploit open source information and to reduce manpower required to provide actionable intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.054"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications.  The program anticipates supporting five to six projects.  Deliverables will include capabilities and tools to exploit open source information and to reduce manpower required to provide actionable intelligence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems and Behaviors Focus Area"
                                    },
                                    "Description": {
                                        "val": "Autonomous Systems and Behaviors projects include power systems to facilitate increased performance of unmanned systems, enhanced capabilities for multiple autonomous systems to cooperatively interact, development of sensors for integration aboard unmanned platforms, improvements to data ex-filtration from unmanned sensors, operation in denied areas, and “red teaming” to counter emerging unmanned threats from potential adversaries.  These projects will also examine the establishment of common software platforms to reduce development cost, increase collaboration among disparate unmanned vehicles, and support rapid customization of autonomous systems’ architectures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.937"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  The RRF will support development of autonomous aerial, surface, and subsurface systems.  Anticipate supporting four to five projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.054"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  The RRF will support development of autonomous aerial, surface, and subsurface systems.  Anticipate supporting five to six projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Characterization Focus Areas"
                                    },
                                    "Description": {
                                        "val": "Future military operations will likely occur in a broad range of urban environments in areas where we are denied free access.  Urban Characterization Focus Area projects will identify, analyze, and describe typical urban areas for modeling, simulation, and planning purposes.  These efforts will inform and enable development of intelligence, surveillance, and reconnaissance (ISR), electronic warfare, kinetic\/non-kinetic, and other capabilities needed for future military operations in a wide range of urban areas."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.938"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  The RRF will support development of open source data analysis tools and applications.  Anticipate supporting three to four projects.  Deliverables will include modeling and simulations systems to support planning efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.055"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.055"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  The RRF will support development of open source data analysis tools and applications.  Anticipate supporting five to six projects.  Deliverables will include modeling and simulations systems to support planning efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "ISR sensors span a wide range of sensing modalities and generally produce very large data sets that are difficult to analyze in a cluttered environment.  Efforts in this area will develop better sensors and tools to more effectively analyze or visualize ISR data.  Projects include improved surveillance sensors, tools to facilitate analysis of large data sets, methods to harvest meaningful intelligence from open and classified sources, and establishment of more effective processing, exploitation, and dissemination capabilities to facilitate integration of new and existing systems.  Projects in this area generally involve high risk and have high potential reward; and, are not being addressed by other organizations.  Projects will also explore technologies to improve ISR in denied areas.  ISR projects will also evaluate methods of increasing the effectiveness of ISR architectures to maximize the capability delivered to the user and to reduce the amount of human analyst manpower required to produce actionable intelligence."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.937"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities and will prevent duplicative activities.  Anticipate supporting three to four projects.  Deliverables will include prototype systems and software for a variety of platforms, as well as analytical capabilities developed to reduce the manpower burden needed to process large sets of ISR data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.054"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities.  Anticipate supporting five to six projects.  Deliverables will include prototype systems and software for a variety of platforms, as well as analytical capabilities developed to reduce the manpower burden needed to process large sets of ISR data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commercial Product Vulnerabilities and Applications Focus Area"
                                    },
                                    "Description": {
                                        "val": "Commercial Product Vulnerabilities and Applications projects explore the use of commercial-off-the-shelf products to address immediate operational needs.  This focus area identifies and exploits technological advances made by industry that may have immediate military utility.  These projects also explore the vulnerabilities of readily available technology used by adversaries.  This focus area leverages investments made by the commercial sector to reduce cost for military equipment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.937"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to identify commercial product vulnerabilities and applications.  Anticipate supporting five to six projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.054"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to identify commercial product vulnerabilities and applications.  Anticipate supporting seven to eight projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interface of Military Operations with Law Enforcement and Border Patrol Focus Area"
                                    },
                                    "Description": {
                                        "val": "Interface of Military Operations with Law Enforcement and Border Patrol new start projects include collaboration and exercises with law enforcement organizations to identify overlap and synergies between military and law enforcement operations, exploitation of law enforcement data for use in an irregular warfare environment, development of improved border protection capabilities that can be used in military base protection, and expanding the capabilities of biometrics and forensics tools."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.937"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities of interest to multiple federal organizations.  Anticipate supporting five to six projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.054"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities of interest to multiple federal organizations.  Anticipate supporting six to seven projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming in Support of Emerging Capabilities Focus Area"
                                    },
                                    "Description": {
                                        "val": "Red Teaming projects assess the susceptibility of emerging capabilities defeat by parties not intimately familiar with the technology.  The RRTO will leverage the innovative capabilities of FFRDCs, government laboratories, academia, and industry to develop a construct that current or future systems can be gamed against in a distributed table-top environment employing traditional and non-traditional players.  Deliverables will inform enhancement decisions and Concept of Operations development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.937"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify key technologies and systems to be assessed by red teams.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  Projects will include Red Team efforts employing undergraduate students of Science, Technology, Engineering, and Math disciplines to explore unconventional approaches to counter DoD technologies, such as the Perseus unmanned underwater vehicle demonstration and Systems Engineering Research Center projects.  Anticipate supporting four to five projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.054"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to Department, COCOMs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify key technologies and systems to be assessed by red teams.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  Projects will include Red Team efforts employing undergraduate students of Science, Technology, Engineering, and Math disciplines to explore unconventional approaches to counter DoD technologies.  Anticipate supporting five to six projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2016, performance metrics applicable to the Rapid Reaction Fund (RRF) includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology program\" and the metric for this objective is the transition of 40 percent of completed projects per year.  In addition, project performance metrics are specific to each effort and include measures identified in each specific project plans.  Project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target milestone dates, specific performance measures, fielding dates, and demonstration goals and dates.  For projects completed in FY 2014, the RRF achieved a transition rate of approximately 80 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P831"
                    },
                    "ProjectTitle": {
                        "val": "Joint Rapid Acquisition Cell Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.318"
                        },
                        "PriorYear": {
                            "val": "1.541"
                        },
                        "CurrentYear": {
                            "val": "1.604"
                        },
                        "BudgetYearOne": {
                            "val": "1.620"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.620"
                        },
                        "BudgetYearTwo": {
                            "val": "1.636"
                        },
                        "BudgetYearThree": {
                            "val": "1.652"
                        },
                        "BudgetYearFour": {
                            "val": "1.669"
                        },
                        "BudgetYearFive": {
                            "val": "1.686"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding includes support for the Joint Rapid Acquisition Cell (JRAC) to enable management and tracking of Combatant Command (COCOM) identified and Joint Staff validated immediate warfighter needs.  The JRAC is responsible to: \n(1)  Coordinate review of validated Joint Urgent Operational Needs (JUON) and Joint Emergent Operational Needs (JEON) and assign responsibility to appropriate DoD Components for timely funding and resolution. \n(2)  Serve as the review and approval authority for the DoD Components’ strategy to fund and mitigate the identified JUON\/JEON capability gap. \n(3)  Continually assess actions taken by the DoD Components to resolve JUONs\/JEONs and recommend to the Under Secretary of Defense for Acquisition, Technology, and Logistics any changes determined appropriate to improve their responsiveness to JUONs\/JEONs.\n(4)  Provide periodic reports to the Secretary of Defense on new and outstanding JUONs\/JEONs.   \n(5)  In coordination with Under Secretary of Defense Comptroller (USD(C)), manage the Rapid Acquisition Fund (RAF) to allocate resources to priority unfunded JUONs\/JEONs.\n(6)  In coordination with the Office of the Chairman of the Joint Chiefs of Staff and the USD(C), make programmatic, budget, and acquisition recommendations for JUONs and identify capability gaps to the Secretary of Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Rapid Acquisition Cell (JRAC) Management Support"
                                    },
                                    "Description": {
                                        "val": "This funding is utilized to support the staff manning of the JRAC to enable management and tracking of COCOM identified and Joint Staff validated immediate warfighter needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.541"
                                            },
                                            "Text": {
                                                "val": "Initiated support for the JRAC to enable management and tracking of immediate COCOM warfighter requirements.  Warfighter needs were validated by the Joint Staff."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.604"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of COCOM initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of COCOM initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA – Capabilities acquired to fulfill Joint Urgent Operational Needs and Joint Emergent Operational Needs are provided by other DoD components."
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Rapid Acquisition Cell performance metrics are specific to each JUON\/JEON and include measures identified in the management approach for each action.  In addition, JUON\/JEON completions and successes are monitored against schedules and deliverables stated in the management approach.  The metrics to which JRAC support correlates is to the number of full time personnel identified in the JRAC support contract with associated pay rates and shall not exceed the specified amounts or hourly rates and\/or firm fixed price."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P833"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.170"
                        },
                        "PriorYear": {
                            "val": "2.005"
                        },
                        "CurrentYear": {
                            "val": "2.041"
                        },
                        "BudgetYearOne": {
                            "val": "2.062"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.062"
                        },
                        "BudgetYearTwo": {
                            "val": "2.082"
                        },
                        "BudgetYearThree": {
                            "val": "2.103"
                        },
                        "BudgetYearFour": {
                            "val": "2.124"
                        },
                        "BudgetYearFive": {
                            "val": "2.145"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The SMA Cell supports all Combatant Commands (COCOMs), Joint Force Commanders, and other government agencies by assessing complex operational\/technical challenges, which require multi-agency and multi-disciplinary approaches.  With input from across the U.S. Government, academia. and the private sector, the SMA cell develops solution options to COCOM generated challenging problems and informs the command's senior leadership.  Each SMA effort is initiated at the request of senior COCOM leadership.  Priorities for SMA problems are set by the Joint Staff Deputy for Operations.  Products are typically produced within six months and directly contribute to the decision making process of COCOM's senior leaders.  SMA is also supported by the Rapid Reaction Fund (RRF)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drivers of Conflict and Convergence in the Asia-Pacific Region in the Next Five to 25 Years"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell conducted an effort starting in FY 2014 at the request of U.S. Pacific Command (USPACOM) to provide an analytical capability to identify areas of strategic risk and opportunity in the Asia-Pacific region over the next two decades.  Specifically, these analytical capabilities enabled USPACOM to examine future political, security, societal, and economic trends; identify where U.S. strategic interests are in cooperation or conflict with Asian and other interests worldwide, in particular, the East China Sea; and to leverage opportunities when dealing with Asian countries in a “global context.”"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.005"
                                            },
                                            "Text": {
                                                "val": "The Drivers of Conflict and Convergence in the Asia-Pacific Region in the Next Five to 25 Years effort executed by SMA assessed stability in the broader region to include Asian countries and other key players in East Asia.  Using a variety of methodologies and disciplinary approaches, the research teams for this project built a qualitative and quantitative framework for understanding the drivers of conflict and convergence in the Asia-Pacific region.  Project teams used content analysis, historical comparison, expert elicitation, and quantitative modeling to identify key variables that influence conflict and cooperation.  These analyses informed the development of a systems dynamic model and decision support tool.  The overall objective of the suite of projects contained in this effort was to inform USPACOM decision makers in the development of intermediate and long-term strategies to manage risk and engage opportunities in the Asia-Pacific region.  In addition to the insights provided by each project team, the projects also informed a systems dynamic model and decision support tool for COCOMs.  These assessments are intended to be combined with unclassified (e.g., academic, subject matter expert, open source, etc.) input not generally found in U.S. government work."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.041"
                                            },
                                            "Text": {
                                                "val": "Based on the analytical methods the framework development and systems dynamics models developed during the Drivers of Conflict and Convergences project, the U.S. Security Coordinator (USSC) for Israel and the Palestinian Authority requested that the SMA conduct a Coordinator’s Mission Review to evaluate strategic risks and identify knowledge gaps.  They provide an increased understanding of potential future security environments and their implications for Palestinian security sector reform.  The SMA team will conduct a multi-disciplined review of USSC questions and provide to the USSC staff a series of insights and recommendations that will enable them to derive a rich contextual understanding of the socio-political, social-cultural, security, and economic dynamics of the region.  The cell will also continue to actively work with the COCOMs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the COCOMs and may include areas such as:  counter terrorism; transnational criminal organizations; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; regional stability assessments; and, individual state or national level deterrence studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.062"
                                            },
                                            "Text": {
                                                "val": "The cell will continue to actively work with the senior COCOMs and the Joint Staff leadership to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the COCOMs and may include areas such as:  counter terrorism; transnational criminal organizations; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; regional stability assessments; and, individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "SMA performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and successes are monitored against schedules and deliverables stated in the execution documents.  Each project’s results are reviewed by a senior review group that is comprised with representatives from the Office of the Secretary of Defense, the Joint Staff, the COCOMs, and outside subject matter experts.  The ultimate measure of success is adoption and transition of SMA products by the COCOM and supporting entities."
                        }
                    }
                }
            ]
        }
    }
}