{
    "id": "9c990cbf760be8c52c3e4acb63641ee16e80aa49",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605865N"
        },
        "ProgramElementTitle": {
            "val": "Operational Test & Eval Capability"
        },
        "R1LineNumber": {
            "val": "163"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.304"
            },
            "CurrentYear": {
                "val": "16.650"
            },
            "BudgetYearOne": {
                "val": "17.985"
            },
            "BudgetYearOneBase": {
                "val": "17.985"
            },
            "BudgetYearTwo": {
                "val": "18.327"
            },
            "BudgetYearThree": {
                "val": "18.478"
            },
            "BudgetYearFour": {
                "val": "18.812"
            },
            "BudgetYearFive": {
                "val": "19.419"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides Commander, Operational Test and Evaluation Force (COMOPTEVFOR) general support funding for headquarters annual operating costs and ensures COMOPTEVFOR compliance with Secretary of Defense (SECDEF) and Secretary of the Navy (SECNAV) directives to conduct independent operational testing and evaluation. Funding supports planning, conducting, and reporting on the operational effectiveness and suitability of new and improved systems and recommending fleet usage to the Chief of Naval Operations (CNO). Funding also supports ongoing development and implementation of new requirements relative to integrated testing. The CNO, as well as acquisition executives and managers at all levels, have a continuing need for expeditious and efficient conduct of Operational Test and Evaluation (OT&E) by COMOPTEVFOR in support of training and equipping fleet forces.  To this end, this funding supports COMOPTEVFOR's continued pursuit of a variety of senior management initiatives aimed at increasing efficiencies in T&E; these senior management initiatives include IT database and decision making technology upgrades, implementation of Integrated Testing and Mission Based Test Design across all programs, and improved staffing and expertise in the areas of DON acquisition processes, Modeling and Simulation, Statistical Studies, Cost Analysis, Information Assurance, and similar disciplines. All of these senior management initiatives are aimed at improving the quality of testing and evaluation, thus ensuring delivery to fleet units of fully tested and capable combat systems.  OT&E issues have direct long term Navy-wide implications on the Fleet's readiness and war fighting capability. Rapid advances in technology, changes in fleet tactics, and increased complexity of weapons systems and platforms, combined with reductions in manpower, force structure, and budgets have created an increased need for technical and operational analyses that are sophisticated and timely in order to ensure an optimal return on investment of Navy resources. Funding is also provided for Navy support of the Office of the Secretary of Defense (OSD) sponsored Joint Test and Evaluation (JT&E) program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.565"
                },
                "CurrentYear": {
                    "val": "16.658"
                },
                "BudgetYearOne": {
                    "val": "16.883"
                },
                "BudgetYearOneBase": {
                    "val": "16.883"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.304"
                },
                "CurrentYear": {
                    "val": "16.650"
                },
                "BudgetYearOne": {
                    "val": "17.985"
                },
                "BudgetYearOneBase": {
                    "val": "17.985"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.261"
                },
                "CurrentYear": {
                    "val": "-0.008"
                },
                "BudgetYearOne": {
                    "val": "1.102"
                },
                "BudgetYearOneBase": {
                    "val": "1.102"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.008"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.261"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.025"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.025"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.127"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.127"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: N\/A\n\nSchedule: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0831"
                    },
                    "ProjectTitle": {
                        "val": "OPTEVFOR Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.304"
                        },
                        "CurrentYear": {
                            "val": "16.650"
                        },
                        "BudgetYearOne": {
                            "val": "17.985"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.985"
                        },
                        "BudgetYearTwo": {
                            "val": "18.327"
                        },
                        "BudgetYearThree": {
                            "val": "18.478"
                        },
                        "BudgetYearFour": {
                            "val": "18.812"
                        },
                        "BudgetYearFive": {
                            "val": "19.419"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) provides Commander, Operational Test and Evaluation Force (COMOPTEVFOR) general support funding for headquarters annual operating costs and ensures COMOPTEVFOR compliance with Secretary of Defense (SECDEF) and Secretary of the Navy (SECNAV) directives to conduct independent operational testing and evaluation. This funding supports planning, testing, and reporting on the operational effectiveness and suitability of new and improved systems and recommending fleet usage to the Chief of Naval Operations (CNO). Funding also supports recently instituted initiatives (including the manpower to execute) that improve COMOPTEVFOR's ability to develop \"minimum, adequate\" test strategies maximizing efficiencies and minimizing assets required to conduct planned operational testing, thereby driving down overall test and evaluation costs for the Navy. The CNO, as well as acquisition executives and managers at all levels, have a continuing need for expeditious and efficient conduct of Operational Test and Evaluation (OT&E) by COMOPTEVFOR in support of training and equipping fleet forces. To this end, this funding supports COMOPTEVFOR's continued pursuit of a variety of senior management initiatives aimed at increasing efficiencies in T&E; these senior management initiatives include IT database and decision making technology upgrades, implementation of Integrated Testing and Mission Based Test Design across all programs, and improved staffing and expertise in the areas of DON acquisition processes, Modeling and Simulation, Statistical Studies, Information Assurance, and similar disciplines. All of these initiatives are aimed at improving the quality of testing and evaluation, thus ensuring delivery to fleet units of fully tested and capable combat systems. OT&E issues have direct long term Navy-wide implications on the Fleet's readiness and warfighting capability. Rapid advances in technology, changes in fleet tactics, and increased complexity of weapons systems and platforms, combined with reductions in manpower, force structure, and budgets have created an increased need for technical and operational analyses that are sophisticated and timely in order to ensure an optimal return on investment of Navy resources."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OPTEVFOR SUPPORT"
                                    },
                                    "Description": {
                                        "val": "Funding in this project supports several senior management initiatives aimed at increasing efficiencies in T&E.  These initiatives include IT database and decision making technology upgrades; implementation of Integrated Testing and Mission Based Test Design across all programs; and improved staffing and expertise in the areas of DON acquisition processes, Modeling and Simulation, Statistical Studies, Information Assurance, and similar disciplines. All of these initiatives are aimed at improving the quality of testing and evaluation, thus ensuring delivery to fleet units of fully tested and capable combat systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.304"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to operationally test and evaluate CNO projects commensurate with authorized funding level.\n- Continue evaluation and improvement of management initiatives previously introduced above (IT database and decision making technology upgrades, implementation of Mission Based Test Design across all programs, improved civilian staffing expertise in areas previously indicated).\n- Continue to maintain level of effort associated with the DoD 5000-acquisition guidance, which requires increased COMOPTEVFOR involvement in early operational assessments, developmental testing, advanced concept technology demonstrations, and advanced technology demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY15. The increasing complexity of new programs of record (e.g., LCS, CVN-78,\nP-8, ORP, AMDR, DDG 1000) requires COMOPTEVFOR to have immediate and ongoing\naccess to analytical skill sets not currently resident on the HQ staff and are more commonly found at SYSCOMS, Navy labs, CNA and similar activities.  Operational testing requirements levied by DoD have increased in scope and complexity; testing requirements are more robust than ever, requiring Commander Operational Test and Evaluation Force (COTF) to obtain and maintain resident skill sets and develop an intellectual capital base that cannot be met with constantly rotating military personnel.  The funding increase will support additional analytic expertise from various sources (SYSCOM, NWCF, CNA) with the requisite skill sets."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As indicated in section A above, funding provides for core headquarters operations and support (O&S) costs related to required operational testing and evaluation (T&E) conducted in support of Navy acquisition programs. The preponderance of funding provides for the annual O&S costs for day to day operations of the staff\/headquarters of COMOPTEVFOR, located in Norfolk, Virginia. (Pursuant to DoD Financial Management Regulations and Navy financial policy guidance, as a T&E activity, COMOPTEVFOR's annual support costs are funded via RDTEN vice OMN; hence, and unlike most RDTEN programs, these funds provide for O&S costs typical of military field commands\/activities). Within this project, over 1\/2 of the funding supports salaries of assigned civilian personnel. The remaining funds provide for other routine support costs such as travel, IT support, supplies, and other overhead\/administrative support costs. The primary metric used within the project involves support for scheduled Navy acquisition program testing and subsequent analysis and reporting of results of testing to appropriate senior Navy acquisition officials and to the Navy chain of command directly to the CNO and various OPNAV\/SECNAV staff offices. The performance goal is met when all assigned\/scheduled testing and reporting is supported each year. Specific test program success is measured through analytic results of testing conducted throughout the year and constant interaction with program offices, acquisition decision makers, OPNAV staff resource sponsor offices, OSD and other service T&E offices\/activities, and miscellaneous other customers\/stakeholders. This project also supports testing and evaluation of various Joint\/multi-service programs in which the Navy shares responsibilities in support of the acquisition community. The following metrics relate directly to the funding provided and are applicable to current operations.                            \n                              \nNumber of Tests Conducted - FY14 = 100; FY15 = 105; FY16 = 103\nNumber of Programs Supported - FY14 = 423; FY15 = 425; FY16 = 422"
                        }
                    }
                }
            ]
        }
    }
}