{
    "id": "9dcc3834f34f7b46c692ea2163fcadda53cef702",
    "meta": {
        "filename": "dod-2016_RDTE_2016_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2016.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missile Defense Organization (JIAMDO)"
        },
        "R1LineNumber": {
            "val": "141"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "269.991"
            },
            "PriorYear": {
                "val": "37.314"
            },
            "CurrentYear": {
                "val": "43.176"
            },
            "BudgetYearOne": {
                "val": "35.471"
            },
            "BudgetYearOneBase": {
                "val": "35.471"
            },
            "BudgetYearTwo": {
                "val": "27.967"
            },
            "BudgetYearThree": {
                "val": "27.799"
            },
            "BudgetYearFour": {
                "val": "30.208"
            },
            "BudgetYearFive": {
                "val": "30.208"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the CJCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.772"
                },
                "CurrentYear": {
                    "val": "43.176"
                },
                "BudgetYearOne": {
                    "val": "35.471"
                },
                "BudgetYearOneBase": {
                    "val": "35.471"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "37.314"
                },
                "CurrentYear": {
                    "val": "43.176"
                },
                "BudgetYearOne": {
                    "val": "35.471"
                },
                "BudgetYearOneBase": {
                    "val": "35.471"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.458"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Carry-over from FY2014"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.458"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "JIAMDO-Core:  The Joint Staff reduced reliance upon contracted advisory and assistance service efforts and increased leverage upon organic (military and federal civilian) labor.\n\nJIAMDO-Homeland:  Programs will be near development completion and conducting Military Utility Assessment, which requires live assets and integration development."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "83.126"
                        },
                        "PriorYear": {
                            "val": "17.862"
                        },
                        "CurrentYear": {
                            "val": "20.178"
                        },
                        "BudgetYearOne": {
                            "val": "15.671"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.671"
                        },
                        "BudgetYearTwo": {
                            "val": "10.437"
                        },
                        "BudgetYearThree": {
                            "val": "10.761"
                        },
                        "BudgetYearFour": {
                            "val": "11.708"
                        },
                        "BudgetYearFive": {
                            "val": "11.708"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the CJCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides overall staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense, and homeland defense.  This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems.  In coordination with Services and CCMDs, JIAMDO Core also leads the definition, assessment, development, and approval of Joint AMD Operational Concepts, Operational Architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable air defense (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles).  JIAMDO Core also:\n• Develops and integrates joint exercises, simulations, war-games, force resource allocations, and interoperability initiatives\n• Manages relevant Congressional interaction and CCMD interface through a cadre of liaisons collocated with major headquarters\n• Directly supports and sponsors homeland air surveillance related demonstration and analysis activities\n• Runs the AMD Working Group focusing CCMD, Joint Staff, and Service collaboration efforts in the generation of joint concepts and development of the integrated AMD architecture and roadmap\n• Develops U.S. positions for, and serves as the U.S. representative to the NATO Air Defense Committee\n\nJIAMDO Core also enables strategic planning development, infrastructure, security, travel, administrative, and other support activities.  Funding pays for: Contractor Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, senior level briefings, and JIAMDO white papers, leased office space including all upkeep services, all travel costs for government, and contractor support personnel, including support for Combatant Commander liaison personnel travel, multiple levels of security including lease support for a Joint Worldwide Intelligence Communications System (JWICS) communications line, and Special Compartmented Information (SCI) terminals (due to the classified nature and the diverse content of work in the JIAMDO portfolio), 24-hour physical security force and alarm monitoring, and maintenance, daily on-site security personnel to meet DOD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations, for all administrative and support functions, all associated Information Technology (IT) support, copier purchase and maintenance, as well as basic office supplies and furniture, telephones, telephone lines, classified telephones, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.862"
                                            },
                                            "Text": {
                                                "val": "Performed Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  CORE has reduced contracted advisory and assistance services (CAAS), and intends to leverage organic (military and federal civilian) labor to achieve planned mission.  A new JIAMDO Security contract was awarded below the independent government cost estimate (IGCE) and previous contract award levels.  CORE transitioned JIAMDO office communications to voice-over internet protocol (VOIP) from traditional landline producing savings of $30K per year."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.178"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Planned additional reductions in contract advisory and assistance services are projected.  Planning will begin on the solicitation of CORE SETA contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.671"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.671"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Planned additional reductions in contract advisory and assistance services are projected. Planned award of a new SETA contract is anticipated in 2016."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Support two major Nimble Fire exercises during FY 2016.\n\n(2) Conduct two Air and Missile Defense Working Groups per month.\n\n(3) Support U.S. Representative to NATO Air Defense Council (NADC) to include 2 overseas NADC meetings per year.\n\n(4) Develop and maintain electronic library of current Joint and Service AMD Publications.\n\n(5) Develop and maintain operational architecture compliance with DoD Architectural Framework (DODAF) standards.\n\n(6) Ensure 100% of all government employee travel is in accordance with the Joint Federal Travel Regulation\/Joint Travel Regulation.\n\n(7) Maintain all unclassified\/classified LANs on a daily basis in accordance with TJS Office of the Chief Information Officer guidance\/policy.\n\n(8) Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to J6 policy\/guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Homeland"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "67.544"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.583"
                        },
                        "PriorYear": {
                            "val": "3.052"
                        },
                        "CurrentYear": {
                            "val": "3.200"
                        },
                        "BudgetYearOne": {
                            "val": "2.444"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.444"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "3.300"
                        },
                        "BudgetYearFive": {
                            "val": "3.300"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Black Dart"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations.  Black Dart is a unique joint, interagency demonstration focusing on rapid development and implementation of Counter - Unmanned Aircraft Systems (CUAS) technology from readily-available commercial and governmental products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.052"
                                            },
                                            "Text": {
                                                "val": "Executed live-fly, live-fire C-unmanned aircraft system (UAS) technology demonstration to assess and validate existing and emerging IAMD capabilities.  Presented emerging solutions to inform requirements decision-making.  Identified and developed IAMD operational concepts, system interoperability, and operational architectures for C-UAS mission set.  Advocated for Warfighters’ desired C-UAS capabilities and affordable, integrated solutions.  Integrated Combatant Command sponsored scenarios, employing an intel-driven mix of threat cruise missile and UAV target surrogates acting in concert, which enabled CCMDs to make real-time changes to Tactics, Techniques, and Procedures TP\/C2 based on BLACK DART results.  Demonstrated steady-state capabilities of the current NNC Homeland Defense Design.  Integrated numerous Joint Test and Demonstrations into BLACK DART event to include:  Joint Counter Low Slow UAS (JCLU) Joint TTP Development; JEPAC Advanced Electronic Attack Testing; SDEST Electronic Warfare Development; JTAP C2 and Datalink Evaluation; JPHID Improved Combat ID TTP Development.  Developed MQ-9 air intercept profiles for future integration of AIM-9X.  Developed TTPs and conducted weapons system analysis for: AH-1Z, UH-1Y, AH-64D, F\/A-18, EA-18G, EC-130H, JSTARS, EP-3E, MH-60R, E-2D, & Aegis CG. Demonstrated unmanned aerial vehicle UAV as electronic attack platform with Digital Radio Frequency Memory (DRFM) technology.  First-ever exploitation of National Technical Means for UAS detection & identification on Link 16.  First ever integration of Cyber-attack options."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Continue to improve, expand, and refine FY2014 objectives to include:  Continue to develop innovative material and non-material solutions that enhance all phases of the Joint Engagement Sequence versus the UAS threat.  Refine kinetic and non-kinetic negation systems and capabilities.  Develop detailed threat scenarios based on direct input from CCMDs to provide specific recommendations on material and non-material solutions to warfighter requirements.  Expand interagency participation to demonstrate C-UAS options in both Title 10 and Title 50 operational environments.  Continue to increase fidelity of threat representations’ size & performance.  Continue to expand US DoD and Inter-agency system portfolio participation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.444"
                                            },
                                            "Text": {
                                                "val": "Continue FY2015 plans including:  Demonstrate UAS capabilities to employ within visual range (WVR) and beyond visual range (BVR) weapons in a counter-UAS, counter-air, and counter-cruise missile role.  Expand the breadth, complexity, and integration of cyber capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1)  Complete events within schedule and budget.   Events provide useful data to improve C-UAS capability.  \n(2)  Document gaps, develop and substantiate hardware, software, and employment concepts. \n(3)  Field C-UAS capability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.712"
                        },
                        "PriorYear": {
                            "val": "0.500"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.300"
                        },
                        "BudgetYearThree": {
                            "val": "1.538"
                        },
                        "BudgetYearFour": {
                            "val": "1.700"
                        },
                        "BudgetYearFive": {
                            "val": "1.700"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMD) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues and for capabilities development and validation in support of the Unified Command Plan (UCP) assigned missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "Conducted a joint test event to assess the interoperability of joint, integrated air and missile defense weapon systems that leveraged commercial-off-the-shelf (COTS) Networks to perform Joint Integrated Fire Control.  This effort provided users the means to create family-of-system (FoS) environments by linking existing capabilities using hardware, software, and operators in a live-fly environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Received results from effort to improve link interoperability between the U.S. E-2 and North Atlantic Treaty Organization (NATO) E-3.  New capability identified to significantly improve the recognized air picture by modifying software parameters in both systems.  Capability results in a no-cost solution to Allied interoperability.  Continued U.S.\/UK Coalition effort for Correlation De-correlation Interoperability Testing to further apply the Chairman of the Joint Chiefs of Staff Integrated Air and Missile Defense Vision for 2020."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.   Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.  Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1)  Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on an eighteen month test planning and event process.\n(2)  Complete events within schedule and budget. \n(3)  Events provide useful data to improve Air Missile Defense interoperability, with implemented and recommended corrective changes.\n(4)  Events must be linked to the current approved IAMD Architecture, provide joint benefit, contribute to Joint Interoperability, and address IAMD ICD capability gaps"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "44.450"
                        },
                        "PriorYear": {
                            "val": "8.727"
                        },
                        "CurrentYear": {
                            "val": "9.400"
                        },
                        "BudgetYearOne": {
                            "val": "8.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.230"
                        },
                        "BudgetYearThree": {
                            "val": "7.000"
                        },
                        "BudgetYearFour": {
                            "val": "7.500"
                        },
                        "BudgetYearFive": {
                            "val": "7.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "The Department's only joint integrated air and missile defense operator-in-the-loop simulation that is comprised of current and future land, sea, and air weapon systems representing each of the Services AMD capabilities.  Enhances air and missile defense capability through the exploration of joint concepts and capabilities using current and future IAMD systems exercised by highly experienced operators against an integrated threat and providing quantifiable data that supports senior leadership within the Department of Defense, Combatant Commanders, and the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.727"
                                            },
                                            "Text": {
                                                "val": "Continued to provide the Joint Staff, Services, Combatant Commanders and Missile Defense Agency (MDA) with the necessary information to better inform acquisition and requirements decisions.\n\nIn support of OSD (AT&L), VCJS and CDR NORAD-NORTHCOM, conducted a Homeland wargame assessing current and future IAMD architectures’ ability to address the cruise missile threat to the National Capital Region.\n\nSupported U.S. Fleet Forces Command (USFFC) Naval Integrated Fire Control – Counter Air (NIFC-CA) wargame designed to provide familiarization and training to the Theodore Roosevelt Carrier Strike Group (CSG).  USN senior leaders decided to use the venue to train the next 3 CSGs.\n\nConducted JROC-directed reassessment of the U.S. Pacific Command (PACOM) IAMD capability against projected 2020 threat.  In collaboration with the Services, MDA, USSTRATCOM and USCYBERCOM, introduced additional kinetic and non-kinetic capabilities.\n\nProvided Army leadership with data on the contribution of Army’s Indirect Fire Protection Capability Increment 2I (IFPC-2I) to cruise missile defense (CMD) in CENTCOM.\n\nSupported USMC expeditionary warfare analysis considering Expeditionary Force 21 Capstone Concept tenets.\n\nFunded and integrated a wide range of new capabilities and simulations:  (1) 4 manned adversary simulators; enhancing both red and blue TTP development and threat employment, (2) MDA approved Terminal High Altitude Area Defense (THAAD) model, (3) Enhanced Electronic Warfare (EW) modeling for all IAMD platforms,  (4) USAF's 3 Dimensional Expeditionary Long-Range Radar (3DELRR) per initial Technical Requirements Document.\n\nProvided unique data collection, analysis and visualization capabilities to stakeholders and extracted end-to-end kill chain information to support IAMD assessments and findings.\n\nAdditional details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.400"
                                            },
                                            "Text": {
                                                "val": "Fund and execute at least 2 Joint events and provide direct support for up to 3 Service, MDA or COCOM sponsored events.\n\nContinue to improve overall environment capabilities exploring all aspects of the Chairman's Joint IAMD Vision 2020.\n\nImprove blue force systems and capabilities to represent projected FYDP+2 upgrades.\n\nPartner with USSTRATCOM to improve overall Electronic Warfare capabilities.\n\nCollaborate with AMRAAM project office to standardize modeling of air-to-air missiles on all USN and USAF weapon systems.\n\nIntegrate 4 additional Joint Strike Fighter simulations to better explore Joint interoperability.\n\nContinue to investigate future gateway concept contributions to Joint IAMD.\n \nStrengthen ties with intelligence community (e.g., Office of Naval Intelligence (ONI), Missile and Space Intelligence Center (MSIC), National Air and Space Intelligence Center (NASIC)) for improved threat representation.\n\nExplore the impacts of Electronic Attack, emerging CONOPS\/TTP’s, offensive cyber operations, and Integrated Fire Control to the IAMD mission area.\n \nAdditional details are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Fund and execute at least 2 Joint events and provide direct support for up to 3 Service, MDA or COCOM sponsored events.\n\nContinue to improve overall environment capabilities exploring all aspects of the Chairman's Joint IAMD Vision 2020.\n\nContinue to improve blue force systems and capabilities to represent projected FYDP+2 upgrades.\n\nContinue to investigate future gateway concept contributions to Joint IAMD.\n\nContinue to strengthen ties with intelligence community (e.g., ONI, MSIC, NASIC) for improved threat representation.\n\nEnhance overall Infrared (IR) capabilities.\n\nExplore the impacts of Electronic Attack, emerging CONOPS\/TTP’s, offensive cyber operations, and Integrated Fire Control to the IAMD mission area.\n\nExplore classified joint force capabilities and the associated impact to IAMD."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Complete events within schedule and budget.\n(2) Document gaps and shortfalls.\n(3) Inform the Joint Capabilities Board (JCB) on results and findings.\n(4) Specific details are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missile Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "44.576"
                        },
                        "PriorYear": {
                            "val": "7.173"
                        },
                        "CurrentYear": {
                            "val": "7.398"
                        },
                        "BudgetYearOne": {
                            "val": "6.356"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.356"
                        },
                        "BudgetYearTwo": {
                            "val": "6.000"
                        },
                        "BudgetYearThree": {
                            "val": "5.500"
                        },
                        "BudgetYearFour": {
                            "val": "6.000"
                        },
                        "BudgetYearFive": {
                            "val": "6.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team and provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Develops joint Counterair Combat Identification technology, and positions it for fielding on front-line weapon systems.  Monitors, assesses, and enhances joint AMD Combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.173"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.398"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.356"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                }
            ]
        }
    }
}