{
    "id": "9e903eb7b8c845e8514613f4d9a77bb0feaa325d",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602102F"
        },
        "ProgramElementTitle": {
            "val": "Materials"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "118.951"
            },
            "CurrentYear": {
                "val": "110.680"
            },
            "BudgetYearOne": {
                "val": "125.234"
            },
            "BudgetYearOneBase": {
                "val": "125.234"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "127.175"
            },
            "BudgetYearThree": {
                "val": "133.286"
            },
            "BudgetYearFour": {
                "val": "131.184"
            },
            "BudgetYearFive": {
                "val": "133.332"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops advanced materials, processing, and inspection technologies to reduce life cycle costs and improve performance, sustainability, availability, affordability, supportability, reliability, and survivability of current and future Air Force systems and operations.  The program has three projects that develop: structural, propulsion, and sub-systems materials and processes technologies; electronic, optical, and survivability materials and processes technologies; and sustainment materials, processes technologies, and advanced non-destructive inspection methodologies.  Efforts in the program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "120.846"
                },
                "CurrentYear": {
                    "val": "105.680"
                },
                "BudgetYearOne": {
                    "val": "126.589"
                },
                "BudgetYearOneBase": {
                    "val": "126.589"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "118.951"
                },
                "CurrentYear": {
                    "val": "110.680"
                },
                "BudgetYearOne": {
                    "val": "125.234"
                },
                "BudgetYearOneBase": {
                    "val": "125.234"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.895"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "-1.355"
                },
                "BudgetYearOneBase": {
                    "val": "-1.355"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.895"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.355"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.355"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY16 due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624347"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Structures, Propulsion, and Subsystems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.486"
                        },
                        "CurrentYear": {
                            "val": "34.776"
                        },
                        "BudgetYearOne": {
                            "val": "47.165"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.165"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "46.057"
                        },
                        "BudgetYearThree": {
                            "val": "46.358"
                        },
                        "BudgetYearFour": {
                            "val": "45.786"
                        },
                        "BudgetYearFive": {
                            "val": "46.205"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the materials and processing technology base for aircraft, spacecraft, launch systems, and missiles to improve affordability, maintainability, and performance of current and future Air Force systems. A family of affordable lightweight materials is being developed, including metals, polymers, ceramics, metallic and nonmetallic composites, and hybrid materials to provide upgraded capabilities for existing aircraft, missile, and propulsion systems to meet the future system requirements. The project develops high-temperature turbine engine materials that will enable engine designs to double the turbine engine thrust-to-weight ratio. Advanced high temperature protection materials are being developed that are affordable, lightweight, dimensionally stable, thermally conductive, and\/or ablation and erosion resistant to meet aerospace and missile requirements. Alternative or replacement materials are being developed to maintain the performance of aging operational systems. Materials for thermal management including coolants, adaptive thermally conductive materials, coatings, friction and wear-resistant materials, and other pervasive nonstructural materials technologies are being developed for directed energy, propulsion, and subsystems on aircraft, spacecraft, and missiles. The project concurrently develops advanced processing methods to enable adaptive processing of aerospace materials."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Nanotechnology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ceramics and Composites"
                                    },
                                    "Description": {
                                        "val": "Develop ceramic, ceramic matrix composite, and hybrid materials technologies for performance and supportability improvement in propulsion systems and high temperature aerospace structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.712"
                                            },
                                            "Text": {
                                                "val": "Developed next generation high temperature organic and ceramic matrix composite material systems for Air Force weapon systems.  Continued development of advanced processing methods and validation process models for organic matrix composites. Initiated process models for ceramic matrix composites. Conducted durability assessments of composite material behavior to gain understanding of time-dependent degradation.  Developed novel hybrid approaches for optical and radio frequency communication system aperture applications.  Developed advanced electromagnetic and laser protection technologies for structurally harden aerospace structures.  Continued the transition of behavior and life prediction models of organic matrix composites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrate new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable organic and ceramic matrix composites. Validate severe environment durability of advanced composite systems via mechanical testing. Continue to advance the development of new ceramic and organic matrix composite materials and processes with higher temperature capability for propulsion systems and aerospace structures. Validate hybrid materials and processes for applications in combined optical and radio frequency communication system apertures. Validate advanced electromagnetic and laser protection technologies for aerospace structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.803"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.803"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable organic and ceramic matrix composites. Demonstrate severe environment durability of advanced composite systems via mechanical testing. Continue to advance the development and validate new ceramic and organic matrix composite materials and processes with higher temperature capability for propulsion systems and aerospace structures. Demonstrate hybrid materials and processes for applications in combined optical and radio frequency communication system apertures. Demonstrate advanced electromagnetic and laser protection technologies for aerospace structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metals"
                                    },
                                    "Description": {
                                        "val": "Develop lightweight and high temperature metallics, life prediction, and metals processing technologies for increased affordability, durability, and reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.351"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate advanced computation methods to support material development and characterization modeling. Continued to demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Analyzed relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Continued development of analysis of residual stress in nickel-base superalloys. Initiated development of integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research.  Initiated development of next generation turbine engine disk."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.750"
                                            },
                                            "Text": {
                                                "val": "Validate repeatability of advanced computation methods to support material development and characterization modeling. Demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Continue to analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Demonstrate analysis techniques for understanding and mitigating residual stress in nickel-base superalloys. Continue development of integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research.  Continue development of next generation turbine engine disk."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.580"
                                            },
                                            "Text": {
                                                "val": "Continue validation of repeatability of advanced computation methods to support material development and characterization modeling. Continue demonstration of quantitative, predictive models for performance of metallic based thermal management systems. Continue to analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Continue demonstration of analysis techniques for understanding and mitigating residual stress in nickel-base superalloys. Continue development of integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research.  Continue to advance development of next generation turbine engine disk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thermal Protection Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and evaluate lightweight, active, adaptive, multifunctional, high temperature, and durable material systems for extreme environments and hypersonic applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.423"
                                            },
                                            "Text": {
                                                "val": "Developed advanced metallic, oxide, and ceramic materials for hypersonic weapon systems. Initiated novel materials and processing methods to fabricate structurally integrated thermal protection systems for expendable hypersonic applications such as control surfaces, leading edges, and acreage designs.  Developed unique experimental techniques to assess mechanical properties and time-dependent behavior of advanced metallic and ceramic material systems. Initiated incorporation of solutions for optical and radio frequency communication system aperture applications on hypersonic systems.  Continued validating performance of fabricated ultra-high temperature ceramics using field assisted sintering technology using a hypersonic experimental propulsion rig.  Developed and validated computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.526"
                                            },
                                            "Text": {
                                                "val": "Refine and improve processing methods to fabricate structurally integrated thermal protection systems for expendable hypersonic applications.  Develop unique experimental techniques to assess mechanical properties and time-dependent behavior.  Validate material properties and performance meets design needs for control surfaces, leading edges and acreage.  Develop computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.782"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and improve processing methods to fabricate structurally integrated thermal protection systems for expendable hypersonic applications.  Continue development of unique experimental techniques to assess mechanical properties and time-dependent behavior.  Continue to validate material properties and performance meets design needs for control surfaces, leading edges and acreage.  Validate computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624348"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Electronics, Optics, and Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.810"
                        },
                        "CurrentYear": {
                            "val": "33.693"
                        },
                        "BudgetYearOne": {
                            "val": "34.530"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.530"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "34.877"
                        },
                        "BudgetYearThree": {
                            "val": "35.504"
                        },
                        "BudgetYearFour": {
                            "val": "34.113"
                        },
                        "BudgetYearFive": {
                            "val": "34.801"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials technologies for surveillance and situational awareness systems and subsystems for aircraft and missile applications, including sensor, microwave, and infrared (IR) detection and countermeasures devices used for targeting, electronic warfare, and active aircraft protection.  Materials for protection of aircrews, sensors, and aircraft from laser and high-power microwave directed energy threats are also developed.  Electronic and optical materials are being developed to enable surveillance and situational awareness with faster operating speeds, greater tunability, higher power output, improved thermal management (including higher operating temperatures), greater sensitivity, and extended dynamic range.  New materials are being developed to counter the most prominent laser threats and to respond to emerging and agile threat wavelengths without impairing mission effectiveness. The project develops nanostructured and biological materials for aircraft structures, munitions, air vehicle subsystems, and personnel. The project develops novel materials for electromagnetic interactions with matter for electromagnetic pulse, high power microwave, and lightning strike protection."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Nanotechnology Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrared Detector Materials"
                                    },
                                    "Description": {
                                        "val": "Develop IR detector materials and processes technologies for performance, affordability, and operational capability of surveillance, tracking, targeting, and situational awareness systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.064"
                                            },
                                            "Text": {
                                                "val": "Developed materials for use in high resolution mid wave infrared (MWIR) applications. Developed materials to support and provide persistent air ISR. Continued to demonstrate models of materials optical\/infrared behavior for low-observable, ISR, and other applications. Continued to develop nanoscale materials for use in producing detectors. Utilized computational materials science to improve performance prediction models. Continued to develop inorganic quantum materials for aerospace applications. Initiated development of short wave IR detector materials and hyperspectral long wave IR materials. Initiated development of radio frequency (RF)\/IR photonics for compact air vehicle applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.443"
                                            },
                                            "Text": {
                                                "val": "Validate and continue to develop materials for use in high resolution MWIR applications. Demonstrate materials to support and provide persistent air ISR. Demonstrate models of materials optical\/IR behavior for LO, ISR, and other applications. Validate nanoscale materials for use in producing detectors. Validate and continue to utilize computational materials science to improve performance prediction models. Demonstrate inorganic quantum materials for aerospace applications. Continue to advance the development of short wave IR detector materials and hyperspectral long wave IR materials. Continue to advance the development of RF\/IR photonics for compact air vehicle applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.364"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.364"
                                            },
                                            "Text": {
                                                "val": "Continue to develop materials for use in high resolution MWIR applications. Continue to develop materials to support and provide persistent air ISR. Demonstrate models of materials optical\/IR behavior for LO, ISR, and other applications. Demonstrate nanoscale materials for use in producing detectors. Continue to utilize computational materials science to improve performance prediction models. Demonstrate inorganic quantum materials for aerospace applications. Continue development of short wave IR detector materials and hyperspectral long wave IR materials. Continue development of RF\/IR photonics for compact air vehicle applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy Hardened Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to enhance the safety, survivability, and mission effectiveness of aircrews, sensors, viewing systems, and related assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.175"
                                            },
                                            "Text": {
                                                "val": "Validated and demonstrated materials and technologies to protect against directed energy threats. Projects included optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Continued to develop materials for high energy laser interactions. Utilized computational materials science to enhance multi-scale modeling. Continued to develop materials and processes for hardening and optical materials applications.  Initiated development of photonic enabled RF phased arrays and tunable inductors\/large area films."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.817"
                                            },
                                            "Text": {
                                                "val": "Demonstrate repeatability of materials and technologies to protect against directed energy threats. Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Validate materials for high energy laser interactions. Utilize computational materials science to enhance multi-scale modeling. Demonstrate materials and processes for hardening and optical materials applications. Continue development of photonic enabled RF phased arrays and tunable inductors\/large area films."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.017"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.017"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate repeatability of materials and technologies to protect against directed energy threats. Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Continue to validate materials for high energy laser interactions. Continue to utilize computational materials science to enhance multi-scale modeling. Continue to demonstrate materials and processes for hardening and optical materials applications. Continue to advance development of photonic enabled RF phased arrays and tunable inductors\/large area films."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Source Materials"
                                    },
                                    "Description": {
                                        "val": "Develop materials to enable higher performance lasing media, new laser architectures, optical isolators, beam steering, and other high energy laser components for directed energy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated reliable materials and processes to optimize components for compact, lightweight, directed energy applications. Continued to develop materials and processes for Polymeric Energy Conversion. Continued to demonstrate materials for improved laser source components operating in the mid-infrared range. Continued to develop materials with tailorable properties for beam steering in the newly accessible W band. Continued to demonstrate materials processes for fabricating new laser beam scanning devices that utilize electrooptic polymers to enable high-speed beam steering. Continued to develop and demonstrate materials that increase high energy laser efficiency and output. Utilized computational materials science to improve performance predictions and shorten design cycle time."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.184"
                                            },
                                            "Text": {
                                                "val": "Demonstrate materials with tailorable properties for beam steering in the newly accessible W band. Validate materials processes for fabricating new laser beam scanning devices that utilize electro-optic polymers to enable high-speed beam steering."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.425"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate materials with tailorable properties for beam steering in the newly accessible W band. Demonstrate materials processes for fabricating new laser beam scanning devices that utilize electro-optic polymers to enable high-speed beam steering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nanostructured and Biological Materials"
                                    },
                                    "Description": {
                                        "val": "Develop enabling and foundational biotechnologies for guidance and control, rapid tagging, tracking, and identification of targets, and bio-integrated electronics and sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.746"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and demonstrate biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Used pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition. Continued to develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, multifunctional devices for use in autonomy. Continued to develop materials and processes for writing and printing robust electronics on varied flexible and stretchable substrates, and the development of structurally resilient architectures and nanostructures with embedded  energy and\/or comm. Focused develop of integrated sensor platform, suitable for multiple sensor components.  Continued to develop and analyze nano-biomaterials for human performance sensing. Validated computation materials science techniques and models to characterize nanomaterials. Continued development and support of nano-bio manufacturing consortium."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.249"
                                            },
                                            "Text": {
                                                "val": "Validate biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Continue to advance the use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition. Validate reliable materials and processes to optimize components for compact, lightweight, multi-functional devices for use in autonomy and human performance monitoring applications. Demonstrate materials and processes for writing and printing robust electronics on varied flexible and stretchable substrates, and the development of structurally resilient architectures and nanostructures with embedded energy and\/or comm. Focused develop of integrated sensor platform, suitable for multiple sensor components. Initiate materials and process or strain resilient electronics. Continue to develop and analyze nano-biomaterials for human performance sensing. Continue to validate computation materials science techniques and models to characterize nanomaterials. Continue development and support of nano-bio manufacturing consortium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.724"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.724"
                                            },
                                            "Text": {
                                                "val": "Demonstrate biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Continue to use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition. Demonstrate reliable materials and processes to optimize components for compact, lightweight, multi-functional devices for use in autonomy and human performance monitoring applications. Continue to develop materials and processes for writing and printing robust electronics on varied flexible and stretchable substrates, and the development of structurally resilient architectures and nanostructures with embedded energy and\/or comm. Focused develop of integrated sensor platform, suitable for multiple sensor components. Initiate materials and process or strain resilient electronics. Validate and continue to develop and analyze nano-biomaterials for human performance sensing. Demonstrate computation materials science techniques and models to characterize nanomaterials. Continue support of nano-bio manufacturing consortium."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624349"
                    },
                    "ProjectTitle": {
                        "val": "Materials Technology for Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.655"
                        },
                        "CurrentYear": {
                            "val": "42.211"
                        },
                        "BudgetYearOne": {
                            "val": "43.539"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.539"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "46.241"
                        },
                        "BudgetYearThree": {
                            "val": "51.424"
                        },
                        "BudgetYearFour": {
                            "val": "51.285"
                        },
                        "BudgetYearFive": {
                            "val": "52.326"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials and processing technologies to support operational Air Force mission areas by providing the ability to inspect the quality of delivered systems, transitioning more reliable and maintainable materials, establishing a capability to detect and characterize performance threatening defects, characterizing materials processes and properties necessary for materials transition, and providing quick reaction support and failure analysis to the operational commands and repair centers.  Repair techniques and nondestructive inspection\/evaluation (NDI\/E) methods are developed that are needed for metallic and non-metallic structures, coatings, corrosion control processes, and to support integration of composite structures for aerospace systems.  Various NDI\/E methods are essential to ensure optimum quality in the design and production of aircraft, propulsion, and missile systems.  These NDI\/E methods are also essential to monitor and detect the onset of any service-initiated damage and\/or deterioration due to aging of operational systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop sensing and life prediction technologies to identify damage and characterize the health of aging structures, propulsion systems, and low-observable (LO) materials and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.109"
                                            },
                                            "Text": {
                                                "val": "Continued to improve and validate modeling capabilities required to enable materials and damage characterization via nondestructive evaluation methods.  Conducted and demonstrated enhanced sensing and characterization of damage in multi-layered structures to improve detectable limits and the probabilities of finding deeply imbedded or hidden damage in aerospace systems.  Continued developing advanced sensing technologies to detect and characterize changes in material structure, material properties, damage, and other factors that detrimentally affect aerospace systems. Continued to develop innovative inspection technologies to enable rapid assessment of LO material performance. Continued research to assess metals performance in aerospace systems for more affordable life management practices and life extension for aerospace structures and turbine engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Continue to improve and validate nondestructive evaluation modeling capabilities and use these competences to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components.  Begin to develop approaches to address the variability inherent in aerospace systems and materials and begin to quantify the impact of that variability on nondestructive inspection capability and reliability.  Validate advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Initiate development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components.  Validate repeatability and functionality of innovative LO inspection methods to enable rapid assessment of LO material performance. Demonstrate assessment of enhanced metals performance in aerospace systems. Initiate development of advanced materials and processes to monitor and evaluate LO material state awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.503"
                                            },
                                            "Text": {
                                                "val": "Demonstrate nondestructive evaluation modeling capabilities and use these competences to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components.  Continue to develop approaches to address the variability inherent in aerospace systems and materials and begin to quantify the impact of that variability on nondestructive inspection capability and reliability.  Demonstrate advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Continue development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components.  Continue to validate repeatability and functionality of innovative LO inspection methods to enable rapid assessment of LO material performance. Continue to demonstrate assessment of enhanced metals performance in aerospace systems. Continue development of advanced materials and processes to monitor and evaluate LO material state awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production and Repair Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve problems with materials in the production and repair of systems components and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.546"
                                            },
                                            "Text": {
                                                "val": "Validated and demonstrated advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Continued to investigate failure limits for emerging Air Force systems. Continued to validate and demonstrate test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural materials. Continued to transition advanced materials technologies and designs for improved maintainability and life cycle costs of conductive outer-moldline films, coatings, access panel treatments, and multifunctional systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "Continue to validate and demonstrate advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Validate understanding of failure limits for emerging Air Force systems. Develop improved lifecycle prediction test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural and functional materials. Assess advanced materials, processes and designs for improved repair and maintainability and life cycle cost of outer-moldline coatings, access panel treatments, and multifunctional systems. Initiate LO affordability technologies and processes to reduce maintenance costs of LO materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.862"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.862"
                                            },
                                            "Text": {
                                                "val": "Validate repeatability and demonstrate advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Demonstrate understanding of failure limits for emerging Air Force systems. Continue to develop improved lifecycle prediction test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural and functional materials. Continue to assess advanced materials, processes and designs for improved repair and maintainability and life cycle cost of outer-moldline coatings, access panel treatments, and multifunctional systems. Continue LO affordability technologies and processes to reduce maintenance costs of LO materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Failure Analysis Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve materials problems and provide electronic and structural failure analysis of components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Continued to perform quick response failure analyses and materials investigations. Initiate investigation of improved analysis techniques to determine root cause materials failure\/degradation. Continued to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight.  Developed advanced functional materials and Micro-Electro-Mechanical system (MEMs) failure analysis capabilities. Continued to validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continued to transition advanced test methods for analyzing electrical and structural failures of emerging materials.  Continued to validate and demonstrate advanced wiring materials technologies to replace aging wiring systems. Validated and demonstrated new wiring technologies for emerging weapon systems. Initiated research to provide advanced materials to improve systems sustainment in field and Air Force Program Offices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.711"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Continue to investigate improved analysis techniques to determine root cause materials failure\/degradation. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight. Continue development of functional materials and MEMS failure analysis capabilities. Continue to validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials.  Initiate development on new, more durable materials and protection for high power wiring technologies for Air Force weapon systems.  Continue research to provide advanced materials to improve systems sustainment in field and Air Force Program Offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.174"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Continue to investigate improved analysis techniques to determine root cause materials failure\/degradation. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight. Continue development of functional materials and MEMS failure analysis capabilities. Continue to validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials.  Continue development on new, more durable materials and protection for high power wiring technologies for Air Force weapon systems.  Continue research to provide advanced materials to improve systems sustainment in field and Air Force Program Offices."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}