{
    "id": "9ea7b6534689fa40c56fd4629f0f4c844ec27666",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258A"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "132"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.139"
            },
            "CurrentYear": {
                "val": "10.037"
            },
            "BudgetYearOne": {
                "val": "16.684"
            },
            "BudgetYearOneBase": {
                "val": "16.684"
            },
            "BudgetYearTwo": {
                "val": "18.506"
            },
            "BudgetYearThree": {
                "val": "10.364"
            },
            "BudgetYearFour": {
                "val": "10.157"
            },
            "BudgetYearFive": {
                "val": "10.346"
            }
        },
        "ProgramElementNote": {
            "val": "FY16 increase attributed to Army realignment to preserve Test Capability."
        },
        "ProgramElementMissionDescription": {
            "val": "This program funds aerial and ground target hardware and software development, maintenance, and upgrades.  The overall objective is to ensure validation of weapon system accuracy and reliability by developing aerial and ground targets essential for test and evaluation (T&E).  These targets are economical and expendable, remotely controlled or stationary, and often destroyed in use.  The Army is the Tri-Service lead under Reliance for providing rotary wing, mobile ground, towed, and designated targets for T&E.  The Army executes development of some Service-peculiar target requirements in support of quality assurance, lot acceptance, and training and continues development of Service-peculiar and on-going target materiel upgrades to maintain continuity with current weapons technology and trends in modern and evolving Army weapons."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.481"
                },
                "CurrentYear": {
                    "val": "10.040"
                },
                "BudgetYearOne": {
                    "val": "9.717"
                },
                "BudgetYearOneBase": {
                    "val": "9.717"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.139"
                },
                "CurrentYear": {
                    "val": "10.037"
                },
                "BudgetYearOne": {
                    "val": "16.684"
                },
                "BudgetYearOneBase": {
                    "val": "16.684"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.342"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "6.967"
                },
                "BudgetYearOneBase": {
                    "val": "6.967"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.003"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.342"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.967"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.967"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "238"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.734"
                        },
                        "CurrentYear": {
                            "val": "7.394"
                        },
                        "BudgetYearOne": {
                            "val": "12.182"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.182"
                        },
                        "BudgetYearTwo": {
                            "val": "12.920"
                        },
                        "BudgetYearThree": {
                            "val": "5.881"
                        },
                        "BudgetYearFour": {
                            "val": "5.515"
                        },
                        "BudgetYearFive": {
                            "val": "5.959"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "High Speed Aerial Target (HSAT) Replacement will begin in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "Aerial Targets support Army Transformation by providing for development, acquisition, operation, storage, update, and maintenance of realistic surrogate or acquired threat high-performance, multi-spectral aerial targets and development of virtual target computer models of aerial targets. Modern weapons require test, evaluation, and training using threat representative aerial targets to assess their effectiveness on the battlefield.  This program encompasses a family of rotary and fixed-wing targets; full-scale, miniature, and subscale targets; virtual targets; ancillary devices; and their control systems.  These products are required to adequately stress weapon systems undergoing test and evaluation (T&E).  In order to stress systems during T&E, aerial targets must have flight characteristics, signatures, and other performance factors that emulate the modern threat.  This program includes long-range planning to determine future target needs and development of coordinated requirement documents; the management of target research, development, test and evaluation process; execution of the validation process to ensure that surrogate targets adequately represent the threat; development and acquisition of surrogate and acquired targets; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of the developed and acquired threat targets to ensure availability for the T&E customer.  The Army is the Reliance lead for Rotary Wing Targets and towed target developments and the Tri-Service lead for procurement and enhancement of the MQM-107 fixed wing target."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the High Speed Aerial Target Sustainment (HSAT)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the HSAT, MQM-107 equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.375"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the aging HSAT, MQM-107 that provided a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds were required to overcome obsolescence for spare and repair parts, and to maintain equipment and documenation for safe operations supporting T&E programs such as Patriot, Stinger, Integrated Air and Missile Defense (IAMD), Sentinel Radar, Cruise Missile Defense Systems (CMDS) and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the agingHSAT, MQM-107 that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds required to overcome obsolescence for spare and repair parts, and to maintain equipment and documentation for safe operations. Supports all Army systems needing to test Intelligence Surveillance and Reconnaissance (ISR), kinetic, electronic warfare, infra-red or ISR capabilities against an aerial target with high speed, high altitude flight envelope."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.132"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.132"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the aging HSAT, MQM-107  that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the research, development, test, and evaluation of weapons systems and to aid in training operational units employing production missile systems. Funds will be required to overcome obsolescence for spare and repair parts, and to maintain equipment and documentation for safe operations supporting T&E programs such as Patriot, Stinger, IAMD, Sentinel Radar, CMDS and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Target Tracking Control Systems (TTCS) and aerial target control components."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the TTCS and aerial target control components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.644"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the TTCS and aerial and ground target control components. Provided for design modifications to solve obsolescence problems and updates software to correct anomalies. Provided for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Updated documentation of the system and operations and maintenance manuals.  Supported operational repair and maintenance with engineering analysis of target control system performance. Provide support to programs such as Patriot, MEADS, and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.602"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the TTCS and aerial target control components. Provides for design modifications to solve obsolescence problems and updates software to correct anomalies. Provides for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Updates documentation of the system and operations and maintenance manuals. Supports operational repair and maintenance with engineering analysis of target control system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.584"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.584"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the aerial and TTCS ground target control components. Will provide for design modifications to solve obsolescence problems and updates software to correct anomalies. Will provides for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Will update documentation of the system and operations and maintenance manuals. Will support operational repair and maintenance with engineering analysis of target control system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Towed Targets\/Ancillary devices."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the Towed Targets\/Ancillary devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.110"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the Towed Targets\/Ancillary devices. Continued development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continued development and testing of Low Cost Towed target systems (Cruise Missile Tow Target and Reduced Radar Tow Target) emulating current threats at a very low cost to Patriot,  Joint Land Attack Cruise Missile Defense Elevated Netted Sensor System (JLENS) and classified customers.  Signature modification and performance enhancement efforts for these targets is ongoing. Investigates\/tests other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.912"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the Towed Targets\/Ancillary devices. Continues development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continues development and testing of Low Cost Towed target systems (Cruise Missile Tow Target, Reduced Radar Tow Target, and the Special Low Altitude Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Investigates\/tests other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.657"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the Towed Targets\/Ancillary devices. Will continue development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continuation of development and testing of Low Cost Towed target systems (Cruise Missile Tow Target and Reduced Radar Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers.  Signature modification and performance enhancement efforts for these targets is ongoing. Investigates\/tests other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Integrated Avionics Package (IAP)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the IAP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.269"
                                            },
                                            "Text": {
                                                "val": "Completed the EMD for the IAP which provides the avionics for aerial targets to support multiple mission requirements for programs such as Patriot, and Medium Extended Air Defense System (MEADS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for Aerial Virtual Targets."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for Aerial Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.089"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focused on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; supported verification and validation of models, and provided archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models were employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models were used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.753"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; supports verification and validation of models and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models are used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.949"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Army Ground Aerial Target Control System (AGATCS)."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activities for the Army Ground Aerial Target Control System (AGATCS). which will support a modern current technology target control system for control of both aerial and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.673"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for AGATCS which provides remote control of aerial (both fixed and Rotary Wing), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness.  Complies with DODI 8510.01 mandate\/DOD Information Assurance Certification and Accreditation Process (DIACAP) on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Develops and maintains a small fleet of seaborne and Unmanned Helicopter Vehicle Targets (UHV-T) assets for use by the T&E community. Provides Test Centers and the  T&E community with a  versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation. Acquires and sustains Surface Target Instrumentation  to support all test ranges critical to  Army Test and Evaluation Command's (ATEC) requirement for threat representative surface targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.621"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for AGATCS which provides remote control of aerial (both fixed and Rotary Wing), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness.  Complies with DODI 8510.01 mandate \/ DOD Information Assurance Certification and Accreditation Process (DIACAP) on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Develops and maintains a small fleet of seaborne and UHV-T assets for use by the T&E community. Provides Test Centers and the  T&E community with a  versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation.\nAcquires and sustains STI to support all test ranges critical to ATEC's requirement for threat representative surface targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.275"
                                            },
                                            "Text": {
                                                "val": "Will Continue EMD for AGATCS which provides remote control of aerial (both fixed and Rotary Wing), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness.  Complies with DODI 8510.01 mandate \/ DOD Information Assurance Certification and Accreditation Process (DIACAP) on all target control systems to ensure a secure operating posture.  Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Develops and maintains a small fleet of seaborne and UHV-T assets for use by the T&E community. Provides Test Centers and the  T&E community with a  versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation. Acquires and sustains STI to support all test ranges critical to ATEC's requirement for threat representative surface targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Unmanned Aerial System - Target (UAS-T)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the UAS-T to provide threat representative support for test and experimentation missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.574"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a wide variety of test requirements by providing generic threat representative support for test and experimentation missions. Projects supported the Space and Missile Defense Command High Energy Laser project, the Stinger proximity fuse development and testing, other missile system upgrade projects, Joint Integrated Air and Missile  Defense Organization (JIAMDO) sponsored Black Dart 2014, Littoral Combat Ship testing, and a variety of research and development efforts. Funds enabled the identification and correction of system anomalies identified during operations and the flight demonstration of system corrections. Funds provided for limited engineering capability to address minor enhancements to the basic target system to meet shortcomings identified during operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.452"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a wide variety of test requirements by providing generic threat representative support for test and experimentation missions. Funds enable the identification and correction of system anomalies identified during operations and the flight demonstration of system corrections. Funds provide for limited engineering capability to address minor enhancements to the basic target system to meet shortcomings identified during operations. Funds also provide for updating of the system drawing package and systems documents to incorporate modifications made to the system. Supports all Army systems needing to test Intelligence, Surveillance and Reconnaissance (ISR), kinetic, Electronic Warfare, infrared or ISR capabilities against an unmanned aerial target with a medium flight envelope."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.585"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.585"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions.  Projects to be supported include the Space and Missile Defense Command High Energy Laser project, the JIAMDO sponsored Black Dart 2015, Littoral Combat Ship operational and live fire testing, and a variety of research and development efforts.  Funds will enable the identification and correction of anomalies identified during flight operations and the flight demonstration of the corrective actions.  Funds will provide for limited engineering capability to address minor enhancements to the basic target system to meet shortcomings identified during operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the High Speed Aerial Target Replacement."
                                    },
                                    "Description": {
                                        "val": "EMD for the replacement of aging HSAT, MQM-107 to provide a realistic aerial target capable of simulating the performance of enemy aircraft. This will aid in the research, development, test, and evaluation of weapons systems and aid in training operational units employing production missile systems. Funds required for the replacement HSAT system to be cost effective and able to meet capabilities currently supported by the MQM-107. Program requires technical support for investigation, demonstration, and Integration of a more economical target. Technical oversight of the replacement targets' acquisition along with GSE and other activities related to getting it operational is essential. Supports T&E programs such as Patriot, Stinger, IAMD, Sentinel Radar, CMDS and classified programs for Army and Tri-Service customers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will begin the EMD for the replacement of aging High Speed Aerial Target (HSAT, MQM-107) that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the research, development, test, and evaluation of weapons systems and to aid in training operational units employing production missile systems. Funds are required for the replacement HSAT system that will need to be cost effective and able to meet capabilities currently supported by the MQM-107. This program will require technical support for investigation, demonstration, and integration of a more economical target. Technical oversight of the replacement targets' acquisition along with ground support equipment and other activities related to getting it operational is essential. This target will support T&E programs such as Patriot, Stinger, IAMD, Sentinel Radar, CMDS and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "459"
                    },
                    "ProjectTitle": {
                        "val": "Ground Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.405"
                        },
                        "CurrentYear": {
                            "val": "2.643"
                        },
                        "BudgetYearOne": {
                            "val": "4.502"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.502"
                        },
                        "BudgetYearTwo": {
                            "val": "5.586"
                        },
                        "BudgetYearThree": {
                            "val": "4.483"
                        },
                        "BudgetYearFour": {
                            "val": "4.642"
                        },
                        "BudgetYearFive": {
                            "val": "4.387"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2016 New Start: Mobile Ground Targets Hardware (MGTH)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program funds Army efforts to support test and evaluation (T&E) of advanced weapon systems and supports Army Transformation by developing surrogates, acquiring foreign equipment and developing virtual target computer models of ground vehicle targets. These products are required to adequately stress weapon systems undergoing T&E. This tasking includes long-range planning to determine future target needs and development of coordinated requirement documents; the centralized management of the ground target research, development, test and evaluation processes; execution of the validation process; acquisition of foreign equipment; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of developed and acquired targets to ensure availability for T&E customers. This program also manages use of current assets and operates centralized spare parts program. The US Army is the Tri-Service lead for providing mobile ground targets for T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile Ground Target Operations (MGTO)"
                                    },
                                    "Description": {
                                        "val": "MGTO to provide oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management.  Efforts support users such as Brigade Modernization Command (BMC), Apache 64E, Guided Multiple Launch Rocket System (GMLRS), PM Robotic Unmanned Sensor (PM RUS), Small Diameter Bomb (SDB II), PM Unmanned Aircraft Systems (PM UAS) and others."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.703"
                                            },
                                            "Text": {
                                                "val": "MGTO provided five Primary Operating Centers to include operations, storage, maintenance, repair, safety and configuration management for Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts supported users such as Army Test and Evaluation Command (ATEC), Apache 64E, GMLRS, Brigade Modernization Command, KIOWA, Ground Combat Vehicle (GCV), Shadow, Joint Light Tactical Vehicle (JLTV), PM Force Protection System, Unmanned Aircraft System (UAS), Light Armored Vehicle and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.072"
                                            },
                                            "Text": {
                                                "val": "MGTO provides five Primary Operating Centers to include operations, storage, maintenance, repair, safety and configuration management for Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts will support users such as ATEC, Apache 64E, GMLRS, Brigade Modernization Command, KIOWA, GCV, Shadow, JLTV, PM Force Protection System, UAS, Light Armored Vehicle and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.861"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.861"
                                            },
                                            "Text": {
                                                "val": "MGTO will provide five Primary Operating Centers to include operations, storage, maintenance, repair, safety and configuration management for Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts will support users such as ATEC, Apache 64E, GMLRS, Brigade Modernization Command, KIOWA, GCV, Shadow, JLTV, PM Force Protection System, UAS, Light Armored Vehicle and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Virtual Targets"
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation to support the research and development of Ground Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.702"
                                            },
                                            "Text": {
                                                "val": "Continued Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Focused on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; developed simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations; supported verification and validation of models, and provided archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models were employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets supported test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that were too costly or difficult to be conducted under actual field conditions.  These models were used by multiple DoD agencies and multiple weapon systems such as the Joint Air to Ground Missile (JAGM) and Longbow Hellfire offices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.571"
                                            },
                                            "Text": {
                                                "val": "Continues Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Focuses on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; develops simulation target models visualization simulations, IR analysis simulations, and RF analysis simulations; supports verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models employed to facilitate simulations for both DT and OT; Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models will be used by multiple DoD agencies and multiple weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.641"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.641"
                                            },
                                            "Text": {
                                                "val": "Will continue Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Will focus on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; will develop simulation target models visualization simulations, IR analysis simulations, and RF analysis simulations; will support verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models will be employed to facilitate simulations for both DT and OT; Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models will be used by multiple DoD agencies and multiple weapon systems such as the JAGM and Longbow Hellfire offices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Ground Targets Hardware (MGTH)"
                                    },
                                    "Description": {
                                        "val": "MGTH is certified\/safety confirmed cost effective Ground Target Hardware\nwith multiband communications. It is required for DoD weapon system force-on-force scenarios, acquisition testing, lethality analysis, and sensor Intelligence, Surveillance and Reconnaissance (ISR) vulnerability. MGTH includes Camouflage, Concealment, Deception and Obscurant (CCDO), Real Time Casualty Assessment (RTCA) and Validated Precision Target Signature (PTS) surrogate systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "MGTH will provide cost effective solutions to actual threat assets in the visual, IR, and millimeter wave (MMW) spectrums.  It will enhances Blue systems ability to recognize, react, and defeat threat forces and will stress weapon sensors.  Additionally, MGTH will enhance Blue system performance by stressing them in T&E.  It provides certified\/safety confirmed mobile ground targets for use in T&E based on Emerging Threats and existing Test and Evaluation Master Plans (TEMPS) and Training Test Support Packages (TTSP)s for DT and OT events. These systems provide realistic maneuvers, force-on-force encounters and communications that is currently unavailable."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}