{
    "id": "a3e3bc06c3923f32e7abc43f606c434a1079c81e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602751D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI) Applied Research"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.699"
            },
            "CurrentYear": {
                "val": "9.143"
            },
            "BudgetYearOne": {
                "val": "8.824"
            },
            "BudgetYearOneBase": {
                "val": "8.824"
            },
            "BudgetYearTwo": {
                "val": "8.961"
            },
            "BudgetYearThree": {
                "val": "9.471"
            },
            "BudgetYearFour": {
                "val": "10.262"
            },
            "BudgetYearFive": {
                "val": "10.401"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Software is a key to meeting the DoD’s increasing demand for high-quality, affordable, and timely national defense systems.  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the SEI Applied Research PE will develop and evaluate the feasibility and practicality of software and computer science concepts with the potential to improve future DoD systems.  The SEI’s program of work coordinates across the Department through Reliance 21, the overarching framework of the DoD’s Science & Technology (S&T) joint planning and coordination process.  This PE directly benefits these DoD S&T Communities of Interest (COI): Command, Control, Communications, Computers, and Intelligence (C4I); Autonomy; Cyber; and Engineered Resilient Systems.  Additionally, this PE benefits every COI to some degree due to the ubiquitous nature of software.  This PE also leverages expertise in government, industry, and academia to enable the development of joint-Service capabilities.\n\nThis PE represents a pivot toward more fundamental research that enables the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE funds the SEI FFRDC as the leading DoD center for addressing these longer term challenges.  The SEI Applied Research PE bolsters the organic research at the SEI FFRDC, enables stronger collaborations between the SEI FFRDC and academia, attracts top researchers to the SEI, gives the DoD access to top experts in information science, and generally enhances the DoD’s ability to benefit from the military applications of research in software and computer science."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.106"
                },
                "CurrentYear": {
                    "val": "9.156"
                },
                "BudgetYearOne": {
                    "val": "9.158"
                },
                "BudgetYearOneBase": {
                    "val": "9.158"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.699"
                },
                "CurrentYear": {
                    "val": "9.143"
                },
                "BudgetYearOne": {
                    "val": "8.824"
                },
                "BudgetYearOneBase": {
                    "val": "8.824"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.407"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "-0.334"
                },
                "BudgetYearOneBase": {
                    "val": "-0.334"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.406"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Sec 8104"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.013"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.309"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.309"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.025"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.025"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 internal realignment reflects funding for higher Departmental priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P278"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI) Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.699"
                        },
                        "CurrentYear": {
                            "val": "9.143"
                        },
                        "BudgetYearOne": {
                            "val": "8.824"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.824"
                        },
                        "BudgetYearTwo": {
                            "val": "8.961"
                        },
                        "BudgetYearThree": {
                            "val": "9.471"
                        },
                        "BudgetYearFour": {
                            "val": "10.262"
                        },
                        "BudgetYearFive": {
                            "val": "10.401"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Software is a key to meeting the Department of Defense’s (DoD’s) increasing demand for high-quality, affordable, and timely national defense systems.  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the Software Engineering Institute (SEI) Applied Research PE seeks to establish a program of applied research that will develop and evaluate the feasibility and practicality of software and computer science concepts with the potential to improve future DoD systems. \n\nThe SEI Applied Research Program Element (PE) has four main research thrusts:  (1) measurement techniques for the effectiveness of software technologies and methods; (2) design principles and tools for evolvable, scalable ecosystems; (3) models of computational behaviors; and (4) cyber-tradecraft and analytics.  These thrusts have known military applications and can be associated with active areas of basic research.  The SEI Applied Research PE seeks to translate this promising basic research into solutions for broadly defined military needs.  This PE will leverage the expertise of the SEI FFRDC in advanced technology development and technology transition to design, develop, and improve tools, prototypes, and new processes that meet general requirements for software-intensive DoD systems.\n\nThe SEI Applied Research PE will also conduct research in multicore computing, architecture-led iterative incremental development (Agile at scale); and emerging software and computer science areas that can act as catalysts for acquiring DoD systems with improved performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute Applied Research"
                                    },
                                    "Description": {
                                        "val": "Research projects at the SEI FFRDC will be awarded under this PE on a competitive basis across the SEI.  Funding levels in each thrust area may vary from year to year.  Research will address the goal of assisting the DoD to retain a long-term differential advantage over potential adversaries in the area of software-intensive systems.  The four main thrust areas are:\n\n1) Measurement techniques for the effectiveness of software technologies and methods.  Modern tools, integrated development environments, and software engineering processes have captured large data sets about development activities.  This thrust seeks to study the metrics that affect cost, schedule, quality, and performance based on real-world observation and experiment.  \n\n2) Design principles and tools for evolvable, scalable ecosystems.  The commercial world has many successful examples of software ecosystems, but the DoD has not capitalized on these to the same extent.  This thrust looks beyond implementing ecosystems in a DoD context and seeks to implement the underlying principles in a way that makes automated creation, evolution, and scaling of ecosystems easier.\n\n3) Models of Computational Behaviors.  System performance depends on end-to-end models of computational behavior that include the user, architecture, source and object code, firmware components, and processor hardware.  This thrust seeks to study emerging ideas that better model end-to-end computational behavior.  \n\n4) Cyber-tradecraft and analytics.  Cyberwarfare is an increasingly important and rapidly evolving dimension on the modern battlefield.  This thrust seeks to investigate methods that will give the DoD enduring advantages in the cyber battlespace such as reverse software engineering, automated code and malware analysis, code-level software resiliency (e.g., randomizing and time variant techniques), and other techniques such as those found in the Software Security Assurance State-of-the-Art Report.  \n\nThe SEI Applied Research PE will also conduct research in multicore computing, architecture-led iterative incremental development (Agile at scale); and emerging software and computer science areas that can act as catalysts for acquiring DoD systems with improved performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.699"
                                            },
                                            "Text": {
                                                "val": "• Piloted advanced methods to provide proactive cost control for major space domain systems, pre-milestone A, by better identifying future program change drivers that will impact cost.\n• Developed automated verification support for distributed algorithms, to lower costs of complex systems and increase assurance when testing might not be possible.  Established education and training opportunities with the Air Force Research Laboratory. \n• Developed new analysis for verifying the safety of software used to control cyber-physical systems in cooperation with the U.S. Army Communications-Electronics Research, Development and Engineering Center and the Federal Aviation Administration.\n• Developed a simulation model to reveal the cost of software sustainment for major systems and serve as a decision aid for investments.  Model trialed with a Navy Laboratory. \n• Developed an insider threat detection test bed that delivers more effective insider threat controls for the DoD.\n• Developed and demonstrated novel vulnerability discovery techniques for supervisory control and data acquisition systems, regardless of access to source code.\n• Validated scalable, efficient malware analysis techniques in operational environments that expand the available threat indicators and reduce response time.\n• Improved the efficiency of error detection by demonstrating that an architecture fault model with confidence arguments can diagnose an error and validate a solution.  Piloted this approach with an engine control system developed by industry for the DoD.  \n• Deployed prototypes for social network analysis to the National Guard, proving a lightweight, effective, and predictive capability to augment preparation and response to natural or man-made disasters during large public events.\n• International Organization for Standardization (ISO) published the SEI led effort ISO\/International Electro-technical Commission Technical Specification 17961:2013 “C secure coding rules” which were developed in the second edition of the CERT C Coding Standards book.  Multiple Defense Industrial Base entities mandated the book as a development standard."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.143"
                                            },
                                            "Text": {
                                                "val": "• Improve software security throughout the entire DoD supply chain with increased adoption of secure coding standards, improved security of programming language standards through completion of the CERT C++ Secure Coding Standard (a programming language used in major weapons systems such as the Joint Strike Fighter), reduction of rule violations in interactive development environments, and demonstration of the costs of producing secure code.\n• Improve approaches to the detection, mitigation and quantification of cyber threats to the DoD, including application programming interface design, automation of static analysis of malware binaries and analysis and contextualization of malware. \n• Identify ways to better integrate user-friendly Insider Threat controls and monitoring.\n• Develop software techniques and tools to provide proactive cost control for the sustainment of major systems. \n• Develop technologies, methods and science to assess individual and team performance during exercises for cyber mission teams.\n• Develop automated verification algorithms and tools for distributed-adaptive real-time systems, such as unmanned systems, to assure correct behavior and provide confidence in system performance.\n• Develop a suite of automated tools and techniques to reveal and manage technical debt, often the rework consequences of poor software design and development, during software sustainment.\n• Build on FY 2014 pilot of architecture fault model to automated incremental life cycle assurance that will decrease the cost and time to test critical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.824"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.824"
                                            },
                                            "Text": {
                                                "val": "• Develop and pilot capabilities and techniques that enhance acquisition-related aspects of software-reliant national security systems, focusing on cost effectiveness and lifecycle assurance.  Produce quantitative methods and software tools for cost and schedule estimation, investment planning for assured affordability, system performance and scalability behavior, anomaly and insider threat detection in operations, cyber forensic analysis, and workforce education.\n• Formulate and prototype a software development methodology with supporting tools and techniques that provide software-based capabilities with greater confidence.\n• Improve situational awareness of cyber key terrain and mission dependence; improve cybersecurity operations and analysis with increased scientific rigor through analysis automation and application of machine learning.  Reduce the costs of cyber attack recovery and reconstitution to provide improved mission assurance and resilience.\n• Enhance scalability and validity of methods and software support for assessing the training and development of the cyber and software engineering workforce."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE# 0603781D8Z"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute (SEI)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.167"
                                        },
                                        "CurrentYear": {
                                            "val": "15.754"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.202"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.202"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.181"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.653"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.132"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.351"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Together with PE 0603781D8Z, Software Engineering Institute (SEI), the SEI Applied Research PE represents a pivot toward more fundamental research that enables the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE will fund the SEI FFRDC as the leading DoD center for addressing these longer term challenges.  The SEI Applied Research PE bolsters the organic research at the SEI FFRDC, enables stronger collaborations between the SEI FFRDC and academia, attracts top researchers to the SEI, gives the DoD access to top experts in information science, and generally enhances the DoD’s ability to benefit from the military applications of research in software and computer science."
                        },
                        "PerformanceMetrics": {
                            "val": "• Transition of tools, methods, and practices for use in DoD technology development programs and programs of record.  \n• Transition of tools, methods, and practices to the Defense Industrial Base to support DoD technology development programs and programs of record.\n• Number of citations in peer reviewed journals and reports.\n• Number of external research collaborations and interactions with the broader software and computer science community."
                        }
                    }
                }
            ]
        }
    }
}