{
    "id": "a4f0bf41a48e21030949aba4939a24d15923eec0",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "64.236"
            },
            "PriorYear": {
                "val": "52.535"
            },
            "CurrentYear": {
                "val": "33.658"
            },
            "BudgetYearOne": {
                "val": "33.515"
            },
            "BudgetYearOneBase": {
                "val": "33.515"
            },
            "BudgetYearTwo": {
                "val": "32.079"
            },
            "BudgetYearThree": {
                "val": "31.344"
            },
            "BudgetYearFour": {
                "val": "39.683"
            },
            "BudgetYearFive": {
                "val": "40.219"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Emerging Capabilities Technology Development (ECTD) Program Element (PE) supports a shift in focus throughout the Office of the Deputy Assistant Secretary of Defense for Emerging Capability & Prototyping (DASD (EC&P)) to producing risk-reducing prototypes and demonstrations of emerging technologies coordinated through interagency and joint partnerships.  ECTD will support the Assistant Secretary of Defense for Research & Engineering (ASD(R&E)) under the Mitigating New and Emerging Threats priority area with longer-term, mission-focused capability development that crosses functional domains to enhance Warfighter adaptability and resilience.  The office will execute projects in collaboration with government labs, academia, and industry that target specific mission capability gaps identified by the Combatant Commands (COCOMs), the Joint Staff and senior leadership in the Office of the Secretary of Defense.\n\nIn FY 2015, Disruptive Demonstrations (Project P369) funding was transferred from PE 0603699D8Z ECTD to PE 0603289D8Z (Advanced Innovative Analysis and Concepts)."
        },
        "ProgramElementMissionDescription": {
            "val": "The ECTD funding supports projects that reduce the technology risk of emerging capabilities by advancing proof of principle prototypes in support of near and mid-term operational engagements and stability operations.  The framework is guided by the ASD(R&E), DASD(EC&P) and the Rapid Reaction Technology Office's science and technology objectives and focus areas.  With an emphasis on interagency and joint partnerships, ECTD develops initiatives to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span one to three years, typically at a cost of less than $4.000 million, and are demonstrated and released in spirals within the project timeline.  The ECTD Program focuses on rapid prototyping of emerging technologies including electromagnetic spectrum-agile capability options, multi-domain, autonomous systems, counter-weapons of mass destruction, and dismounted soldier systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.967"
                },
                "CurrentYear": {
                    "val": "33.706"
                },
                "BudgetYearOne": {
                    "val": "34.784"
                },
                "BudgetYearOneBase": {
                    "val": "34.784"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.535"
                },
                "CurrentYear": {
                    "val": "33.658"
                },
                "BudgetYearOne": {
                    "val": "33.515"
                },
                "BudgetYearOneBase": {
                    "val": "33.515"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.432"
                },
                "CurrentYear": {
                    "val": "-0.048"
                },
                "BudgetYearOne": {
                    "val": "-1.269"
                },
                "BudgetYearOneBase": {
                    "val": "-1.269"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.026"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.406"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.174"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.174"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.048"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.095"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.095"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding decreases were used to pay for higher priority DoD bills."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "64.236"
                        },
                        "PriorYear": {
                            "val": "33.535"
                        },
                        "CurrentYear": {
                            "val": "33.658"
                        },
                        "BudgetYearOne": {
                            "val": "33.515"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.515"
                        },
                        "BudgetYearTwo": {
                            "val": "32.079"
                        },
                        "BudgetYearThree": {
                            "val": "31.344"
                        },
                        "BudgetYearFour": {
                            "val": "39.683"
                        },
                        "BudgetYearFive": {
                            "val": "40.219"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Emerging Capabilities Technology Development (ECTD) funding supports projects that reduce the technology risk of emerging capabilities by advancing proof of principle prototypes in support of near and mid-term operational engagements and stability operations.  The framework is guided by the Office of the Assistant Secretary of Defense, Research and Engineering (ASD(R&E)), the Deputy Assistant Secretary of Defense, Emerging Capability & Prototyping (DASD(EC&P)) and the Rapid Reaction Technology Office science and technology objectives and focus areas.  With an emphasis on interagency and joint partnerships, ECTD develops initiatives to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span one to three years, typically at a cost of less than $4.000 million, and are demonstrated and released in spirals within the project timeline.  The ECTD Program  focuses on rapid prototyping of emerging technologies including electromagnetic spectrum-agile capability options, multi-domain, autonomous systems, counter-weapons of mass destruction, and dismounted soldier systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Missile Defeat (LCMD) Prototype"
                                    },
                                    "Description": {
                                        "val": "Low Cost Missile Defeat (LCMD) is a ballistic missile defense system designed to counter current and emerging Weapons of Mass Destruction (WMD) and Anti-Access\/Area Denial (A2\/AD) threats.  LCMD is structured using a building block approach that first conducts a technology demonstration effort under the DASD (EC&P) to accelerate technology maturation.  The Concept of Operations (CONOPS) for the system has been formulated to integrate LCMD into the existing National Ballistic Missile Defense (BMD) architecture and will prioritize the use of existing components and systems already fielded.  LCMD is not designed as a replacement to existing BMD systems, but rather as a lower cost complementary\/augmentative component to forward-deployed BMD assets.  The LCMD capability will augment current BMD systems and mitigate threat vulnerabilities to U.S. personnel and strategic assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "An Analysis Plan was developed that identified validated models and simulations to define the LCMD architecture.  This project developed system specifications, determined system performance and determined technology maturation status.  Additionally, the required performance characteristics of the LCMD critical technologies were defined and the technology maturation plan and risk assessment methodology were developed.  Future phases of the LCMD project will be determined in the year of execution.  In FY 2015, this effort is continued under Program Element 0603648D8Z."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multimodal Hostile Fire Detection System"
                                    },
                                    "Description": {
                                        "val": "The Multimodal Hostile Fire Detection System (MHFDS) integrates multiple hostile shot detection technologies through data fusion algorithms and ballistic models. The system will be designed to conduct point-of-origin shot detection and classify threats in multi-shooter scenarios.  This effort is a critical subsystem for RRTO’s Remote Weapon Station (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR) project.  This effort will also transition proof of principle technologies, fulfilling a requirement for the Army Ground Based Operational Surveillance System (Expeditionary) (GBOSS(E))."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, the MHFDS project conducted data fusion algorithm development, conducted analyses of alternatives and procured communications and sensor hardware. The project also completed hostile shot detection test events at Yuma Proving Grounds, Arizona and Fort Harrison, Montana.  The project received a research endorsement from the Maneuver Support Center of Excellence (MSCoE), Capability Development and Integration Directorate.  MHFDS directly addresses a required attribute for the Army GBOSS(E) program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The MHFDS project will continue development and integration efforts and conduct a prototype demonstration.  This test will demonstrate small arms multi-shooter detection, providing Point-of-Origin and weapon identification information.  In FY 2015, the project will also focus on integrating with the Remote Weapon Station (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR) system.  In FY 2016, the project will continue development efforts with prior year funds, fusing detection signatures for small arms and large arms.  A prototype ground demonstration is planned to evaluate the system’s capability to detect and classify hostile fire in complex fire fights with multiple hostile engagements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "X-Lab"
                                    },
                                    "Description": {
                                        "val": "X-Lab is a research effort to prototype and demonstrate a process to detect early indications of activities leading to a terrorist or state-sponsored attack using weapons of mass destruction (WMD).  The principal focus of this effort is on emergent biological-based threats.  X-Lab will demonstrate and assess analytic methods and tools for finding and correlating multiple subtle signatures associated with biological WMD development and employment.  Early detection and warning of precursor activities can enable intervention, earlier localization of response, and earlier preparation of antidotes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The X-Lab project established an analytic framework that supports large data handling and exploitation relevant to the Bio-WMD problem that includes initial analytics and workflows.  The project developed and demonstrated initial analysis tools.  The program developed a testbed for developing, testing and evaluating data analysis tools and workflows.  This testbed provided a platform for development by the broader community for ongoing refinement and expansion of methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The X-Lab project will implement an infrastructure, process, and analytic tools for detection of precursor activity related to the execution of a biological WMD attack.  The performance of this capability will be assessed in part through demonstrations that will involve analysts operating in a nominal Red-Blue game format.  These demonstrations will be conducted in accelerated real-time with analysts applying data mining tools against realistic datasets.  ECTD funding for X-Lab will conclude in FY 2015.  Following the FY 2015 demonstrations, the research analytics and methodologies developed under this effort will transition to the Services, COCOMs and other government organizations for use in their operational intelligence cells."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Weapon Station (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR)"
                                    },
                                    "Description": {
                                        "val": "The Remote Weapon Station (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR) project will develop a prototype for a crew-served weapon system that will semi-autonomously detect, track, prioritize and engage multiple targets with operator determination.  This is a joint effort in conjunction with representatives of the U.S. Army Armament Research, Development and Engineering Center (ARDEC), the Joint Non-Lethal Weapons Directorate (JNLWD) and the Office of Naval Research (ONR).  These partner organizations will provide subsystems critical for RAPTOR functionality.  The combined demonstration of multi-agency science and technology developments will serve to inform the Common Remotely Operated Weapon Station (CROWS) Program of Record.  RAPTOR will also inform the development of a Joint Advanced Weapon Sensor System (JAWSS) Capability Development Document (CDD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.075"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, the RAPTOR project focused on Human Systems Integration analyses and Warfighter experimentation to aid in refining integration requirements.  The project also started developing the necessary algorithms for RWS cueing, pointing, detection and tracking capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "All RAPTOR systems engineering will be completed in FY 2015.  The project will conduct a Preliminary Design Review and a Critical Design Review.  The project will also focus on integrating with the Multimodal Hostile Fire Detection System (MHFDS) and hardware components from partner organizations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, the project will complete development of a man-in-the-loop, semi-autonomous RWS capable of detecting, tracking, prioritizing, and engaging multiple targets.  The project will also coordinate partner organizations’ technology development efforts to allow the execution of a coordinated demonstration in a hasty defense scenario."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Architectures, Design and Manufacturing for Operational Responsiveness"
                                    },
                                    "Description": {
                                        "val": "This project demonstrates the gains to be realized by tightly coupling product architectures with manufacturing and design tools, using a prototype unmanned aerial system (UAS) architecture for demonstration purposes.  The UAS architecture serves as a test bed for research in system physical and autonomy architectures and their complementary design tools and in applying additive manufacturing to accelerate manufacture by orders of magnitude."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, the project produced an initial prototype system and measured the operational responsiveness of the system in terms of total cycle time and suitability to operational missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "In FY 2015, the project will produce a final prototype system and training materials for a Structures Design Module.  Final measures of operational responsiveness and training metrics will be provided.  The UAS architecture will be readily transferrable to operators and the training material will be available for use and will transition for further toolset development with the Naval Air Systems Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Environmental Monitoring System (BEMS)"
                                    },
                                    "Description": {
                                        "val": "This project is developing a system to detect radio frequency (RF) emissions in certain portions of the RF spectrum.  Detection will inform the radiometer community in remote sensing programs on RF Interference sources, inform Department of Defense forces if they are being illuminated by certain unexpected RF sources and report unusual RF emission patterns that are detected in the environment.  The project includes the production and fielding of a distributed set of six units to three operational naval non-combatants that operate in high risk environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, the BEMS project produced prototype systems and completed testing on all units.  The systems have been prepared for deployment in FY 2015.  ECTD funding for this effort completed in FY 2014.  In FY 2015, the effort will transition to the Navy for funding of the deployment of the units to operational users and the collection of feedback reports."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stiletto Maritime Demonstration Program"
                                    },
                                    "Description": {
                                        "val": "Stiletto is a technology demonstration and assessment asset developed to examine and explore emerging technologies and prototypes via a series of maritime technology demonstrations and other activities conducted by the Rapid Reaction Technology Office (RRTO) within the DASD(EC&P).  Stiletto is an 88-foot boat that serves as a maritime demonstration platform to assist in the assessment and development of prototypes and the rapid transition of emerging technologies across the range of military operations to higher Technology Readiness Levels.  Stiletto is an experimental, all carbon fiber craft.  It was purposefully designed to rapidly acquire, integrate and employ new capabilities to explore the military utility and reduce the risk of emerging technologies and concepts of operation for special and expeditionary forces, interagency users and international partners.  Stiletto offers a streamlined experimentation and demonstration process that encourages system developers to engage directly with the warfighter in the maritime environment to rapidly adapt technologies around operational needs.  The Stiletto vessel is home-ported in Norfolk, Virginia."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Emerging capabilities and technologies were demonstrated on Stiletto during three capability demonstrations with operational commands and interagency partners.  Stiletto also participated in joint operational demonstrations and exercises including a Maritime Technical Experimentation event with U.S. Special Operations Command (USSOCOM) and the Trident Spectre 2014 interagency exercise.  Stiletto’s FY 2014 capability demonstrations focused on demonstrating integrated situational awareness capabilities to support expeditionary, coastal and riverine operations; mobile capabilities to support USSOCOM’s maritime activities; and, emerging solid state radar systems supporting the interagency combatant craft stakeholder community.  Stiletto hosted and demonstrated forty separate technologies during the two-week Trident Spectre 2014 exercise.  Technology demonstration events were conducted with radar system developers, maritime Unmanned Aerial Vehicles (UAV) manufacturers, maritime disablement capability developers, and other non-traditional businesses.  In FY 2014, Stiletto demonstrated 109 technologies and achieved a cost avoidance to the DoD of $11.700 million.  Stiletto supported 19 small businesses and 10 foreign companies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue, and will focus maritime efforts on autonomous capabilities, situational awareness, net-centric operations and electronic warfare\/electronic protection technologies.  Emerging capabilities will continue to be demonstrated on Stiletto during three capability demonstrations with operational commands and interagency partners, as well as joint operational demonstrations and exercises including Trident Spectre.  Capability demonstrations are planned to showcase maritime UAV launch and recovery capabilities to support Naval Special Warfare and the United Kingdom Ministry of Defence stakeholders; a littoral operations center concept; and communications capabilities while on-the-move at sea.  Projects will focus on partnerships with the U.S. Navy, U.S. Coast Guard, U.S. Army Watercraft Systems, USSOCOM, U.S. Southern Command (USSOUTHCOM), the Intelligence Community and other operational users.  Technology demonstration opportunities will continue to be offered to non-traditional businesses to help mature their systems and increase engagement with the warfighter in the development process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue to focus on emerging capabilities and threats and will execute capability demonstrations based on needs and priorities identified through engagement with stakeholders in the U.S. Navy, U.S. Coast Guard, U.S. Army Watercraft Systems, U.S. Marine Corps, USSOCOM, USSOUTHCOM, the Intelligence Community and other operational users.  Technology demonstration opportunities will continue to be offered to non-traditional businesses to help mature their systems and increase engagement with the warfighter in the development process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Assessments"
                                    },
                                    "Description": {
                                        "val": "The Joint Experimentation Range Complex at Yuma Proving Grounds, Arizona, is a Technology Demonstration and Assessment venue developed to examine and explore emerging technologies and prototypes in a desert environment.  In FY 2015, the Rapid Reaction Technology Office (RRTO) is sponsoring six two-week evaluation periods for interested industry and government representatives, as well as foreign partners, to demonstrate emerging capabilities in a realistic desert environment.  The sponsored demonstration period gives non-traditional and other businesses easy access to realistic environments for informal evaluation of emerging technologies.  The results of these evaluations enable improvements to the prototype systems, inform the procurement process for future enhanced capabilities and alert operational users of capabilities in development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "In FY 2015, the RRTO plans to conduct six two-week evaluation periods for interested industry and government representatives, as well as foreign partners, to test emerging capabilities in a realistic desert environment.  Also in FY 2015, a technology demonstration will be conducted in support of efforts to identify alternatives to anti-personnel landmines.  The Department of Defense (DoD) will use the results of these evaluations to inform the development\/procurement process for future enhanced capabilities and to inform operational users of capabilities in development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The Joint Experimentation Range Complex will continue to be offered as a technology demonstration and evaluation venue for interested industry and government representatives to test emerging capabilities in a realistic desert environment.  Specific technology demonstrations will be planned in response to needs identified through engagement with operational users and interagency partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "This portfolio examines and explores emerging technologies and prototypes via a series of technology demonstrations and other activities conducted by the RRTO within the DASD(EC&P).  Thunderstorm enhances interagency and international collaboration and provides the DoD and participating partners with an opportunity to evaluate and assess the capabilities of new and emerging technologies.  In addition, Thunderstorm provides an opportunity for technology developers to interact with a specific operational command and\/or other government personnel to determine how specific efforts and systems may support or enhance warfighter capability needs.  Technology developers are given the opportunity to demonstrate selected technologies in geographically and operationally relevant areas.  Thunderstorm demonstration objectives, performance measures, lessons learned, post-demonstration assessments and data evaluation serve to inform future DoD technology investments and identify new capabilities and\/or new ways to employ existing capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm Spirals 14-1, 14-2, 14-3 and 14-3A planning began in late FY 2013.  All FY 2014 Spirals capitalized on the lessons learned from previous spirals with special emphasis on information sharing; mitigating barriers to information sharing and evaluating prototype technologies.  Spiral 14-1 was a stand-alone threat convergence analyses designed to explore existing and nascent technology in an effort to expose threats to our national security; specifically those described as \"Black Swan\" events.  Spiral 14-2 was a Distributed Tabletop effort that focused on countering chemical and biological Weapons of Mass Destruction (WMD) in a maritime environment and served as a precursor to the 14-3 Field Demonstration.  The Spiral 14-3 field demonstration took place in the southeast United States.  Key operational partners included the Joint Interagency Task Force South (JIATF-S), United States Coast Guard (USCG), Defense Threat Reduction Agency (DTRA), U.S. Customs and Border Protection (CBP), Federal Bureau of Investigation (FBI), Office of Naval Intelligence (ONI), National Reconnaissance Office (NRO), National Intelligence-Geospatial Agency (NGA), Homeland Security Investigations (HSI), Joint Program Executive Office (JPEO) for Chemical and Biological  Defense, and Special Operations Command (SOCOM).  Spiral 14-3A was an adjunct effort in partnership with the Edgewood Chemical Biological Center (ECBC).  Four chemical\/biological detection technologies that showed exceptional promise in Spiral 14-3 were invited to ECBC to evaluate their systems in a more realistic environment.  In FY 2014, Thunderstorm demonstrated a total of 55 technologies and transitioned eight technologies to operational end users.  In addition, five of the technologies have informed follow-on research and development investment and another five have informed the development of agency tactics, techniques and procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm FY 2015 spirals will build on the experience garnered from previous spirals.  Thunderstorm FY 2015 activities will focus on counter-Weapons of Mass Destruction (WMD) capabilities in the Arctic environment and assessment of technology alternatives to anti-personnel landmines.  The FY 2015 Thunderstorm spirals will include table top exercise as well as field demonstrations, which will include technologies from U.S. and foreign firms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm will continue to reflect the most exigent challenges to DoD and provide a venue to explore new and innovative technological solutions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects"
                                    },
                                    "Description": {
                                        "val": "Emerging Capabilities Technology Development (ECTD) funds supported several projects requiring less than one million dollars for execution.  ECTD selected, executed and transitioned low cost projects in the areas of autonomous vehicles, maritime irregular warfare capabilities, countering violent extremism, persistent surveillance, low-cost, small footprint operations, and other emerging technology areas.  These projects delivered developmental prototypes for evaluation or assessment by warfighters and other interagency users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.018"
                                            },
                                            "Text": {
                                                "val": "•Buoyant Body Armor (BBA):  The Buoyant Body Armor (BBA) project completed an analysis of novel ceramic manufacturing processes and developed four sets of test articles and completed ballistics testing at Naval Surface Warfare Center Dahlgren Division.  BBA is intended to develop a lightweight, flexible, and buoyant body armor prototype with multi-hit capability.  FY 2014 test results informed current acquisition efforts with the Marine Corps Systems Command (MARCORSYSCOM) and U.S. Special Operations Command (USSOCOM).\n•Humanitarian Assistance\/Disaster Relief (HA\/DR) Science & Technology Test Center:  The Humanitarian Assistance\/Disaster Relief (HA\/DR) Science & Technology Test Center established partnerships and identified a location for an ongoing capability for evaluating expeditionary and HA\/DR technologies in a Southeast Asian tropical environment.  \n•Spectral Management:  The Spectral Management project developed materiel camouflage solutions for U.S. Army, U.S. Navy and U.S. Marine Corps dismounted personnel and addressed vulnerabilities in the electromagnetic spectrum.  In March 2014, the project completed testing of initial test articles in Hawaii with the support of the U.S. Marine Corps Weapons Training Battalion and completed live fire testing at Marine Corps Base Quantico, Virginia.  \n•Augmented Reality Clip-On (ARCO):  ARCO integrated multiple situational awareness information sources directly into a thermal imager for use with night vision goggles.  The system provides a heads-up display (HUD) that delivers a day\/night-time vision, thermal imaging, navigation and route planning capabilities.\n•Spatial Iris:  The Spatial Iris project kicked off planning to develop and field software that enables the manual and digital mobile data collection of geospatial intelligence in austere environments by DoD, interagency organizations and host nation partners.  The software enables persistent domain awareness of transnational criminal organizations, counterinsurgency, humanitarian assistance\/disaster relief and civil affair activities.  It enables users to monitor trends and perceptions in high-threat countries with minimal cost and risk.  The project will complete iterative development and field testing in Honduras and Syria.  This project continues in FY 2015. \n•Managing the Space Environment:  The Managing the Space Environment project delivered a critical overview of credible technologies, prototypes and concepts for understanding, observing and managing the space environment through space debris mitigation, commercial space situational awareness capabilities and space-based orbital servicing.\n•Naval Underwater Threat Interrogation and Covert Assessment System (NAUTICAS):  NAUTICAS completed testing in California in FY 2014.  The Navy and Joint Improvised Explosive Device Defeat Organization (JIEDDO) worked toward a successful prototype system that will lead to the development of an operationally deployable prototype.\n•Spar Tactical Sensor Mast:  The Spar Tactical Sensor Mast, a deployable ocean sensor system will increase situational awareness in limited access areas.  The Naval Surface Warfare Center Dahlgren released a solicitation to build the Spar in FY 2014.  Development and evaluation during deployment are planned for FY 2015.  \n•Inflatable Catamaran Hull and Frame Development:  Inflatable Catamaran Hull and Frame Development completed testing in FY 2014 and transitioned the capabilities to the Navy’s Combatant Craft Light Mark 1 program.  The new hull design provides significantly increased speed, range, payload and improved riding. \n•Two projects focused on developing prototype capabilities for Maritime Disablement Operations were started in FY 2014 in partnership with the U.S. Navy Director of Expeditionary Warfare, Naval Special Warfare, and other partners.  Details of these prototype efforts are classified. \n•Electric-Vertical BAT (E-VBAT):  In FY 2014 the E-VBAT, an electrically-driven vertical takeoff and landing (VTOL) unmanned aircraft system (UAS), was delivered for maritime launch and recovery demonstrations from the Stiletto maritime demonstration vessel.  The E-VBAT will support missions in the areas of organic situational awareness (optics payload), maritime disablement operations (polymer kelp payload), maritime intelligence, surveillance and reconnaissance (ISR payload) and marine atmospheric boundary layer (oceanographic environmental data acquisition payload).  \n•Information Operations Assessment Foundation:  The Information Operations Assessment Foundation project identified best practices in DoD, industry and academia to help develop and refine processes and tools for information operations assessments.  The project was completed in FY 2014 and transitioned to the Joint Information Operations Warfare Center (JIOWC).\n•NETp-1:  Transitioned the NETp-1 influence assessment training capability project in FY 2014 to the Joint Staff-J8 for use in both influence assessment and Theater Campaign Planning. \n•CVE Messaging Impact:  The CVE Messaging Impact project delivered a Web-based counter-messaging prototype tool to the interagency Center for Strategic Counterterrorism Communications (CSCC) hosted at the State Department.  The project completed its development in FY 2014 with delivery of these tools.  Discussions are ongoing with other potential Combatant Command (COCOM) users related to transition of the capability.\n•Warrior Resiliency Course:  Initiated development of the Warrior Resiliency Course, a psychology based educational instruction that empowers Warfighters to take control of their stress reaction and increase unit readiness by addressing existing Post-Traumatic Stress Disorder (PTSD) in the unit, the potential to develop PTSD and family member education.  This project will continue in FY 2015 in partnership with OSD (Policy) and the National Institutes of Health.\n•Extreme Bandwidth Analyzer and Correlator (EBAC):  The EBAC technology senses broadband radio frequency (RF) information from the environment and outputs high resolution wideband spectrum information.  In FY 2014, in conjunction with the Air Force, system development improved the accuracy and speed of the signal analysis, post processing and direction finding capabilities.  ECTD funding for this effort completed in FY2014.  The improvements will be demonstrated in an open air capability during an Electromagnetic Spectrum experimentation event in FY 2015.\n•Map Based Planning Service (MBPS):  This project developed a set of services and capabilities that allow planners, staff and leaders to collect, process, store, display and share data and information in a geo-temporal context in order to develop situational awareness, share knowledge and make informed decisions in a near real-time environment.  An operational prototype was deployed in FY 2014.  The effort will fully transition to the Army Engineer Research and Development Center (ERDC) in FY 2015."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.858"
                                            },
                                            "Text": {
                                                "val": "•Spectral Management:  The Spectral Management project will complete Generation II development and perform testing.  Testing will take place in applicable global environments and involve the currently fielded camouflage spectrum as a baseline.  Results will be used to finalize the Spectral Management camouflage specification in support of Marine Corps Systems Command and the Army Program Executive Officer (PEO) Soldier.\n•Spatial Iris:  The Spatial Iris project will continue in FY 2015 developing and fielding software that enables manual and digital mobile data collection of geospatial intelligence in austere environments by DoD, interagency organizations and host nation partners.  The software enables persistent domain awareness to combat transnational criminal organizations, counterinsurgency, Humanitarian Assistance\/Disaster Relief, civil affairs, or otherwise monitor trends and perceptions in high-threat countries with minimal cost and risk.  The software will be transitioned to the Defense Threat Reduction Agency’s (DTRA) Secure Unclassified Network (SUNet).\n•Humanitarian Assistance\/Disaster Relief (HA\/DR) Science & Technology Test Center:  The Humanitarian Assistance\/Disaster Relief (HA\/DR) Science & Technology Test Center established partnerships and identified a location for an ongoing capability for evaluating expeditionary and HA\/DR technologies in a Southeast Asian tropical environment.  The Test Center will be completed in FY 2015 and support U.S. Pacific Command (PACOM) HA\/DR Science & Technology (S&T) exercises and demonstrations.\n•Spar Tactical Sensor Mast:  The Spar Tactical Sensor Mast project will continue in FY 2015, with the planned delivery of the Spar ocean sensor buoy, integration of sensor systems by Naval Surface Warfare Center Dahlgren and deployment during Trident Spectre and potentially in the U.S. Southern Command (USSOUTHCOM) area of responsibility. \n•Two classified Maritime Disablement Operations prototypes will deliver and demonstrate prototype capabilities in FY 2015.\n•Warrior Resiliency Course:  The Warrior Resiliency Course, a psychology based educational instruction that empowers Warfighters to take control of their stress reaction and increase unit readiness will deliver a Train-the-Trainer program to selected unit members, first responders, and medical professionals; provide mentored resiliency training to military members (training by Unit Trainers); and complete a Web portal for the Department of Defense focused on Recoding Post-Traumatic Stress Disorder (PTSD).\n•Electric-Vertical BAT (E-VBAT):  The E-VBAT Unmanned Aircraft System (UAS) will perform maritime launch and recovery demonstrations from Stiletto in FY 2015 specifically to support identified needs from stakeholders in the U.S. Navy, U.S. Marine Corps, U.S. Coast Guard, and other government agencies in the areas of Intelligence, Surveillance, and Reconnaissance (ISR); data communications; and Maritime Disablement Operations.  The E-VBAT is a hybrid platform possessing the launch and recovery capabilities of a rotary wing aircraft and the endurance, range and payload capacity of a fixed wing ISR UAS.\n•ARCO:  The system provides a heads-up display (HUD) that delivers day\/night-time vision, thermal imaging, navigation and route planning capabilities.  The ARCO project will complete all development, integration and testing in FY 2015.  The prototypes will be demonstrated during a Limited User Assessment in March 2015 with Special Operations Forces (SOF) participation.  The ARCO prototypes will directly transition to United States Special Operations Command (USSOCOM) Program Executive Office (PEO) SOF Warrior's Joint and Special Operations Program (JSOP) Program of Record and the U.S. Army PEO Soldier's Soldier Enhancement Program (SEP).  In addition, ARCO will inform follow-on Joint Special Operations Command (JSOC) science & technology development and acquisition.\n•Additional FY 2015 Low Cost Innovative Projects will be selected in the year of execution in support of DoD Strategic Priorities and S&T objectives identified by the Assistant Secretary of Defense for Research (ASD(R&E)) and Engineering and the Deputy Assistant Secretary of Defense for Emerging Capability & Prototyping (DASD(EC&P))."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.865"
                                            },
                                            "Text": {
                                                "val": "FY 2016 Low Cost Innovative Projects will be selected in the year of execution in support of DoD Strategic Priorities and S&T objectives identified by the ASD(R&E) and DASD(EC&P)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Proof of Principle Prototyping"
                                    },
                                    "Description": {
                                        "val": "This project focuses on cost-effective, limited duration efforts to design, develop and deliver prototypes of cutting-edge land, sea, air and space systems to meet the Department's goal to drive innovation in aviation, space, maritime and ground combat systems in a fiscally constrained environment through advanced rapid prototyping.  These prototypes will be delivered to joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include assets such as the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises and the Joint Experimental Range Complex (JERC).  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities.  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics.  Advanced rapid prototyping provides a mechanism to guard against technological surprise, preserve industrial base capabilities, impose asymmetric strategic costs on potential adversaries, and explore innovative, technology-enabled military capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.308"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, Rapid Prototyping addressed the areas of Electromagnetic Spectrum Agility; Multi-Domain Autonomous Systems; Counter-Weapons of Mass Destruction; and Dismounted Soldier Systems.  Plans include pursuing development of concepts and designs that will result in ready-to-field prototype systems in one to three years."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Spectrum Agile Capability Focus Area"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on cost-effective, mission-focused projects to design, develop and deliver new concepts and technology prototypes aimed at protecting DoD systems and extending capabilities across the electromagnetic spectrum.  Rapid advancement of technologies and tactics that erode the U.S. ability to operate freely in the electromagnetic spectrum are affecting operational performance.  Prototypes from this focus area will be delivered to joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated electromagnetic threats.  Potential venues for prototype assessment include assets such as the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises and the Joint Experimental Range Complex (JERC) in Yuma, Arizona.  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements for future acquisition programs.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities.  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.188"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2015 include pursuing development of concepts and designs that will result in innovative Concepts of Operations (CONOPS) and prototype systems in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will explore capabilities that amplify electromagnetic signals of interest or protect the freedom of operations in the electromagnetic spectrum by DoD and its partners.  Two to three prototype efforts are anticipated in FY 2015 leveraging joint, Service and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.750"
                                            },
                                            "Text": {
                                                "val": "FY 2016 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop and deliver new concepts and technology prototypes aimed at protecting DoD systems and extending capabilities across the electromagnetic spectrum."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Autonomous Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on cost-effective, mission-focused projects to design, develop, and deliver technology prototypes of cutting edge multi-domain, autonomous systems to meet the Department’s goal to drive innovation in aviation, space, maritime and ground combat systems.  Autonomous systems range from software to aid the intelligence analyst in processing, exploitation and dissemination, through very complex autonomous air systems networked in tandem with unmanned ground or undersea vehicles.  The technologies associated with autonomy are multiplying:  from sensors that can understand the environment, to software algorithms that can make a decision or seek human assistance.  Through autonomy, the DoD will reduce the manpower required to safely conduct missions.  Multi-domain, autonomous systems developed and demonstrated through this focus area will seek to enhance the capabilities of unmanned systems to enable missions across air, sea, land and space environments and advance the state-of-the-art in cooperative behaviors among autonomous systems, such as Unmanned Aircraft Systems, Unmanned Ground Combat Vehicles, Unmanned Underwater Vehicles, and Unmanned Surface Vessels.  These prototypes will be delivered to joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises and the Joint Experimental Range Complex (JERC).  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  Development of advanced autonomous systems prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.938"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2015 include pursuing development of concepts and designs that will result in innovative CONOPS and prototype systems in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will look at science and technology to achieve autonomous systems that reliably and safely accomplish complex tasks in all environments.  Projects under consideration include low-cost, multi-mission prototypes to detect and defeat Unmanned Aerial System (UAS) threats and prototype systems with autonomous behaviors to accelerate kill chains.  Two to three prototype efforts are anticipated in FY 2015 leveraging joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.250"
                                            },
                                            "Text": {
                                                "val": "FY 2016 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop and deliver new concepts and technology prototypes aimed at achieving autonomous systems that reliably and safely accomplish complex tasks, in all environments, or protect DoD assets from autonomous threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Weapons of Mass Destruction Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area for FY 2015 and FY 2016, in anticipation of emerging needs, will include the development and advancement of prototype technologies that focus on the detection and interdiction of chemical, biological, radiological, nuclear and high yield explosives threats.  Projects may include techniques and methodologies that improve detection sensitivities, persistent Intelligence, Surveillance and Reconnaissance (ISR), tagging and tracking technologies, data analysis tools, and global situational awareness.  Efforts will support the DoD’s Strategy for Countering Weapons of Mass Destruction by developing and demonstrating active and passive defenses that address both known threats and potential surprises in adversaries’ Weapons of Mass Destruction (WMD) technology and employment methods, particularly those that could present challenges to existing countermeasures.  The constant evolution of WMD materials, tactics, and technologies calls for the development of flexible and innovative solutions that leverage the full range of DoD and interagency tools and capabilities.  Capabilities that support these tasks include detection; modeling; detailed operational planning; and analysis of materials, precursors and agents that may be related to a proliferation activity, an adversary’s developmental or fielded capability or the actual use of WMD.  Prototypes developed in this focus area will be delivered to joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include assets such as Thunderstorm integration exercises and the Joint Experimental Range Complex (JERC).  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.938"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2015 include pursuing development of concepts and designs that will result in innovative CONOPS and prototype systems in one to three years.  While project determinations are generally made in the year of execution, projects to be considered prototypes and demonstrations of capabilities to detect early indications of activities leading to a terrorist or State-sponsored attack using Weapons of Mass Destruction.  Other potential projects will focus on advances in the DoD’s ability to locate, secure, monitor, tag, track, interdict, eliminate and attribute WMD weapons and materials.  Two to three prototype efforts are anticipated in FY 2015 leveraging joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Text": {
                                                "val": "FY 2016 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at detection; modeling; detailed operational planning; and analysis of materials, precursors, and agents that may be related to a proliferation activity, an adversary’s developmental or fielded capability, or the actual use of WMD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on cost-effective, mission-focused projects to design, develop and deliver prototypes of cutting-edge dismounted soldier systems.  These systems will support the Joint Force with critical enablers in force protection, lethality, robotics, human performance optimization, command & control, mobility and sustainment.  Technology development will counter emergent threats to the warfighter both while en-route to and operating within expeditionary environments alongside unified action partners.  Force support capabilities that offer the dismounted personnel enhanced situational awareness, communications, data to decisions, and energy and power sources will be explored through this focus area.  Prototypes will be delivered to joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include assets such as the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises and the Joint Experimental Range Complex (JERC). Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities.  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.186"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2015 include pursuing development of concepts and designs that will result in innovative CONOPS and prototype systems in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will look at dismounted soldier systems that support the Joint Force with critical enablers in force protection, lethality, robotics, human performance optimization, warfighter resilience, command & control, mobility and sustainment.  Potential projects include the development of expeditionary and man-portable capabilities that enhance situational awareness, communications, data to decisions and access to energy and power.  Two to three prototype efforts are anticipated in FY 2015 leveraging joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "FY 2016 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force with critical enablers in force protection, lethality, robotics, human performance optimization, warfighter resilience, command & control, mobility and sustainment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2016, generic performance metrics applicable to Emerging Capabilities includes attainment of this objective is transition 40 percent of completing demonstrations program per year.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target dates, production measures, and demonstration goals and dates.  In FY 2014, Emerging Capabilities Technology Development achieved a transition rate of approximately 70 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P369"
                    },
                    "ProjectTitle": {
                        "val": "Disruptive Technology Demonstrations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2015, Disruptive Demonstrations (P369) funding was transferred from the ECTD Program Element to PE 0603289D8Z (Advanced Innovative Analysis and Concepts)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Disruptive Technology Demonstrations project is a technology initiative to address pre-conflict-centric capability needs and anticipatory concerns while maintaining low cost, small footprint operations.  The program objectives are to develop disruptive anticipatory products, processes and services suited for quick deployment to fulfill emerging pre-conflict requirements.  Disruptive technology and process demonstrations will leverage low cost, commercial, and often low-technology options to provide game-changing and innovative warfighting capabilities.  Demonstrations will include protection capabilities in an era of increased theft of Defense-related Intellectual Property (IP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "The Disruptive Technology Demonstrations project is a technology initiative to address pre-conflict-centric capability needs and anticipatory concerns while maintaining low cost, small footprint operations.  Prior fiscal year accomplishments include:\n- Identified alternative, game-changing capabilities leveraging existing Department of Defense Capabilities in partnership with United States Pacific Command. \n- Analyzed, demonstrated, and transitioned innovative alternative uses of existing Service programs of record.\n- Built threat models at an all-source level to address an urgent Combatant Command (COCOM) requirement.\n- Evaluated four near-term, game-changing options to address an urgent COCOM requirement.\n- Evaluated cost-effective forward base defense architectures.\n\nDue to nature of these efforts, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "Disruptive Technology Demonstrations focused on addressing anticipatory concerns, and small footprint, low-cost operations.  This was accomplished by utilizing low cost, commercial and existing Programs of Record, along with low technology options outside the typical DoD acquisition business model.  Specific FY 2014 accomplishments are as follows:  Designed and procured equipment to build a prototype configuration of an Intelligence, Surveillance and Reconnaissance-denial project.  Prepared mission-level analysis with John Hopkins University Applied Physics Lab and Massachusetts Institute of Technology Lincoln Labs that was used in a Pacific Command-sponsored Operational Exchange meeting with various services, JS and the Intelligence Community, whose participation helped to refine and enhance the prototype design, to meet warfighters needs.\nConducted experiments to refine and validate models for a unique concept for alternative navigation system with Sandia National Lab.  Conducted systems engineering and conceptual design reviews for a prototype system using an existing operational platform.\nDue to nature of these efforts, specific descriptions and detailed plans are available at higher classification levels."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The primary acquisition strategy for funding Disruptive Technology Demonstrations will be through the use of Military Inter-Departmental Purchase Requests (MIPRS).  The specifics of each MIPR will be dependent upon the development center, laboratory, contractor or agency requirements and needs.  If an Inter-Agency agreement is required, compliance and coordination of the agreement will be completed in coordination with the receiving activity and Federal Acquisition Regulation 17.5."
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2016 performance Metrics for Disruptive Demonstrations will be displayed in PE 0603289D8Z (Advanced Innovative Analysis and Concepts)."
                        }
                    }
                }
            ]
        }
    }
}