{
    "id": "a9f6db029f48a627a05126541e7c7e3cab7daf54",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603003A"
        },
        "ProgramElementTitle": {
            "val": "Aviation Advanced Technology"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "78.513"
            },
            "CurrentYear": {
                "val": "102.950"
            },
            "BudgetYearOne": {
                "val": "89.736"
            },
            "BudgetYearOneBase": {
                "val": "89.736"
            },
            "BudgetYearTwo": {
                "val": "94.280"
            },
            "BudgetYearThree": {
                "val": "100.731"
            },
            "BudgetYearFour": {
                "val": "100.699"
            },
            "BudgetYearFive": {
                "val": "102.706"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates manned and unmanned air vehicle technologies to enable Army aviation modernization.  Within this PE, aviation technologies are advanced and integrated into realistic and robust demonstrations.  Project 313 matures, demonstrates and integrates enabling component, subsystems and systems in the following areas: rotors, drive trains, structures and survivability.  Project 436 matures, integrates and demonstrates air launched weapons systems and mission equipment packages to enable control of unmanned systems.  Project 447 matures and demonstrates affordable and efficient engines.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. A major effort in this PE is the Joint Multi-Role (JMR) Technology Demonstrator.  \n\nWork in this PE contributes to the Army S&T Air Systems portfolio and is related to and fully coordinated with PE 0602211A (Aviation Technology), PE 0603313A (Missile and Rocket Advanced Technology), PE 0603710A (Night Vision Advanced technology), and PE 0603270A (Electronic Warfare Technology).  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the U.S. Army Aviation and Missile Research, Development, and Engineering Center(AMRDEC) with facilities located at Redstone Arsenal, AL; Joint Base Langley-Eustis, VA; and Moffett Field, CA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "81.037"
                },
                "CurrentYear": {
                    "val": "88.990"
                },
                "BudgetYearOne": {
                    "val": "90.394"
                },
                "BudgetYearOneBase": {
                    "val": "90.394"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.513"
                },
                "CurrentYear": {
                    "val": "102.950"
                },
                "BudgetYearOne": {
                    "val": "89.736"
                },
                "BudgetYearOneBase": {
                    "val": "89.736"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.524"
                },
                "CurrentYear": {
                    "val": "13.960"
                },
                "BudgetYearOne": {
                    "val": "-0.658"
                },
                "BudgetYearOneBase": {
                    "val": "-0.658"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.040"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "14.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.524"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.658"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.658"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "Adv Rotarywing Veh Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "61.496"
                        },
                        "CurrentYear": {
                            "val": "72.700"
                        },
                        "BudgetYearOne": {
                            "val": "73.076"
                        },
                        "BudgetYearOneBase": {
                            "val": "73.076"
                        },
                        "BudgetYearTwo": {
                            "val": "80.948"
                        },
                        "BudgetYearThree": {
                            "val": "87.882"
                        },
                        "BudgetYearFour": {
                            "val": "88.707"
                        },
                        "BudgetYearFive": {
                            "val": "90.476"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates and integrates components, subsystems and systems for vertical lift and unmanned air systems that provide improved aircraft and occupant survivability, reduced maintenance and sustainment costs, and greater performance through improved rotors, drives, vehicle management systems and platform design and structures.  Systems demonstrated include rotors, drive trains, robust airframe structures and integrated threat protection systems.  A major effort in this project is the Joint Multi-Role (JMR) Technology Demonstrator in support of the Future Vertical Lift (FVL) family of aircraft.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy. \n \nWork in this project is performed by the Aviation Development Directorate of the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Joint Base Langley-Eustis, VA, and the System Simulation Development Directorate, AMRDEC, Redstone Arsenal, AL.  Work in this project is coordinated with Program Manager Aircraft Survivability Equipment (PM-ASE)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft & Occupant Survivability Systems"
                                    },
                                    "Description": {
                                        "val": "This effort increases rotorcraft survivability by reducing platform signatures, providing the means to more efficiently counter enemy detection and tracking systems, and also increases protection to the aircraft and aircrew against ballistic munitions, crash landings, and post-crash fire events. This effort enhances air crew situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.082"
                                            },
                                            "Text": {
                                                "val": "Generated real-time threat lethality prediction algorithms and 3-D route planning optimization algorithms which include consideration of aircraft flight dynamics limits, and demonstrated in the AMRDEC Aviation Integration System Facility; demonstrated modular integrated survivability architecture using aircraft survivability equipment components, and Future Airborne Common Environment conforming software; and began full scale fabrication of a combat tempered airframe sub-section designed to meet damage tolerance criteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.118"
                                            },
                                            "Text": {
                                                "val": "Integrate for flight demonstration purposes route planner software, common processing hardware, displays, and sensors onto a relevant aircraft platform; conduct system ground testing and a series of flight tests that will quantify the capability of the hardware\/software to process data from threat sensors and display appropriate adjustments to the route plan; complete development and demonstration of a common software\/hardware interface to rapidly integrate survivability technologies into aviation platforms; and demonstrate increased operational durability and total survivability through full-scale tests of combat tempered airframe, zero-vibration helicopter, durable main rotor, integrated crash protection system, and adaptive flight control laws."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.371"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.371"
                                            },
                                            "Text": {
                                                "val": "Complete full scale demonstration of Combat Tempered Platform Technology.  Will initiate platform system trades of vehicle hardening and aircraft \/ occupant protection technologies with threat detection and route optimization for complex environments to optimize the total survivability of future vertical lift concepts; and will begin to mature integrated technology solution through analysis and incremental tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the performance benefits of advanced rotors through the evaluation of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  This effort also integrates advanced flight controls with real-time aircraft state information into vehicle management systems to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.061"
                                            },
                                            "Text": {
                                                "val": "Demonstrated scalable and portable vehicle management system techniques to more efficiently use available data to improve performance and reduce pilot workload using advanced flight controls across a wide range of Army rotorcraft sized vehicles and missions (cargo, assault, scout, attack and recon); and demonstrated an integrated reconfigurable rotor, at full scale in component tests and scaled wind tunnel tests, and demonstrated capability to adapt during operation to maximize performance, reduce vibrations, and reduce acoustic signatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.455"
                                            },
                                            "Text": {
                                                "val": "Mature advanced Vehicle Management System (VMS) technologies and demonstrate via flight test a system which more efficiently utilizes available vehicle data to improve system performance and reduce pilot workload across the range of Army rotorcraft with applicability to both the legacy fleet and the Future Vertical Lift (FVL) fleet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.505"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.505"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate integrated Rotors and Vehicle Management Technologies developed in PE 0602211A to reduce rotor loads, reduce hub and airframe drag and improve performance and will validate high-fidelity computational models of complete rotorcraft for the aerodynamics and dynamics in whirl stands and wind tunnels.  Will conduct flight test demonstration of dual-lift control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Systems"
                                    },
                                    "Description": {
                                        "val": "Design, fabricate, evaluate and demonstrate advanced vertical lift aircraft system configurations that address Future Vertical Lift (FVL) capability needs.  Determine optimum vehicle attributes that meet future force capability needs for increased system speed, range, payload, and reduced operating costs.  Conduct preliminary and detailed system design of multiple candidate systems.  Flight demonstrate operational capability of FVL technology demonstrators. Demonstrate an architecture standard and toolset that enables robust, effective, affordable and enduring mission system solutions for the FVL family of systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.001"
                                            },
                                            "Text": {
                                                "val": "Conducted preliminary design of multiple technology demonstrator aircraft, considering higher speed rotor\/prop-rotor configurations, lightweight airframe structures, and low drag fuselages to support medium lift utility and attack\/recon missions; conducted design support testing to establish performance expectations for vehicle subsystem concepts and enablers; refined a model development specification; matured technology development plans for the selected vehicle concepts; and conducted configuration and architecture concept evaluations with analyses and demonstrations performed to mature tools, processes and technologies required for mission systems development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.768"
                                            },
                                            "Text": {
                                                "val": "Complete detailed design of Joint Multi-Role technology demonstrator concepts; mature final design drawings; provide cost\/weight analyses; conduct critical system design review; begin component and subsystem fabrication and test; update analytical tools; conduct the Joint Common Architecture demonstration; refine the objective Mission Equipment Package (MEP) definition; define an Architecture Centric Virtual Integration process for avionics architecture development; and complete version 1 of the Joint Common Architecture standard."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "57.810"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "57.810"
                                            },
                                            "Text": {
                                                "val": "In FY16, the JMR TD program will continue execution of the Air Vehicle demo efforts, Joint Common Architecture (JCA) standard validation and implementation demonstrations, and the Mission System Architecture Demo (MSAD) efforts.  Specific tasks for the Air Vehicle effort includes: for both flight vehicles - complete fabrication of major air vehicle components; initiate flight vehicle assembly; complete scaled wind tunnel tests and continue data reduction activities; develop and submit subsystem test plans, air vehicle ground test plan, and critical analytical results in support of the on-going airworthiness evaluation; complete fabrication of full scale subsystem test fixtures; initiate tests to reduce risks and develop airworthiness data; and develop and exercise flight control software in simulations and system integration labs (SILs).  Specific tasks for the MSAD effort include: issuance of Requests for Information to refine the scope of the implementation demonstrations; continued development of the JCA standard including the functional decomposition of subsystem modules using both government and industry experts and government laboratory facilities; support the development of the model-based software tool with the System Architecture Virtual Integration effort; and conduct mission systems architecture implementation process demonstrations designed to mature tools, processes and technologies required for affordable and effective mission systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Drive Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates advanced rotorcraft drive technologies with the potential to: increase the horsepower-to-weight ratio; reduce drive system noise; reduce production, operating and support costs; and provide automatic component impending failure detection. The drive system demonstrators for this effort will be applicable to current platforms and future Vertical Lift platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.003"
                                            },
                                            "Text": {
                                                "val": "Matured designs of full-scale demonstrator transmissions and tail rotor drive shaft system; initiated fabrication of full-scale demonstrator hardware for aircraft configurations such as Blackhawk; assessed and validated reliability and maintainability algorithms; and assessed progress towards meeting power\/weight goals as well as production and operational cost goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.954"
                                            },
                                            "Text": {
                                                "val": "Complete final assembly of the full-scale drive system demonstrator hardware for Blackhawk configurations; conduct full-scale testing to include endurance testing for reliability and over torque testing to validate material design parameters; and evaluate loss of lubrication capabilities through testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate technologies that improve the operational availability of rotorcraft while reducing operating and support (maintenance) costs.  Efforts include component sensing, diagnostics, prognostics, and control systems. Far-term objective is to enable transition to an ultra-reliable, low maintenance design approach that significantly reduces unscheduled maintenance, inspections and operating and sustainment costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.962"
                                            },
                                            "Text": {
                                                "val": "Matured advanced prognostic algorithms for more chaotic, non-linear dynamic failure modes for engines, structures, rotor systems and drives; matured the interfaces for health monitoring systems to communicate with Joint Common Architecture standards; and evaluated the integration of system health monitoring with electronic controls to enable adaptive control systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.405"
                                            },
                                            "Text": {
                                                "val": "Mature engine adaptive controls to optimize performance, component life and maintenance schedule based on engine health; mature planetary gear failure detection technology, multifunctional aircraft sensor technology to reduce number of sensors and system weight, and a drive system intermediate rating methodology; demonstrate technologies for assessment of the structural integrity of a primarily composite airframe; verify the integrity of composite repairs, and predict the remaining useful life; and demonstrate in-flight real-time, automated methods to sense rotor system track and balance and make adjustments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.378"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.378"
                                            },
                                            "Text": {
                                                "val": "Will mature wireless sensors for on-component processing of part health and usage history; will demonstrate methodologies to allow for probability of failure predictions based on vehicle current state and anticipated mission; will mature technologies to enable lighter weight designs through loads monitoring of critical components; will mature and demonstrate technologies for component self assessment, usage tracking and embedded history; and will mature embedded multifunctional sensors with built-in processing and communications.  Will conduct developmental testing of system health and fault recognition algorithms, sensors and structural global health models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crew Decision Aid System"
                                    },
                                    "Description": {
                                        "val": "Demonstrate intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses.  This work continues in FY15 and FY16 in PE 0603003A Project 436 under the Unmanned \/ Optionally Manned Systems effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.387"
                                            },
                                            "Text": {
                                                "val": "Demonstrated an intelligent search and screen function to sort actionable priority data from onboard and off-board sources and evaluate Joint Common Architecture-like protocols for algorithm integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability for DVE Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and mature advanced sensor and cockpit display technologies to provide ability to maintain terrain and obstacle situational awareness during all degraded visual environments both aircraft induced(brown-out & white-out) and environmentally induced (fog, rain, snow etc.).  Flight testing on fleet aircraft is an integral component of the demonstration. Work in this area is being done in coordination with efforts at U.S. Army Communications-Electronics Research, Development, and Engineering Center (CERDEC), PE 603710A, Night Vision Advanced Technology.  The program presents an opportunity to North Atlantic Treaty Organization (NATO) nations, global industry, and academia to participate with their own assets in order to foster information exchange and collaboration."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.012"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.012"
                                            },
                                            "Text": {
                                                "val": "Will conduct the first major milestone event of the DVE Mitigation Demonstration Program, the NATO DVE Flight Trials at Yuma Proving Ground, AZ.  The demonstration will be executed with a UH-60 aircraft that will host program developed modernized control laws (MCLAWS version 3), multi-modality sensor suites (two) and advanced cueing elements.  All modes of flight will be tested (landing, take-off, enroute) and numerous obstacle fields will be presented to the flight crew in order to assess overall DVE System performance, system capability and pilot workload."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "436"
                    },
                    "ProjectTitle": {
                        "val": "Rotarywing MEP Integ"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.987"
                        },
                        "CurrentYear": {
                            "val": "8.000"
                        },
                        "BudgetYearOne": {
                            "val": "8.444"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.444"
                        },
                        "BudgetYearTwo": {
                            "val": "8.385"
                        },
                        "BudgetYearThree": {
                            "val": "6.758"
                        },
                        "BudgetYearFour": {
                            "val": "5.847"
                        },
                        "BudgetYearFive": {
                            "val": "5.962"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and validates man-machine integration and mission equipment software and hardware technologies for unmanned and optionally manned aircraft systems. Efforts focus on artificial intelligence, intelligent agents, cognitive decision aiding, sensors, avionics, communications, and pilot vehicle interfaces. This project improves the overall mission execution by demonstrating manned and unmanned system teaming, enhanced aircraft pilotage capability, improved crew workload distribution, and new capabilities for both manned and unmanned aircraft. This project supports Army transformation by providing mature technology to greatly expand the capabilities of unmanned aircraft, in current operating roles and future unmanned wingman roles. This project also develops, demonstrates and integrates manned and unmanned sensor and weaponization technologies such as advanced missiles, guns, fire controls, advanced target acquisition and pilotage sensors into Army aviation platforms.  Efforts are directed toward reducing the integrated weight of weapons, increasing engagement ranges, providing selectable effects on a variety of threats, and enabling cost-effective integration across multiple aviation platforms.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the U.S. Army Aviation and Missile Research, Development and Engineering Center (AMRDEC), Joint Base Langley-Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and apply tactical behavior algorithms and safe-flight technologies to enable unmanned and optionally manned aircraft to maintain safe, responsive, flexible and tactical formation flight with manned helicopters for unmanned wingman applications in re-supply, reconnaissance, surveillance and attack missions.  Develop, mature, apply, and integrate advanced decision aiding, autonomy, and human-machine interface technologies to enable the helicopter flight crew to make full use of the capabilities of an unmanned aerial system (UAS) without requiring continuous attention. Efforts include development of intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.045"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated autonomous retrograde capability on rotary-wing cargo UAS; conducted flight testing and system-level demonstration of all technologies integrated on the cargo unmanned aerial demonstrator system; determined highest-value unmanned wingman functions for decision aiding and autonomy; and selected and  began algorithm implementation and integration approach."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Complete implementation of aiding and autonomy algorithms into simulation; demonstrate task and mission effectiveness of interface devices and concepts, and aiding and autonomy algorithms; optimize approach for full integration of selected devices, concepts, and algorithms; and demonstrate a hierarchical structure of nested crew aiding and autonomy functions and evaluate the structure and functionality set for application across multiple Army aircraft, both current and future, and for suitability as the aiding\/autonomy domain of the Joint Common Architecture (JCA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.444"
                                            },
                                            "Text": {
                                                "val": "Will design, develop and demonstrate advanced autonomous behaviors in a virtual battle space to be integrated into a simulation facility to evaluate Manned\/Unmanned Teaming (MUM-T).   Will integrate close proximity flight in a simulated environment and mature technology in preparation for a simulation demonstration.  Will mature and demonstrate data fusion technologies of both on and off board sensors in a simulation environment.   Will demonstrate advanced decision aiding technologies to aid an airborne mission commander to control both own ship and a team of unmanned system. Will implement Future Airborne Capability Environment (FACE) conformance requirements to allow for ease of portability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Weapon & Sensor Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and integrate sensors, weapons, and networked technologies into manned and unmanned air systems for enhanced reconnaissance, attack, utility, and cargo missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.942"
                                            },
                                            "Text": {
                                                "val": "Matured advanced fire control systems and demonstrated an integrated weapon system through ground firings, including: sensors, proximity\/point detonation airburst ammunition and sensor targeting algorithms, for use against ground and air targets. This effort completed at the end of FY14."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "447"
                    },
                    "ProjectTitle": {
                        "val": "ACFT Demo Engines"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.030"
                        },
                        "CurrentYear": {
                            "val": "8.250"
                        },
                        "BudgetYearOne": {
                            "val": "8.216"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.216"
                        },
                        "BudgetYearTwo": {
                            "val": "4.947"
                        },
                        "BudgetYearThree": {
                            "val": "6.091"
                        },
                        "BudgetYearFour": {
                            "val": "6.145"
                        },
                        "BudgetYearFive": {
                            "val": "6.268"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates power system technologies through design, fabrication, and evaluation of advanced engine components in order to improve the performance of turbine engines for vertical lift aircraft.  This project supports Army modernization by demonstrating mature technologies for lighter turbine engines that provide increased power, increased fuel efficiency, improved sustainability and reduced maintenance.  These advanced engine designs will significantly improve the overall aircraft performance characteristics and reduce the logistical footprint of vertical lift aircraft.    \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), at Joint Base Langley-Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Affordable Turbine Engine (FATE)"
                                    },
                                    "Description": {
                                        "val": "Demonstrate an advanced, innovative 7000 horsepower class gas turbine engine that provides significant improvement in operational capability for current and future rotorcraft.  FATE uses sequential design and fabrication iterations to mature engine design and demonstrate significant reduction in specific fuel consumption (SFC), significant improvement in horsepower-to-weight ratio, and significant reduction in production and maintenance cost compared to year 2000 state-of-the-art engine technology.  The sequential design and fabrication process will begin with the compressor subsystem, then the combustor subsystem, then the turbine subsystem, and finally the mechanical systems.  Work in this project is coordinated with efforts in PE 0602211A, project 47A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.030"
                                            },
                                            "Text": {
                                                "val": "Completed majority of remaining component tests in support of first engine build; used results from these initial component level tests to complete\/refine hardware fabrication efforts as appropriate for the first engine build and redesigned component tests; initiated FATE engine hardware fabrication and assembly\/instrumentation for first engine test; and identified design improvements for goal demonstration testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.250"
                                            },
                                            "Text": {
                                                "val": "Will complete assembly\/instrumentation for first engine test; this initial, full engine, system level test will validate the mechanical integrity of the advanced FATE architecture and provide data for an initial integrated performance assessment; begin redesigned component tests in support of final goal engine build; and use results from first engine test to establish optimized component flow areas and variable geometry schedules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.216"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.216"
                                            },
                                            "Text": {
                                                "val": "Will complete fabrication of redesigned engine components and complete assembly, instrumentation, and testing of the final performance demonstration engine; this full engine system level test will validate the horsepower to weight ratio and specific fuel consumption goals of the advanced FATE architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BA7"
                    },
                    "ProjectTitle": {
                        "val": "AVIATION ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "14.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Aviation advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Future Vertical Lift Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "14.000"
                                        },
                                        "Text": {
                                            "val": "This Congressional Add will support research for Future Vertical Lift technologies and concepts in support of the Joint Multi-Role Tech Demo Program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}