{
    "id": "aae45cb1edd3043455b225a0783eaa19921141e9",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604441F"
        },
        "ProgramElementTitle": {
            "val": "Space Based Infrared System (SBIRS) High EMD"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "MdapCode": {
            "val": "210"
        },
        "PriorYearsDelta": {
            "val": "39.831"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "9455.620"
            },
            "PriorYear": {
                "val": "322.399"
            },
            "CurrentYear": {
                "val": "308.788"
            },
            "BudgetYearOne": {
                "val": "292.235"
            },
            "BudgetYearOneBase": {
                "val": "292.235"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "198.779"
            },
            "BudgetYearThree": {
                "val": "479.879"
            },
            "BudgetYearFour": {
                "val": "608.849"
            },
            "BudgetYearFive": {
                "val": "619.742"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Prior Years: Total Program Element above includes $39.831M for BPAC 65A040 Commercially Hosted Payload funded in FY11 and FY12.\nMDAP PNO 210 includes only BPAC 653616 SBIRS High EMD."
        },
        "ProgramElementMissionDescription": {
            "val": "The SBIRS RDT&E FY16 budget justification exhibits describe three elements of the SBIRS program: 1) the SBIRS Engineering and Manufacturing Development (EMD) program of record PNO 210 MDAP, 2) the Space Modernization Initiative (SMI) (non-MDAP) and the 3) Evolved SBIRS follow-on (pre-MDAP PNO 499).\n\n1. SBIRS EMD:  The Space-Based Infrared System (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improve reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance over legacy systems in order to meet requirements in Air Force Space Command's (AFSPC) Operational Requirements Document (ORD). The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The HEO-1 and HEO-2 payloads are on-orbit and certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations. The GEO-1 and GEO-2 satellites have completed AFSPC and USSTRATCOM operational acceptance.  GEO-1 received ITW\/AA certification in August 2013. The GEO-2 satellite received ITW\/AA certification in December 2013. These payloads provide a rich data set for exploitation. The program of record ground segment development exploits both the new scanner and starer sensor data through software processing and builds user messages for missile warning and missile defense. Also, data exploitation efforts enable access to raw and processed data to expand capabilities for battlespace awareness and other applications.  FY17 and FY18 funds support ground segment development.  The baseline requirement document is the 1996 SBIRS ORD. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture development. \n\n2. SMI:  Future SBIRS Overhead Persistent Infrared (OPIR) satellites will be procured using the Department of Defense (DOD) Efficient Space Procurement (ESP) concept.  ESP is an approach which seeks stable production and efficient sub-contractor product management through the block buy of two space vehicles at one time (please see SBIRS P-40 Exhibit). A portion of the savings realized from ESP block buys are programmed for investment into OPIR Space Modernization Initiative (SMI); the current OPIR SMI project was established in this manner in the FY12 President's Budget.  The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture by maturing technologies and mitigating risk areas to facilitate OPIR modernization within the Department's constrained resources. SMI supports the Program of Record (PoR) by assessing future parts and material obsolescence and designing future space and ground modifications focused on affordability and capability while simultaneously maximizing the effectiveness of existing system data products. SMI funds engineering activities to reduce both production and future system costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements.  The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current PoR SBIRS GEO satellites, reduce production timelines, and reduce recurring production costs. SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data dissemination, algorithm development, network connectivity, efficient interfaces and sensor performance assessments to enable greater exploitation of SBIRS PoR and other data sources. SMI exploitation efforts build upon PoR capabilities and inform the PoR decision process. The data exploitation efforts identify affordable, responsive and resilient measures to improve technical intelligence and battlespace awareness processing and data dissemination tools to enhance OPIR support to the warfighters and other data users. The SMI Hosted Payloads and Wide Field of View (WFOV) Testbed activities explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture. Hosted Payloads and WFOV Testbeds support maturation of mission data processing algorithms for tactical and strategic applications which are critical demonstration efforts to enhance PoR capabilities and to reduce program risks for future OPIR systems, whether new systems or evolutions of the PoR.  Collection of on-orbit WFOV data is critical to develop algorithms to process large data sets generated by emerging large format focal planes and to reduce risk for possible SBIRS follow-on architectures.  SMI activities are balanced and phased to enable an expanded tradespace and improve the competitive environment.   \n\n3. Evolved SBIRS Follow-on: The SBIRS Follow-On AoA and knowledge gained from the SBIRS SMI projects will inform a future Defense Acquisition Board (DAB) decision for the Evolved SBIRS effort.  DAB alternatives are expected to include: 1) continued production of SBIRS PoR design; 2) an evolved satellite and ground system derived from the SBIRS POR designs; 3) an evolved satellite and ground system that includes a combination of PoR derivatives and new systems; or 4) an alternative architecture (potentially disaggregated).  The Evolved SBIRS effort will implement the DAB directed program alternative. The Evolved SBIRS AoA will consider the requirement for global coverage in the post-GEO-6 and post-HEO-4 timeframe.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "322.399"
                },
                "CurrentYear": {
                    "val": "319.501"
                },
                "BudgetYearOne": {
                    "val": "274.826"
                },
                "BudgetYearOneBase": {
                    "val": "274.826"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "322.399"
                },
                "CurrentYear": {
                    "val": "308.788"
                },
                "BudgetYearOne": {
                    "val": "292.235"
                },
                "BudgetYearOneBase": {
                    "val": "292.235"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-10.713"
                },
                "BudgetYearOne": {
                    "val": "17.409"
                },
                "BudgetYearOneBase": {
                    "val": "17.409"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.713"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "17.409"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.409"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY15:  \nCongressional Mark:  -$10.0M SMI WFOV Testbed.\n\nFY16:\nOther Adjustments: +$4.751M Air Force adjustment for Combined Task Force at the Interim Test Center, +$14.6M HEO-1\/2 residual capability, less -$1.942M inflation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653616"
                    },
                    "ProjectTitle": {
                        "val": "SBIRS High Element EMD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9337.141"
                        },
                        "PriorYear": {
                            "val": "264.575"
                        },
                        "CurrentYear": {
                            "val": "230.180"
                        },
                        "BudgetYearOne": {
                            "val": "203.540"
                        },
                        "BudgetYearOneBase": {
                            "val": "203.540"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "109.975"
                        },
                        "BudgetYearThree": {
                            "val": "96.379"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10241.790"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "4"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Note: The quantity of RDT&E articles above reflects delivery of GEO-1 in FY11, GEO-2 in FY12, HEO-1 in FY04, and HEO-2 in FY05.\n\nThe Space-Based Infrared System (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improve reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance over legacy systems in order to meet requirements in Air Force Space Command's (AFSPC) Operational Requirements Document (ORD). The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The HEO-1 and HEO-2 payloads are on-orbit and certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations. The GEO-1 and GEO-2 satellites have completed AFSPC and USSTRATCOM operational acceptance.  GEO-1 received ITW\/AA certification in August 2013. The GEO-2 satellite received ITW\/AA certification in December 2013. These payloads provide a rich data set for exploitation. The program of record ground segment development exploits both the new scanner and starer sensor data through software processing and builds user messages for missile warning and missile defense. Also, data exploitation efforts enable access to raw and processed data to expand capabilities for battlespace awareness and other applications.  FY17 and FY18 funds support ground segment development.  The baseline requirement document is the 1996 SBIRS ORD. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIRS EMD"
                                    },
                                    "Description": {
                                        "val": "Continued EMD contracts for Space and Ground segment development, concept studies\/activities for obsolescence issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "264.575"
                                            },
                                            "Text": {
                                                "val": "Completed the first three (of four) Block 10 system deliveries. Completed development and delivery of the Block 10 Standard Space Trainer to support 460 OG training. Completed development and delivery of the Block 10 Launch and Anomaly Resolution Center to support SBIRS GEO-3 system test. Completed operational acceptance of the GEO-2 scanner, allowing the Technical Intelligence community certified scanner data for operational use and exploitation. Completed development of Ground mission processing risk reduction build, which includes starer processing for non-ITW\/AA users. Completed GEO-2 operational user evaluation and certification. Continued Ground System Development (Block 10 and Block 20), System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Continued Program Office and related support activities, technical analysis and independent verification and validation of Contractor.  Continued enterprise SE&I."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "230.180"
                                            },
                                            "Text": {
                                                "val": "Continue Ground System Development (Block 10) and certify the staring sensor for Technical Intellegence.  Block 10 provides significantly enhanced missile warning capabilities for our nation and allies by exploiting both scanner and starer sensor data with the improved ability for quicker detection and warning against a wider-ranging number of smaller missiles that are proliferating around the globe.  Continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches to enhance burnout surveillance and improve impact point prediction.  Continue Program Office and related support activities, technical analysis and independent verification and validation of contractor developmental efforts.  Continue enterprise SE&I."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "203.540"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "203.540"
                                            },
                                            "Text": {
                                                "val": "Complete ground system development and consolidation (Block 10). Complete Block 10 Operational Acceptance and ITW\/AA certification (including GEO-1\/2 Starers). Block 10 acceptance will significantly enhance missile warning capabilities for our nation and allies by exploiting both scanner and starer sensor data with the improved ability for quicker detection and warning (for Combatant Commanders and the National Command Authority) against a wider-ranging number of smaller missiles that are proliferating around the globe.  Complete Increment 1 operations support activities. Continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches for enhance burnout surveillance and improved impact point prediction. Continue Program Office and related support activities, technical analysis and independent verification and validation of Contractor. Continue developing and fielding Command & Control, Technical Intelligence, and Battlespace Awareness operations to leverage residual capability for HEO 1\/2 post-transition.  Continue enterprise SE&I."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 836720"
                                    },
                                    "Title": {
                                        "val": "Space Based Ir Sensor Pgm Space"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.608"
                                        },
                                        "CurrentYear": {
                                            "val": "26.100"
                                        },
                                        "BudgetYearOne": {
                                            "val": "90.190"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "90.190"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.603"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.734"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.872"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.012"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "524.587"
                                        },
                                        "CurrentYear": {
                                            "val": "444.568"
                                        },
                                        "BudgetYearOne": {
                                            "val": "452.676"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "452.676"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "412.794"
                                        },
                                        "BudgetYearThree": {
                                            "val": "991.938"
                                        },
                                        "BudgetYearFour": {
                                            "val": "111.700"
                                        },
                                        "BudgetYearFive": {
                                            "val": "102.979"
                                        },
                                        "CostToComplete": {
                                            "val": "118.274"
                                        },
                                        "TotalCost": {
                                            "val": "7494.947"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The pre-SDD SBIRS contracts were competed in full and open competition.  Two contracts were awarded to Lockheed\/Loral\/Aerojet and Hughes\/TRW in 1995 for the pre-SDD phase.  A single contract was awarded to Lockheed Martin in 1996 for the SDD phase.  This contract is still ongoing and will incrementally deliver the ground segment.  Production contracts are discussed in the procurement budget exhibits."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the funds for that fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Pre-EMD (LMMS & Hughes)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hughes Aircraft Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "159.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "159.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "159.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS EMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Prime: Lockheed Martin Sunnyvale, CA; Sub: Northrop Grumman, Azusa, CA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8358.489"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "233.645"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "199.335"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "157.914"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "157.914"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "163.173"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9112.556"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9112.514"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Systems Engineering and Integration (SE&I)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Analytical Sciences Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Andover, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "42.681"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.811"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.811"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "8.683"
                                                    },
                                                    "TotalCost": {
                                                        "val": "68.575"
                                                    },
                                                    "TargetValue": {
                                                        "val": "68.575"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS Pre-SDD Contract Adjustment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.780"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.780"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.780"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Phenomenology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO Command & Control (C2) Ground Expansion"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.700"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "39.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "39.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO 1\/2 Residual Capability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "14.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbed Concept Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millennium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Torrance, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.538"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.538"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.538"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Support (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "429.002"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.702"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.427"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.953"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.953"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "18.987"
                                                    },
                                                    "TotalCost": {
                                                        "val": "488.071"
                                                    },
                                                    "TargetValue": {
                                                        "val": "488.071"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Admin Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech Services, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.027"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.388"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.412"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.827"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.827"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Technical Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Scitor Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "72.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.902"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.860"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "77.112"
                                                    },
                                                    "TargetValue": {
                                                        "val": "77.112"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Financial Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Goleta, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.378"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.687"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.499"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.564"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.564"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC SAFS Support (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.633"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.915"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.915"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "7.761"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.309"
                                                    },
                                                    "TargetValue": {
                                                        "val": "15.309"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Management Support Services (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "144.646"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.045"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.820"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.347"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.347"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "10.150"
                                                    },
                                                    "TotalCost": {
                                                        "val": "175.008"
                                                    },
                                                    "TargetValue": {
                                                        "val": "175.008"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "GEO-2 Early Orbit Testing (EOT)\/Tuning\/Certification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Back-up Mission Control Station (MCSB) Fit Up"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCSB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MCS Launch and Anomaly Resolution Center (LARC) ready for GEO-3 launch and early on-orbit System Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B10.3 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B20 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657009"
                    },
                    "ProjectTitle": {
                        "val": "Space Modernization Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "78.648"
                        },
                        "PriorYear": {
                            "val": "57.824"
                        },
                        "CurrentYear": {
                            "val": "78.608"
                        },
                        "BudgetYearOne": {
                            "val": "88.695"
                        },
                        "BudgetYearOneBase": {
                            "val": "88.695"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "88.804"
                        },
                        "BudgetYearThree": {
                            "val": "88.464"
                        },
                        "BudgetYearFour": {
                            "val": "90.132"
                        },
                        "BudgetYearFive": {
                            "val": "91.744"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Future SBIRS Overhead Persistent Infrared (OPIR) satellites will be procured using the Department of Defense (DOD) Efficient Space Procurement (ESP) concept.  ESP is an approach which seeks stable production and efficient sub-contractor product management through the block buy of two space vehicles at one time (please see SBIRS P-40 Exhibit). A portion of the savings realized from ESP block buys are programmed for investment into OPIR Space Modernization Initiative (SMI); the current OPIR SMI project was established in this manner in the FY12 President's Budget.  The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture by maturing technologies and mitigating risk areas to facilitate OPIR modernization within the Department's constrained resources. SMI supports the Program of Record (PoR) by assessing future parts and material obsolescence and designing future space and ground modifications focused on affordability and capability while simultaneously maximizing the effectiveness of existing system data products. SMI funds engineering activities to reduce both production and future system costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements.  The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current PoR SBIRS GEO satellites, reduce production timelines, and reduce recurring production costs. SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data dissemination, algorithm development, network connectivity, efficient interfaces and sensor performance assessments to enable greater exploitation of SBIRS PoR and other data sources. SMI exploitation efforts build upon PoR capabilities and inform the PoR decision process. The data exploitation efforts identify affordable, responsive and resilient measures to improve technical intelligence and battlespace awareness processing and data dissemination tools to enhance OPIR support to the warfighters and other data users. The SMI Hosted Payloads and Wide Field of View (WFOV) Testbed activities explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture. Hosted Payloads and WFOV Testbeds support maturation of mission data processing algorithms for tactical and strategic applications which are critical demonstration efforts to enhance PoR capabilities and to reduce program risks for future OPIR systems, whether new systems or evolutions of the PoR.  Collection of on-orbit WFOV data is critical to develop algorithms to process large data sets generated by emerging large format focal planes and to reduce risk for possible SBIRS follow-on architectures.  SMI activities are balanced and phased to enable an expanded tradespace and improve the competitive environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "Perform Trade and Design Studies to assess obsolescence, affordability, and capability design modifications to the PoR.  Based on study outcomes, mature technologies and manufacturability to reduce cost, schedule, and technical risk for new component and subsystem designs which may be used in the next production block.  Develop brassboards, breadboards, and engineering model prototypes for hardware\/software integration and testing to reduce risk and mature technologies applicable to PoR and new system alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "Initiated SBIRS PoR design trade studies with the incumbent SBIRS Prime contractor and Payload Subcontractor to 1) identify obsolescence issues and corresponding hardware\/software design modifications to mitigate future production risks; 2) identify payload and spacecraft modifications to improve affordability of the current satellite; and 3) identify design modifications required to simplify payload hardware, software, and functionality to enable evolution of the PoR SBIRS satellites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.645"
                                            },
                                            "Text": {
                                                "val": "Complete SBIRS design trade studies with the incumbent SBIRS Prime contractor and Payload Subcontractor.  Identify and initiate detailed design studies and component hardware\/software risk reduction efforts to implement the most critical technology maturation activities required to support the most promising alternative architectures for the SBIRS Follow-on program.  Advance key technologies for spacecraft and ground system components to include line-of-sight computer; focal planes; signal processing; algorithm development; lossless data compression techniques; and space-environmental qualification of new detectors, microprocessors, and memory devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.053"
                                            },
                                            "Text": {
                                                "val": "Continue detailed design studies and hardware\/software risk reduction efforts to implement the most critical technology maturation activities required to support the most promising alternative architectures for the SBIRS Follow-on program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Exploitation"
                                    },
                                    "Description": {
                                        "val": "Exploit existing OPIR data sources (DSP, SBIRS HEO, SBIRS GEO Scanner, SBIRS GEO Starer, Commercially Hosted Infrared Payload (CHIRP), other classified sources) through data collection, processing, fusion, data dissemination, algorithm development and testing, network connectivity, and sensor performance assessments.  SBIRS and other sensors provide a rich data set for exploitation.  SMI data exploitation enables access to raw and processed data for data analysts and application developers to expand capabilities for battlesepace awareness and other applications.  SMI data exploitation efforts are complementary to, and enhance, the exploitation capabilities delivered by the PoR and inform future PoR exploitation efforts. SMI will develop tools and algorithms to enable users to apply OPIR data to support their mission needs.  Data exploitation efforts are also evaluating tools for command and control, mission management, and mission data processing for risk reduction to support evolution of the SBIRS PoR ground system to an open architecture that could support PoR and other future satellites and payload alternatives. SMI ground system development activities seek to demonstrate the performance of an evolved ground system architecture capable of supporting multi-satellite, multi-payload, multi-mission management and data processing for any IR payload to achieve lower operating costs with enhanced net-centric and service oriented features along with a flexible expansion capability that was not designed into the current PoR ground system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.133"
                                            },
                                            "Text": {
                                                "val": "Continued to collect CHIRP data through payload decommissioning on 31 Dec 2013.  Continued analysis of CHIRP Wide Field of View staring data to enhance detection algorithms for PoR and future staring systems.  Continued to provide enhanced ground segment capabilities for command and control, data collection, mission processing, and data dissemination to enable greater data exploitation opportunities.  Initiated system design and continued development of an open architecture ground system for the WFOV Testbed flight demo to support evolution of the SBIRS PoR ground system.  The ground system for WFOV Testbed will provide a pathfinder for risk reduction for Common Ground Architecture command and control and Virtual Mission Management operations for potential application to evolve the current SBIRS PoR ground architecture after Block 20 certification.  Initiated development of ground entry point antenna and communication\/data processing hardware for WFOV Testbed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.205"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS PoR and other OPIR data.  Collaborate with Intelligence Community (IC) and Missile Defense Agency (MDA) to enhance Joint OPIR Ground (JOG) initiatives.  Initiate development of an open architecture ground command and control and Virtual Mission Management operations for expanded data exploitation of the SBIRS HEO sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.607"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.607"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS and other OPIR data.  Continue to collaborate with IC and MDA to enhance Joint OPIR Ground (JOG) initiatives. Continue development of an open architecture ground command and control and mission processing capability for the WFOV Testbed to support evolution of the SBIRS PoR ground system.  Conduct space to ground system testing in preparation for an early FY17 WFOV Testbed launch.  Continue development of an open architecture ground command and control and Virtual Mission Management operations for expanded data exploitation of the SBIRS HEO sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hosted Payloads"
                                    },
                                    "Description": {
                                        "val": "Hosted Payloads mature WFOV technology and demonstrate multi-mission capabilities including the potential for a single sensor to simultaneously perform both the strategic and tactical missions. On-orbit data is required in order to develop and validate WFOV algorithms and on-board mission data processing throughput requirements for the Strategic Missile Warning Mission.  These payload risk-mitigation efforts support the potential to field future Strategic Missile Warning and\/or multi-mission systems and potentially increase capablity of the PoR starer.  A second payload to demonstrate strategic mission capabilities may be developed pending the outcome and recommendations of the AoA.  WFOV payloads are a part of all evolved and new architecture alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.252"
                                            },
                                            "Text": {
                                                "val": "Completed WFOV Payload Preliminary Design Review (PDR) studies with six IR payload contractors.  Successfully completed space radiation environment testing of new 4Kx4K Indium-Antimonide (InSb) Sensor Chip for use in the WFOV Payload. Evaluated proposals for Critical Design Review (CDR) design effort and build for new WFOV payload. Awarded a new contract for development and build of the WFOV payload on 20 June 2014. Collaborated with classified program office on strategic on-board processing testbench to demonstrate ability to meet processing throughput for Strategic Missile Warning on-board exceedence generation requirements. Initiated procurement of low-risk, long-lead components. Initiated payload calibration and test planning to include evaluation of existing test facilities and equipment.  Identified and funded long lead procurement for payload test facilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.300"
                                            },
                                            "Text": {
                                                "val": "Continue development of the WFOV Payload and processing algorithms.  Complete payload CDR, continue procurement of long-lead parts and materials, and initiate payload integration.  Continue WFOV payload calibration and test planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.046"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.046"
                                            },
                                            "Text": {
                                                "val": "Continue development of the WFOV payload and deliver payload to the calibration and test facility.  Complete payload calibration and deliver payload to WFOV Testbed spacecraft contractor for satellite integration and test. Support end-to-end system checkout with payload, spacecraft, and ground system in support of an early FY17 WFOV Testbed launch."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Description": {
                                        "val": "WFOV Testbeds are satellite platforms offering opportunities to demonstrate mission capabilities on-orbit and mitigate development risks for employing WFOV sensors. WFOV Testbeds include contractual options to integrate, test, and launch prototype, developmental WFOV payloads with a Government-owned free-flyer spacecraft or on a host government or commercially owned satellite. The WFOV Testbed will host the WFOV payload to demonstrate on-orbit mission performance.  On-orbit data from the WFOV payload hosted on the WFOV Testbed is essential to develop and validate WFOV algorithms and on-board mission data processing throughput requirements for the Strategic Missile Warning mission.  These two critical risk mitigation efforts support the potential to field future Strategic Missile Warning and\/or multi-mission WFOV systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.491"
                                            },
                                            "Text": {
                                                "val": "Continued development of WFOV Testbed spacecraft for the WFOV staring payload.  Successfully completed Satellite CDR and ordered long-lead procurement items.  Completed structural dynamics testing on Developmental Test Vehicle.  Studied launch and launch rideshare opportunities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.055"
                                            },
                                            "Text": {
                                                "val": "Continue development of WFOV Testbed spacecraft, payload, and ground algorithms.  Integrate and test spacecraft subsystems and components.  Complete payload-to-spacecraft interface control specification and spacecraft-to-ground interface control specification.  Plan for, and initiate, contract for launch rideshare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.119"
                                            },
                                            "Text": {
                                                "val": "Complete payload-to-spacecraft integration. Initiate launch vehicle integration for early FY17 launch. Support end-to-end system checkout with payload, spacecraft, and ground system in support of an early FY17 WFOV Testbed launch."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Engineering and Integration"
                                    },
                                    "Description": {
                                        "val": "System of Systems engineering and integration (SE&I) activities to evolve to future architectures."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.005"
                                            },
                                            "Text": {
                                                "val": "Initiate SE&I support for OPIR Enterprise analysis and integration of potential mission capabilities with existing OPIR Architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Conduct Systems Engineering and Program Management to include Program Office support such as Federally Funded Research and Development Center (FFRDC) analyses and System Engineering Technical Assistance (SETA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.698"
                                            },
                                            "Text": {
                                                "val": "Funded Program Office and Space and Missile Systems Center support for SMI projects.  Initiated Joint DoD and Intelligence Community Analysis of Alternatives (AoA) for the SBIRS Follow-on Program to evaluate PoR and other architecture alternatives to ensure affordable, capable, and resilient system architecture to meet future needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.403"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office and Space and Missile Systems Center support for SMI projects.  Complete the AoA and provide findings to Senior AF and OSD leadership to determine way ahead for the SBIRS Follow-on."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.865"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office and Space and Missile Systems Center support for SMI projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program office will use a variety of acquisition approaches to execute various concept studies, technology maturation efforts, testbed\/prototype demonstrations, and data exploitation initiatives and projects.  The program office will collaborate with appropriate contracting agencies to support each individual effort. Activities, such as SBIRS obsolescence and affordability enhancements to the existing satellite design, will leverage existing Program of Record contracts. Technology maturation and component prototyping and\/or qualification could leverage existing contracts, but, where practical, could be competed.  New technology, replacement components, and system designs will be acquired with government data rights to the maximum extent to allow their incorporation into any future OPIR satellite production or system development. Contracting partnerships with other agencies will also be used to study, develop, demonstrate and prove emerging capabilities.  FFRDC and SETA contractors will also be used to conduct and support studies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.645"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.053"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.053"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "71.626"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Exploitation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Boulder, CO; Others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.862"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.205"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.607"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.607"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "215.153"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hosted Payloads"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Communications"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wilmington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.324"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "22.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.046"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.046"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "138.758"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbeds"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millenium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Torrance, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "32.200"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.491"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "18.055"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "40.119"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "40.119"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "193.603"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.005"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.005"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.173"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Various Management Support Services (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.262"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.698"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.865"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.865"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "31.184"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Support (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.420"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Data Exploitation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "WFOV Starer Payload"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "WFOV Testbed"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Second WFOV Starer Payload"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657106"
                    },
                    "ProjectTitle": {
                        "val": "EVOLVED SBIRS"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "295.036"
                        },
                        "BudgetYearFour": {
                            "val": "518.717"
                        },
                        "BudgetYearFive": {
                            "val": "527.998"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The SBIRS Follow-On AoA and knowledge gained from the SBIRS SMI projects will inform a future Defense Acquisition Board (DAB) decision for the Evolved SBIRS effort.  DAB alternatives are expected to include: 1) continued production of SBIRS PoR design; 2) an evolved satellite and ground system derived from the SBIRS POR designs; 3) an evolved satellite and ground system that includes a combination of PoR derivatives and new systems; or 4) an alternative architecture (potentially disaggregated).  The Evolved SBIRS effort will implement the DAB directed program alternative.  The SBIRS Follow-on AoA will consider the requirement for global coverage in the post-GEO-6 and post-HEO-4 timeframe.\n\nThe \"cost to complete\" and \"total cost\" fields above will be populated after completion of the formal cost estimate in support of the DAB decision."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "New FY18 development effort for the Follow-on System after SBIRS GEO-6 and HEO-4.  Evolved SBIRS will also include development of ground system modifications to accommodate evolved SBIRS satellite design changes for GEO and possibly HEO.  The specific system requirements and program definition are pending outcome of the on-going SBIRS Follow-on AoA. Once Evolved SBIRS is defined, the outyear requirements will include PMA requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, no funding in FY14."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, no funding in FY15."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, no funding in FY16."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TBD until Milestone Decision in the FY16-17 timeframe."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management and Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS GEO Development\/Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBIRS Ground Block 30 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS HEO Development\/Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}