{
    "id": "aca0e6f249a1a14901ac5f0abc099e4d5ca677c0",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603133D8Z"
        },
        "ProgramElementTitle": {
            "val": "Foreign Comparative Testing"
        },
        "R1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "22.000"
            },
            "BudgetYearOne": {
                "val": "21.782"
            },
            "BudgetYearOneBase": {
                "val": "21.782"
            },
            "BudgetYearTwo": {
                "val": "21.643"
            },
            "BudgetYearThree": {
                "val": "25.753"
            },
            "BudgetYearFour": {
                "val": "26.448"
            },
            "BudgetYearFive": {
                "val": "27.173"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Foreign Comparative Testing (FCT) Program Element (PE) 0603133D8Z is recast with a focus on Pre-Engineering and Manufacturing Development (Pre-EMD) and Proof of Principle prototypes derived from evaluation of foreign equipment that will provide the United States Armed Services, Special Operations Command (SOCOM) and defense agencies, capabilities to counter emerging threats.  The program will increase its focus on foreign technology solutions that affordably extend the life of existing military platforms\/capabilities and enhance interoperability with foreign partners and between services.  FCT’s broad reach across our allies and friendly foreign countries will enable development of innovative, cost effective, and potentially interoperable solutions for the Department of Defense, Multi-Service and Combatant Command (COCOM) priority requirements.  FCT also enables more effective competition between U.S. and foreign technologies.\n\nIn FY 2015, FCT funding from PE 0605130D8Z was realigned to PE 0603133D8Z for Budget Activity alignment and emphasis on prototyping."
        },
        "ProgramElementMissionDescription": {
            "val": "The FCT program supports the warfighter by leveraging technologies and equipment from allied nations and coalition partners to counter emerging threats, thereby accelerating the United Sates acquisition process and lowering development costs.  FCT enhances interoperability, facilitates international collaboration, expands opportunities for prototyping to identify significant technology maturation, increases competition in innovation, and enables more efficient and affordable transition of technologies into acquisition programs of record.  Authorized by Title 10, U.S. Code, Section 2350a (g), the FCT program is managed by the Office of Secretary of Defense (OSD) Deputy Assistant Secretary of Defense Emerging Capability & Prototyping(DASD (EC&P)), Comparative Technology Office (CTO).  The FCT projects are sponsored by the Department, Services and SOCOM.  Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements and DoD priorities, a thorough market survey, and the development of a roadmap to incorporate results into Defense programs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "30.000"
                },
                "BudgetYearOne": {
                    "val": "15.363"
                },
                "BudgetYearOneBase": {
                    "val": "15.363"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "22.000"
                },
                "BudgetYearOne": {
                    "val": "21.782"
                },
                "BudgetYearOneBase": {
                    "val": "21.782"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-8.000"
                },
                "BudgetYearOne": {
                    "val": "6.419"
                },
                "BudgetYearOneBase": {
                    "val": "6.419"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-8.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.481"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.481"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.062"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.062"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds were added to provide emphasis on Proof of Principle and Pre-Engineering and Manufacturing Development (Pre-EMD) prototypes derived from evaluation of foreign equipment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P313"
                    },
                    "ProjectTitle": {
                        "val": "Foreign Comparative Testing"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "22.000"
                        },
                        "BudgetYearOne": {
                            "val": "21.782"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.782"
                        },
                        "BudgetYearTwo": {
                            "val": "21.643"
                        },
                        "BudgetYearThree": {
                            "val": "25.753"
                        },
                        "BudgetYearFour": {
                            "val": "26.448"
                        },
                        "BudgetYearFive": {
                            "val": "27.173"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Foreign Comparative Testing (FCT) program supports the warfighter by leveraging advanced technologies and equipment from allied nations and coalition partners to counter emerging threats, thereby accelerating the U.S. acquisition process and lowering development costs.  FCT enhances interoperability, facilitates international collaboration, expands opportunities for prototyping to identify significant technology maturation, increases competition in innovation, and enables more efficient and affordable transition of technologies into acquisition programs of record.  Authorized by Title 10, U.S. Code, Section 2350a(g), the FCT program is managed by the Office of Secretary of Defense (OSD), Deputy Assistant Secretary of Defense Emerging Capability & Prototyping (DASD (EC&P)), Comparative Technology Office (CTO).  The FCT projects are sponsored by the Department, Services and U.S. Special Operations Command (USSOCOM).  Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements and DoD priorities, a thorough market survey, and the development of a roadmap to incorporate results into Defense programs.  \n\nThe FCT program is a catalyst for teaming and other business relationships between foreign and U.S. industries.  Many successful FCT projects result in the licensed production of the qualified foreign item in the United States.  Other nations recognize the long-term value of such practices for competing in the United States Defense market and the resultant strengthening of the \"two-way street\" in Defense procurement.  The result often means the creation of jobs and contributions to local economies throughout the United States.  To date, companies across 34 states benefited from FCT projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Lightweight M3A1 Recoilless Rifle (Army)"
                                    },
                                    "Description": {
                                        "val": "The current M3 Carl Gustaf Recoilless 84 millimeter Rifle was introduced to U.S. forces in 1991.  The original version used a thin steel barrel liner containing the rifling, strengthened with a carbon fiber outer sleeve.  External steel parts were eventually replaced with aluminum alloys or plastics thereby reducing the weapon weight from 36 pounds to 21 pounds.  This M3A1 project will eliminate six pounds (28 percent) from the existing system by replacing the existing steel tube with a titanium alloy tube, and other various components (bolt, trigger, venturi, and ancillary parts) without changing the firing procedures, operations or ammunition.  Since the weapons’ operational characteristics will not be changed, this low risk approach will produce a lighter weight 84mm shoulder-fired weapon without going through a costly and time consuming process to test, qualify, and re-certify an entirely new modernized weapon system.  This is a continuing project previously funded in FY 2014 in PE 0605130D8Z."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.633"
                                            },
                                            "Text": {
                                                "val": "Conduct engineering analysis\/study, analyze vendor data, conduct technical testing, and perform operator\/user assessment test during 2Q FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.175"
                                            },
                                            "Text": {
                                                "val": "Write test reports, prepare decision packet and close-out report during 4Q FY 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Gunnery Live Fire Monitoring System (MGLFMS) (Navy)"
                                    },
                                    "Description": {
                                        "val": "The project will test and evaluate a Tank and Infantry Fighting Vehicle gunnery training system that wirelessly transmits live audio and video feeds of weapon systems data to a mobile monitoring station.  The MGLFMS enables instructors to evaluate crew functions, make instantaneous corrections, and provides recording capability for detailed after action reviews.  Foreign data has shown that training with this system significantly increases probability of gunnery crews placing first round on target.  The system also provides an essential tool for instructors to evaluate and make the necessary feedback to ensure the analytical abilities that encompasses all the gunnery skills required for accurate fire.  Several North Atlantic Treaty Organization (NATO) allies currently train with this same equipment.  This is a continuing project which was previously funded during FY 2014 in PE 0605130D8Z."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Receive Phase I test articles during 1Q FY 2015.  Initiate Phase I Technical Testing throughout 1Q – 3Q FY 2015.  Receive Phase II test articles during 3Q FY 2015.  Initiate Phase II Performance Testing during 3Q FY 2015.  Initiate Phase II Field User Evaluation during 4Q FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.594"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.594"
                                            },
                                            "Text": {
                                                "val": "Complete Phase II Performance Testing during 1Q FY 2016.  Complete Phase II Field User Evaluation during 2Q FY 2016.  Receive Phase III test articles in 3Q FY 2016.  Initiate Phase III Performance Testing and initiate Phase III Field User Evaluation during 3Q–4Q FY 2016.  Finalize technical test report, closeout report, and provide procurement decision by the end of 4Q FY 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects Less Than One Million Dollars Each):"
                                    },
                                    "Description": {
                                        "val": "Energy Absorbing Material for Improved Blunt Impact\/Trauma Protection (Army); Solar Power Shelter System (Army); Multifunctional Information Distribution System (MIDS) Joint Tactical Radio System (JTRS) Radio Frequency Amplifier (RFA) (Navy); Automatic Target Recognition (ATR): Reducing MK18 Unmanned Underwater Vehicles (UUV) Mine Countermeasures Tactical Timeline (Navy); Computer Network Defense (CND) Advanced Persistent Threat (APT) Detection (Navy); H-1 Crash-resistant, Ballistic-tolerant, Fuel Cell Qualification (Navy); Horizon Reference System (HRS), Electroluminescent Panel Replacement (Navy); Rapid Airfield Damage Assessment System (RADAS) (Air Force); and Electronic Underwater Navigation (USSOCOM).  These continuing projects were previously funded during FY 2014 in PE 0605130D8Z."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.790"
                                            },
                                            "Text": {
                                                "val": "Procure test articles and conduct testing for Energy Absorbing Material for Improved Blunt Impact\/Trauma Protection, a soft flexible material that stiffens upon impact for use in helmets and body armor to reduce blunt impact forces.  Procure test articles and conduct testing for Solar Power Shelter System, a new capability which utilizes renewable energy technology (solar power) as an alternative energy source to diesel fuel for powering equipment supporting Army base camps.  Conduct operational testing and prepare test report for Rapid Airfield Damage Assessment Systems, a project to test and evaluate a system that detects airfield damage or objects on runways\/taxiways that will damage aircraft.  Provide an evaluation report for Deployable Instrument Landing System, equipment that combines glideslope and localizer information together to provide azimuth and elevation directions to approaching aircraft.  Complete equipment procurement for Advanced Mobile Universal Electrical Tester, a mobile, modular, piece of automated test equipment used to collect test parameters of complete sub-system(s) under both depot and operational maintenance environments.  Complete testing for Multifunctional Information Distribution System (MIDS) Joint Tactical Radio System (JTRS) Radio Frequency Amplifier (RFA), a project that tested and evaluated the Communication RFA Shop Replaceable Unit (SRU).  Perform final evaluation and make procurement decision on Automated Target Recognition:  Reducing MK18 Unmanned Underwater Vehicles (UUV) Mine Countermeasures Tactical Timeline, system capable of automatically identifying mine-like targets in sonar imagery from the in-service MK18 Family of UUV Systems.  Conduct initial testing and finalize comprehensive test plan for Computer Network Defense (CND) Advanced Persistent Threat (APT) Detection, a project that evaluated software that will address advanced persistent threats (APTs), which is a current capability gap in the CND program of record.  Conduct Phase I and II testing for H-1 Crash-resistant, Ballistic-tolerant, Fuel Cell Qualification, a project that tests and evaluates crashworthy self-sealing fuel cell technology to U.S. military standards for use on the UH-1Y and AH-1Z aircraft.  Perform testing and provide evaluation reports for Horizon Reference System Electroluminescent Panel Replacement, a systematic upgrade to modernize the existing electroluminescent (EL) Panel Bar to Light Emitting Diode (LED) Technology on the shipboard Horizon Reference Set.  Receive test articles, conduct safety and technical testing for Electronic Underwater Navigation, a project that assures the certainty of combat divers arriving at the intended assigned target, using an extremely accurate underwater navigation system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FCT FY 2015\/2016 Focal Area:  Force Application"
                                    },
                                    "Description": {
                                        "val": "FCT will invest in cross-domain, innovative Force Application technologies for new and emerging capabilities with international partners, including but not limited to these Defense-wide requirements that are consistent with strategic priorities: Anti-Access\/Area Denial (A2\/AD); Robotics and Autonomous Systems; Interoperability across Platforms and Systems; and Countering Unmanned Systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.577"
                                            },
                                            "Text": {
                                                "val": "During FY 2015, FCT will focus on selecting projects supporting the below Force Application Areas:\n-Anti-Access\/Area Denial (A2\/AD) will provide innovative technologies that enhance position, navigation and timing accuracies, improve targeting\/delivery in Global Positioning System (GPS)-denied environments and prevent exploitation of systems lost in denied areas (e.g., anti-tamper capabilities).  \n-Robotics and Autonomous Systems will remotely control assets that reduce troop tasks and exposure for daily operations, including force protection, special operations, and detection. \n-Interoperability across Platforms and Systems invest into technologies for mission-based on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks.  Transition of Modular Open Systems Approach (MOSA) capabilities which are portable, modular, partitioned, scalable, extendable, and secure.\n-Countering Unmanned Systems (Unmanned Aerial Vehicles (UAVs), Unmanned Underwater Vehicle (UUVs), and Unmanned Surface Vehicles (USVs)) will provide technologies that detect, monitor, and counter hostile threats with small signatures, including special operations missions in surface, underwater and onshore environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.003"
                                            },
                                            "Text": {
                                                "val": "During FY 2016, FCT will focus on selecting projects supporting the below Force Application Areas:\n-Anti-Access\/Area Denial (A2\/AD) will provide innovative technologies that enhance position, navigation and timing accuracies, improve targeting\/delivery in GPS-denied environments and prevent exploitation of systems lost in denied areas (e.g., anti-tamper capabilities).  \n-Robotics and Autonomous Systems will remotely control assets that reduce troop tasks and exposure for daily operations, including force protection, special operations, and detection. \n-Interoperability across Platforms and Systems invest into technologies for mission-based on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks.  Transition of Modular Open Systems Approach (MOSA) capabilities are portable, modular, partitioned, scalable, extendable, and secure.\n-Countering Unmanned Systems (Unmanned Aerial Vehicles (UAVs), Unmanned Underwater Vehicle (UUVs), and Unmanned Surface Vehicles (USVs)) will provide technologies that detect, monitor, and counter hostile threats with small signatures, including special operations missions in surface, underwater and onshore environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FCT FY 2015\/2016 Focal Area: Force Logistics"
                                    },
                                    "Description": {
                                        "val": "FCT will invest in cross-domain, innovative Force Logistic technologies for new and emerging capabilities with international partners, including but not limited to these Defense-wide requirements that are consistent with strategic priorities: Reducing Soldier Load, Interoperability across Platforms and Systems, and Energy Solutions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "During FY 2015, FCT will focus on selecting projects supporting the below Force Logistics Areas:\n-Reducing soldier load reduces the weight currently sustained by the individual dismounted soldier, including materials that enable weight reduction to individual weapons, ammunition, or portable missile systems.  \n-Interoperability across Platforms and Systems will invest into technologies for mission-based on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks.  Transition of Modular Open Systems Approach (MOSA) capabilities which are portable, modular, partitioned, scalable, extendable, and secure.\n-Energy solutions will include power systems and electronics designed for extreme cold to support arctic strategy and renewable energy options that can reduce force support and logistics requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.005"
                                            },
                                            "Text": {
                                                "val": "During FY 2016, FCT will focus on selecting projects supporting the below Force Logistics Areas:\n-Reducing soldier load reduces the weight currently sustained by the individual dismounted soldier, including materials that enable weight reduction to individual weapons, ammunition, or portable missile systems.  \n-Interoperability across Platforms and Systems will invest into technologies for mission-based on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks. Transition of Modular Open Systems Approach (MOSA) capabilities which are portable, modular, partitioned, scalable, extendable, and secure.\n-Energy solutions will include power systems and electronics designed for extreme cold to support Arctic strategy and renewable energy options that can reduce force support and logistics requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FCT FY 2015\/2016 Focal Area: Force Support"
                                    },
                                    "Description": {
                                        "val": "FCT will invest in cross-domain, innovative Force Support evaluation of new and emerging capabilities with international partners, including but not limited to these Defense-wide requirements that are consistent with strategic priorities: Increase Human Performance, and Training Systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "During FY 2015, FCT will focus on selecting projects supporting the below Force Support Areas:\n-Increasing human performance involves developing and demonstrating advanced technologies to assess and optimize human cognitive load during combat operations and training.  Increasing human performance will also utilize cognitive-load assessment technologies to enhance training of tasks with high cognitive load such as in aviation operations, combined arms engagements, mission command, air and missile defense, or multiple intelligence sensor training. \n-Training Systems will demonstrate augmented reality capability that allows representation of fixed objects from a synthetic terrain environment and ability to overlay those objects within the augmented reality display."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.005"
                                            },
                                            "Text": {
                                                "val": "During FY 2016, FCT will focus on selecting projects supporting the below Force Support Areas including emerging Science and Technology challenges:\n-Communication and Sensor Performance:  Development of broad-band sensing systems, non-satellite long-range communication systems, and prototyping of enabling technologies for over the horizon radar (OTHR).\n-Increasing human performance involves developing and demonstrating advanced technologies to assess and optimize human cognitive load during combat operations and training.  Increasing human performance will also utilize cognitive-load assessment technologies to enhance training of tasks with high cognitive load such as in aviation operations, combined arms engagements, mission command, air and missile defense, or multiple intelligence sensor training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Successful FCT’s can transition to acquisition via several ways: as a pre-EMD prototype the item tested could be a technology upgrade insertion into a current platform or program providing greater capability or prolonging the life of the weapon system; if the item was a proof-of-principle prototype the testing results could lead to informed\/refined requirements generation providing better outcome for current planned US system or could lead to a direct transition\/procurement should the item\/article provide a new capability."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported:\n-Develop and Demonstrate Proof-of-Principle prototypes that fill capability gaps.\n-Develop and Demonstrate Pre-EMD prototypes that address DoD strategic priorities.\n-Develop and Demonstrate a prototype that informs\/refines the acquisition process.\n\nMeasurable Outcomes:\n-FCTs will demonstrate capability objectives within 24-36 months.\n-In FY 2014, FCT had a transition rate of 64 percent for completed projects, exceeding the objective of 40 percent for demonstration programs.  With a shift from Program Element 0605130D8Z to Program Element 0603133D8Z and focus on countering emerging threats as opposed to current threats, the transition rate is expected to decrease but with anticipated impact being greater."
                        }
                    }
                }
            ]
        }
    }
}