{
    "id": "ae5ff4aa648c42d231b129e3aa3fbfbd8ca94fd2",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603015A"
        },
        "ProgramElementTitle": {
            "val": "Next Generation Training & Simulation Systems"
        },
        "R1LineNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.168"
            },
            "CurrentYear": {
                "val": "16.740"
            },
            "BudgetYearOne": {
                "val": "17.425"
            },
            "BudgetYearOneBase": {
                "val": "17.425"
            },
            "BudgetYearTwo": {
                "val": "17.719"
            },
            "BudgetYearThree": {
                "val": "17.803"
            },
            "BudgetYearFour": {
                "val": "20.927"
            },
            "BudgetYearFive": {
                "val": "21.345"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates tools to enable effective training capability for the Warfighter.  Project S28 matures and demonstrates simulation technologies developed by the Institute for Creative Technologies (ICT) at the University of Southern California.  Project S29 incorporates advanced modeling and simulation (M&S), training, and leader development technology into immersive training demonstrations as well as demonstrates a framework for future embedded training and simulation systems for future force combat and tactical vehicles, and dismounted Soldier systems.  Project S31 develops, integrates and demonstrates an overarching M&S architecture that incorporates multi-resolution, entity-based models, simulations, and tools to enable Network-Centric Warfare M&S capability.  \n  \nWork in this PE complements and is fully coordinated with efforts in PE 0602308A (Advanced Concepts and Simulation), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602787A (Medical Technology) and PE 0603007A (Manpower, Personnel and Training Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy\n \nWork in this PE is performed by the U.S. Army Research Laboratory,  Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.620"
                },
                "CurrentYear": {
                    "val": "16.749"
                },
                "BudgetYearOne": {
                    "val": "17.553"
                },
                "BudgetYearOneBase": {
                    "val": "17.553"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.168"
                },
                "CurrentYear": {
                    "val": "16.740"
                },
                "BudgetYearOne": {
                    "val": "17.425"
                },
                "BudgetYearOneBase": {
                    "val": "17.425"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.452"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-0.128"
                },
                "BudgetYearOneBase": {
                    "val": "-0.128"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.452"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.128"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.128"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S28"
                    },
                    "ProjectTitle": {
                        "val": "Immersive Learning Environments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.485"
                        },
                        "CurrentYear": {
                            "val": "2.736"
                        },
                        "BudgetYearOne": {
                            "val": "3.121"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.121"
                        },
                        "BudgetYearTwo": {
                            "val": "3.254"
                        },
                        "BudgetYearThree": {
                            "val": "3.100"
                        },
                        "BudgetYearFour": {
                            "val": "4.153"
                        },
                        "BudgetYearFive": {
                            "val": "4.236"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates immersive technologies that include the application of photorealistic synthetic environments, multi-sensory interfaces, virtual humans, and training applications on low-cost game platforms for Soldier training applications using simulation technologies.  This project uses advanced modeling, simulation, and leadership development techniques to leverage the emerging immersive technologies that are created at the Institute for Creative Technologies (ICT) University Affiliated Research Center (UARC) at the University of Southern California to develop training demonstrators.  These demonstrators focus on urban operations, asymmetric warfare, resilience and rehabilitation to support Warfighting units and Army Institutions (U. S. Army Training and Doctrine Command (TRADOC) and U.S. Army Medical Command (MEDCOM)).  Resilience and rehabilitation research will focus on Post Traumatic Stress Disorder (PTSD).  The ICT's collaboration with its entertainment partners creates a true synthesis of creativity and technology that harnesses the capabilities of industry, and the research and development community to advance the Army's capabilities.\n\nEfforts in this program element (PE) support the Army science and technology Soldier portfolio.\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, Florida."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Techniques for Training Applications"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates and matures technological advancements from PE 0602308A\/Project D02 into complex state-of-the-art simulation environments in support of multi-student and team training applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.485"
                                            },
                                            "Text": {
                                                "val": "Matured the tools and technologies required to create prototype simulations, games, and virtual environments focused on training commanders on the decision making, planning, and leadership for institutional and Warfighting units; and explored advanced display technologies to prototype new low cost immersive displays for virtual training environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.736"
                                            },
                                            "Text": {
                                                "val": "Investigate visual perception technologies and effects and use findings to incorporate more natural human perception\/performance in virtual training environments; and demonstrate how technologies that capture the essence of high performing instructors can be used to improve virtual classroom instruction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.121"
                                            },
                                            "Text": {
                                                "val": "Will mature collaborative virtual environments through the incorporation of live objects to enhance user's immersion experience and improve user's performance; optimize simulation techniques such as redirected walking (creates real time virtual environment adjustments to allow user to walk through large scale environment while remaining in a smaller physical space) by expanding capability to support multiple users moving within a single virtual reality training environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S29"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation - Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.227"
                        },
                        "CurrentYear": {
                            "val": "8.881"
                        },
                        "BudgetYearOne": {
                            "val": "9.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.213"
                        },
                        "BudgetYearTwo": {
                            "val": "6.922"
                        },
                        "BudgetYearThree": {
                            "val": "7.024"
                        },
                        "BudgetYearFour": {
                            "val": "8.052"
                        },
                        "BudgetYearFive": {
                            "val": "8.213"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates next generation training and simulation systems that integrate virtual threats, asymmetric warfare concepts, network-centric operations, and embedding training capabilities as well as technologies into operational go-to-war future force systems to include dismounted warrior systems.  The synergy between these embedded training capabilities and the immersive training advanced technology development in Project S28 provides Army units with a set of complementary embedded as well as deploy-on-demand systems that provide just-in-time, dynamic, realistic training, and mission rehearsal capabilities.  Demonstrations include technologies that form a framework for future training applications for the range of future force operations such as robotic control and other sensor operations; mission planning and rehearsal; maneuver; Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) network analysis to support distributed simulations; and vehicle system interface requirements.  This project creates a joint environment by synchronizing virtual and constructive simulated forces with the next generation and current training systems from the Army, Navy, Air Force, and Marine Corps forces.   \n\nEfforts in this program element (PE) support the Army science and technology Soldier portfolio.\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, Florida."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Embedded Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities (most provided from PE 0602308A\/project C90) built into or added onto operational systems, subsystems, or equipment, to enhance as well as maintain the skill proficiency of Soldiers, and maximizes component commonality among combat vehicles and Soldier computer systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.227"
                                            },
                                            "Text": {
                                                "val": "Designed embedded training components (e.g. predictive simulation) for current and future Command and Control systems for both mounted and dismounted Soldiers; designed components for advance sensor technology for locomotion and gesturing;  advanced and matured technology for developing artificial intelligence behaviors for interactive characters in a mixed kinetic\/non-kinetic training scenario within a dismounted squad virtual game environment;  and advanced and conducted experimentation with tactile feedback technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.881"
                                            },
                                            "Text": {
                                                "val": "Mature component design of algorithms for course of action embedded training on current and future command and control systems; mature component design of advanced sensor technology for locomotion and gesturing, tactile feedback technology, and artificial intelligence behaviors for computer generated forces to simulate dismounted squads; and validate component technology maturity in relevant simulation environments.  This effort develops virtual, mixed and augmented technologies for dismounted Soldier training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.013"
                                            },
                                            "Text": {
                                                "val": "Will complete FY15 component designs for embedded training on current and future command and control systems;  develop prototype systems of advanced sensor technology for locomotion, gesturing and tactile feedback technologies for computer generated forces to simulate dismounted squads; mature, demonstrate and assess effectiveness of augmented reality training systems for dismounted Soldier training."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness"
                                    },
                                    "Description": {
                                        "val": "This research addresses the effectiveness of training Soldiers and teams in immersive environments.  This effort will research and develop simulations to determine the interaction of realism, immersion, acceptance, and training effectiveness.  A baseline of the key dimensions of realism and immersion for current training systems will be developed and will be extended to generate guidelines for the development of future training technologies.  Cost effectiveness of these training components will also be considered."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Identify impacts and tradeoffs associated with training effectiveness using current (training) simulation architectures and the expected training effectiveness associated with using future virtual, mixed, and augmented reality training technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Will provide a baseline of measures and methods for use in assessing training effectiveness for a subset of technologies used in various training environments (simulated and live); and begin to develop comparative assessment strategies needed to measure effectiveness of future virtual, mixed, and augmented reality training technologies and identify gaps in measurement techniques."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S31"
                    },
                    "ProjectTitle": {
                        "val": "Modeling And Simulation Infrastructure Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.456"
                        },
                        "CurrentYear": {
                            "val": "5.123"
                        },
                        "BudgetYearOne": {
                            "val": "5.091"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.091"
                        },
                        "BudgetYearTwo": {
                            "val": "7.543"
                        },
                        "BudgetYearThree": {
                            "val": "7.679"
                        },
                        "BudgetYearFour": {
                            "val": "8.722"
                        },
                        "BudgetYearFive": {
                            "val": "8.896"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates a distributed modeling and simulation (M&S) environment that integrates a collection of multi-fidelity models and simulations and tools that map to an evolving architecture and M&S activities to support decisions throughout the acquisition life-cycle. This provides a unifying M&S architecture that synchronizes and integrates multi-resolution modeling applications such as Live, Virtual, and Constructive (LVC) experimentation.  This effort focuses on researching cutting-edge M&S methods to enable the Army and DoD to perform critical System of Systems (SoS) analysis, experimentation, technology tradeoffs, capability assessments, concept development, and training that saves time and resources while increasing the effectiveness of acquisition and training activities.  \n\nEfforts in this program element (PE) support the Army science and technology Soldier portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, Florida."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Distributed Simulation Environments"
                                    },
                                    "Description": {
                                        "val": "In FY14, this effort was renamed from Modeling Architecture for Technology, Research, and Experimentation (MATRIX) to Advanced Distributed Simulation Environments to reflect this effort's evolution of simulation technologies.  This effort matures and demonstrates modeling and simulation (M&S) technologies and techniques that support training and experimentation to assess and support system acquisition and military planning decision-making and System of Systems (SoS) architecture, technology tradeoffs, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.456"
                                            },
                                            "Text": {
                                                "val": "Refined and matured SoS architecture for integration and use in Army and DoD simulation and training programs; matured a generalized interface for the systems engineering architecture and M&S tools for transition to DoD programs with existing M&S systems engineering capabilities; matured and refined Distributed Soldier Representation to demonstrate a Soldiers-as-a-Service simulation (illustrating relevance of human factors data to training); identified hardware and software solutions that decreased dependence on third party solutions; formalized M&S in a cloud environment (M&S as a service tool for training and mission rehearsal simulations across geographically distributed areas); provided a tool to rapidly configure and run training simulations by maturing and translating simulations from complex scenario definitions and databases; matured and refined M&S tools targeted towards Program Executive Office for Simulation, Training and Instrumentation (PEO STRI) simulation needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.123"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate SoS simulation architecture technologies for integrating Army and DoD simulation and training programs; demonstrate an initial distributed Soldier simulation providing a more complete representation of the Soldier by including effects such as culture, individual stress, resilience, social and family relationships, individual and unit decision making, and effects on performance; mature and demonstrate M&S as a cloud-based service that supports training and mission rehearsal simulations across geographically distributed areas; advance and refine simulation and training technologies in support of the Army next generation training initiatives; and mature and transition M&S hardware and software solutions targeted towards PEO STRI simulation needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.091"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.091"
                                            },
                                            "Text": {
                                                "val": "Will exploit current simulation architecture technologies to demonstrate utility for use in a future robust, single simulation architecture (Future Holistic Training Environment-Live\/Synthetic (FHTE-LS)) and identify associated technology gaps; refine and demonstrate distributed Soldier simulation for use in training and analysis applications; mature and demonstrate M&S as a cloud-based service that supports experimentation and testing across geographically distributed areas; Demonstrate potential of current training simulation technologies for use in areas such as cyber training in support of PEO STRI simulation technology gaps."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}