{
    "id": "aeb7420025205f2221d1815c7006b5491af5f2bd",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0607210D8Z"
        },
        "ProgramElementTitle": {
            "val": "Industrial Base Analysis and Sustainment Support"
        },
        "R1LineNumber": {
            "val": "181"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "9.638"
            },
            "CurrentYear": {
                "val": "14.756"
            },
            "BudgetYearOne": {
                "val": "22.576"
            },
            "BudgetYearOneBase": {
                "val": "22.576"
            },
            "BudgetYearTwo": {
                "val": "16.705"
            },
            "BudgetYearThree": {
                "val": "11.119"
            },
            "BudgetYearFour": {
                "val": "5.664"
            },
            "BudgetYearFive": {
                "val": "5.741"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2016 funding request was reduced by $2.207M to account for the availability of prior year execution balances."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense-wide Industrial Base Analysis and Sustainment (IBAS) program element, directed by Title 10 USC Section 2508, provides the Department with a comprehensive ability to support the monitoring and assessment of the industrial base, address critical issues in the industrial base relating to urgent operational needs, support efforts to expand the industrial base and address supply chain vulnerabilities.  This program maintains or improves the health of critical and fragile defense industry capabilities that are at risk of being lost but are needed at present and\/or have verified future requirements in support of the National Defense Strategy.  The goal of the program is to avoid loss of critical capabilities and resultant reconstitution costs, where affordable and innovative mechanisms are available to the producers in the interim.\n\n\nCriteria for project selection will include factors such as 1) identifiable path of preservation, transformation or innovation between an existing capability and a capability with a very high probability of being needed in the short to medium term (< 5 years); 2) loss of the capability is likely in the absence of the proposed project; 3) analysis showing that the project results in a lower overall cost to the department than if capability is developed from scratch when needed; and 4) preference is given to projects supporting multiple programs or services with multiple beneficiaries."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.993"
                },
                "CurrentYear": {
                    "val": "14.778"
                },
                "BudgetYearOne": {
                    "val": "17.896"
                },
                "BudgetYearOneBase": {
                    "val": "17.896"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.638"
                },
                "CurrentYear": {
                    "val": "14.756"
                },
                "BudgetYearOne": {
                    "val": "22.576"
                },
                "BudgetYearOneBase": {
                    "val": "22.576"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.355"
                },
                "CurrentYear": {
                    "val": "-0.022"
                },
                "BudgetYearOne": {
                    "val": "4.680"
                },
                "BudgetYearOneBase": {
                    "val": "4.680"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.005"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.350"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Baseline Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.276"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.276"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.044"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.044"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Space Industrial Base Sector"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 baseline program increased with Department priorities.\n\nThe $4.680M increase from FY2015 to FY2016 is an increase for Space Sector Sustainment.  The funding is targeted to maintain active Mercury-Cadmium-Telluride (MCT) detector production (and the capability to surge) to meet the needs of National Security Systems in the Missile and Space Sectors.  This MCT project leverages Defense Manufacturing Science and Technology (DMST) work to qualify MCT projects.\n\nThe FY 2016 funding request was reduced by $2.207M to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "819"
                    },
                    "ProjectTitle": {
                        "val": "Industrial Base Analysis and Sustainment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "9.638"
                        },
                        "CurrentYear": {
                            "val": "14.756"
                        },
                        "BudgetYearOne": {
                            "val": "22.576"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.576"
                        },
                        "BudgetYearTwo": {
                            "val": "16.705"
                        },
                        "BudgetYearThree": {
                            "val": "11.119"
                        },
                        "BudgetYearFour": {
                            "val": "5.664"
                        },
                        "BudgetYearFive": {
                            "val": "5.741"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "OSD Acquisition, Technology and Logistics (AT&L) investments under this program are informed by the Department's Sector by Sector, Tier by Tier (S2T2) program for industrial base analysis directed by Title 10 Section 2503 and carried out by the Deputy Assistant Secretary of Defense (Manufacturing and Industrial Base Policy) (DASD (MIBP)).  Periodic S2T2 assessments under this program, directed by Title 10 Section 2505, and other assessments collaboratively identify elements of the industrial base where current acquisition programs will not invest enough in production and\/or research to support the minimum sustaining rate that would keep critical capabilities viable.  While industrial base risks identified through these assessment tools are to be mitigated primarily through direct engagement with military departments, agencies, and industry, exceptional cases will require defense-wide intervention via investment accounts, often in collaboration with multiple Services and agencies, to ensure adequate industrial capability to support future defense needs.\n\nThis funding is a key tool for addressing supply chain risks and diminishing manufacturing sources.  Investments are prioritized though a careful analysis at every tier of the supply chain according to a numerical scale of the risk-area's fragility and criticality.  Fragility examines characteristics that make a specific product or service likely to be disrupted;  criticality examines characteristics that make a specific product or service difficult to replace if disrupted.  These concepts underpin AT&L’s core mission and inform critical investment, budgetary, and programmatic decision-making.\n\nS2T2 fragility and criticality assessments are applied across the DoD enterprise to identify and prioritize industrial base niches requiring additional investment by DoD.  The purpose of investment is to sustain essential industrial production and design team capabilities.  Projects will focus on high impact industrial base sectors with a combination of defense-specific requirements and low, limited or declining production.  The focus areas are 1) missiles and munitions, 2) space, and 3) other defense-specific capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile and Munitions Industrial Base Sustainment"
                                    },
                                    "Description": {
                                        "val": "With a decline in the procurement of missile programs, design and production skills for critical components within the missile sector industrial base are at risk, which could result in costly delays and unanticipated expense.  The loss of this design and production capability could have a significant impact on many current and future missile programs, damaging the readiness and availability of technology.  The missile sector sustainment effort will improve the existing production process efficiencies, explore advanced materials for higher performance, and upgrade outdated technology for missile components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.090"
                                            },
                                            "Text": {
                                                "val": "Addressed supply chain vulnerabilities and identified early indicators of program risk and made corrective and innovative investments in essential defense supply chains.\n\nButanetriol (BT):  This project developed a qualified domestic source for BT, a solid rocket fuel precursor chemical, precluding the necessity of procurement from a prohibited foreign source.  Since 2008, DoD’s projected requirements have shrunk to levels that substantially change the business case for development of new domestic source.  To re-enable the business case and develop a permanent domestic industrial base, DoD funded a project to close the gap between the new and old business cases.\n\nAdvanced Solid Rocket Propulsion:  To support future missile interceptor missions, advanced kill vehicle thrusters for high precision and long duration missions are required.  This is a defense-unique industrial base niche.  In order to maintain this capability and avoid the loss of skills and intellectual capital, the Department is currently executing a project to develop high precision attitude control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.478"
                                            },
                                            "Text": {
                                                "val": "Fragility and Criticality Assessments evaluated the impacts to the missile industrial base caused by declining procurements.  Specific action is necessary to preserve industrial base capabilities for fuzes and thermal batteries.  \n\nFuzes:  Business case analysis has found production for Electronic Arm and Safe Device (EASD) fuzes to be very fragile.  To mitigate this risk the business case is being improved by expanding the use of EASD fuzes to multiple missiles.  Project funding will be used to perform the work necessary to enable the fuze to be used on additional missiles.\n\nAnother project will preserve the manufacturing capability for Low Energy Exploding Foil Initiators (LEEFI) used in a variety of DoD missile programs in anticipation of shutdown by the U. S. supplier.\n\nThermal Batteries:  Because of declining production for missiles, the demand for thermal batteries is also declining and production is falling below minimum sustaining rates.  Project funding will be used to lower minimum sustaining rates to match demand by developing production improvements, improved technologies, and cost efficiencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.340"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.340"
                                            },
                                            "Text": {
                                                "val": "Address supply chain vulnerabilities and early indicators of program risk and make corrective and innovative investments in essential defense supply chains.\n\nFragility and Criticality Assessments have assessed the impacts to the missile industrial base caused by declining procurements.  Specific action is necessary to preserve industrial base capabilities for fuzes and thermal batteries.  Projects will be executed to improve the efficiency of existing production processes, explore advanced materials for higher performance and upgrade outdated technology.\n\nDoD will conduct additional industrial base assessments in FY 2016 to identify weaknesses and fragile and critical capabilities for FY 2017 project development.  A call for FY 2016 projects has also been sent to the Service’s Acquisition Executives (SAE's) requesting that proposals rate the fragility and criticality of subject capabilities.  A Joint Industrial Base Working Group (JIBWG) Panel will rank the proposals, and the Deputy Assistant Secretary of Defense (DASD) for Manufacturing and Industrial Base Policy (MIBP) will make the final selection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Industrial Base Sustainment"
                                    },
                                    "Description": {
                                        "val": "Investment in key sub-tier suppliers across the FYDP (FY16-20)  will ensure qualified suppliers exist to support future system development efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.092"
                                            },
                                            "Text": {
                                                "val": "Joint efforts with other DoD, Department of Energy (DoE), and the National Reconnaissance Office (NRO) to maintain industrial base facilities that are capable of testing radiation hardened electronics.  This funding provided resources to cover a one-time FY 2014 funding gap.\n\nA number of unique radiation hardened products from a sole source supplier highly likely to be used by a number of future programs have completed development but require final space qualification.  The supplier cannot fund this at their own expense.  Without funding to perform space qualification work, the products will not be ready for use when needed and the supplier is highly likely to leave the business.  Funding will be used to perform final space qualification work and avoid the much higher cost of developing replacement products with an alternative supplier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.638"
                                            },
                                            "Text": {
                                                "val": "The project to perform space qualification of radiation hardened products will continue.\n\nAdditional funding is targeted for another project to keep Mercury-Cadium-Telluride (MCT) detector production active (and capable of meeting surge requirements projected) for National Security Systems in the Space Sector.  This MCT project leverages Defense Manufacturing Science and Technology (DMST) work to qualify MCT projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.001"
                                            },
                                            "Text": {
                                                "val": "Twelve space industrial base capability areas have been identified as needing mitigation in FY16-20, half of them in the area of radiation-hardened electronics.  IBAS funds for 2016 in this industrial base sector will focus on sustainment of existing capability.   The 2015 project to keep MCT detector production active and capable of surging will be continued in 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Other Defense-Specific Capabilities"
                                    },
                                    "Description": {
                                        "val": "With an overall decline in defense budgets, the industrial base sectors and niches hit hardest are those with a combination of defense-specific requirements and low, limited or declining production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.456"
                                            },
                                            "Text": {
                                                "val": "The Infrared Focal Plan Array (IRFPA) project focused on sustaining a continuous production capability for the Improved Forward Looking Infrared (I-FLIR) modernization program.  It was identified as very high risk in a comprehensive assessment of the ground vehicle sector.  There is a gap between the end of horizontal integration of FLIR and the slated start of I-FLIR modernization.  In order to bridge the gap, the Department continues to maintain the foundry capability and intellectual base of critical suppliers through time-phased lots of IRFPAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.640"
                                            },
                                            "Text": {
                                                "val": "A variety of products have been identified as at risk because of their highly specialized nature and very low production.  \n\nFunding is planned to bridge the gap between rapid prototype and formal DoD production for the Counter Bomber automated, standoff, suicide vest and concealed weapon detection sensor.  The Counter Bomber detection sensor supports a variety of U. S. military operations. \n\nAnother project will preserve the unique capability to manufacture Electromechanical Actuators needed to replace the hydraulics for aircraft carrier weapons and stores elevator systems.  This capability is at risk because of a break in production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.235"
                                            },
                                            "Text": {
                                                "val": "DoD will conduct additional industrial base assessments in FY 2015 to identify weaknesses and fragile and critical capabilities for FY 2016 project development.  A Joint Industrial Base Working Group (JIBWG) Panel will rank the proposals, and the Deputy Assistant Secretary of Defense (DASD) for Manufacturing and Industrial Base Policy (MIBP) will make the final selection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Goal - Insert industrial base considerations consistently in program review:\nTo make informed investment and production decisions\nTo avoid reconstitution costs for capabilities that DoD will need again soon"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Industrial Base Analysis and Sustainment (IBAS) Project Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM, RDCB-DE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock Island, IL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.869"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.745"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.245"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.245"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Industrial Base Analysis Sustainment (IBAS) Program Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM, RDCB-DE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock Island, IL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.769"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.011"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.331"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.331"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_Exhibit_TIFF.tif"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "FY14 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY 15 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY 16 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY 17 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY 18 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY 19 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}