{
    "id": "aebddbda44c126212bbb44224063caaacd3dd535",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602624A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Technology"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.013"
            },
            "CurrentYear": {
                "val": "63.057"
            },
            "BudgetYearOne": {
                "val": "48.340"
            },
            "BudgetYearOneBase": {
                "val": "48.340"
            },
            "BudgetYearTwo": {
                "val": "57.038"
            },
            "BudgetYearThree": {
                "val": "49.245"
            },
            "BudgetYearFour": {
                "val": "57.509"
            },
            "BudgetYearFive": {
                "val": "61.313"
            }
        },
        "ProgramElementNote": {
            "val": "FY16 increase to develop enabling component technologies that provide improved lethality with precision at extended\nranges as well as sensor and warheads technologies that provide capabilities to move in constrained terrains."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates, designs and evaluates enabling technologies  to develop lethal and nonlethal weapons and munitions with increased performance and the potential for lower weight, reduced size, and improved affordability.  Project H18 focuses on weapons and munitions development. Project H19 researches technologies to maintain the lethality of US weapons as well as directed energy (DE) capabilities and subsystems to support the weaponization of High Power RF systems. Project H28 evaluates munition components such as fuzes, power, warheads with tailorable effects, and insensitive munition compliant energetic materials. \nWork in this PE is related to, and fully coordinated with, PE 0602303A (Missile Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology),  and  PE 0603004A (Weapons and Munitions Advanced Technology).\n\nThe cited work is consistent with the Ground Maneuver  and Lethality Portfolios and the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is primarily performed by the Armament Research, Development, and Engineering Center (ARDEC) at Picatinny Arsenal, NJ, cooperation with the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD; the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA; the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI; and the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "52.778"
                },
                "CurrentYear": {
                    "val": "38.069"
                },
                "BudgetYearOne": {
                    "val": "42.686"
                },
                "BudgetYearOneBase": {
                    "val": "42.686"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.013"
                },
                "CurrentYear": {
                    "val": "63.057"
                },
                "BudgetYearOne": {
                    "val": "48.340"
                },
                "BudgetYearOneBase": {
                    "val": "48.340"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.765"
                },
                "CurrentYear": {
                    "val": "24.988"
                },
                "BudgetYearOne": {
                    "val": "5.654"
                },
                "BudgetYearOneBase": {
                    "val": "5.654"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.012"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "25.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.765"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.654"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.654"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H18"
                    },
                    "ProjectTitle": {
                        "val": "Weapons & Munitions Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.998"
                        },
                        "CurrentYear": {
                            "val": "18.786"
                        },
                        "BudgetYearOne": {
                            "val": "20.974"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.974"
                        },
                        "BudgetYearTwo": {
                            "val": "22.143"
                        },
                        "BudgetYearThree": {
                            "val": "20.918"
                        },
                        "BudgetYearFour": {
                            "val": "24.425"
                        },
                        "BudgetYearFive": {
                            "val": "28.896"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs, investigates, and evaluates component technologies to enable affordable precision munitions as well as provide increased lethality and performance with reduced logistics and advanced direct\/indirect fire capabilities. \n\nThis project sustains Army science and technology efforts supporting the Ground and Lethality portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy\n\nWork in this project is performed by the Armament Research, Development, and Engineering Center (ARDEC), at Picatinny Arsenal, NJ ( in collaboration with a  the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD; the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL; and the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA.)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Propulsion Technology for the Future"
                                    },
                                    "Description": {
                                        "val": "This effort explores propellant technologies such as powder coextrusion and grain coatings, while retaining insensitive properties, for employment in gun launch environments as well as directional thrusters including those that deliver a broad spectrum of effects .  It also conducts experiments with these propellants to increase the range of artillery and mortar rocket assisted projectiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.462"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments on rocket propulsion systems concepts to extend the range of 155mm artillery and 120mm mortar;  determine ballistic applications for co-extruded propellants; leveraged advancements in combustible cartridge case technologies to improve projectile propulsion; designed and developed optimal propellant configurations for specific applicable systems; developed 120mm mortar propellant for 120mm systems for improved range and cost; developed and optimized advanced propellant for 81mm extended range system compliant with automated direct\/indirect fire mortar (ADIM)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.614"
                                            },
                                            "Text": {
                                                "val": "Conduct initial experiments on non ammonium perchlorate propellant formulations for rocket assisted projectile indirect fire solutions; design and develop propellant technologies for next generation artillery and tank applications; scale up materials for advanced propellants, igniters and combustible materials for propellant charges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.856"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.856"
                                            },
                                            "Text": {
                                                "val": "Will conduct evaluation of extended range 120mm mortar fire in a round designed to double (2x ) the range; produce co-extruded gun propellant for direct and indirect fire applications; perform 30mm fires of coated propellant for improved ballistic performance and extended range with lower sensitivity to temperature; increase the burn rate at low temperature and maintain high temp burn rate resulting in more range over the temp spectrum and increased accuracy due to less propellant variation; formulate new materials for extended range artillery applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates innovative weapon technologies such as recoil energy mitigation, affordable precision, extended range\/guided technologies, and advanced propellant for future medium caliber direct fire systems that could provide similar or greater lethality than current systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.496"
                                            },
                                            "Text": {
                                                "val": "Matured most promising weapon technologies to enable swarming munitions that provide highly lethal target tailorable effects such as advanced miniature fuze and power systems and munition architectures for synergistic effects; evaluated for transition to advanced development; conducted additional small scale research into multiple novel weapon system candidate technologies, including fire control decision support services, and enhanced sniper technologies for improved precision at extended ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.174"
                                            },
                                            "Text": {
                                                "val": "Investigate multiple promising innovative weapon technologies that could provide greater lethality; develop weapon technologies that incorporate emerging materials (e.g. nanotechnology, additive manufacturing); develop weapon, munition and fire control technologies that support advanced forms of engagement, such as collaborative munitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.409"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.409"
                                            },
                                            "Text": {
                                                "val": "Will  continue to investigate innovative weapon technologies that could provide lethality improvements such as nanostructured materials for high strain rate applications and counter UAS system analysis; develop weapon technologies that incorporate new materials (e.g. nanotechnology, additive manufacturing);  develop weapon, munition and fire control technologies that support advanced forms of engagement, such as collaborative multi-role weapons and munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Penetrator Designs"
                                    },
                                    "Description": {
                                        "val": "This effort provides novel direct fire capabilities against advanced heavy armor threats by investigating several projectile configurations and non depleted uranium (DU) materials to achieve flight stability and effectiveness against new armored targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.662"
                                            },
                                            "Text": {
                                                "val": "Optimized components for better function and launch survival; designed and modified non-DU kinetic energy (Next Generation KE) functional projectile leading to the tech demo."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Projectile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops various methods of low cost extended range technologies for mortar and artillery applications.  Projectile lift and control technologies will be investigated for survivability and functionality through component level testing and modeling and simulation.  The Warfighter will be able to use these technologies and handheld device to engage Beyond Line-of-Sight (BLOS) targets and guide the projectile in flight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.979"
                                            },
                                            "Text": {
                                                "val": "Matured component technologies such as aerodynamic shapes, tail fins, lift surfaces, improved propellant and base bleed for 60mm through 120mm mortar projectiles; conducted experiments for directing the projectile onto target at ranges beyond 500 meters; validated and matured electronic components for insertion into projectiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.991"
                                            },
                                            "Text": {
                                                "val": "Mature and validate the improved aerodynamic shapes, propellant, guidance\/navigation and control, auto pilot and low pressure gas technologies, into 60mm\/120mm mortar projectiles with a goal of up to a 75% increase in range with guidance; conduct an experimental flight of a guide to hit projectile at 75% increased range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.988"
                                            },
                                            "Text": {
                                                "val": "Will investigate hybrid (155mm projectile with the incorporation of base fins and lifts\/control surfaces) technologies for artillery indirect fire application; design control surfaces to achieve extended ranges; conduct bench top testing of control actuation  mechanisms such as (power sources, motors and canards) capable to maintain structural integrity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that provide affordable precision capabilities for projectiles fired into GPS denied environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.453"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments to validate the concept of utilizing commercial-off-the-shelf (COTS) inertial sensors for guided munition applications; determined the feasibility of applying arrayed sensor concepts to gun launched munitions in order to determine position within navigation grade accuracies; validated target recognition algorithms adapted for use with the imaging modalities selected."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.282"
                                            },
                                            "Text": {
                                                "val": "Validate inertial sensor array design and processing algorithms developed: conduct various experiments with the long-wave\/near-IR imagers used for terminal guidance in GPS denied environments. Nature of the experiments is to collect real time imagery data for the purpose of navigation algorithm development. This effort is being conducted in collaboration with AMRDEC through the ATR Working Group and with the Army Research Laboratory (ARL) through a technology transition agreement. This effort will spin out component technologies that will be evaluated and matured in the fully coordinated effort of the same name in PE\/Project 0603004A\/232."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.675"
                                            },
                                            "Text": {
                                                "val": "Will continue subsystem evaluation of the optics to include laying out the tactical imager and electronics form factor as well as begin high-g survivability testing of the optics;  perform evaluation of the image processing navigation algorithm using the Modeling and Simulation developed. This effort is being conducted in collaboration with AMRDEC through the Aided Target Recognition (ATR) Working Group and with the Army Research Laboratory (ARL) through a technology transition agreement. ."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Printed Explosives, Power Sources & Electronics for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates the state-of-the-art in materials printing, direct write, flexible electronics, and conformal systems for the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.692"
                                            },
                                            "Text": {
                                                "val": "Developed Printed Electronics, Energetics, Materials, & Sensors (PEEMS) technologies for armament applications; investigated ink development, device fabrication, and testing of printed electronics for current and future armament system; determine the utility of PEEMS technologies for munitions fuzing, sensing, security, and logistics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.694"
                                            },
                                            "Text": {
                                                "val": "Investigate, design, develop and validate printed electronics, energetics, and power sources for Munitions and other armament applications; mature materials and printing techniques to add capabilities to munitions and fuze systems, while reducing the size, weight, and cost of conventional electronics; conduct experiments to determine applicability of printing techniques for antennas, sensors, electrical components, and other components printed onto windscreens, radomes, munitions, and weapon systems.  This effort is being conducted in collaboration with CERDEC, AMRDEC and the Army Research Laboratory (ARL) through both the integrated project team and technical working groups."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.747"
                                            },
                                            "Text": {
                                                "val": "Will investigate, design and adopt COTS hardware to print electronics and energetics for use in munitions and power sources for Munitions and other armament applications; establish materials and printing techniques to add capabilities to munitions and fuze systems, while reducing the size, weight, and cost of conventional electronics; conduct experiments to determine applicability of printing techniques for antennas, sensors, electrical components, and other components printed onto windscreens, radomes, munitions, and weapon systems.  This effort is being conducted in collaboration with CERDEC, AMRDEC and ARL through both an integrated project team and technical working groups."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Dropped Guided Munition Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops and integrates component technologies that enable the precision delivery and function of an 81mm mortar to defeat moving targets of opportunity in complex terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.272"
                                            },
                                            "Text": {
                                                "val": "Matured designs and analyze integration of Proximity Fuze system, with a wrap around antenna, and semi active laser seeker components, designed and developed to fit the volume and form factor of low cost and light weight air drop 60-81mm munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Indirect Fire Weapon Technology"
                                    },
                                    "Description": {
                                        "val": "This effort initially investigates and determines the viability of candidate extended range indirect fire weapon technologies that facilitate light weight armaments with launch velocities resulting in ranges of 70km and beyond with emerging ammunition .  Technologies will be applied at the system and sub-system level to address technology gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.982"
                                            },
                                            "Text": {
                                                "val": "Identified candidate technologies that can be used to facilitate hyper-velocity launch; investigate viability of candidate technologies; developed concepts utilizing the most promising technologies; identified the subcomponent technological gaps that need to be addressed early."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.021"
                                            },
                                            "Text": {
                                                "val": "Mature the concepts of an extended range armament system; continue the investigation of unconventional materials and processes to allow a new system to have no significant weight increase compared to existing systems; develop a detailed design of a lightweight armament system for use in extended range weapons that addresses the current Army capability gaps with minimal system impact."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.287"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature the concepts of an extended range armament system; conduct initial verification of models through lab scale prototypes and testing;  and evaluate the various technology concepts based on the capabilities the integrated system provides."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort accelerates the development of disruptive technologies that enable transformational protection capabilities for vital assets, forces and civilian populations, increasing safety, decreasing collateral damage and minimizing fratricide."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.010"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop armament technologies to provide protection to vital National assets including vehicles, facilities, weapons, and personnel; develop precision weapons, munitions and fire control technologies to reduce collateral damage to non-combatants; develop armament technologies that provide greater standoff distance between incoming threats and vital assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.512"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate and develop armament technologies to provide protection to vehicles, facilities, weapons, and personnel; develop precision weapons, munitions and fire control technologies to reduce collateral damage to non-combatants while providing greater standoff distance between incoming threats and vital assets"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops candidate extended range artillery weapon system and projectile technologies that increase the range up to 2x with increased precision."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Investigate candidate projectile and weapon systems technologies that provide extended range by leveraging novel materials, innovative propulsion technologies and advanced design concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "This effort is being conducted in concert with the Extended Range Indirect Fire Weapon Technology effort. Resulting component technologies will be evaluated and matured in the fully coordinated effort of the same name in PE\/Project 0603004A\/232. These new technologies will apply to light weight common armament , advanced micro-common fire control, novel post launch propulsion methods, and advanced projectile lifting surfaces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technologies for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and design innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes and advanced fuze setting to provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Identify candidate technologies that can be used to facilitate advanced high-g target sensing\/classification that are miniaturized, integrated and packaged into existing fuze form factors which are currently not available for advanced munitions; new miniaturized safe and arm architectures that can enable the next generation of enhanced lethality; and advanced fuze setting for size and weight reduction through advanced electronic packaging schemes and efficient setting technologies; investigate viability of candidate technologies; develop initial concepts and determine feasibility to known technological gaps; and  evaluate innovative miniaturized munitions power source candidate technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will explore robust airburst fuze technology concepts for increased accuracy in multi-purpose rounds; develop microscale sensor concepts and devices for enhanced environment sensing and for arming and warhead initiation in which all the energetic components are out-of-line; investigate alternative fuze setting methodologies to more efficiently transfer and store power and data to smart indirect fire projectiles; investigate multi-point initiation concepts applicable for Insensitive Munitions applications; investigate innovative munitions power source candidate technologies for medium and large caliber munitions. These technologies support the Joint Munitions Program Technical Coordinating Group (TCG – 5 and TCG-10) and the  Joint Fuze Technology Program (JFTP)"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H19"
                    },
                    "ProjectTitle": {
                        "val": "Asymmetric & Counter Measure Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.795"
                        },
                        "CurrentYear": {
                            "val": "6.985"
                        },
                        "BudgetYearOne": {
                            "val": "13.212"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.212"
                        },
                        "BudgetYearTwo": {
                            "val": "15.324"
                        },
                        "BudgetYearThree": {
                            "val": "9.482"
                        },
                        "BudgetYearFour": {
                            "val": "12.865"
                        },
                        "BudgetYearFive": {
                            "val": "11.602"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops technologies to support asymmetric countermeasures such as radio frequency and ultra-short pulse directed energy and efforts to maintain the lethality and overmatch of US weapons.  Work in this project is related to, and fully coordinated with, efforts in projects H18 and H28 (also in PE 0602624A), PE 0602618A (Ballistics Technology), and projects 232 and L94 in PE 0603004A (Weapons and Munitions Advanced Technology).   \n \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.   \n \nThis work is performed by the Armament Research, Development, and Engineering Center (ARDEC), at Picatinny Arsenal, NJ, and the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Battlefield Effectors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates unique weapon and munitions enabling technologies to achieve tunable effects on targets and that are capable of providing a full range of effects from non-lethal to highly lethal via a single weapon or munition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.684"
                                            },
                                            "Text": {
                                                "val": "Investigated additional new and promising effector technologies and evaluated them for transition to advanced development; conducted experiments to enable size, weight, power and cost (SWaP-C) reduction of solid state active denial technologies to allow for handheld applications and for use on the design of other novel battlefield effector candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Develop most promising effector technologies for transition to advanced development; investigate size, weight, power and cost benefits of those technologies; explore the use of non-traditional technologies in new applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.753"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.753"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate the most promising effector technologies such as Hostile Fire Detection Mortar Blast Attenuation, and Counter-Counter Measure Technologies ready for transition to advanced development; investigate size, weight, power and cost benefits of those technologies in new applications; explore the use of disruptive technologies that can be applied to current and future precision guided direct and indirect fired munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Countermeasure (CCM) Technologies for weapons and munitions"
                                    },
                                    "Description": {
                                        "val": "This effort investigates guidance signal reduction, inertial measurement unit, and antenna design technologies to enable continued effectiveness of US weapon systems against enemy countermeasures including Active Protection Systems (APS), Global Positioning System (GPS) jamming, and active seeker jamming."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.881"
                                            },
                                            "Text": {
                                                "val": "Designed CCM systems to protect against known vulnerabilities and evaluate for transition to advanced development; investigated multiple counter countermeasure candidate technologies; explored susceptibilities and remediation techniques for armament systems; conducted various experiments to measure effects of directed energy and developed modeling and simulation to understanding underlying physics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.369"
                                            },
                                            "Text": {
                                                "val": "Develop most promising technologies that protect munitions and weapons technologies against emerging threat countermeasure technologies; explore disruptive directed energy as a means of providing CCM; investigate most promising CCM technologies for transition to advanced development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.445"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.445"
                                            },
                                            "Text": {
                                                "val": "Will conduct experimentation of Counter Counter Measure technologies for gun launched munition components in a relevant laboratory environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Fire Control for Indirect Fires"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates the applicability and integration of state-of-the-art acquisition and engagement technologies for data and image processing, weapon orientation sensors and methodologies to enhance fire control capability, and therefore weapon effectiveness, at various ranges and under battlefield conditions. Investigates components and architectures that will reduce size, weight, power and cost (SWAP-C), and increase commonality and operation across direct and indirect fire control systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.780"
                                            },
                                            "Text": {
                                                "val": "Utilized systems engineering to investigate the state-of-the-art of optics, microprocessors and target recognition\/classification algorithms based on market surveys of private industry\/academia\/other government agencies' sensor technologies; established, developed and matured the associated fire control system requirements and performance goals; generated and evaluated concepts for software and hardware architectures for optimal fire control system performance and size, weight and power considerations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.011"
                                            },
                                            "Text": {
                                                "val": "Develop novel methods and algorithms for improved ballistics, for data and image processing, and for sensing battlefield, weapon and target environment; investigate small, accurate, survivable weapon orientation sensors, technologies and compensation methodologies to improve the weapon pointing; refine concepts for hardware and software architectures for optimum physical and functional integration, increased commonality, lower weight, and faster engagement times."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and integrate acquisition and engagement technologies which support extended range indirect fire systems such as:  extended range tracking and sizing capabilities, advanced sensors, hardware prototyping and firmware coding technologies for use in GPS-denied environments; navigation and pointing technologies\/compensation techniques; conventional munition accuracy and reduced navigational burden for smart munitions technologies; communication techniques for in-flight interface\/control with smart munitions; investigate miniaturized and multifunctional electronic components to reduce size, weight, power and cost (SWAP-C), and increase commonality of hardware, software and operation across indirect fire systems; perform architecture trade-off analyses that allow for efficient, real-time fusion of information and data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improvised Explosive Device ( IED) Neutralization Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates multiple radio frequency (RF) functions to neutralize IEDs utilizing a common set of hardware and software, on a ground vehicle. It develops novel RF waveforms to neutralize a broad spectrum of IEDs and their electronic triggering devices. Results to transition to explosive hazard predonation system effort in PE 0603004A\/Project 232 in FY2014\/15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.958"
                                            },
                                            "Text": {
                                                "val": "Matured existing IED neutralization systems; conducted research to include the development of IED neutralization waveforms utilizing a modular exciter architecture, and developed a beam steering directional antenna to focus high power RF towards predicted threat zones to neutralize the IED; validated the increased performance of a convoy \/ route clearance based IED neutralization system by interfacing with IED detection sensor systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Decision Enhancing Capabilities for Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort develops target database and target management capability for company and below operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.490"
                                            },
                                            "Text": {
                                                "val": "Developed software for integration and collaboration of remote weapon station for lethal\/non lethal effects; developed software for the processing and integration of sensor\/target information; developed Line-Of-Sight\/Beyond-Line-Of-Sight (LOS\/BLOS) fires capability for company and below within program of record architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Powered Radio Frequency"
                                    },
                                    "Description": {
                                        "val": "The use of High Power Radio Frequency (RF) has been demonstrated to provide desired target effects against various targets; however such systems are still too large and consume too much power to make them tactically useful for Army applications. This effort will focus on addressing the Size, Weight, Power and Cost (SWAP - C) of High Power RF systems and their components so as to allow tactically useful systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.005"
                                            },
                                            "Text": {
                                                "val": "Focus on reducing antenna size for high power RF transmission; investigate high dielectric constant composites (nano-dielectics) to produce 60-80% size reduction in antenna array elements; develop the antenna array elements to transmit known RF waveforms (frequency, pulse width, and amplitude) to cause a desired target effect of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.007"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.007"
                                            },
                                            "Text": {
                                                "val": "Will continue investigation of high dielectric constant composites (nano-dielectrics) to achieve the desired size reduction of the high power antenna array to include validation; design, fabricate and evaluate transistor technologies, such as laterally diffused metal oxide semiconductor (LDMOS) field-effect transistors, for highly efficient solid state transmitter applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Terrain Shaping Munition Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops an improved munition capability, remote delivery, and man-in-the-loop control technologies that will allow the warfighter to maintain dominance in the battlefield by denying adversaries access to an area of operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will investigate munition technologies including: large area coverage anti-personnel and dual mode warhead designs, directed energy vehicle defeat effects for low hazard protection of area denial munitions, and munition configurations; and investigate different designs of tamper deterrence and anti-tamper technologies such as obscuration and non-lethal technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on providing the soldier  a set of small arms capabilities to increase the accuracy at extended ranges, probability of hit, improve the time of engagement, and enhance the situational awareness. By achieving these objectives, the soldier will be able to improve his opertional effectiveness in reduced time."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.007"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.007"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced materials and technologies that optimize small arms fire control architecture at a reduced weight;  develop and assess advanced small arms technologies for improved target handoff;  evaluate technologies that detect and provide threat indicators and potential targets; investigate technologies that recognize\/classify and identify targets, aid in accurately aiming the  weapon for effective firing and allow the soldier to assess conditions after firing for potential reengagement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Recoil Reduction Disruptive Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to reduce recoil momentum and energy waste for integration onto lighter vehicle platforms for increased mobility, using rarefaction wave gun and supporting technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.002"
                                            },
                                            "Text": {
                                                "val": "Investigated fundamental means of radical recoil reduction to enable large caliber weapons to be lightweight and integrated to lightweight manned and unmanned vehicles; funded research into rarefaction wave gun and supporting\ntechnologies for use in supersonic up to hypervelocity launchers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H1A"
                    },
                    "ProjectTitle": {
                        "val": "WEAPONS & MUNITIONS TECH PROGRAM INITIATIVE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.000"
                        },
                        "CurrentYear": {
                            "val": "25.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Weapons and Munitions Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Investigated, designed and evaluated enabling technology to develop lethal and nonlethal weapons and munitions with increased performance and the potential for lower weight, reduced size, and improved affordability."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for weapons and munitions technology research."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H28"
                    },
                    "ProjectTitle": {
                        "val": "Warheads\/ Energetics Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.220"
                        },
                        "CurrentYear": {
                            "val": "12.286"
                        },
                        "BudgetYearOne": {
                            "val": "14.154"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.154"
                        },
                        "BudgetYearTwo": {
                            "val": "19.571"
                        },
                        "BudgetYearThree": {
                            "val": "18.845"
                        },
                        "BudgetYearFour": {
                            "val": "20.219"
                        },
                        "BudgetYearFive": {
                            "val": "20.815"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and designs enabling warhead and energetic technologies such as novel warhead architectures, new propellant techniques, and high-density explosives to produce smaller, lighter, more effective, multi-role warheads.  \n\nThis project sustains Army science and technology efforts supporting the Ground and Lethality portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy\n\nThis work is performed by the U.S. Army Armament Research, Development, and Engineering Center (ARDEC), at Picatinny Arsenal, NJ in collaboration with the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD; and the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Scalable Warhead Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs scalable and adaptive explosives and reactive materials technology for either gun or missile-launched weapons and munitions that can deliver a broad spectrum of effects with reduced collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.085"
                                            },
                                            "Text": {
                                                "val": "Designed and conducted experiments for spin compensated shaped charges, enhanced fragmentation and multiple explosively formed penetrator (MEFP) warheads; investigated scalable technologies as they relate to lethal to less than lethal effects; develop designs for non-axisymmetric EFP warheads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.392"
                                            },
                                            "Text": {
                                                "val": "Mature designs and conduct experiments in the area of spin compensated shaped charges, enhanced fragmentation, directional lethality and multiple explosively formed penetrator (MEFP) warheads;  validated scalable technologies as they relate to lethal to less than lethal effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.193"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.193"
                                            },
                                            "Text": {
                                                "val": "Will design and develop multi-functional warheads for multi-role missions that include C-RAM, C-UAS and anti-vehicle\/personnel. Will design and test brass board designs for shaped charge, explosively formed penetrator (EFP) and blast fragmentation with targeted lethality; will determine through modeling and simulation of tunable\/tailorable effects for adaptable warheads for future artillery, mortars and medium caliber munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials and Warheads"
                                    },
                                    "Description": {
                                        "val": "This effort designs energetic materials with controlled energy release for precision munition and counter-munition applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.803"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate most promising technologies such as disruptive energetics, micro-thrusters and tailorable propellants, highly effective miniature lethal mechanisms, and nano insensitive nitramines; also conducted evaluation for transition into novel swarming munitions, advanced warheads, medium and large cal ammunition; seek new applications based on measured performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosives Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops high energy\/high performance, multi-purpose insensitive munitions (IM) explosives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.937"
                                            },
                                            "Text": {
                                                "val": "Determined most promising compounds to enable tailored energy release and combined effects; investigated and characterized new insensitive energetic ingredients; designed and developed novel concepts for explosive initiation and formulation; scale up and test Nano energetic materials in TRL-4-5 experiments; developed nano-enhanced melt pour ingredients for reduced sensitivity and cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.064"
                                            },
                                            "Text": {
                                                "val": "Formulate and process combined effects and high efficiency explosives; validate affordable new energetic binders for enhanced blast formulations; investigate new synthetic processes to enable low-cost, high energy solid crystal explosive ingredients; mature processing techniques for nano-enhanced organic energetics formulations; conduct experiments on electrically-induced tailored energy release for proof of chemistry-based variable warhead fragmentation and the possibility of an on\/off energetic capability. This effort is being conducted in collaboration with the Army Research Laboratory (ARL) through both the integrated project team and technical working groups."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.861"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.861"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate single step nano-enhaced explosive munitions with greatly reduced shock sensitivities.  Will validate lethality and fragmentation concepts.  Will investigate scale up high pressure synthesis chemistry of disruptive energetic materials.  Will validate high efficiency explosive concepts in munition systems. This effort is being conducted in collaboration with the Army Research Laboratory (ARL) through both the integrated project team and technical working groups."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Development for Water Purification"
                                    },
                                    "Description": {
                                        "val": "This effort originated from a material development for armament systems and was found to have a dual use application.  The effort (also known as Adaptive Armament Reactive Interface Domains\/AARID) is intended to provide a capability to enhance contingency basing water efficiency via recycling with secondary contributions to reduction of waste and power.  Lesser focus advantages are on sustainment, greater logistics flexibility, and reduced Warfighter threat from supply convoys."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.489"
                                            },
                                            "Text": {
                                                "val": "Investigated cycle time and water flow, determined rate of reaction for decontamination, validated the coating to lend itself useful for robustness of current filters, and designed and developed laboratory systems for conducting experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.248"
                                            },
                                            "Text": {
                                                "val": "Design and develop a method to collect real time data to determine flow rates and validate water purity; conduct experiments to compare coated filters to uncoated filters to determine the benefits of the coating in purifying water."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosives Safety for Automated Base Camp Planning"
                                    },
                                    "Description": {
                                        "val": "This effort determines data interoperability requirements between explosive safety and base camp planning software tools; designs an integrated tool that increases explosive safety for base camps by managing the risk due to interaction between changes in Net Explosive Weight, geography, facilities and force structure. In FY 2014 this effort supports the Demonstration of Force Protection for Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Determined data interoperability requirements of explosives safety, risk assessment, and base camp planning tools leading to the development of the design architecture for an automated comprehensive base camp planning software suite."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.497"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate ammunition explosives safety planning and management modules within the base camp planner design architecture.  This task is fully coordinated with the effort of the same name in PE\/Project 0603001A\/543."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunable Pyrotechnics"
                                    },
                                    "Description": {
                                        "val": "This effort develops smoke and flare countermeasure for passive protection for ground and air combat platforms, and hand held signals for illumination and signaling.  This will increase warfighter and aircraft survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.606"
                                            },
                                            "Text": {
                                                "val": "Investigated ultraviolet countermeasure (UVCM) flare reformulation with modeling & simulation and validated in scale up experiments; developed and validated laser beam rider countermeasure (LBRCM) designs with functional experiments; designed & developed image seeking countermeasure (ISCM) flare configurations; matured and validated white illumination hand held signal designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.085"
                                            },
                                            "Text": {
                                                "val": "Assess formulations and functional concepts for dazzler, cloud and seeker countermeasures; conduct experiments on dazzler flares and prepare for flight tests; conduct experiments on cloud countermeasures; analyze dazzler and cloud countermeasure performance using experiment and simulation results for application to multiple aircraft and aspect angles; identify threats and develop concepts for seeker countermeasure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Dazzler Countermeasure formulations will be refined along with additional flight testing.  Dazzler M&S algorithms will be refined as well.  Cloud Countermeasure will undergo final prototype formulation full up system level demonstrations on aircraft.  M&S algorithms will be updated for Cloud Countermeasure.  Advanced Countermeasure will have initial formulations and flare concepts tested against hardware in the loop threat seekers.  Digital M&S algorithms will be developed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}