{
    "id": "b1cf075520b493be1bf792e8f416b2acdba86779",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "218.482"
            },
            "CurrentYear": {
                "val": "299.734"
            },
            "BudgetYearOne": {
                "val": "314.582"
            },
            "BudgetYearOneBase": {
                "val": "314.582"
            },
            "BudgetYearTwo": {
                "val": "386.540"
            },
            "BudgetYearThree": {
                "val": "432.417"
            },
            "BudgetYearFour": {
                "val": "430.814"
            },
            "BudgetYearFive": {
                "val": "464.014"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology program element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Advanced Tactical Technology, Aeronautics Technology and Network Centric Enabling Technology.\n\nThe Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications.\n\nThe Advanced Land Systems project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies.\n\nThe Advanced Tactical Technology project focuses on broad technology areas including: a) compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications; and b) new tactical systems for enhanced air vehicle survivability, precision optics, electronic warfare, and advanced air breathing weapons. \n\nAeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications.\n\nThe Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) intelligence networks; 2) open and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  The data processing efforts include: conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "218.209"
                },
                "CurrentYear": {
                    "val": "305.484"
                },
                "BudgetYearOne": {
                    "val": "340.564"
                },
                "BudgetYearOneBase": {
                    "val": "340.564"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "218.482"
                },
                "CurrentYear": {
                    "val": "299.734"
                },
                "BudgetYearOne": {
                    "val": "314.582"
                },
                "BudgetYearOneBase": {
                    "val": "314.582"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.273"
                },
                "CurrentYear": {
                    "val": "-5.750"
                },
                "BudgetYearOne": {
                    "val": "-25.982"
                },
                "BudgetYearOneBase": {
                    "val": "-25.982"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "4.250"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "6.724"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.451"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-25.982"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-25.982"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.\nFY 2015:  Decrease reflects congressional adjustments.\nFY 2016:  Decrease reflects completion of the Robotics Challenge program and the transition of the Endurance and Vertical Take-Off and Landing (VTOL) Technology Demonstration programs to Budget Activity 3."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.208"
                        },
                        "CurrentYear": {
                            "val": "53.001"
                        },
                        "BudgetYearOne": {
                            "val": "55.687"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.687"
                        },
                        "BudgetYearTwo": {
                            "val": "75.067"
                        },
                        "BudgetYearThree": {
                            "val": "92.879"
                        },
                        "BudgetYearFour": {
                            "val": "87.321"
                        },
                        "BudgetYearFive": {
                            "val": "110.168"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Arctic Operations Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.250"
                                        },
                                        "Text": {
                                            "val": "- Conduct additional study work on technologies to assure U.S. capability to achieve situational awareness in the Arctic."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV)"
                                    },
                                    "Description": {
                                        "val": "The Anti-Submarine Warfare  (ASW) Continuous Trail Unmanned Vessel (ACTUV) program has three primary goals: (1) to build and demonstrate an experimental unmanned vessel with beyond state-of-the-art platform performance based on clean sheet design for unmanned operation, (2) demonstrate the technical viability of operating autonomous unmanned craft at theater or global ranges, from forward operating bases, under a sparse remote supervisory control model, and (3) leverage unique ACTUV characteristics to transition a game changing ASW capability to the Navy.  By establishing the premise that a human is never intended to step on board at any point in the operational cycle, ACTUV concepts can take advantage of an unexplored design space that eliminates or modifies conventional manned ship design constraints in order to achieve disproportionate speed, endurance, and payload fraction.  The resulting unmanned naval vessels must possess sufficient situational awareness and autonomous behavior capability to operate in full compliance with the rules of the road and maritime law to support safe navigation for operational deployments spanning thousands of miles and months of time.  When coupled with innovative sensor technologies, the ACTUV system provides a low cost unmanned system with a fundamentally different operational risk calculus that enables game changing capability to detect and track even the quietest diesel electric submarine threats.  Key technical areas include unmanned naval vessel design methodologies, ship system reliability, high fidelity sensor fusion to provide an accurate world model for autonomous operation, novel application of sensors for ASW tracking, and holistic system integration due to unique optimization opportunities of the ACTUV system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.951"
                                            },
                                            "Text": {
                                                "val": "-  Conducted ACTUV sensor and autonomy testing on surrogate platform.\n-  Initiated ACTUV prototype vessel construction.\n-  Signed Memorandum of Agreement with the Office of Naval Research for collaborative extended testing of the ACTUV platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete construction of prototype vessel.\n-  Integrate software and hardware into the ACTUV platform.\n-  Initiate at-sea testing to validate performance of vessel, sensor systems, and autonomy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue at-sea testing of the completed ACTUV platform to demonstrate autonomy and baseline performance of ASW sensors.\n-  Begin testing of improved ASW sensors.\n-  Demonstrate improved situational awareness and autonomy capabilities, incorporating advanced above water sensors.\n-  Demonstrate the ability to successfully integrate new mission payloads, including a Mine Counter Measures (MCM) payload."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Upward Falling Payloads (UFP)"
                                    },
                                    "Description": {
                                        "val": "The Upward Falling Payloads (UFP) program will develop forward-deployed unmanned distributed systems that can provide non-lethal effects or situational awareness over large maritime environments.  Building upon and complimenting concepts for maritime situational awareness and ISR developed under the DASH program, budgeted in Project PE 0603766E\/NET-02, the UFP approach centers on pre-deploying deep-ocean nodes years in advance in forward operating areas which can be commanded from standoff to launch to the surface.  \n\nAdvances in miniaturized sensors and processors, growth in the variety of unmanned systems, and advances in autonomy and networking all point toward highly capable, yet affordable, distributed systems.  However, power and logistics to deliver these systems in a timely manner in forward operating areas limit their utility.  The UFP program will remove this barrier to accelerate large-scale unmanned distributed missions.  The presumption is that a wider range of technology options and system solutions will emerge when the barriers to deployment are removed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.257"
                                            },
                                            "Text": {
                                                "val": "-  Conducted system trade studies addressing a range of UFP applications leading to conceptual designs.\n-  Conducted analysis to characterize long-range deep-sea communications.\n-  Developed conceptual designs for deep-sea containment and launch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.751"
                                            },
                                            "Text": {
                                                "val": "-  Develop UFP nodes capable of extended survival at full depth.\n-  Demonstrate the launch of a UFP surrogate payload to the surface from full depth.\n-  Initiate development of payload subsystems for sensing, communications, and locating.\n-  Demonstrate payload launch capabilities.\n-  Initiate development of communications subsystems.\n-  Study alternative communication modalities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of payload subsystems for sensing, communications, and locating.\n-  Demonstrate deep-ocean launch of payload prototype to the surface with fully functioning subsystems.\n-  Demonstrate the launch of a dormant UFP surrogate payload.\n-  Complete development of communications subsystems.\n-  Demonstrate long-range communications sufficient to wake up a UFP node.\n-  Initiate integration of communications and UFP nodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Mobility"
                                    },
                                    "Description": {
                                        "val": "The goal of the Strategic Mobility program is to analyze and perform risk reduction on technology solutions which can enable rapid deployment of brigade-- or even division-- sized forces globally in a matter of just days.  Initially, the activity will focus on identifying high payoff logistics and deployment technologies, and understanding the deployment and sustainment architectures required to support these technologies.  The program will examine increased automation in logistics and distribution operations, new platform technologies for sea-based transportation and prepositioning, and technologies which could enable aerial delivery of forces to the vicinity of an objective area.  The Strategic Mobility program will then shift to a focused technology risk reduction activity designed to systematically address the principal risks for the highest payoff technology set.  The technologies developed by the program could enable a rapid strategic response capability, with rapid deployment and sustainment of substantial ground combat forces, even to very remote or austere locations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Create time and cost model of brigade level deployment technologies and processes.\n-  Perform refined technology trade studies to identify critical component technology.\n-  Initiate development of select logistics technologies with high military payoff."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Azimuth Defense Fast Intercept Round Engagement System (MAD-FIRES)*"
                                    },
                                    "Description": {
                                        "val": "*Previously Medium Caliber Precision Weapons, budgeted under Project TT-04.\n\nThe Multi-Azimuth Defense Fast Intercept Round Engagement (MAD-FIRES) program will validate the premise that high precision extended range (1-10 km) direct fire medium caliber cannons can trade accuracy for size to provide equal or greater lethality compared to traditional larger and more expensive weapon systems.  While MAD-FIRES does focus on the most stressing case; ship self defense against the newest and next generation maneuverable and high speed aerial threats, extending the technology could enable smaller combat fighting vehicles and platforms augmented survivability and lethality against larger,  more valuable targets.  Lethal direct fire overmatch traditionally required larger cannons and larger vehicles to overcome threat armor systems and defenses.  MAD-FIRES will change this paradigm and enable smaller platforms by changing the requirement for maintaining lethality overmatch through accuracy rather than size."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted systems architecture trades and cost studies.\n-  Initiated design studies of candidate weapons systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate technology development efforts focusing on guidance, packaging and delivery method.\n-  Conduct end-to-end modeling and simulation of all candidate designs.\n-  Begin detailed subsystem design and plans for later stage risk reduction tests.\n-  Begin examining candidate platforms for out-year live-fire tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.687"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.687"
                                            },
                                            "Text": {
                                                "val": "-  Complete detailed subsystem design.\n-  Complete all subsystem tests.\n-  Coordinate with Navy for integrated tests to include approved representative targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arctic Operations"
                                    },
                                    "Description": {
                                        "val": "The Arctic Operations initiative is focused on developing technology to assure U.S. capability to achieve situational awareness in the Arctic.  Due to retreating Arctic ice in the coming decades there is an expectation for increased shipping traffic during the summer months, and increased interest in exploiting natural resources along the Arctic continental shelf.  This growth in activity will increase the strategic significance of the region, and will drive the need to ensure stability through effective regional monitoring.  The extreme environmental conditions of the Arctic may challenge the effectiveness of conventional technology to provide such monitoring.  As such, this program seeks to exploit unique physical attributes and emergent environmental trends in the Arctic to create surprising new capabilities, and will develop technologies for persistent and affordable sensing and communication both above and below the ice to ensure responsive operations and domain awareness."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate data collection analysis.\n-  Complete data analysis from recovered data collection systems.\n-  Complete data collection analysis from Navy Ice Experiment (ICEX)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "ACTUV"
                                    },
                                    "Title": {
                                        "val": "ONR PE 0603758N, Project 02918"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ACTUV (line 2)"
                                    },
                                    "Title": {
                                        "val": "ONR PE 0602123N, Project 0000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.877"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.877"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ACTUV (line 3)"
                                    },
                                    "Title": {
                                        "val": "ONR PE 0603123N, Project 2912"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.123"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.123"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.957"
                        },
                        "CurrentYear": {
                            "val": "67.075"
                        },
                        "BudgetYearOne": {
                            "val": "54.618"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.618"
                        },
                        "BudgetYearTwo": {
                            "val": "70.355"
                        },
                        "BudgetYearThree": {
                            "val": "99.355"
                        },
                        "BudgetYearFour": {
                            "val": "84.551"
                        },
                        "BudgetYearFive": {
                            "val": "84.355"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Experimental Vehicle (GXV)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Ground Experimental Vehicle (GXV) program is to investigate ground vehicle technologies that enable crew\/vehicle survivability through means other than traditional heavy passive armor solutions.  This will be accomplished through research and development of novel ground combat and tactical vehicle technology solutions that demonstrate significantly advanced platform mobility, agility, and survivability.  The focus of the GXV program will be on technology development across multiple areas to simultaneously improve military ground vehicle survivability and mobility.  Traditionally, survivability and mobility have to be traded against each other due to the reliance on heavy armor.  The GXV program seeks to break this trend.  Coupled with the development of technologies, the GXV program will define concept vehicles which showcase these developmental technologies.  A modeling and simulation effort will also be undertaken to understand the vehicle design trade space for the concept vehicles using the developmental technologies and to illustrate how these vehicles might be used operationally in combat scenarios.  Technology development areas are likely to include increasing vehicle tactical mobility, survivability through agility, crew augmentation, and signature management, though other relevant technologies may also be pursued."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.606"
                                            },
                                            "Text": {
                                                "val": "-  Initiated research in GXV technology areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue GXV technology development efforts.\n-  Define initial concept vehicles based on emerging technologies.\n-  Develop parametric models for evaluating military utility of technologies.\n-  Conduct survivability analysis of individual vehicle concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue research, development and integration of the most promising technologies.\n-  Refine the concept vehicles based on the maturing technologies.\n-  Develop modeling and situation tools to incorporate the advantages of the new technologies into existing campaign simulation tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Squad X"
                                    },
                                    "Description": {
                                        "val": "*Formerly Infantry Squad Systems (IS2)\n\nThe U.S. military achieves overmatch against its adversaries via vehicles in all regimes - land, sea and air; however, this level of overmatch is not enjoyed at the squad to individual dismounted warfighter level.  The goal of the Squad X program is to leverage advances in real-time situational awareness and mission command; organic three-dimensional dismount mobility; extended range tracking, targeting, and response; and unmanned mobility and perception in order to create a squad with substantial combat overmatch.  The concept of overmatch at the squad level includes increased human stand-off, a smaller force density, and adaptive sensing to allow for responses at multiple scales. Squad X will explore advanced wearable force protection, advanced organic squad level direct and indirect trajectory precision weaponry, and non-kinetic precision capabilities.  The end result of the Squad X program is an individual dismount unit outfitted with sensors, weaponry, and supporting technology to achieve one-on-one overmatch as well as the overall integration of unmanned assets alongside the dismounts to create a new Hybrid Squad unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated CONOPS and systems architecture trade studies in the areas of soldier information interaction, network information management, and unmanned information interaction,  engineering and perception as well as sensors, precision effects, and support technology for squad sensing, targeting and response.\n-  Researched technology development efforts in the areas of situational awareness, command and control, and squad effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiate technology development efforts, focusing on enhanced sensor fusion and exploitation, squad collaborative autonomy, and squad organic precision effects.\n-  Complete initial integration trade studies.\n-  Complete technology evaluation and experimentation studies.\n-  Develop virtual, constructive, and live experimentation plan; define modeling and simulation strategy.\n-  Initiate development of virtual test bed.\n-  Conduct Tactical Edge Standards Boards (TESBs) and service-level operational workshops."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.618"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.618"
                                            },
                                            "Text": {
                                                "val": "-  Conduct virtual and live experiments to obtain a system performance baseline.\n-  Refine technology development efforts focusing on enhanced sensor fusion and exploitation, squad collaborative autonomy, and squad organic precision effects.\n-  Implement modeling and simulation environment to allow for an overarching iterative design process and obtain system performance estimations.\n-  Leverage Squad X testbed and simulation environments to iteratively assess developed technology and architecture schemes.\n-  Initiate technology development interfaces focusing on human machine interfaces and the squad common operating picture.\n-  Demonstrate initial individual technology capabilities in technology assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Infantry"
                                    },
                                    "Description": {
                                        "val": "The Mobile Infantry (MI) program will explore  the development of a system-based, mixed team of mounted\/dismounted warfighters and semi-autonomous variants of current or planned small off-road platforms  (equivalent to high-mobility platforms currently used by special forces operators single rider, two-rider, or four-rider variants).  The MI mixed teams will be able to execute an expanded mission set from those currently employed.  The MI system concept will allow for a combined set of mounted and dismounted operations and for a larger area of operations over more aggressive timelines than standard infantry units.  To improve operational effectiveness of the warfighter teams when dismounted, the semi-autonomous platforms,  when unmanned, act as multipliers to the squad, such as extended and mobile fire support platforms and allow the MI mixed teams to perform higher risk exposure and access missions. The MI system scale, enabled by smaller off-road platforms, is intended to maintain dismounted warfighter scales for operational deployment.  Platforms are planned for internal transportation within CH-47, CH-53, and V-22 aircraft and are intended to be adaptations of existing\/expected platforms to eliminate the schedule and cost of new platform development."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete trades of mission\/vignette-driven collaborative command and control of a MI unit composed of a warfighter team and semi-autonomous systems.\n-  Complete trade studies and initial estimates of perception and autonomous algorithms required to match vignettes.\n-  Complete trade studies of candidate platforms and options for conversion, system integration, interfaces (electrical, mechanical, software, etc.), and define preliminary warfighter architectures to leverage.\n-  Modify and demonstrate optionally manned configuration on an available all terrain vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Challenge"
                                    },
                                    "Description": {
                                        "val": "The Robotics Challenge program will directly meet Department of Defense strategic needs by developing robotic technology for disaster response operations. This technology will improve the performance of robots that operate in the rough terrain and austere conditions characteristic of disasters, and use vehicles and tools commonly available in populated areas.  This technology will work in ways easily understood by subject matter experts untrained in the operation of robots and be governed by intuitive controls that require little training.  The program will also meet the global need for resilience against natural disasters and industrial accidents, and increase the resilience of infrastructure against acts of terrorism.  Anticipated Service users include the Army, Marines, and Special Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.851"
                                            },
                                            "Text": {
                                                "val": "-  Built robot systems.\n-  Developed algorithms for perception, manipulation, and operator interface.\n-  Conducted the DARPA Robotics Challenge Trials.\n-  Defined the DARPA Robotics Challenge Finals event performance and test criteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.575"
                                            },
                                            "Text": {
                                                "val": "-  Conduct the DARPA Robotics Challenge Finals.\n-  Perform analysis and report findings to document advancements achieved as a result of the challenge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Fast Track"
                                    },
                                    "Description": {
                                        "val": "To be dominant in robotics of the future, the DoD will need to embrace programs designed to create disruptive advances in robotics capabilities that are measured in months rather than years, and whose individual costs may largely be measured in thousands of dollars rather than millions.  The Robotics Fast Track program seeks to revolutionize robotics technologies by promoting non-traditional technical opportunities.  The program will create low-cost, high-utility robotic component solutions by engaging a novel performer community in research efforts that result in prototype systems and proofs of concept in months, at a fraction of the cost of traditional design processes.  The Robotics Fast Track program will engage numerous robotics related efforts across the spectrum of robotics professionals and enthusiasts, extending the existing performer base to include non-standard, cutting edge organizations and individuals throughout the robotics community.  The program will demonstrate the ability for robotics projects to be performed at an asymmetric advantage in time, cost, and contribution of the efforts in comparison to more traditional applied research areas.  This will apply to both performance of individual efforts and to the contracting required to engage performers in said efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiated outreach with nontraditional performer community.\n-  Established baseline fundamental robotic system and subsystem needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin execution of multiple performance developments.\n-  Release initial robotics fast track catalog."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fast, Adaptable, Next Generation Ground Combat Vehicle (FANG)"
                                    },
                                    "Description": {
                                        "val": "The goals of the Fast, Adaptable, Next-Generation Ground Combat Vehicle (FANG) program were to employ a novel, model-based design and verification capability, a highly-adaptable foundry-style manufacturing capability, and collaborative design methods to demonstrate up to 5X compression in the timeline necessary to build an infantry fighting vehicle (IFV).  The program sought to create an open-source development infrastructure for the aggregation of designer inputs applicable to complex electromechanical systems as well as software, and to exercise this infrastructure with a series of design events, leading to the building of designs in a foundry-style, rapidly configurable manufacturing facility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted developmental testing and evaluation of the drivetrain and mobility subsystem built by the iFAB Foundry, including laboratory testing of a full up power pack (engine) and ground testing of a tracked vehicle.\n-  Prepared notional design requirements for an IFV chassis and integrated survivability subsystem.\n-  Conducted AVM tool suite validation testing, a rigorous test of META and iFAB capabilities executed by relevant industry teams and focused on the chassis and survivability subsystem of a heavy, amphibious IFV.\n-  Transitioned component model standards, tool integration standards, and VehicleFORGE software tool suite and associated technology to the Digital Manufacturing and Design Innovation Institute (DMDII) through the use of co-funded research and formal technology transition activities for industry use.\n-  Completed FANG Automotive Test Rig (ATR) build-out from the FANG Dynamometer Test Rig (DTR) Test Asset built by iFAB.\n-  Executed Test Plan on FANG ATR Asset to compare real world performance with predicted performance in the AVM Tools.\n-  Conducted focused iFAB manufacturing process capabilities assessment while transitioning AVM technologies to Army TARDEC and ARDEC (Benét Labs) through an End-to-End tool suite demonstration effort."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-06"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED TACTICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.582"
                        },
                        "CurrentYear": {
                            "val": "19.494"
                        },
                        "BudgetYearOne": {
                            "val": "15.968"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.968"
                        },
                        "BudgetYearTwo": {
                            "val": "33.200"
                        },
                        "BudgetYearThree": {
                            "val": "35.672"
                        },
                        "BudgetYearFour": {
                            "val": "39.467"
                        },
                        "BudgetYearFive": {
                            "val": "24.443"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focuses on broad technology areas including: a) compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications; and b) new tactical systems for enhanced air vehicle survivability, precision optics, electronic warfare, and advanced air breathing weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Endurance"
                                    },
                                    "Description": {
                                        "val": "The Endurance program will develop technology for pod-mounted lasers to protect a variety of airborne platforms from emerging and legacy electro-optical\/infrared (EO\/IR) guided surface-to-air missiles.  The focus of the Endurance effort under TT-06 will be on miniaturizing component technologies, developing high-precision target tracking, identification, and lightweight agile beam control to support target engagement.  The program will also focus on the phenomenology of laser-target interactions and associated threat vulnerabilities.  The advanced technology component of this program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.082"
                                            },
                                            "Text": {
                                                "val": "-  Developed preliminary designs for the objective brassboard system within the functional parameters of an objective flight-prototype.\n-  Developed lethality data sets for representative legacy seekers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.794"
                                            },
                                            "Text": {
                                                "val": "-  Develop the critical design for the objective brassboard within the functional  parameters of an objective flight prototype.\n-  Develop a live-fire test plan in conjunction with all the stakeholders (Government test team, performer, target logistics, range support, range safety and environmental offices, laser clearing house etc.)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.968"
                                            },
                                            "Text": {
                                                "val": "-  Obtain all necessary approvals (range-safety, environmental, and laser-clearing house, etc.) for conducting live-fire testing.\n-  Develop detailed system and sub-system requirements for a flight-prototype of a pod-mounted laser weapon system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LUSTER (Laser Ultraviolet Sources for Tactical Efficient Raman)"
                                    },
                                    "Description": {
                                        "val": "The Laser UV Sources for Tactical Efficient Raman (LUSTER) program is developing a compact semiconductor laser that emits in the deep UV (i.e. wavelength <250 nanometers) and is capable of an output power of 1 Watt with high efficiency and spectral purity suitable for a wide array of spectroscopy applications.  Such an achievement will represent a significant advance over the state of the art, as existing lasers in this wavelength range are bulky, highly inefficient, and expensive, as there are no available semiconductor lasers that can emit in the UV range <250nm. LUSTER will leverage lessons learned in growing high quality light emitting material from the Compact Mid-Ultraviolet Technology (CMUVT) program.  The compact size of semiconductor lasers along with the LUSTER performance goals will enable many applications including but not limited to standoff Raman spectroscopy which is of interest for DoD applications such as chemical agent sensing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate the design and growth of laser epitaxial material, focusing on low-defect growth, optimal electrical and optical confinement and methods for high efficiency and power operation.\n-  Evaluate development of laser pumping technologies, such as the use of compact electron-beam sources.\n-  Evaluate methods for using non-linear crystals to efficiently convert longer wavelength lasers in the 500 nanometer range down to the 250 nanometer range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Optimize laser epitaxial material, electron-beam source, and frequency multiplying nonlinear crystals for higher efficiency and high power operation.\n-  Develop compact low power electronics for driving and controlling photonic and mechanical components.\n-  Demonstrate working prototype of a deep UV laser system that meets the phase 1 metrics of >100mW output power, 0.4% total system efficiency and line width less than 0.1nm."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "International Space Station SPHERES Integrated Research Experiments (InSPIRE)"
                                    },
                                    "Description": {
                                        "val": "The International Space Station SPHERES Integrated Research Experiments (InSPIRE) program utilizes the DARPA-sponsored Synchronized Position, Hold, Engage, and Reorient Experimental Satellites (SPHERES) platform, which has flown onboard the International Space Station (ISS) since May 2006, to perform a series of multi-body formation flight experiments that necessitate a medium-duration zero-gravity environment.  InSPIRE enhances the ability to rapidly mature and insert new technologies into national security space assets.  The InSPIRE program expands on the capabilities matured through SPHERES by developing, building and launching new hardware and software elements that expand the baseline capabilities.  These capabilities enable use of SPHERES as a testbed for more complex experimentation, providing affordable opportunities to test new space technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Built and ground tested docking ports for SPHERES to enhance rendezvous and docking test capabilities.\n-  Built and ground tested new structures for SPHERES that expand upon its ability to integrate with additional hardware.\n-  Conducted testing of tele-operations capabilities on the SPHERES devices on ISS, from the ground.\n-  Conducted testing of vision-based navigation hardware and software on the SPHERES devices on ISS.\n-  Conducted testing of electromagnetic formation flight hardware and software on the SPHERES devices on ISS.\n-  Developed and executed additional rendezvous and proximity operations experiments using SPHERES inside ISS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "-  Launch the new docking ports for SPHERES to enhance rendezvous and docking test capabilities.\n-  Launch new structures for SPHERES that expand upon its ability to integrate with additional hardware.\n-  Conduct on-orbit testing of new SPHERES docking ports and structures.\n-  Develop and execute additional rendezvous and proximity operations experiments using SPHERES inside ISS."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.951"
                        },
                        "CurrentYear": {
                            "val": "46.961"
                        },
                        "BudgetYearOne": {
                            "val": "39.971"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.971"
                        },
                        "BudgetYearTwo": {
                            "val": "44.942"
                        },
                        "BudgetYearThree": {
                            "val": "47.361"
                        },
                        "BudgetYearFour": {
                            "val": "55.424"
                        },
                        "BudgetYearFive": {
                            "val": "42.434"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircrew Labor In-cockpit Automation System (ALIAS)"
                                    },
                                    "Description": {
                                        "val": "The Aircrew Labor In-cockpit Automation System (ALIAS) program will design, develop, and demonstrate a kit enabling affordable, rapid automation of selected aircrew functions across a broad range of aircraft.  ALIAS intends to enable reduction of aircrew workload and\/or the number of onboard aircrew, to improve performance. The program will develop hardware and software to automate select aircrew functions and will employ novel, low impact approaches to interfacing with existing aircraft monitoring and control systems. The program will also develop tractable approaches to rapidly capture crew-station specific skills and aircraft unique behaviors. To accomplish this, ALIAS will leverage recent advances in perception, manipulation, machine learning, reusable software architectures, autonomous systems architecture, and verification and validation.  ALIAS will culminate in a demonstration of the ability to rapidly adapt a single system to multiple aircraft and execute simple missions. This reliability enhancement capability will enable new operational concepts for reuse of existing air assets and allow a reduction in the number of aircrew required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Executed a ground-based proof of concept study refining an approach to crew station interfacing.\n-  Initiated development of core crew station technologies.\n-  Initiated development of adaptable learning approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Design and commence prototyping of an initial ground-based ALIAS system.\n-  Initiate simulator-based demonstration of complete automation system including training and adaptation of system to multiple crew member roles.\n-  Conduct ground or airborne risk reduction testing and demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.971"
                                            },
                                            "Text": {
                                                "val": "-  Perform ground demonstration of ALIAS system functionality.\n-  Conduct flight demonstration of contingency management and new command interface.\n-  Demonstrate portability to new aircraft type.\n-  Continue risk reduction activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautics Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautical technologies and concepts through applied research. These may include feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, as well as manufacturing and implementation approaches.   The areas of interest range from propulsion to control techniques to solutions for aeronautic mission requirements. The result of these studies may lead to the design, development and improvement of prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed testing of enabling technology components.\n-  Initiated conceptual system designs.\n-  Developed technology maturation plan and risk reduction strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate new studies of novel technologies.\n-  Conduct risk reduction tests of candidate technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform modeling of concepts and architectures.\n-  Conduct trade studies of emerging concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Swarm Challenge"
                                    },
                                    "Description": {
                                        "val": "The goal of the Swarm Challenge is to develop autonomous swarming algorithms for Unmanned Vehicle (UxVs) to augment ground troops performing missions in a complex environment, without creating a significant cognitive burden.  The program will evaluate the effectiveness of swarming for UxVs supporting ground operations, air operations, maritime operations, undersea operations, or search and rescue operations. Challenges include the ability for the UxV to collaborate to rapidly survey an area leveraging other UxVs to solve problems related to, for example, perception, decision making, or obstacle clearing.   The challenge emphasizes minimum operator training and supervision so that the operator can continue to perform his\/her normal duties while using UxVs as force multipliers."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform trade studies for system approach, functional and cognitive decomposition.\n-  Select architecture for software, communication, computation, perception, and simulation environment.\n-  Develop autonomous algorithms and associated software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate first round of evaluation in simulated environment and then in physical environment.\n-  Procure hardware and modify to enable demonstration of autonomy algorithms.\n-  Improve cloud-based simulation environment and conduct virtual trials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gremlin"
                                    },
                                    "Description": {
                                        "val": "The goal of the Gremlin program is to develop platform technologies that enable a new class of distributed warfare.  The Gremlin concept envisions small air-launched unmanned systems that can be responsively dispatched in volley quantity from commodity platforms, fly into contested airspace, conduct a moderate duration mission, and ultimately be recovered.  Key enabling technologies for the concept include smaller developmental payloads that benefit from multiple collaborating host platforms.  The Gremlin program will conduct risk reduction and development of the host platform launch and recovery capability and develop and demonstrate a recoverable UAV platform concept.  Enabling platform technologies will include precision relative navigation, advanced computational modeling, variable geometry stores, compact propulsion systems, and high speed digital flight control.  The program will leverage these technologies, perform analytic trade studies, conduct incremental development, and ultimately demonstrate the potential for an integrated air-launched Gremlin unmanned platform."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct exploratory trade studies to establish feasibility of technical approaches.\n-  Initiate studies on integration with existing Service systems and systems architectures.\n-  Study platform design trades and approaches to best meet performance goals at minimum cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vertical Take-Off and Landing (VTOL) Technology Demonstrator"
                                    },
                                    "Description": {
                                        "val": "The Vertical Take-Off and Landing (VTOL) Technology Demonstrator program will demonstrate revolutionary improvements in (heavier than air) VTOL air vehicle capabilities and efficiencies through the development of subsystem and component technologies, aircraft configurations and system integration. The program will build and flight test an unmanned 10,000 - 12,000 lb aircraft capable of sustained speeds in excess of 300 kt, demonstrate system level hover efficiency within 25% of the ideal, and a lift-to-drag ratio no less than ten.  Additionally, the demonstrator will be designed to have a useful load of no less than 40% of the gross weight.  A strong emphasis will be placed on the development of elegant, multi-functional subsystem technologies that demonstrate net improvements in aircraft efficiencies to enable new and vastly improved operational capabilities.  In FY 2016, VTOL Technology Demonstrator will be funded in PE 0603286E, Project AIR-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.951"
                                            },
                                            "Text": {
                                                "val": "-  Performed trade studies to refine configuration and subsystem designs.\n-  Defined software and hardware integration approaches and baseline controls necessary for successful air vehicle concept.\n-  Performed simulations to establish expected system level performance and validated the system concept and underlying enabling technologies.\n-  Conducted 3D, unsteady Computational Fluid Dynamics (CFD) analyses for design refinements and convergence.\n-  Utilized multi-point optimization techniques for design of subsystems and aerodynamics.\n-  Performed multiple sub-system, wind tunnel and aerodynamic tests utilizing rapid prototyping for design verification and validation.\n-  Evaluated performance capabilities, and conducted objective aircraft operational analyses.\n-  Evaluated technical and programmatic risk elements, defined mitigation plans and analyses of alternatives.\n-  Completed conceptual design of configurations and all subsystems.\n-  Refined and consolidated flight test and validation approaches, flight test missions, and test range requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.961"
                                            },
                                            "Text": {
                                                "val": "-  Initiate preliminary design of configuration and all subsystems.\n-  Hold system definition reviews to evaluate subsystem integration into air vehicle design and technology development paths to meet program objectives.\n-  Perform subscale wind tunnel and laboratory testing for aerodynamic data base and flight controls development.\n-  Refine power generation and distribution\/integration concepts.\n-  Perform propulsion and power system scaled model bench testing.\n-  Design and develop subscale flight models for configuration viability and control law validation.\n-  Conduct subscale model flight testing for controls development, verification, and validation.\n-  Validate computational performance predictions against empirical data.\n-  Refine full scale engine integration design.\n-  Continue preliminary design refinements leading toward detailed design of the demonstrator aircraft and associated subsystems.\n-  Create detailed system integration plans.\n-  Prepare detailed airworthiness and flight test preparation requirements in support of flight test schedule."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Petrel"
                                    },
                                    "Description": {
                                        "val": "The Petrel program will investigate and develop advanced capabilities for the rapid transport of large quantities of cargo and equipment, such as in support of the deployment of a heavy brigade combat team, from CONUS to the battlefield, reducing the deployment timeline for mechanized land forces and critical supplies anywhere in the world to under 7 days at a price point comparable or slightly in excess of conventional sealift.  Petrel will fill the niche between conventional airlift and sealift through development of a new transportation mode capable of high speed operation across the surface\/air interface over water as well as terrain.  Technical approaches for rapid transport across the ocean and movement from the ship to the tactical battlefield will consider traditional and non-traditional aerodynamic and hydrodynamic concepts as well as innovative uses of existing technologies. Primary technical goals for Petrel are to reduce or eliminate intermodal delays and to achieve a transport efficiency better than $0.1\/ton-mi."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted studies to refine the operational trade space, defined limits of current technology, and informed new technical approaches.\n-  Initiated concept designs focusing on transport efficiency, speed, and producibility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate component technologies with potential to enable specific concepts, including advanced propulsion and materials.\n-  Explore innovative approaches for significantly increasing lift to drag ratio.\n-  Evaluate approaches to rapidly deliver cargo and equipment directly from offshore to the battlefield without infrastructure.\n-  Complete initial Petrel studies and conceptual system design work."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK CENTRIC ENABLING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "75.784"
                        },
                        "CurrentYear": {
                            "val": "113.203"
                        },
                        "BudgetYearOne": {
                            "val": "148.338"
                        },
                        "BudgetYearOneBase": {
                            "val": "148.338"
                        },
                        "BudgetYearTwo": {
                            "val": "162.976"
                        },
                        "BudgetYearThree": {
                            "val": "157.150"
                        },
                        "BudgetYearFour": {
                            "val": "164.051"
                        },
                        "BudgetYearFive": {
                            "val": "202.614"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) intelligence networks; 2) open and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  The data processing efforts include: conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "XDATA"
                                    },
                                    "Description": {
                                        "val": "The XDATA program is developing computational techniques and software tools for analyzing large volumes of data, both semi-structured (e.g., tabular, relational, categorical, metadata, spreadsheets) and unstructured (e.g., text documents, message traffic).  Central challenges addressed include a) development of scalable algorithms for processing imperfect data in distributed data stores, and b) creation of effective human-computer interaction tools for facilitating rapidly customizable visual reasoning for diverse missions.  The program has developed open source software toolkits that enable flexible software development supporting users processing large volumes of data in timelines commensurate with mission workflows of targeted defense applications.  An XDATA framework supports minimization of design-to-deployment time of new analytic and visualization technologies on diverse distributed computing platforms, and also accommodates changing problem spaces and collaborative environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.800"
                                            },
                                            "Text": {
                                                "val": "-  Developed a framework for processing data from diverse sources with advanced analytics and visualization for diverse missions and platforms.\n-  Developed and demonstrated analytic tools for temporal and pattern analysis on data approaching petabyte scale.\n-  Initiated methods for uncertainty representation, processing, propagation, and visualization.\n-  Developed methods for dimensionality reduction for faster approximate processing with characterized accuracy.\n-  Developed adaptive visualization methods for large data for varying users and contexts.\n-  Developed an integrated framework for rapidly implementing analytics on a given computational platform with the ability to systematically trade off processing time and accuracy.\n-  Demonstrated end-to-end systems in transactional problem domains from multiple defense mission areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.217"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods for interactive, iterative, and distributed analysis of diverse data at petabyte scale.\n-  Optimize analytic methods and software for implementation on heterogeneous platforms and operating environments.\n-  Optimize visualization technology to rapidly adapt to a new mission and context.\n-  Demonstrate the initial implementation of a rich library of software tools for rapid use in mission and user specific contexts.\n-  Demonstrate end-to-end systems on data and problems of end users from DoD, intelligence, and law enforcement communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.717"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods and software for interactive, iterative, distributed analysis of diverse data enabling transition, integration and implementation on heterogeneous platforms.\n-  Develop new analytic methods for distributed data and systems through the development of enhanced machine learning and algorithmically scalable methods.\n-  Develop a scalable, robust framework for user-defined, adaptable visualizations.\n-  Develop, test and benchmark a library of user interfaces which provide a consistent user experience independent of scale or processor heterogeneity.\n-  Demonstrate that applications deployed from a library of interfaces reduce design to testing time and increase reusability of components across multiple mission systems and user-defined requirements.\n-  Explore additional infrastructure and computing architectures where disparate components reside in order to demonstrate the implementation of a rich, reusable library of software tools for rapid use in multiple missions and user specific contexts.\n-  Develop a process for transition, exploring the benefits and limitations of embedded support to transition end-to-end systems, components, platforms and operating environments to identified end user communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Defense"
                                    },
                                    "Description": {
                                        "val": "The Network Defense program will develop technologies to detect network attacks using network summary data. U.S. computer networks are continually under attack, and these attacks are typically handled by individual organizations as they occur.  Analyzing network summary data across a wide array of networks will make it possible to identify trends and patterns visible only when the data is viewed as a whole and to detect recurring threats, patterns of activity, and persistent vulnerabilities.  Network Defense will develop novel algorithms and analysis tools that enable a big picture approach for identifying illicit behavior in networks.  This analysis and subsequent feedback to system administrators, security engineers, and decision makers will enhance information security in both the government and commercial sectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed analytics that detect structured network attacks within a single network.\n-  Developed tailored algorithms to detect recurring threats on a single network.\n-  Created a corpus of realistic benign and threat network data for test and evaluation of candidate techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.500"
                                            },
                                            "Text": {
                                                "val": "-  Enhance network analytics to detect structured attacks across multiple networks.\n-  Create general purpose algorithms for detecting novel classes of attacks across multiple networks.\n-  Develop methods for identifying persistent vulnerabilities within a network and across multiple networks.\n-  Evaluate and optimize techniques on realistic network data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.002"
                                            },
                                            "Text": {
                                                "val": "-  Develop algorithms that use scanning events to provide indications and warning of coordinated adversary activities.\n-  Enhance persistent vulnerability detection techniques and work with potential users to identify vulnerabilities particular to individual organizations\/networks and\/or shared by multiple organizations\/networks.\n-  Demonstrate the capability to use summary information about an attack on one network to automatically detect similar attacks on other networks.\n-  Transition capabilities to U.S. government and defense industrial base organizations\/networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Memex"
                                    },
                                    "Description": {
                                        "val": "The Memex program will develop the next generation of search technologies to revolutionize the discovery, organization, and presentation of domain-specific content.  Current search technologies have limitations in search query format, retrieved content organization, and infrastructure support and the iterative search process they enable is time-consuming and inefficient, typically finding only a fraction of the available information.  Memex will create a new domain-specific search paradigm to discover relevant content and organize it in ways that are more immediately useful to specific missions and tasks.  In addition, Memex domain-specific search engines will extend the reach of current search capabilities to the deep web and non-traditional content.  Memex technologies will enable the military, government, and commercial enterprises to find and organize mission-critical information on the Internet and in large intelligence repositories.  Anticipated mission areas include counter-terrorism, counter-drug, anti-money-laundering, and anti-human-trafficking, with transition partners from DoD and other U.S. government activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conceptualized and designed initial search architectures to support domain-specific search in high priority mission areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.758"
                                            },
                                            "Text": {
                                                "val": "-  Develop domain-specific search engines to automatically discover, access, retrieve\/extract, parse, process, analyze, and manage web content in specified domains.\n-  Implement the capability to index deep web and non-traditional structured and unstructured content that is dynamically-generated, unlinked, and in unconventional formats.\n-  Develop information extraction techniques to categorize and classify discovered content based on mission\/user task requirements.\n-  Develop dynamic, interactive, and collaborative user interface capabilities to support the needs of specialized users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.300"
                                            },
                                            "Text": {
                                                "val": "-  Develop specialized search techniques for information discovery in social media. \n-  Develop advanced content discovery, deep crawling, information extraction, and information relevance algorithms to support domain specific search.\n-  Integrate and evaluate multiple end-to-end operational prototypes with automated, user, and team guided methods for web content analysis.\n-  Conduct system evaluation with feedback from operational partners and transition mature capabilities for use in operational settings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Battle Management (DBM)"
                                    },
                                    "Description": {
                                        "val": "The Distributed Battle Management (DBM) program will develop mission-driven architectures, protocols, and algorithms for battle management (BM) in the contested environment.  The military is turning to networked weapons and sensors on-board a heterogeneous mix of multi-purpose manned and unmanned systems.  In contested environments, it is a challenge for BM networks to communicate with subordinate platforms due to extensive adversarial cyber and electronic warfare operations, anti-satellite attacks, and the need for emissions control in the face of a formidable integrated air defense system.  The Distributed Battle Management program will seek to develop a distributed command architecture with decentralized control of mission-focused asset teams.  The architecture will enable rapid reaction to ephemeral engagement opportunities and maintain a reliable BM structure, despite limited communications and platform attrition in continuously evolving threat environments.  The program will incorporate highly automated decision making capability while maintaining vital human-on-the-loop operator approval."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed architecture and concept of operations (CONOPS) for teams of manned and unmanned platforms coordinating to accomplish a mission in a denied environment.\n-  Developed a simulation environment in parallel with technology development.\n-  Developed detailed requirements and initiated system engineering for a mission-focused team-level distributed battle management system intended to operate in the denied environment.\n-  Explored and evaluated alternative architectures and cooperative control algorithms for team-level autonomy in a denied environment, as well as approaches for interacting with a human operator, and options for inserting software in operational platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.024"
                                            },
                                            "Text": {
                                                "val": "-  Develop detailed system architecture for the distributed battle management system.\n-  Develop workflow and CONOPS for the human operator to interact with the battle management system.\n-  Develop and prototype the protocols and algorithms for distributed battle management in a denied environment.\n-  Stand-up modeling and simulation capability for test and performance evaluation and begin testing of prototype architecture and algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete design of the overall DBM system, to include architecture, software components, CONOPS, and integration strategy for expected host platforms.\n-  Implement initial version of the DBM system architecture and software.\n-  Demonstrate initial version's capabilities in a simulated battle environment with impaired communications and loss of critical resources.\n-  Update DBM initial version to accommodate changes and new versions of software modules."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantitative Methods for Rapid Response (QMRR)"
                                    },
                                    "Description": {
                                        "val": "The Quantitative Methods for Rapid Response (QMRR) program develops and applies big data analysis and visualization methodologies for rapidly emergent U.S. national security priorities.  As was shown by the Nexus 7 experience in Afghanistan, big data presents an opportunity to better understand the true nature of non-traditional threats, track the effectiveness of remedial measures, and develop\/optimize alternative strategies; QMRR extends that work. Recently we have seen the rise of extremely challenging non-traditional threats such as ISIL and Ebola.  In the case of ISIL, in addition to countering their military actions on the battlefield, it is important to limit the effectiveness of their recruitment efforts.  Since ISIL recruiting is largely web-based, this implies the need to monitor ISIL public messaging in social media and private messaging on the dark web.  Ebola presents related, but somewhat different challenges, specifically, finding patterns in the spread of the disease and factors that favor\/mitigate its development.  There is also interest in quantitative methods for countering proliferation of weapons of mass terrorism.  The work conducted under the program will be coordinated with and transitioned to multiple national security agencies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.600"
                                            },
                                            "Text": {
                                                "val": "-  Develop quantitative models to track the development of ISIL force structure, funding, and logistics.\n-  Develop quantitative models to track the spread of ISIL ideology with emphasis on the roles of social media and the dark web.\n-  Develop quantitative models to track the spread of Ebola with emphasis on social and economic factors.\n-  Develop quantitative models to track the proliferation of weapons of mass terrorism.\n-  Coordinate with stakeholders in national security agencies and develop mechanisms for transitioning technology to operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.588"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.588"
                                            },
                                            "Text": {
                                                "val": "-  Refine quantitative models to track the development of ISIL force structure, funding, and logistics.\n-  Refine quantitative models to track the spread of ISIL ideology with emphasis on the roles of social media and the dark web.\n-  Refine quantitative models to track the spread of Ebola with emphasis on social and economic factors.\n-  Refine quantitative models to track the proliferation of weapons of mass terrorism.\n-  Transition technology to operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Machine Intelligence (UMI)"
                                    },
                                    "Description": {
                                        "val": "The Understanding Machine Intelligence (UMI) program will develop techniques that enable artificial intelligence (AI) systems to better support users through transparent operation.  In the future, the U.S. military will encounter adversary systems that are AI-enabled.  Maintaining \"AI-superiority\" will require AI-enabled systems capable of performing increasingly complex functions with high degrees of reliability and safety.  Significantly, in order for developers and users to feel confident enough to deploy and use AI-enabled systems, these systems must operate with a high degree of transparency.  UMI will develop AI technologies that support transparency by providing supporting rationale and logic sequences to clarify the basis for and reliability of outputs.  In addition, efforts will be made to develop a mathematically rigorous virtual stability theory for AI-enabled systems analogous to the (conventional) stability theory developed for dynamical systems (solutions to systems of differential equations).  Such a virtual stability theory will enable the creation of feedback mechanisms that flag and interrupt anomalous outputs and behaviors.  UMI implementations will be developed and demonstrated in next-generation systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.731"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.731"
                                            },
                                            "Text": {
                                                "val": "-  Formulate approaches for AI systems to explain their behavior and clarify the basis for and reliability of outputs.\n-  Develop automated drill-down techniques that provide users with logic\/data that drives AI system outputs\/behaviors.\n-  Develop a mathematically rigorous virtual stability theory for AI-enabled systems analogous to the (conventional) stability theory developed for dynamical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visual Media Reasoning (VMR)"
                                    },
                                    "Description": {
                                        "val": "The Visual Media Reasoning (VMR) program is creating technologies to automate the analysis of enemy-recorded photos and videos and identify, within minutes, key information related to the content.  This includes the identification of individuals within the image (who), the enumeration of the objects within the image and their attributes (what), and the image's geospatial location and time frame (where and when).  Large data stores of enemy photos and video are available but cannot be easily leveraged by a warfighter or analyst attempting to understand a specific new image in a timely fashion.  The VMR program will enable users to gain insights rapidly through application of highly parallelized image analysis techniques that can process the imagery in massive distributed image stores.  VMR technology will serve as a force-multiplier by rapidly and automatically extracting tactically relevant information and alerting the analyst to scenes that warrant the analyst's expert attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Optimized the core reasoning engine to make reliable inferences across the Who, What, Where and When domains to produce more accurate answers to warfighter and intelligence analyst queries.\n-  Extended indexing to video clips.\n-  Enhanced detection of the geo-physical content of images: water, desert, urban, interior, etc.\n-  Implemented image\/video frame triage so reasoning is applied to scene-like images only.\n-  Delivered an experimental prototype for evaluation by the National Media Exploitation Center (NMEC) as a potential transition partner, and received inquiries from over 20 different federal groups interested in the technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.104"
                                            },
                                            "Text": {
                                                "val": "-  Configure the reasoning engine so the user can customize selected reasoning assumptions, such as typical vehicle size, to enhance query results for specific applications.\n-  Include mechanisms for technical users to add new computer vision algorithms to the system.\n-  Provide a quantified level of performance to show the advantage of multi-algorithm reasoning versus a single-algorithm approach.\n-  Deliver robust full-featured prototypes to NMEC and the FBI as transition products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nexus 7"
                                    },
                                    "Description": {
                                        "val": "The Nexus 7 program applied forecasting, data extraction, and analysis methodologies to develop tools, techniques, and frameworks for the automated interpretation, quantitative analysis, and visualization of social networks.  Social network theory has emerged in recent years as a promising approach for understanding groups of individuals connected through a variety of shared interests and collaborative activities.  For the military, social networks provide a promising model for understanding terrorist cells, insurgent groups, and other stateless actors whose connectedness is established not on the basis of shared geography but rather through the correlation of their participation in coordinated activities such as planning meetings, training\/mission rehearsal sessions, sharing of materiel\/funds transfers, etc.  Nexus 7 supported emerging military missions using both traditional and non-traditional data sources for those areas of the world and mission sets with limited conventional Intelligence, Surveillance and Reconnaissance.  Examples of additional data sources included foreign news, media, and social network data.  These non-traditional sources were integrated with a wide variety of military structured and unstructured data.  Nexus 7 developed quantitative techniques and tools for processing and analyzing these large data sources as a means for understanding relationships between hostile, neutral, and friendly foreign organizations with the United States."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.984"
                                            },
                                            "Text": {
                                                "val": "-  Developed quantitative techniques and tools for processing, analyzing, and visualizing increasingly large volumes of cyber-social data.\n-  Created and deployed analytics for emerging DoD mission areas to Combatant Commands and other U.S. Government agencies.\n-  Completed drawdown of forward deployed analytical cell in Afghanistan.\n-  Transitioned suite of algorithms, software, and tools throughout DoD including DCGS-Army."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}