{
    "id": "b33cf70e129d711cfef8b4df807ae04864ebb37e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305207F"
        },
        "ProgramElementTitle": {
            "val": "Manned Reconnaissance Systems"
        },
        "R1LineNumber": {
            "val": "210"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.491"
            },
            "CurrentYear": {
                "val": "13.516"
            },
            "BudgetYearOne": {
                "val": "13.245"
            },
            "BudgetYearOneBase": {
                "val": "13.245"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "14.184"
            },
            "BudgetYearThree": {
                "val": "14.366"
            },
            "BudgetYearFour": {
                "val": "14.462"
            },
            "BudgetYearFive": {
                "val": "14.720"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.491"
                },
                "CurrentYear": {
                    "val": "13.516"
                },
                "BudgetYearOne": {
                    "val": "13.767"
                },
                "BudgetYearOneBase": {
                    "val": "13.767"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.491"
                },
                "CurrentYear": {
                    "val": "13.516"
                },
                "BudgetYearOne": {
                    "val": "13.245"
                },
                "BudgetYearOneBase": {
                    "val": "13.245"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.522"
                },
                "BudgetYearOneBase": {
                    "val": "-0.522"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.522"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.522"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674754"
                    },
                    "ProjectTitle": {
                        "val": "RC-135 Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.491"
                        },
                        "CurrentYear": {
                            "val": "13.516"
                        },
                        "BudgetYearOne": {
                            "val": "13.245"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.245"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.184"
                        },
                        "BudgetYearThree": {
                            "val": "14.366"
                        },
                        "BudgetYearFour": {
                            "val": "14.462"
                        },
                        "BudgetYearFive": {
                            "val": "14.720"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The RC-135 operational systems development and enhancement activities support the design studies, engineering analysis, non-recurring engineering, and other efforts associated with the integration and modification of the RC-135 programs and their specialized mission systems, both air and ground.  Extensive utilization of Commercial-Off-The-Shelf (COTS) based solutions allows rapid fielding of needed capabilities through continuous technology refresh cycles and Diminishing Manufacturing Sources (DMS)\/Vanishing Vendor Items (VVI) logistics mitigation efforts.  The results of these efforts provide for preliminary assessments of technical feasibility, operability, or military utility as well as specific engineering implementations for integration into the various systems baseline configurations.  \n\nThese activities are managed by the Air Force through the 645th Aeronautical System Group (645 AESG).  The SPO manages engineering, ground and support systems modifications, integration, flight testing, product assurance, acceptance testing, logistics, and training activities.  \n\nAircraft, sensor systems, and associated ground support system engineering planned for FY 2016 include support for the RC-135V\/W RIVET JOINT Baseline 12 and 13, the RC-135U COMBAT SENT Baseline 5, and the RC-135S COBRA BALL Baseline 5 configurations.  The world-wide challenge of keeping pace against technologically agile targets used by both nation and non-nation-state adversaries and the rapid evolution of COTS technologies demands a responsive and adaptive acquisition strategy for fielding baseline capabilities that are logistically supportable at all locations.  BIG SAFARI uses an incremental baseline strategy to mitigate risk, find affordable solutions and field needed capabilities on the aircraft and ground support and training systems.  Obsolescence and DMS\/VVI logistical concerns are addressed with each baseline upgrade strategy and annually as part of the fleet sustainment responsibilities.  \n\nRIVET JOINT Baseline 12 upgrades consist of, but are not limited to, increased digital signal exploitation, increased digital signal recorder bandwidth, enhanced spatial processing\/exploitation, enhanced weather radar, digitally enhanced electronic flight instrument system (EFIS), AF-DCGS interoperability, operator work station 3-D map projection, enhanced operator reporting management tools, modernized communications security (COMSEC) protocols, and a new steerable beam antenna.  RIVET JOINT Baseline 13 upgrades consist of, but are not limited to, providing a continuous recording capability, Super Wideband Compressive Receiver (SWCR) and Nyquist Folding Receiver (NYFR), global air traffic management (GATM) avionics upgrades (e.g. new autopilot), Mode 5 identify friendly or foe (IFF) system, and family of beyond-line-of-sight terminals (FAB-T) advanced extremely high frequency (AEHF) communications suite. \n\nCOMBAT SENT Baseline 5 upgrades consist of, but are not limited to, continued Communications, Navigation and Surveillance\/Air Traffic Management (CNS\/ATM) and Required Navigational Performance (RNP) compliant cockpit avionics enhancements, active ranging and theater networked geo-location (TNG) capability, Proforma search and classification tools, cooling duct and lighting improvements, CORVUS related precision electronic intelligence (ELINT) SWCR enhancements, RJ Baseline 13 communications intelligence (COMINT), upgraded computer architecture, primary sensor measurement system (PRISMS), wideband global satellite (WGS) communications enhanced integration, development of an airborne tracking system, and communications upgrade to include Multifunctional Information Distribution System Joint Tactical Radio System (MIDS-J).\n\nCOBRA BALL Baseline 5 upgrades consist of, but are not limited to, RJ Baseline 11 COMINT, Medium-Wave Infra-Red Acquisition (MIRA) sensor\/processor upgrade, measurements and signature intelligence (MASINT) Collection System (MCS) optical upgrade, WGS communications enhanced integration, communications upgrades to include MIDS-J and an intercom system (FORCE), U-Band antenna, continued CNS\/ATM and RNP compliant cockpit avionics enhancements and foreign instrumentation intelligence (FISINT) system refresh.         \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.  \n\nThis program is in Budget Activity 7, Operational Systems Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production fielding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Baseline Configuration Development"
                                    },
                                    "Description": {
                                        "val": "Non-recurring engineering (NRE) for Baseline system developments and enhancements to improve mission capabilities of the RIVET JOINT Baselines 12 and 13 (BL-12 and BL-13), COMBAT SENT Baseline 5 (BL-5) and COBRA BALL Baseline 5 (BL-5)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.491"
                                            },
                                            "Text": {
                                                "val": "Supported design studies, engineering analysis, NRE and other efforts associated with the integration and modification of the RC-135 programs (RJ BL-12 and BL-13, CS BL-5, and CB BL-5) and their specialized mission systems for the collection of both air and ground signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.516"
                                            },
                                            "Text": {
                                                "val": "Continue to support design studies, engineering analysis, NRE and other efforts associated with the integration and modification of the RC-135 programs and their specialized mission systems for the collection of both air and ground signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.245"
                                            },
                                            "Text": {
                                                "val": "Will continue to support design studies, engineering analysis, NRE and other efforts associated with the integration and modification of the RC-135 programs and their specialized mission systems for the collection of both air and ground signals."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: DARP01"
                                    },
                                    "Title": {
                                        "val": "Modification of Inservice Aircraft"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "174.513"
                                        },
                                        "CurrentYear": {
                                            "val": "152.746"
                                        },
                                        "BudgetYearOne": {
                                            "val": "156.165"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "156.165"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "199.323"
                                        },
                                        "BudgetYearThree": {
                                            "val": "202.851"
                                        },
                                        "BudgetYearFour": {
                                            "val": "186.275"
                                        },
                                        "BudgetYearFive": {
                                            "val": "189.628"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: DARP01"
                                    },
                                    "Title": {
                                        "val": "Aircraft Spares and Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.280"
                                        },
                                        "CurrentYear": {
                                            "val": "57.119"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.106"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.106"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.632"
                                        },
                                        "BudgetYearThree": {
                                            "val": "49.407"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.331"
                                        },
                                        "BudgetYearFive": {
                                            "val": "51.237"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA04: 846070"
                                    },
                                    "Title": {
                                        "val": "Defense Airborne Recce Projects (DARP) RC-135"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.577"
                                        },
                                        "CurrentYear": {
                                            "val": "24.710"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.237"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.237"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.700"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.153"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.620"
                                        },
                                        "BudgetYearFive": {
                                            "val": "27.099"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E: BA07: PE 0304260F"
                                    },
                                    "Title": {
                                        "val": "RC-135 Airborne SIGINT Enterprise Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.331"
                                        },
                                        "CurrentYear": {
                                            "val": "15.007"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.025"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.025"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.436"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.972"
                                        },
                                        "BudgetYearFour": {
                                            "val": "51.864"
                                        },
                                        "BudgetYearFive": {
                                            "val": "58.852"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RC-135 RIVET JOINT, COBRA BALL, and COMBAT SENT configured aircraft are maintained and kept technologically relevant through a baseline or incremental upgrade acquisition strategy.  Technology refresh and quick reaction capability (QRC) developments are acquired through the 645th AESG in accordance with the BIG SAFARI Program Management Directive (PMD) and Class Justification and Approval (J&A) document for acquisition of supplies and services using an \"other than full and open competition\" criteria.  The supplies and services procured by 645 AESG satisfy National Security requirements (FAR 6.302-6) through the use of their standing J&A or address Unusual and Compelling Urgency requirements (FAR 6.302-2) through an individually prepared J&A supported by the BIG SAFARI Life Cycle Management Plan (LCMP) across the full spectrum of system life cycle management from developmental engineering to system retirement (\"cradle to grave\") support.  Due to the rapidly changing threat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging Combatant Commander (COCOM) and\/or Intelligence Community (IC) requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "RC-135 Program Manager has determined that PMA will be funded with RIVET JOINT APAF appropriation and included in the P-Doc, Mod 4263."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "All activity is based around the Programmed Depot Maintenance (PDM) airframe and missions systems schedule which includes multiple contracts and organizations with overlapping and continuous periods of performance.  Due to the rapidly changing threat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging COCOM and\/or IC requirements."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Aircraft Modifications"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 Com"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Greenville, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.491"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.516"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.245"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.245"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 10 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 11 Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 12 Development, Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RIVET JOINT Baseline 13 Development, Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT SENT Baseline 5 Development, Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT SENT Baseline 6 Development, Integration and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COBRA BALL Baseline 4 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COBRA BALL Baseline 5 Development, Integration, Test and Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COBRA BALL Baseline 6 Development, Integration and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Systems Baseline 11 Integration and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Systems Baseline 12 Integration and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}