{
    "id": "b6ffe1927f07758c75d55f6b7760f18267971bff",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "98.558"
            },
            "PriorYear": {
                "val": "59.996"
            },
            "CurrentYear": {
                "val": "90.966"
            },
            "BudgetYearOne": {
                "val": "157.056"
            },
            "BudgetYearOneBase": {
                "val": "157.056"
            },
            "BudgetYearTwo": {
                "val": "119.714"
            },
            "BudgetYearThree": {
                "val": "97.634"
            },
            "BudgetYearFour": {
                "val": "76.962"
            },
            "BudgetYearFive": {
                "val": "49.709"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "P350 is a new project number in this budget cycle.  Funding for the Institutes for Manufacturing Innovation was included in the FY 2015 President's Budget in P680, and has now been extracted for clarity."
        },
        "ProgramElementMissionDescription": {
            "val": "Defense-wide Manufacturing Science and Technology (DMS&T), established within the Manufacturing Technology Program directed in Title 10 USC Section 2521, provides the Department with a comprehensive manufacturing program to achieve the strategic goals of focused technology, improved acquisition across the life cycles, and cost-effective logistics.  By designing for manufacturability early in development, anticipated results will have an impact on increasing reliability and decreasing the life cycle burden of weapon systems. The mission to anticipate and close gaps in defense manufacturing capabilities and drive significant system life cycle affordability benefits makes DMS&T an increasingly important leveraging tool in the current budget environment.\n\t\t\t\nDMS&T will: 1) address manufacturing enterprise game-changing initiatives that are beyond the scope of any one Military Department or Defense Agency or platform and, 2) establish and mature cross-cutting manufacturing processes required for transitioning emerging technologies which impact the time lines, affordability, and productivity of acquisition programs and shorten the deployment cycle times.\n\t\t\t\nThe DMS&T program is fundamental to a coordinated development process.  Concurrent development of manufacturing processes with the S&T development enables the use of emerging technologies.  Key technical areas for investment for DMS&T include Advanced Electronics and Optics Manufacturing, Advanced Materials Manufacturing, and Enterprise and Emerging Manufacturing.  Advanced Electronics and Optics addresses advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Advanced Materials addresses advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include the industrial information infrastructure, advanced design\/qualification\/cost tools, supply network integration technologies and management practices, direct digital (or additive) manufacturing, machining; robotics, assembly, and joining.\n\nInstitutes for Manufacturing Innovation program funding is also included in this program element (first addressed in the FY 2015 President’s Budget). Technical innovation and leadership in manufacturing are essential to sustaining the foundations of economic prosperity to enable our military to maintain technological advantage and global dominance. To support these goals, Institutes for Manufacturing Innovation (IMI) will serve as regional hubs to accelerate technological innovation into commercial application and concurrently develop the educational competencies and production processes via shared public-private sectors.  The establishment of the IMIs, supported by resources from multiple U.S. Government agencies, will spur industry cost-share for manufacturing innovation and quickly develop a pathway for technology-focused regional hubs for collaboration among government, industry, and academia that will meet critical government and Warfighter needs. The concept of these institutes is described in the President’s National Science and Technology Council report by the Advanced Manufacturing National Program Office entitled, “National Network for Manufacturing Innovation: A Preliminary Design,” published in January 2013."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.014"
                },
                "CurrentYear": {
                    "val": "91.095"
                },
                "BudgetYearOne": {
                    "val": "62.640"
                },
                "BudgetYearOneBase": {
                    "val": "62.640"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.996"
                },
                "CurrentYear": {
                    "val": "90.966"
                },
                "BudgetYearOne": {
                    "val": "157.056"
                },
                "BudgetYearOneBase": {
                    "val": "157.056"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.982"
                },
                "CurrentYear": {
                    "val": "-0.129"
                },
                "BudgetYearOne": {
                    "val": "94.416"
                },
                "BudgetYearOneBase": {
                    "val": "94.416"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.028"
                    },
                    "CurrentYear": {
                        "val": "-0.129"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.990"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Baseline Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.250"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.250"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.446"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.446"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "P350 Institutes for Manufacturing Innovation"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "95.112"
                                },
                                "BudgetYearOneBase": {
                                    "val": "95.112"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "P350 Institutes for Manufacturing Innovation in FY 2016 $95.112 adjustment: Incorporates phased funding for six institutes, three established as of FY2014, two established in FY 2015, and one to be established in FY 2016.\n\nFY 2014 $3.0 below threshold reprogramming within AT&L resources to fund P350 Institutes for Manufacturing Innovation requirements.\n\nCongressional General Reductions in both FY 2014 and FY 2015 are for FFRDC."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "65.420"
                        },
                        "PriorYear": {
                            "val": "45.697"
                        },
                        "CurrentYear": {
                            "val": "19.845"
                        },
                        "BudgetYearOne": {
                            "val": "20.245"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.245"
                        },
                        "BudgetYearTwo": {
                            "val": "20.911"
                        },
                        "BudgetYearThree": {
                            "val": "22.078"
                        },
                        "BudgetYearFour": {
                            "val": "23.798"
                        },
                        "BudgetYearFive": {
                            "val": "24.188"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DMS&T program has a two-pronged approach: 1) technology initiatives and 2) specific single projects.  Technology initiatives, in collaboration with the Joint Defense Manufacturing Technology Panel (JDMTP) and industry, identify and develop investment strategies to advance the manufacturing processes needed to support the specific technology.  Above-the-shop-floor investments focus on new manufacturing processes that have potential to significantly improve manufacturing efficiencies. Single specific projects address investment opportunities not associated with selected technology initiatives and enable the program to respond to urgent, compelling manufacturing needs and provide seed funding to more high risk-high payoff technologies.\n \t\t\t\nData calls are launched through two methods to identify technology initiatives and single specific issues requiring investment.  One method is through the JDMTP.  The JDMTP is comprised of the ManTech Directors from the Services, Defense Logistics Agency, and Office of Secretary of Defense (OSD).  The call is distributed through the ManTech Directors to the four JDMTP sub panels: Metals Processing and Fabrication Subpanel, Composites Processing and Fabrication Subpanel, Electronics Processing and Fabrication Subpanel, and Advanced Manufacturing Enterprise Subpanel. Potential candidates are evaluated by the JDMTP based on criteria set forth in the call and announcements, and then down-selected for further development prior to final selection.  The other method is through Broad Agency Announcements to industry.  Priority is given to investments that support affordability and producibility of critical enabling manufacturing technologies that cut across multiple platforms.  Investments also balance defense priorities in specialty materials, electronics, propulsion and power, and manufacturing processes including \"above the shop floor\" (lean and business technologies facilitating interoperable manufacturing).  Final projects are selected by the OSD ManTech Director, considering input from the JDMTP and Director of Manufacturing, and as approved by Deputy Assistant Secretary of Defense, Manufacturing and Industrial Base Policy (MIBP).  Technology initiatives and projects are executed at the Component level."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Industrial Base Innovation Fund (IBIF)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Cyber Security for the Shop Floor – Phase I: FY 2014 effort jointly resourced with IBIF and core funds.  See project description above under project title “Enterprise and Emerging Manufacturing.”\n\nHigh Power Ultrasonic Assisted Drilling: FY 2014 effort jointly resourced with IBIF and core funds.  See project description above under project title “Enterprise and Emerging Processes.” \n\nImproved Focal Plane Array (FPA) Production – Hyperspectral (HIS) - Phase I: FY 2014 effort jointly resourced with IBIF and core funds.  See project description above under project title “Advanced Electronics and Optics.” \n\nLarge Affordable Substrates - Phase II Space Applications: Developed a domestic capability to produce cadmium zinc telluride (CZT) and enabled a second source of substrate material for mercury cadmium telluride (HgCdTe) infrared focal plane arrays for space applications.\n\nLarge Scale Encapsulate Ceramics – Phase I: FY 2014 effort jointly resourced with IBIF and core funds.  See project description above under project title “Advanced Materials Manufacturing.” \n \nOn Tool Inspection for Automated Fiber Placement: Automated fiber placement inspection using sensors mounted on the fiber placement head. Replaced manual inspection processes which are time-consuming, dependent on inspector alertness, and expensive. Provided a basis for a commercially-viable product to be applied in the production of aircraft. Generated significant improvement in detection capability (from <95% to >95%), increased inspection rate (.25 square meter\/min to 2 square meter\/min), and generated electronic tracking for reduction of paper and quality trending.\n\nOrganic Light Emitting Diode (OLED) Microdisplays - Phase I: FY 2014 effort jointly resourced with IBIF and core funds.  See project description above under project title “Advanced Electronics and Optics.” \n\nRadar Affordability Initiative: Reduced development and acquisition cost for multiple radar & EW systems. These improvements in design and processing will result in a cost savings of greater than 20% per module: AN\/TPS-80 savings of $1M per radar; $39M for FRP Lot 2 (39 radars); AN\/TPQ-50 savings of $200K per radar. \n\nScalable Optical Network Producibility: Created a design approach using noval components and fiber fabric for the F-35 EW system that generates significantly lower production and maintenance costs throughout the life of the F-35 program. Enhanced the implementation of single mode analog and digital fiber optic architecture to support legacy system updates to platforms such as F-22 and F-18. \n\nSolid Rocket Motor Digital Factory: Improved the capability for production surge on multiple workloads, generating a targeted 20% cost reduction that immediately impacts future workloads.\n\nTransparent Ceramic Blast Shield: Improved transparent spinel powder processing, green forming, densification, and finishing processes to produce 1.5 ft2 size transparent armor parts.  Incorporated the spinel parts into a new armor system.\n\nManufacturability of Vertical-Cavity Surface Emitting Lasers (VCSEL) Phase I: FY 2014 effort jointly resourced with IBIF and core funds.  See project description above under project title “Advanced Electronics and Optics.”"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electronics and Optics"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics and Optics is a series of efforts addressing advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Focal points are productivity and efficiency gains in the defense manufacturing base to accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nFuture efforts will focus on advances in fuel cells, radars, conformal sensors, and solder free electronics.\n\nIncreased Thickness for Large Sheet Edge Defined Film-Fed Growth (EFG) Sapphire Production (FY 2016): Establish a repeatable process capable of producing finished sapphire windows with the following dimensions: 13.5” x 24” 0.5”. Sapphire sheet production process improvements will transition to current and next generation DoD applications. Applications include F-35 Electro-Optical Targeting System (EOTS), High Mobility Artillery Rocket System (HIMARS), UCLASS, DDG-1000, and other programs that use sapphire panels.\n\nSilicon Carbide (SiC) High Efficiency Power Switches (FY 2014-2016): Enable a new class of power electronics that allows flexible new architectures at higher voltages, higher frequencies, less volume and weight, higher temperatures, higher efficiency (reduced fuel consumption), and better power quality that allow flexible architectures with enhanced electronics in a smaller footprint. Demonstrated on a naval power conditioning application reduced the weight by 90% and volume by 30%. Reduce high voltage pulsed diode $\/Amp from $0.40 at 6kv to $0.27 at >20kV. Applications include Army - Ground Combat Vehicle (PEO GCS, PM-GCV); Navy - DDG51 Flight III (Electric Ships Office, PMS-320); and Air Force – F-35, F-22 (MEA & F-35 Offices).\n\nMini Short-wave Infrared (SWIR) Cameras and Imagers (FY 2014-2016): Expedite the transition of 10 um (TEC)-less SWIR cameras to the warfighter and develop wafer level processing techniques to improve yield and reduce contaminants in the SWIR focal plane array (FPA)\/ camera assembly. Will establish the industrial base for SWIR technology systems and components. Reduced unit cost allows more individuals to carry imagers; 6x improved cost, reduced from $30K to $5K; 3x reduced size from 3cm3 to 1 cm3; 3x reduced weight from 120 g to 40 g. Applications include COSI, INOD, COS3, AWST, Joint Effect Targeting System (JETS), IDNST, PAWS, and MTS-B.\n\nMini Vis - SWIR Cameras and Imagers (FY 2015\/2016): Develop a manufacturing capability to produce one camera that can see the entire spectral band of Visible, Near Infrared (NIR), and Short-wave Infrared (SWIR); while being compatible with visible, NIR, and SWIR laser pointers and illuminators. Applications include: COSI, INOD, COS3, Advanced Weapon Sight Technology (AWST), Joint Effect Targeting System (JETS), Integrated Day\/Night Sight Technology (IDNST), PAWS, and Multispectral Targeting System (MTS-B).\n\nManufacturability of Vertical Cavity Surface Emitting Lasers (VCSELs) – Phase I (FY 2014\/2015) (FY 2014 effort jointly resourced with Industrial Base Innovation Funds.) Develop better performance for laser sights, laser illuminators, and laser designators as measured by Size, Weight and Power and wider scale deployment of critical laser-based systems due to lower cost. Provide clearer illumination critical for positive Identification Friend vs. Foe, facial ID, weapons ID; covert wavelengths (808, 850, 975 and 1064 nm, + 1550 nm); improve packaging (10-100x smaller and lighter products); increase reliability (10,000 hrs.). Applications include PUMA, RAVEN, TigerShark, Anubis, Spectre-FINDER, Speckles, TigerMoth, WAAS, PAWS, IPODS, AngelFire, MAV-OBAT, nLoss, LOS-short, CLRF, Joint Effect Targeting System (JETS), IDNST, TLDS, Big Safari, OEF, OIF,  STINGER, ARGUS, and others.\n\nManufacturability of Vertical Cavity Surface Emitting Lasers (VCSELs) – Phase II (FY 2016): Develop the capability to produce a Multi-Function Laser Illuminator and Pointer that delivers the functionality of five different devices (Green, NIR, and Short-wave Infrared (SWIR) Laser Pointers plus NIR and SWIR illuminators) in a single, high-power, lightweight unit, which would give the warfighter commonality with all other weapon systems and be covert.  Would provide the SWIR VCSEL a three-fold increase in efficiency and output power to meet critical needs for covert illumination in both High Definition and SXGA formats. Applications include: PUMA, RAVEN, TigerShark, Anubis, Spectre-FINDER, Speckles, TigerMoth, WAAS, PAWS, IPODS, AngelFire, MAV-OBAT, nLoss, LOS-short, CLRF, Joint Effect Targeting System (JETS), IDNST, TLDS, Big Safari, OEF, OIF,  STINGER , and ARGUS, others.\n\nVital Infrared Sensor Technology Acceleration (VISTA) High Temp Mid-Wave Infrared (MWIR) Detectors (FY 2016): Establish a critical domestic industrial base for MWIR focal plan arrays (FPA) having capabilities in III-V antimony-based IR FPAs to reduce size, weight, power, and cost while increasing yield and operability as an alternative to current technology.  Will achieve wafer production scale-up to 40-50 wafers per month while shortening sensor turn-on and cool down time by 50%, extending cooler lifetimes 150% - 200% as a result of reduced stress during temperature cycling, and substantially reducing the sensor lifecycle maintenance cost. Applications include: Air Force: EODAS Enhancement (F-35), EOTS Enhancement (F-35), LWIRST (F-15), Targeting System Enhancements (MQ-9, F-16), Overhead Persistent Infrared (OPIR); Army: Next Gen FLIR, Degraded Visual Environment, Rotary Wing Pilotage; Navy: Shipboard Multifunction Sensors (APDIS), Overhead Persistent Surveillance for USMC, UAV, and Navy: BAMS, F-18 (Advanced IRST), EO\/IR Standard Integration System (EISIS), and Affordable Modular Panoramic Photonics Mast.\n\nOrganic Light Emitting Diode (OLED) Microdisplays - Phase II (FY 2016): Phase I initiated using FY 2014 IBIF resources. Establish manufacturing capability for producing an ultra-high resolution, high brightness, high contrast, full color microdisplay at a low unit cost.  Mature and combine manufacturing processes: Silicon on Insulator (SOI) and Direct Patterning technologies to enable a 5X improvement in yield and 5X longer lifetime of displays, reducing life cycle costs. $141.7M savings for aviation (17,700 displays between 2017-2032) x $8K\/unit savings). Applications include F-35 Heads-up Helmet Mounted Display System, Apache, Enhanced Night Vision Goggles, F-18, F-15, F-16, affordable color\/monochrome displays with high brightness and high contrast to enable Warfighter to fully use sensors and cuing\/augmented reality hardware.\n\nImproved Focal Plane Array (FPA) – Hyperspectral – Phase II (FY 2016): Phase I initiated using FY 2014 IBIF resources. Demonstrate utility of III-V based FPAs for Long-Wave Infrared (LWIR) Hyperspectral (HIS) applications. Up to $1M\/year\/sensor reduction in system life cycle costs compared to arsenic-doped silicon blocked impurity band (Si:As BIB) detectors. Significant reduction in up-front costs compared to Mercury Cadmium Telluride (MCT). Improved reliability, maintainability, and availability, along with increased detection range."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.450"
                                            },
                                            "Text": {
                                                "val": "Increased Thickness for Large Sheet Edge Defined Film-Fed Growth  Sapphire Production: Designed reduced setups to grow a 13.7” x 0.61” and 13.7” x 0.65” cross sections and achieved sufficient volume to grow a 13.7” x 0.65” x 24.2” crystal.\n\nSilicon Carbide High Efficiency Power Switches: Increased throughput and decreased cost of power devices through enhanced yield device fabrication processes; continued power device fabrication using 6” substrates.\n\nMini Short-wave Infrared Cameras and Imagers: Improved yields\/reduced costs of wafer level processing; improved hybridization yields and costs; applied automation of die\/wire bonding to reduce packaging costs; planned for sensor packaging and camera calibration tasks.\n\nManufacturability of Vertical Cavity Surface Emitting Lasers - Phase I: Continued hermetic design and standardized packaging efforts for low-cost\/high-volume applications; compatible with Pick-n-Place and Surface Mount Technology PCB-stuffing assembly; using multilayer ceramics and PCB technology consistent with wafer-scale packaging; evaluated cooling technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.528"
                                            },
                                            "Text": {
                                                "val": "Silicon Carbide (SiC) High Efficiency Power Switches: Work on 150 mm diameter substrate material; continue epi-layer demonstration task, including warm and hot wall growth reactor development.\n\nMini Short-wave Infrared (SWIR) Cameras and Imagers: Address wafer growth, backside processing, hybridization, sensor packaging, and camera calibration efforts.\n\nMini Vis - SWIR Cameras and Imagers: Begin design and development of additional manufacturing processes for sensor substrate removal.  Develop specifications for vis-SWIR devices.  Develop test and evaluation methods for extended response to <900 nm.\n  \nVISTA High Temp MWIR Detectors: Continue efforts to integrate High Operating Temperature MWIR FPA technology developed under the larger VISTA program into the F-35 EODAS system.  Plans include FPA fabrication, process optimization and maturation, and supporting integrated dewar cooler assembly field testing.\n\nManufacturability of Vertical-Cavity Surface Emitting Lasers (VCSELs) - Phase I: Explore multilayer ceramics and polychlorinated biphenyl (PCB) technologies, emphasizing  low-cost die level packaging compatible with Pick-n-place and Surface-Mount Technology PCB-stuffing assembly lines; apply lower thermal impedance packaging; down-select superior heat pipes and micro-channel coolers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.382"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.382"
                                            },
                                            "Text": {
                                                "val": "Mini Short-wave Infrared Cameras and Imagers: Plan for device transitions; continue wafer growth\/processing, hybridization, sensor packaging, and camera calibration efforts.\n\nMini Vis - SWIR Cameras and Imagers: Continue manufacturing process implementation and test substrate removal. Fabricate and test devices. Continue development and fabrication of prototype and initial production vis-SWIR devices for initial field trials and deployment.\n\nVISTA High Temp MWIR Detectors: Develop fabrication process improvements that reduce defects and increase availability and yields; target achievement of wafer production scale-up to 40-50 wafers per month while shortening sensor turn-on and cool down time by 50%, extending cooler lifetimes 150% - 200% as a result of reduced stress during temperature cycling, and substantially reducing the sensor lifecycle maintenance cost.\n\nManufacturability of Vertical-Cavity Surface Emitting Lasers – Phase II: Continue pointer device development. Design and develop electronics and packaging. Begin planning for manufacturing and field testing. \n\nOrganic Light Emitting Diode Microdisplays -Phase II: Develop direct patterning and Silicon on Insulator (SOI) Backplane; demonstrate critical manufacturing processes (direct patterning: 0.5 um accuracy, linear source process uniformity, SOI: high dynamic range, display uniformity); establish a direct patterning prototype; qualify the SOI process at the foundry; install the final Direct Patterning equipment; conduct SOI and Direct Patterning lot runs; execute an interim Manufacturing Readiness Level assessment; initiate a SOI qualification plan.\n\nImproved Focal Plane Array (FPS) - Hyperspectral – Phase II: Focus on detector and FPA fabrication, testing, and validation. Demonstrate 640x480, 20 μm Very Long Wavelength Infrared FPAs. Provide detailed FPA characterization. Develop cost and yield models using multi-wafer lot runs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing is a series of efforts addressing advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and Low Observables.  Through productivity and efficiency gains, these manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, while reducing the cost, acquisition time and risk of our major defense acquisition programs.\n\nAdvanced materials manufacturing technologies undergoing development include materials for ballistic survivability and rapid fabrication of structural components.\n\nCold Spray Phase I (FY 2014) : Create a production ready supply chain that will cost-effectively deliver magnesium transmission housings and other high value, high failure-tolerant components repaired with cold spray technology. Reclaim parts that are unserviceable due to corrosion, wear, chafing, or other damage. Develop automated, flexible, and repeatable repair process for production implementation of cold spray. Applications include establishing a new manufacturing capability that can be used to repair other materials (i.e. Al, Ti, steel & Bronze) and produce other coatings (Ni, MCrAlY).  Reduced condemnations in the AMCOM SAFR Program. Other applications: 120mm, 155mm, F-35, Seawolf, F-15, F-16, F-18, and B-1.\n\nCold Spray - Phase II Large Structures (FY 2016): Expand the Cold Spray product envelope from 5 ft. to a target of 40 ft. to enable large tubular component repair. Applications include Seawolf Class Submarine Periscopes and TD-63 Actuators.\n\nCast Eglin Steel (FY 2014): Develop affordable casting processes to defeat >5X scalable objective underbody vehicle threats; single piece casting for MK82\/SDB I to meet lethality requirements to defeat area targets. Applications include replacing DoD non-compliant weapon systems by 2018 per OSD directive. Estimated $30K savings\/vehicle through process change from welded components to a cast underbody. Estimated $5K savings\/bomb to replace the 110,000 non-compliant wide area cluster munitions.\n\nFastener Fill (Exposed Outer Mold Line Fastener Sealing) (FY 2014): Achieve shorter fastener installation times, (i.e., less than 30 seconds per fastener), and minimal residual cleanup to realize a savings of up to 1,000 hours\/aircraft in direct labor, saving 312,000 man-hours\/year at F-35 full rate production. Applications include F-35 and other aircraft requiring critical LO performance characteristics.\n\nLow Observables (LO) - Phase II (FY 2014): Phase I initiated with Industrial Base Innovation Resources. No manufacturing capability exists for systems to meet mission survivability against advanced threats. The objective is a minimum 10x reduction in cost and minimum 50x increase in availability. Applications include multiple DoD platforms for survivability enhancement.\n\n40MM M433 Warhead Producibility (FY 2014\/2015): Achieve improved anti-personnel lethality at the squad level, increasing first shot effectiveness against personnel targets through optimization of production process prior to transition to Full Rate Production, avoiding high cartridge unit costs. Projected $17\/round cost reduction. Primary applications include Mk 19 GMG, M203 GL, M320GL, and M32 MSGL. Secondary applications include Cannon and Tank Calibers, and Hand Grenades.  \n\nAutomated and Rapid Boot Installation (FY 2014-2016): Achieve an F-35 Program-wide 30% reduction in touch labor for boot installation and boot hole cutting. Improve fit and finish, reducing production span times (20s\/fastener to 3s\/fastener for boot hole cutting), reducing kitting, eliminating time for adhesive mixing, application, and vacuum bagging. Applicable to LO aircraft acquisition and sustainment communities. \n\nDimensions from Day One (FY 2014-2016): Demonstrate a methodology that accurately predicts and accounts for the numerous geometric, tooling and material factors impacting finished composite parts enabling the correct upfront process and tooling decisions to yield first article parts meeting the “dimensional requirements on day 1”. Applications include F-35\/ UCLASS\/F\/A-XX\/Long Range Strike for maintaining part and aircraft tolerances, which enables survivable, supportable and affordable air vehicles. \n\nLarge Scale Encapsulate Ceramics - Phase II (FY 2016): Phase I initiated using Industrial Base Innovation Fund Resources. Enable combat vehicles to defeat the large caliber Kinetic and Chemical Energy objective threats within the allocated weight parameters.  Help address affordability of the armor. Armor panels will be producible in the shapes required by individual vehicles. Estimated cost reduction of $10K \/sq. foot. Applications include Abrams, which has a known protection limitation. GCV and other vehicles will use this technology to design those areas of vehicles subject to large caliber KE and CE threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.367"
                                            },
                                            "Text": {
                                                "val": "Cold Spray Phase I: Initiated qualification of the UH-60 Sump Housing; automated manufacturing cell tested for production.\n\nCast Eglin Steel: Test results conveyed need for additional analysis to achieve blast thresholds. Designed an improved casting underbody for a full vehicle hull.  \n\nFastener Fill (Exposed Outer Mold Line Fastener Sealing): Applied tool evaluation plan through range testing; validated requirements and enhanced ergonomic and material optimization. Tools for trials designed for prototype testing.\n\nLow Observables (LO) – Phase II: Evaluated material requirements to support survivability optimization for advance threats.\n\n40MM M433 Warhead Producibility: set processes and teams in place for the development of injection molding and discrete fragment insertion tooling and processes.\n\nAutomated and Rapid Boot Installation: Initiated improvements to the detail reductions, physical placement, and adhesive applications for boot configurations; developed ultrasonic hand-held boot hole cutter; began pre-production testing.  \n\nDimensions from Day One: set processes and teams in place for the creation of process methodology and identification of required materials not addressed in current predictive software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.379"
                                            },
                                            "Text": {
                                                "val": "40MM M433 Warhead Improvement Producibility: Develop injection molding and discrete fragment insertion tooling and processes. Optimize mold stages to decrease time to load parts, over-mold parts & transition to follow on stages. Develop fragment insertion methods\/tools to reduce time to fill mold with fragments & settle\/align fragments; enable mold stage transitions at reduced cycle times. \n\nAutomated and Rapid Boot Installation: Conduct pre-production evaluations; determine implementation approach; perform First Article delta updates.\n\nDimensions from Day One: Create process methodology and identify required materials not addressed in current predictive software. Test for resin shrinkage and coefficient of thermal expansion. Develop predictive capability methodology training. Evaluate methodology predictions and compare to “as built” hardware of various configurations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.022"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.022"
                                            },
                                            "Text": {
                                                "val": "Cold Spray - Phase II Large Structures: Expand the capability of Cold Spray Phase I System to accommodate larger components. Incorporate a means of processing long parts (40 feet). Develop a fully integrated \"tube\" repair processing line.\n\nAutomated and Rapid Boot Installation: Develop adhesive application development of the re-configured boots to enable reduced cycle time and improved quality. \n\nDimensions from Day One: Apply lessons learned from analysis to planned configurations; conduct demonstrations.\n\nLarge Scale Encapsulate Ceramics - Phase II: Conduct manufacturing trials to scale up solutions; test full-size panels; refine models; produce the required thermal design power to manufacture the armor panels; set up a Government manufacturing facility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise and Emerging Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and business practices for defense applications.  Key focus areas include direct digital (or additive) manufacturing, advanced manufacturing enterprise, machining, robotics, assembly, and joining.  Will accelerate delivery of technical capabilities to impact current warfighting operations while reducing cost, acquisition time, and risk of major defense acquisition programs.\n\nIt is paramount for the U.S. military to improve its own agility and flexibility. The focus is to find a solution to overcome a burdensome acquisition cycle requiring a great amount of cost, time, security, and storage space. Through the use of secure satellite data links or a local parts database, warfighters can access CAD designs for replacement parts, allowing them to repair equipment without the need to establish supply chains or wait for shipments. It allows operators to modify a part's design based on its performance in the field.\n\nEmerging manufacturing technologies undergoing development include:  a large-scale challenge for advanced, interoperable machine tool applications, and methods for exchange of 3D official technical data throughout the supply chain and between the Government and contractors.\n\nField Assisted Sintering Technology (FAST) (FY 2014): Replace comparatively slow, expensive sintering process with the capability to produce fine grained, fully dense materials that are not possible and\/or cost-prohibitive with conventional sintering processes (days to minutes). FAST will significantly reduce cycle time for armor materials over 60%, and the near-net-shaped nature of FAST can reduce machining costs by 90% (and overall item cost by more than 20%).  Applications: EAPS, JAGM(Army), Small Diameter Bomb (Air Force), Next Generation Warheads, ceramic body and vehicle armor, tungsten kinetic energy penetrators, IR windows, heat sinks for electromagnetic propulsion cooling, insensitive munitions UHTC, height temp leading edge.\n\nMTConnect Challenge Phase I (FY 2014): MTConnect is a manufacturing industry standard to facilitate the organized retrieval of process information from numerically controlled machine tools.  This project continues the development and implementation of production interactive solutions to contribute to reduced cycle time throughout the factory; production metrics presented in real time using adaptable dashboards; enable real-time actions and decisions based on real time facts and data; correlate planned operations and processing with actual events for enhanced efficiency in the future; develop knowledge-based correlation of processing events with part quality to improve efficiency and reduce rework. Applications span the broad US Industrial Base.\n\nMTConnect Challenge - Phase II (FY 2015\/2016): Development and implementation of production interactive solutions based on the expansion of MTConnect Challenge will contribute to reduced cycle times and the development of real-time production metrics for adaptable dashboard applications. Applications span academia’s role and the broad US Industrial Base.\n\nHigh Power Ultrasonic Assisted Drilling (FY 2015): This project is jointly resourced with FY 2014 Industrial Base Innovation Fund resources.  Addresses the problem of high costs of drilling various alloys of significant strength, High KSI Steels, IN625, and Composites by developing ultrasonic technology for hole drilling applications to improve productivity and tool life by more than 50%. Potentially impacts all systems that require drilling of holes.\n\nFramework for Assessing Cost and Technology (FACT) (FY 2014-2016): Reduce the system engineering development time by 50% compared to traditional trade off studies, and reduce the cost of manufacturing by 10%-15%. Create M777 stabilizer arm performance\/production models and federate through FACT architecture. Conduct tradeoff analysis between casting and TIG\/MIG welding with delivery of prototype hardware. Expected result: lead time reductions from 12-18 months to 90 days; component cost for the M777 will be reduced by 15%; additional critical M777 and mortar system parts identified. Applications include DoD Systems - Developmental, Block Upgrade, and Legacy Systems.\n\nCyber Security for the Shop Floor – Phase II (FY 2016): Phase I was initiated using FY 2014 IBIF resources.  Develop a Trusted and Assured supply chain, identify threat vulnerabilities of industrial control systems, provide input to DoD policies, and shape follow-on investment to mitigate threat vulnerabilities. Applications span the US Defense Industrial Base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.880"
                                            },
                                            "Text": {
                                                "val": "Field Assisted Sintering Technology (FAST): Demonstrate near-net-shaped EAPS warhead components with FAST; reduce cycle times (and hence cost) of current armor materials with FAST; demonstrate functionally graded armor; fabricate legacy IR materials w\/FAST; demonstrate cost-savings while matching or exceeding properties.\n\nMTConnect Challenge Phase I: Determined the three award winners. A Mechanical Engineering graduate student from Clemson won the first prize with an application monitoring machine spindle chatter.\n\nFramework for Assessing Cost and Technology: Modeled sample data to 3D annotated baseline technical data for insertion to a product lifecycle management (PLM)-to-PLM information data exchange format. Benefits associated with updating design specifications to accommodate welding and machining processes begin for the LTV in FY 2015, with the benefits for the M777 spare parts project also to be realized starting in FY 2015."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.938"
                                            },
                                            "Text": {
                                                "val": "MTConnect Challenge - Phase II:  Building upon the results of the first MTConnect Challenge, the phase II objective is to focus on challenging Academia’s role in support of the MTConnect expansion in Industry implementation. \n\nHigh Power Ultrasonic Assisted Drilling: Advance AcousTech Machining from thecurrent Manufacturing Readiness Level (MRL) of 4 to MRL 6.  This will be accomplished through a task based effort focused on Drilling and Milling Studies of Weapons Systems Materials and AcousTech™ Machining Module Refinement.\n\nFramework for Assessing Cost and Technology: Accelerate tradeoff analyses for new system production planning to reduce the risk of underperformance and associated costs. Conduct analysis of the logistical implications (assembly, maintenance, and repair times) of the previous projects efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.841"
                                            },
                                            "Text": {
                                                "val": "MTConnect Challenge – Phase II: Focus is automation for obtaining and exchanging information on the factory floor. Select a module developer, and develop the base module. Select an app portal developer and develop the app portal. Define metrics and methodologies for testing. Develop judging criteria and initiate development of the challenge test bed. \n\nFramework for Assessing Cost and Technology: Develop prediction capabilities pertaining to the life cycle sustainment cost implications of alternative designs.\n\nCybersecurity for the Shop Floor – Phase II: Follow-on from Phase I Red Team evaluation focused on multiple threat levels triggered on manufacturing equipment at the shop floor level. Assess performance of companies for vulnerabilities after implementing the new DFAR requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680F"
                                    },
                                    "Title": {
                                        "val": "Air Force ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680N"
                                    },
                                    "Title": {
                                        "val": "Navy ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7)  0708045A"
                                    },
                                    "Title": {
                                        "val": "Army ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011S"
                                    },
                                    "Title": {
                                        "val": "DLA ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item. Outyear data for \"Other Program Funding\" is contained within the Service budgets."
                        },
                        "PerformanceMetrics": {
                            "val": "The majority of project performance metrics are specific to each effort and include measures identified in the project plans.  The metrics include items such as target dates from project work break down schedules, production measures, production goals, production numbers and demonstration goals and dates. In addition, generic performance metrics applicable to the Defense-Wide Manufacturing, Science and Technology (DMS&T) program includes attainment of a previous administration goal, \"Speed technology transition focused on warfighting needs\".  The metrics for this objective and the objective of DMS&T is to transition 30% of completing demonstrations program per year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P350"
                    },
                    "ProjectTitle": {
                        "val": "Institutes for Manufacturing Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.138"
                        },
                        "PriorYear": {
                            "val": "14.299"
                        },
                        "CurrentYear": {
                            "val": "71.121"
                        },
                        "BudgetYearOne": {
                            "val": "136.811"
                        },
                        "BudgetYearOneBase": {
                            "val": "136.811"
                        },
                        "BudgetYearTwo": {
                            "val": "98.803"
                        },
                        "BudgetYearThree": {
                            "val": "75.556"
                        },
                        "BudgetYearFour": {
                            "val": "53.164"
                        },
                        "BudgetYearFive": {
                            "val": "25.521"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "P350 is a new project number in this budget cycle.  Funding for the Institutes for Manufacturing Innovation was reported in the FY 2015 President's Budget in P680, and has now been extracted for clarity."
                        },
                        "ProjectMissionDescription": {
                            "val": "Technological innovation and leadership in manufacturing are essential to sustaining the foundations of economic prosperity to enable our military to maintain technological advantage and global dominance. To support these goals, Institutes for Manufacturing Innovation (IMIs), each led by non-profit 501(c) entities, will serve as regional hubs to accelerate technological innovation into commercial applications and concurrently develop the educational competencies and production processes via shared public-private sectors.  Collaborative execution and funding by the Departments of Defense (DoD), Energy (DOE), and Commerce (DoC), the National Aeronautics and Space Administration (NASA), and the National Science Foundation (NSF) to support the establishment of these IMIs will spur industry cost-share for manufacturing innovation and quickly develop a pathway for technology-focused regional hubs for collaboration among government, industry, and academia that will meet critical government and Warfighter needs. The concept of these institutes is described in the President’s National Science and Technology Council report by the Advanced Manufacturing National Program Office entitled, “National Network for Manufacturing Innovation: A Preliminary Design,” published in January 2013.\n\nEach of the six DoD-led IMIs addressed in this budget is expected to be self-sustaining, without reliance on federal sustainment funding, by the end of the cooperative agreement (CA) period between the federal government and the non-profit-led consortium.  This CA period is typically for five years, with the option to extend the agreement up to two years for the benefit of DoD projects, technical achievement, etc., to fully leverage the minimum 1:1 cost share.  All subsequent (post-CA) federal funding provided to any IMI will be on a specific project basis by the requirements generators, either within or external to DoD.\n\nEach of the six DoD-led IMIs is intended to: \n1) Bring together industry, universities and community colleges, federal agencies, and state and local governments and organizations to create regionally-based but nationally-impactful public-private partnerships underpinning the formation of sustainable manufacturing innovation ecosystems\n2) Accelerate innovation to bridge the gap between Research and Development (R&D) and deployment of technological innovations in domestic production of goods\n3) Invest in industrially relevant manufacturing technologies with broad applications, accelerating innovation within DoD and across all manufacturing sectors to increase U.S. competitiveness\n4) Provide shared assets to help companies access cutting-edge capabilities and equipment \n5) Create an unparalleled environment to educate and train students and workers in advanced manufacturing skills\n6) Focus on maturing the associated manufacturing technologies from Manufacturing Readiness Level (MRL) 4 to 7\n\nThe first and second year of each of these new non-profit business entities is devoted to creating a sustainable business model, with follow-on refinement through the final year, including: growing the membership of each Institute as appropriate; initiating revenue streams (e.g., membership fees, training and workforce development, certification and licensing, etc.); establishing provisional Executive Board and Technical Advisory committees to execute the business of each institute; finalizing Intellectual Property plans; developing technology roadmaps to inform investment strategies; opening industrial commons to provide for shared resource facilities available to all institute members; initiating workforce training programs in each technology area; establishing complementary relationships between IMIs; analyzing the U.S. and Global industrial base in partnership with other government agencies to build upon the institute portfolio and address critical requirements; and further developing national technology roadmaps.\n\nEach established Institute for Manufacturing Innovation was selected through a competitive process.  The executing DoD Service published a formal solicitation for proposals for each IMI, describing extensive proposal evaluation criteria. Non-Profit Organizations and Universities were eligible to bid, and each bidder formed a broad consortium of industry and academic partners for its proposal team. The executing DoD Service used a team of government experts to evaluate each proposal against the evaluation criteria and selected a winning consortium."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Institute #1 – Additive Manufacturing Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "Additive manufacturing (i.e., “3D printing”) is a process of joining materials to make objects from 3D model data, usually layer upon layer, as opposed to subtractive manufacturing methodologies such as traditional machining. The mission of the IMI is to accelerate additive manufacturing technologies to the U.S. manufacturing sector and increase domestic manufacturing competitiveness. Advanced additive manufacturing will benefit the DoD by enabling lifecycle cost savings and enhanced capabilities, including moving toward “focused logistics” – getting the right part in the right place in just the right time – for wartime and humanitarian missions using local supply chains. This IMI was established in 2012, with cooperative agreement funding contribution included in this budget through FY 2016."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The additive manufacturing IMI was established with over 125 industry, academic, and non-profit members from 37 U.S. states, working in consonance with government and industry stakeholders, and generated $18 million in cost share; completed two project calls and awarded over 30 project contracts totaling $48 million public and private funding, of which $13.5 million is PE 0603680D8Z funding. These first two rounds of applied R&D projects were concentrated in the following critical technology elements: design aids and applications, material characterization, and standards\/protocols. Developed education and workforce training roadmap."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "Launch a third call for R&D projects based on an updated technology roadmap developed from the technical strategy workshops held in late 2014; competitively review and award additional applied research projects with highest potential for industry and government shared benefit; launch a challenge or series of challenges\/prizes surrounding additive manufacturing topics to encourage highly innovative approaches to problems of buildings infrastructure. Launch education and workforce training initiatives, including partnering with the U. S. Special Operations Command and an existing additive manufacturing education and workforce development program that includes a one-year additive manufacturing certification program for Level One Technicians targeting retraining of wounded warriors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.842"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.842"
                                            },
                                            "Text": {
                                                "val": "Launch a fourth call for R&D projects based on the institutes' most current technology roadmap; competitively review and award additional applied research projects with highest potential for industry and government shared benefit; launch a challenge or series of challenges\/prizes surrounding additive manufacturing topics to encourage highly innovative approaches to problems of buildings infrastructure; continue education and workforce training initiatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute #2 – Digital Manufacturing and Design Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "This national institute focus is on the development of model-based design methodologies, virtual manufacturing tools, and sensor and robotics-based manufacturing. Advanced design and manufacturing tools that are digitally integrated and networked across enterprises and supply chains can lead to the 'factories of the future, forming an agile U.S. industrial base with significant speed to market advantage. This IMI was established in February 2014, with cooperative agreement funding contribution included in this budget through FY 2018."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.150"
                                            },
                                            "Text": {
                                                "val": "This IMI was established with 73 industry, academic, and non-profit members from 17 U.S. states, working in consonance with government and industry stakeholders, and generated pledges of $105 million in cost share; conducted the first round of R&D project calls based on the IMI's Technology Road Map; awarded 18 project contracts totaling $20.5 million in public and private funding, of which $12 million is PE 0603680D8Z funding, with a focus on transitioning capability to the organic and commercial industrial base.  These first-round applied R&D projects were awarded in the following key core areas: Adaptive Vehicle Make transition (DARPA funded), advanced manufacturing enterprise, intelligent machines, advanced analysis, cyber manufacturing system security and driving open source digital manufacturing commons throughout multiple supply chains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.125"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur approximately every six months.  Award projects in 10 proposal calls totaling about $10 million in PE 0603680D8Z funding in the key core areas, which include but are not limited to: advanced manufacturing enterprise, intelligent machines, advanced analysis, and cyber manufacturing system security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.233"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.233"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur approximately every six months.  Conduct multiple project calls and award projects in the key core areas which include but are not limited to: advanced manufacturing enterprise, intelligent machines, advanced analysis, and cyber manufacturing system security."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute #3 – Lightweight and Modern Metals Manufacturing Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "Advanced lightweight metals retain properties comparable to heavier, traditional materials, and can enable weight reduction in a variety of components and products with significant energy savings and increased payloads. This IMI will scale-up research across multiple areas to accelerate market expansion by applying an integrated materials and manufacturing approach, addressing a lack of design guides and certifications as well as cost and scale-up challenges. The goal is to catalyze the development of an advanced lightweight metal U.S. supplier base and to enable DoD to realize greater speed and agility of manned, unmanned, and Warfighter systems as well as benefits for commercial applications. This IMI was established in February 2014, with cooperative agreement funding contribution included in this budget through FY 2018."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.149"
                                            },
                                            "Text": {
                                                "val": "This institute was established with over 80 industry, academic, and non-profit members from 22 U.S. states, working in consonance with government and industry stakeholders, and generated pledges of $93 million in cost share; conducted the first round of R&D projects based on initial proposals submitted, and awarded contracts totaling approximately $10 million of PE 0603680D8Z funding, with a focus on transitioning capability to the organic and commercial industrial base. These first-round applied R&D projects were awarded in the following key core areas: produce and lower the manufacturing cost of lightweight metal components, identify applications for new\/novel metals and alloys, improve primary and secondary metal manufacturing processes, develop products exploiting lightweight and modern metals, and initiate steps to ensure the workforce is pipelined to the needs of this technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.125"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur every six months, valued at approximately $10 million in PE 0603680D8Z funding for the year. Award second and third round of projects in the key core areas which include but are not limited to: applications of new\/novel metals and alloys, primary and secondary metal manufacturing processes, and development of additional products utilizing lightweight and modern metals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.584"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.584"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur every six months, valued at approximately $10 million in PE 0603680D8Z funding for the year. Conduct project call rounds four and five and award projects in the previously described key core areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute #4 Integrated Photonics Manufacturing Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "Integrated photonics manufacturing advances the promise of unprecedented interconnection between electronics and photonics that will deliver previously unattainable performance in speed, density and power consumption, quickly providing differentiating benefits for defense applications such as high-speed signal processing, electronic warfare, information transport and computation, sensing, imaging and targeting. This institute will establish an end-to-end ‘ecosystem’ in the U.S. for advancing domestic integrated photonics manufacturing. This IMI will include responsive integrated photonics fabrication foundry access, photonics-electronics integrated design tools, and advances in packaging, assembly and test automation.  The goal will be to catalyze a vibrant, enduring integrated photonics domestic industrial base, much as SEMATECH did with the domestic semiconductor industry. This IMI will be established in 2015, with cooperative agreement funding contribution included in this budget through FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "FY 2015 Plans Award a Cooperative Agreement, and stand up this new IMI following processes used for previous institutes while refined through lessons learned. Conduct initial technology roadmapping activities. Complete a data call for a first round of applied R&D projects and award project contracts in the key core areas identified in the roadmapping phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.677"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.677"
                                            },
                                            "Text": {
                                                "val": "Conduct two new rounds of applied R&D project calls and award projects in the key core areas identified in the roadmapping phase."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute #5 – Flexible Hybrid Electronics Manufacturing Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "Flexible Hybrid Electronics manufacturing involves highly tailorable devices on non-traditional, compliant substrates that combine thinned components manufactured from traditional processes with components that are added via “printing” processes. This institute will invest in prototyping and scale-up of production processes for high speed pick-and-place, printed circuits, and hybrid fabrication that will enable defense and commercial applications in wearable electronics, unattended sensors, medical prosthetics \/ neuro-synthetic devices, and the continuous improvement in SWAPC (Size, Weight And Power plus Cost) for electronic systems. This institute will establish a complete end-to-end domestic innovation ‘ecosystem,’ containing design, packaging, assembly and test automation research and workforce development capabilities which can be accessed by small, medium and large companies as well as academic institutes.  The goal is to help enable the creation of a sustainable domestic industrial base which can rapidly respond to global needs using a quick technology cycle and scale-up. This IMI will be established in 2015, with cooperative agreement funding contribution included in this budget through FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.871"
                                            },
                                            "Text": {
                                                "val": "Award a Cooperative Agreement and establish this new IMI following processes used for previous institutes and refined through lessons learned in solicitations and standup of for Institutes 1-4.  Conduct initial technology road mapping activities. Complete a data call for a first round of applied R&D projects and award project contracts in the key core areas identified within the road mapping activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.628"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.628"
                                            },
                                            "Text": {
                                                "val": "Continue to refine core investment areas supporting the innovation ecosystem.  Initiate two rounds of applied R&D project calls in core areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute #6 - Technical Area Selection Pending"
                                    },
                                    "Description": {
                                        "val": "This institute is in acquisition planning to be established in early 2016, focusing investment in one of the following four candidate technical areas: Engineered Nano-Materials, Electronics Packaging and Reliability, Aerospace and Space Grade Composites, and Modern Fibers and Textiles. This IMI will be established in 2016, with cooperative agreement funding contribution included in this budget through FY 2020."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.847"
                                            },
                                            "Text": {
                                                "val": "Award a Cooperative Agreement and establish this new IMI following processes used for previous institutes and refined through lessons learned in solicitations and standup of for Institutes 1-4.  Conduct initial technology road mapping activities. Complete a data call for a first round of applied R&D projects and award project contracts in the key core areas identified within the road mapping activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Although each institute will formally adopt and implement its own metrics, the institutes will measure their performance in the following common areas: 1) Degree of Institute self-sustainability (operations revenue \/ expenses); 2) technologies transitioned to production; 3) technology project execution performance; 4) member participation; 5) education & workforce outreach; 6) success stories."
                        }
                    }
                }
            ]
        }
    }
}