{
    "id": "b76f3b2a60d8093f2d3728ebf8f817b0bd83c8e3",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603287E"
        },
        "ProgramElementTitle": {
            "val": "SPACE PROGRAMS AND TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "127.948"
            },
            "CurrentYear": {
                "val": "179.883"
            },
            "BudgetYearOne": {
                "val": "126.692"
            },
            "BudgetYearOneBase": {
                "val": "126.692"
            },
            "BudgetYearTwo": {
                "val": "130.091"
            },
            "BudgetYearThree": {
                "val": "188.935"
            },
            "BudgetYearFour": {
                "val": "205.471"
            },
            "BudgetYearFive": {
                "val": "191.226"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "142.546"
                },
                "CurrentYear": {
                    "val": "179.883"
                },
                "BudgetYearOne": {
                    "val": "169.626"
                },
                "BudgetYearOneBase": {
                    "val": "169.626"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "127.948"
                },
                "CurrentYear": {
                    "val": "179.883"
                },
                "BudgetYearOne": {
                    "val": "126.692"
                },
                "BudgetYearOneBase": {
                    "val": "126.692"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-14.598"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-42.934"
                },
                "BudgetYearOneBase": {
                    "val": "-42.934"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-9.611"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.987"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-42.934"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-42.934"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Decrease reflects reprogrammings and the SBIR\/STTR transfer. \n\nFY 2016:  Decrease reflects drawdown of the Airborne Launch Assist Space Access (ALASA) and Space Domain Awareness (SDA) programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SPC-01"
                    },
                    "ProjectTitle": {
                        "val": "SPACE PROGRAMS AND TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "127.948"
                        },
                        "CurrentYear": {
                            "val": "179.883"
                        },
                        "BudgetYearOne": {
                            "val": "126.692"
                        },
                        "BudgetYearOneBase": {
                            "val": "126.692"
                        },
                        "BudgetYearTwo": {
                            "val": "130.091"
                        },
                        "BudgetYearThree": {
                            "val": "188.935"
                        },
                        "BudgetYearFour": {
                            "val": "205.471"
                        },
                        "BudgetYearFive": {
                            "val": "191.226"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential threats, a proliferation of assets to provide robustness against attack, ready access to space, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space requires the delivery of capabilities, replenishment of supplies into orbit, and rapid manufacturing of affordable space capabilities.  Developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users. Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing or assembly processes; precision control of multi-payload systems, and payload isolation and pointing systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Launch Assist Space Access (ALASA)"
                                    },
                                    "Description": {
                                        "val": "The ALASA program has four major goals.  The first of these is to make access to space more affordable by reducing the cost per launch to under one million dollars per flight.  ALASA accomplishes this by using a simple design, with minimal infrastructure, touch labor, and range support. Secondly, the program seeks to improve the responsiveness of space access by reducing the interval from call-up to launch to a single day.  This enables rapid delivery of spacecraft in response to evolving situations, such as a humanitarian crisis or unexpected conflict, and is accomplished by developing rapid mission planning tools which streamline existing range processes, and automated flight safety systems which reduce reliance on expensive and fragile range infrastructure.  These tools enable the program's third goal: to escape the limitations of fixed launch sites by achieving a greater flexibility in the direction and location of launch.  Finally, ALASA will demonstrate the ability to move its operations from one airfield to another in twelve hours to show resilience in the presence of the initial operating airfield being unavailable, even from factors as relatively innocuous as the weather.  The system uses the Air Force's F-15 fleet, getting as much energy as possible from the reusable part of the system, but without costly modifications to the aircraft.  Challenges include, but are not limited to: in-air separation of aircraft and orbit-insertion launch stages, development of alternatives to current range processes, and achieving a cost per flight of one million dollars, including range support costs, to deploy satellites on the order of one hundred pounds.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.448"
                                            },
                                            "Text": {
                                                "val": "-  Conducted trade studies of additional enabling technology to include propellants, manufacturing, mission planning and range support software, and tracking and flight termination software.\n-  Began detailed design of selected ALASA demonstration system.\n-  Developed detailed planning and operations concepts for testing the ALASA demonstration system.\n-  Performed propulsion and system risk reduction testing.\n-  Completed Preliminary Design Review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "60.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct propellant handling and characterization testing and propulsion system hot-fire testing.\n-  Conduct Critical Design Review.\n-  Conduct captive carry and aircraft compatibility flight tests.\n-  Conduct analysis of launch performance metrics and identify opportunities for system design and integration optimization.\n-  Continue transition coordination."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "- Initiate demonstration of ALASA vehicle launches including launch readiness reviews.\n- Conduct three initial launches with engineering payloads to qualify space based telemetry system, automatic flight termination system, and payload environment measurements.\n- Conduct nine additional launches to demonstrate the advantages of tailored, dedicated launch capability.\n- Coordinate transition of ALASA system to the Air Force.\n- Transition space based telemetry and automatic flight termination technology to the launch community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimental Spaceplane One (XS-1)"
                                    },
                                    "Description": {
                                        "val": "The XS-1 program will mature the technologies and operations for low cost, persistent and responsive space access and global reach.  Past efforts have identified and demonstrated critical enabling technologies including composite or light weight structures, propellant tanks, thermal protection systems, rocket propulsion and advanced avionics\/software.  A critically important technology gap is integration into a flight demonstration able to deliver aircraft-like operability.  The program will validate key technologies on the ground, and then fabricate an X-Plane to demonstrate: 1) 10 flights in 10 days,  2) Mach 10+ flight, and 3) 10X lower cost space access for cargoes from 3,000-5,000 lbs to low earth orbit.  A key goal is validating the critical technologies for a wide range of next generation high speed aircraft enabling new military capabilities including worldwide reconnaissance, global transport, small responsive space access aircraft and affordable spacelift.  The anticipated transition partners are the Air Force, Navy and commercial sector."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed a conceptual design for the XS-1 demonstration system including detailed structural analysis and mass properties.\n-  Performed system level trade studies to identify alternative configurations and defined the tradespace for XS-1."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct risk reduction studies for propulsion, thermal protection systems, guidance\/avionics, composite materials, propellant tanks and space based communications.\n-  Conduct a mid-phase Conceptual Design and Systems Requirements Review.\n-  Conduct component, wind tunnel, and subsystem testing and verification.\n-  Continue to develop detailed XS-1 designs including mass properties, configuration, aerodynamic, trajectory and thermal protection data.\n-  Conduct a Preliminary Design Review and select design for technology risk reduction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop detailed finite element model structural and thermal analysis for the XS-1 design.\n-  Perform aerodynamic Computational Fluid Dynamics analysis and wind tunnel testing for the XS-1 design.\n-  Complete the system and subsystem designs, mass properties and configuration required to support the Critical Design Review.\n-  Develop the concept of operation including the maintenance concept, performance, trajectories and design reference missions.\n-  Coordinate with the Federal Aviation Administration, federal ranges and spaceports to accomplish preliminary flight test planning.\n-  Begin developing a plan to accomplish ground operations, facility modifications and flight demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Phoenix"
                                    },
                                    "Description": {
                                        "val": "To date, servicing operations have never been conducted on spacecraft beyond low earth orbit (LEO).  A large number of national security and commercial space systems operate at geosynchronous earth orbit (GEO) altitudes; furthermore, many end-of-life or failed spacecraft drift without control through portions of the GEO belt, creating a growing hazard to operational spacecraft.  Technologies for servicing of spacecraft with the expectation that such servicing would involve a mix of highly autonomous and remotely (i.e., ground-based) tele-operated robotic systems have been previously pursued.  The Phoenix servicing program will build upon these legacy technologies, tackling the more complex GEO environment and expanding beyond pure traditional servicing functions.  The program seeks to validate robotics operations in GEO suitable for a variety of potential servicing tasks, in full collaboration and cooperation with existing satellite owners.  The program will examine utilization of a new commercial ride-along capability to GEO called Payload Orbital Delivery (POD) to support hardware delivery for upgrading, repairing, assembling, and reconfiguring satellites.  The program will include an early LEO flight experiment focused on satlets as a path of risk reduction for modular assembly on orbit.  Key challenges include robotic tool\/end effector requirements, efficient orbital maneuvering of a servicing vehicle, robotic arm systems, and integration and efficient and low cost transportation of robotic tools. The anticipated transition partners are the Air Force and the commercial spacecraft servicing providers.  Beginning in FY 2015, the GEO robotics portion of this effort will be funded under the Robotic Servicing of Geostationary Satellites program within this Project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "57.500"
                                            },
                                            "Text": {
                                                "val": "-  Delivered prototypes of hardware and software for various servicing tasks to robotic testbed for validation and integration with tools.\n-  Completed mission validation testing inside a six degree of freedom testbed.\n-  Conducted critical design review for LEO satlet experiment and demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct pre-ship review for early LEO satlet experiment equipment and deliver to launch integrator.\n-  Complete delta critical design of satlets per lessons learned from LEO experiment.\n-  Complete delta critical design of PODs for first GEO flight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Launch early LEO satlet experiment and conduct experiment operations.\n-  Launch GEO POD flight and conduct on-orbit testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Servicing of Geostationary Satellites (RSGS)"
                                    },
                                    "Description": {
                                        "val": "A large number of national security and commercial space systems operate at geostationary earth orbit (GEO), providing persistence and enabling ground station antennas to point in a fixed direction.  Technologies for servicing of GEO spacecraft would involve a mix of highly automated and remotely operated (from Earth) robotic systems.  The Robotic Servicing of Geostationary Satellites (RSGS) program, an outgrowth of the Phoenix program budgeted in this Project, will establish robotics operations in GEO suitable for a variety of potential servicing tasks, in full collaboration and cooperation with existing satellite owners.  The program will establish the ability to assist with mechanical malfunctions such as solar array deployment; provide assistive thrust to increase the flexibility of fleets of operational satellites; and use camera systems to perform very detailed inspections to help troubleshoot satellite problems and increase transparency of GEO operations.  Key challenges include; developing automated robot reflexes for safety of operations, robotic tools, efficient orbital maneuvering of the servicing vehicle, robotic arm systems, and mission simulation and validation.  The anticipated transition will be through a commercial spacecraft operator who will provide services to both commercial and military satellites on a fee-for-service basis."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete critical design of robotic servicing system including robotic arms and tool docking system.\n-  Validate specific servicing mission types that maximize value for commercial and DoD satellite operators.\n-  Begin fabrication of primary and secondary robotic hardware and software.\n-  Develop detailed requirements developed from mission description and commercial operator needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Establish partnership with satellite bus provider.\n-  Develop interfaces between servicer satellite and government-provided robotic payload.\n-  Develop comprehensive test plan for robotics and for integrated system.\n-  Begin fabrication of servicer satellite with commercial partner."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Surveillance Telescope (SST)"
                                    },
                                    "Description": {
                                        "val": "The Space Surveillance Telescope (SST) program has developed and demonstrated an advanced ground-based optical system to enable detection and tracking of faint objects in space, while providing rapid, wide-area search capability.  A major goal of the SST program, to develop the technology for large curved focal surface array sensors to enable an innovative telescope design combining high detection sensitivity, short focal length, wide field of view, and rapid step-and-settle to provide orders of magnitude improvements in space surveillance has been achieved. This capability enables ground-based detection of un-cued objects in deep space for purposes such as asteroid detection and space defense missions.  The initial program is transitioning to Air Force Space Command.\n\nThe SST Australia effort will provide a further operational demonstration of the SST at the Naval Communication Station Harold E. Holt near Exmouth, Western Australia.  Such a location presents a more operationally relevant demonstration, with a richer and more interesting population of SSA targets in geosynchronous orbit.  A demonstration in Australia will investigate telescope performance and observe objects and orbits not visible from the current site in New Mexico.  In addition, the demonstration will generate data for analysis and fusion efforts, which will be used to further refine and evaluate data processing techniques, such as those developed under the data fusion effort.  This program will address technical challenges which may arise from an Australian site, including adaptations to a different telescope environment, and the logistical and communications challenges presented by a site significantly more remote than the current SST location."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Continued evaluation of operational strategies, technology studies, and hardware demonstrations in order to optimize SST performance at Australia site.\n-  Continued research at Atom site into technical challenges facing the system after relocation.\n-  Completed MOU with Australia.\n-  Refined SST relocation plan, jointly with the Australian Department of Defense partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to refine SST relocation plan jointly with Air Force Space Command (AFSPC) and the Australian Department of Defense partners.\n-  Conduct SST sustainment studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Recoat mirrors at Kitt Peak Arizona.\n-  Ship SST Telescope Mount Gimbal (TMG) to Australian site.\n-  Ship SST optics to Australian site."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Domain Awareness (SDA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Space Domain Awareness (SDA) program is to develop and demonstrate an operational framework and responsive defense application to enhance the availability of vulnerable space-based resources.  Current space surveillance sensors cannot detect, track, or determine the future location and threat potential of small advanced technology spacecraft in deep space orbits, where a majority of DoD spacecraft are located. Additionally, servicing missions to geosynchronous (GEO) orbits will require exquisite situational awareness, from ultra-high-accuracy debris tracking for mission assurance at GEO orbits to high resolution imaging of GEO spacecraft for service mission planning.  The SDA program will develop a space management system that allows cognitive reasoning and decision support to execute space operations with current and proposed assets within real and synthetic environments.\n\nSDA will investigate revolutionary technologies in two areas: 1) advanced space surveillance sensors to better detect, track, and characterize space objects, with an emphasis on deep space objects, and 2) space surveillance data collection, data archival, and data processing\/fusion to provide automated data synergy.  The resulting increase in space domain awareness will enhance overall space safety of flight, and allow space operators to make informed, timely decisions.  The SDA program will leverage data fusion and advanced algorithms developed under the Space Surveillance Telescope (SST) program, as well as seek to exploit new ground-breaking technologies across the electromagnetic spectrum and utilize already existing sensor technology in nontraditional or exotic ways, to bring advanced capabilities to the space domain.  SDA will correlate a wide range of operational support and space system user data to rapidly identify threat activities, propose mitigating countermeasures, and verify the effectiveness of selected responses.  Critical technologies include accessing disparate sources of relevant data in a common scalable database, model-based situational awareness, and candidate response generation and evaluation.  Particular emphasis will be placed on the ability to continuously adapt to changes in defended system components and usage patterns as well as validation of system integrity.  SDA will demonstrate new approaches to collection of data utilizing a variety of collection modalities, ranging from fusion of observations from non-traditional sources, such as amateur astronomers, to evaluation of sparse aperture imaging techniques.\n\nAlso funded within this program is the Galileo effort, which will develop technology to image a Geosynchronous Earth Orbit (GEO) satellite from the ground.  Galileo will utilize fixed mobile telescopes, each with adaptive optics and a guide star, to create multiple baselines that can be used to reconstruct the image through an inverse Fourier transform.  The potential transition customer is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated the StellarView network of academic astronomy data providers.\n-  Initiated novel dynamic database to collect networked source information for validation.\n-  Demonstrated preliminary capability of the Allen Telescope Array to passively detect and track satellites.\n-  Commenced astrometric data processing and validation efforts.\n-  Commenced SpaceView Phase 2 to demonstrate additional amateur nodes including Australia locations.\n-  Completed Galileo risk reduction experiments in ground-based sparse aperture imaging technologies.\n-  Conducted a survey of operational management systems for Real-Time Space Domain Awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.883"
                                            },
                                            "Text": {
                                                "val": "-  Expand the SpaceView amateur network to additional nodes including Australia locations.\n-  Incorporate international data sources into SDA database.\n-  Integrate all data providers and first generation algorithms on the SDA database to autonomously detect biases, estimate uncertainties, and leverage non-accredited information for real time SDA.\n-  Initiate data ingest from the StellarView network of academic astronomy data providers.\n-  Commence Phase 1 of an un-cued low inclined LEO object detection capability.\n-  Perform database verification on collected data; demonstrate metric and radiometric accuracy.\n-  Study the application of coherent and quantum detectors to Space Domain Awareness challenges of object detection and imaging.\n-  Initiate Real-Time Space Domain Awareness design development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.692"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.692"
                                            },
                                            "Text": {
                                                "val": "-  Complete an initial capability demonstration of a collaborative network of distributed sensors and users to generate timely, accurate and actionable space indications and warnings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Aperture Self-Assembly in Space (OASIS)"
                                    },
                                    "Description": {
                                        "val": "The Optical Apertures Self-assembling in Space program seeks to demonstrate the feasibility of constructing large optical apertures in orbit from a number of smaller modular components that self-organize in space.  The program will demonstrate the technologies needed to assemble a large (>5m) and near-diffraction limited optical aperture from modular components that are launched as separate payloads.  The program will include a scalable zero-g demonstration of a functional optical system that maintains the precision and large-scale physical stability required, and utilizes at least one segmented optical surface.  This program will address technical challenges of precision mechanical assembly from modular components, multiple object rendezvous and coupling in space, and active surface measurement, compensation and control.  Modular construction in space is intrinsically more challenging than ground-based assembly in that there is not necessarily any measurement and support infrastructure and equipment available, such as interferometer test towers.  Therefore, the modular pieces and system design must include self-contained measurement and alignment capabilities to be employed after or during assembly.  The OASIS program will demonstrate the feasibility of assembling complex and highly precise structures in space which, in assembled form, are larger than the capacity of any existing or planned space launch vehicle.  This capability could enable a number of surveillance and communications instruments in orbit that are not possible today or in the near future under the current paradigm.  The anticipated transition partners are the Air Force, Navy and commercial sector."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate essential technologies to facilitate self-organizing robotic construction in space.\n-  Conduct ground-based risk reduction experiments for critical path technologies.\n-  Develop improved piezopolymer controlled deformable mirrors which can be deployed in a self-assembling orbital optical aperture.\n-  Develop a Photonic Integrated Circuit (PIC) for a proof of concept interferometry demonstration, to enable simultaneous wide angle and zoom capabilities from a single device with no moving parts. \n-  Perform risk reduction activities on strain-deployed, piezo-aligned, lightweight sparse aperture optical concept to support orbital Intelligence, Surveillance, and Reconnaissance (ISR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate high resolution capability with light weight optics by leveraging a precision interferometric approach combined with novel image reconstruction algorithm and PIC, which will provide both simultaneous wide angle and zoom capabilities on the same device with no moving parts.\n-  Complete System Requirements Review (SRR) and Preliminary Design for a system of SmallSat modules and mission specific attachments traceable to space operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Space Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "The advanced propulsion technologies program will examine and evaluate space propulsion technologies that will enable order of magnitude improvement in existing systems as well as new missions\/capabilities in space.  Technologies to be explored include new materials and new propellants, novel thruster and engine designs, and methods\/processes to increase efficiency at lower cost.  The program will conduct proof of concept risk reduction activities leading to potential on orbit demonstration of the most promising technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate new studies of novel technologies.\n-  Conduct risk reduction tests of candidate technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radar Net"
                                    },
                                    "Description": {
                                        "val": "The Radar Net program will develop lightweight, low power, wideband capability for radio frequency (RF) communications and remote sensing for a space based platform.  The enabling technologies of interest are extremely lightweight and space capable deployable antenna structures.  Current deployable antenna options have not been sufficiently developed to be dependable on small payload launches, leaving current capabilities trending to large and more costly launch systems.  These launch systems are expected to have long operational lifetimes, which can leave them behind the pace of state of the art technical developments.  The technologies developed under Radar Net will enable small, low-cost sensor launches on short timescales with rapid technology refresh capabilities"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a detailed system architecture assessment.\n-  Begin cubesat deployable antenna risk reduction. \n-  Commence thermal cycling, power availability, and electrical system analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hallmark"
                                    },
                                    "Description": {
                                        "val": "The Hallmark program seeks to demonstrate a space Battle Management Command and Control (BMC2) capability to provide U.S. senior leadership the tools needed to effectively manage space assets in real time.  The program will develop command and control decision tools for full-spectrum space operations, management, and control from peace to potential conflict.  Hallmark will demonstrate the ability to increase space threat awareness via use of multi-data fusion and time-relevant sensor tasking.  The program will also improve the ability to protect against threats by use of modeling and simulation tools for adversary intent determination and course of action development.  The program will employ comprehension and visualization techniques to increase commander and operator awareness to transform information to knowledge and effectively communicate and facilitate time-critical decision making.  The anticipated transition partner is the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete preliminary system design.\n-  Initiate real-time decision tools design development.\n-  Develop sensor data fusion algorithms.\n-  Define course of action data scheme.\n-  Develop intuitive applications and adaptive understanding capabilities for the next-generation space information fusion center."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System F6"
                                    },
                                    "Description": {
                                        "val": "The System F6 program sought to demonstrate the feasibility and benefits of satellite architecture technologies which facilitate a fractionated architecture wherein the functionality of a traditional \"monolithic\" spacecraft is replaced by a cluster of wirelessly-interconnected spacecraft modules.  Each such \"fractionated\" module could contribute a unique capability, for example, computation and data handling, communications relay, guidance and navigation, payload sensing, or it would replicate the capability of another module.  The cluster would deliver a comparable mission capability to a monolithic spacecraft.  The fractionated modules would fly in a loose, proximate cluster orbit capable of semi-autonomous reconfiguration or a rapid defensive scatter\/re-gather maneuver.  The program developed key technologies to facilitate fractionated and disaggregated architectures. The F6 Technology Package (F6TP), a suite of technologies, components, and algorithms that enables semi-autonomous multi-body cluster flight and secure, distributed, real-time sharing of various spacecraft resources at the cluster level was also developed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed F6TP engineering development units.\n-  Completed cluster flight application software development and testing.\n-  Completed a fully-functional, documented, value-centric architecture and design tool for adaptable space systems.\n-  Completed flight unit of the persistent broadband terrestrial connectivity terminal for Low Earth Orbit (LEO) fractionated clusters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SeeMe"
                                    },
                                    "Description": {
                                        "val": "The SeeMe program explored methods to provide near-real-time (for example, no older than ~90 minutes) images and other data  directly to individual users' handheld devices from space using a very low cost constellation of inexpensive, disposable small satellites routinely and inexpensively put in orbit through low-cost (for example, horizontal) launches.  SeeMe sought to radically shorten the entire cycle: ground development time, launch cadence, and on-orbit request-to-image-delivery time through new satellite manufacturing techniques, advanced low-cost aperture technologies, leveraging alternative launch concepts, and a novel direct-to-user command and data exfiltration architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed preliminary design of system hardware and software for the satellites.\n-  Completed prototype hardware field demonstrations (through balloon testing) to support radio uplink and downlink direct to user handhelds.\n-  Completed technology prototype units, performed functional and environmental tests, and demonstrated operation.\n-  Developed the first space factory to showcase high volume low cost satellite manufacturing capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}