{
    "id": "bd256c67ba8611f808943f6c6d7ee996ce5239a3",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "150"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "70.264"
            },
            "CurrentYear": {
                "val": "66.718"
            },
            "BudgetYearOne": {
                "val": "112.606"
            },
            "BudgetYearOneBase": {
                "val": "112.606"
            },
            "BudgetYearTwo": {
                "val": "102.984"
            },
            "BudgetYearThree": {
                "val": "11.057"
            },
            "BudgetYearFour": {
                "val": "11.378"
            },
            "BudgetYearFive": {
                "val": "10.022"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development and procurement of aerial, sea surface, and sub surface target systems, as well as target control systems, and associated Target Augmentation and Auxiliary Systems required to replicate real world threat systems.  These capabilities are required to execute developmental and operational test and evaluation of naval combat weapon systems and to satisfy advanced fleet training requirements.\n\nThis program is funded under RESEARCH, DEVELOPMENT, TEST AND EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.872"
                },
                "CurrentYear": {
                    "val": "79.718"
                },
                "BudgetYearOne": {
                    "val": "30.789"
                },
                "BudgetYearOneBase": {
                    "val": "30.789"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "70.264"
                },
                "CurrentYear": {
                    "val": "66.718"
                },
                "BudgetYearOne": {
                    "val": "112.606"
                },
                "BudgetYearOneBase": {
                    "val": "112.606"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.608"
                },
                "CurrentYear": {
                    "val": "-13.000"
                },
                "BudgetYearOne": {
                    "val": "81.817"
                },
                "BudgetYearOneBase": {
                    "val": "81.817"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-13.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.609"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "76.900"
                                },
                                "BudgetYearOneBase": {
                                    "val": "76.900"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.917"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.917"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Multi Stage Supersonic Target (MSST) (designated the GQM-173A) program increased in design\/development costs and experienced test failures, requiring the program to re-baseline. The MSST program will field a rocket-launched supersonic vehicle capability in FY18 with an end-to-end capability to follow. This re-baseline resulted in additional funding requirements in FY16. In FY16, $41.8 million was reprogrammed from WPN (BLI 2280) to mitigate the funding shortfall and continue the Engineering, Manufacturing, and Development phase to complete required testing.  Additionally, $5.8 million was also provided in FY16 to accelerate testing and fielding of a rocket-launched supersonic capability to satisfy near term Fleet test requirements. \n \nThe Subsonic Aerial Target (designated the BQM-177A) program required additional funding in FY16 due to software delays, guidance navigation and control technical issues, and poor correlation between 6 Degrees of Freedom modeling and air vehicle performance.  $4.1 million was reprogrammed from FY 2016 WPN (BLI 2280) to mitigate this shortfall and continue with the Engineering, Manufacturing, and Development phase. FY15 was reduced by $3 million for program restructure.\n \nIn PB15, the AST\/QF-16 and FSAT\/QF-4 programs were deferred while the Department of the Navy reevaluated requirements. In PB16, the QF-16 and QF-4 funding was restored beginning in FY16, providing $31 million for the procurement of QF-16 assets and engineering support of QF-4 assets."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "52.229"
                        },
                        "CurrentYear": {
                            "val": "56.296"
                        },
                        "BudgetYearOne": {
                            "val": "75.498"
                        },
                        "BudgetYearOneBase": {
                            "val": "75.498"
                        },
                        "BudgetYearTwo": {
                            "val": "68.180"
                        },
                        "BudgetYearThree": {
                            "val": "8.469"
                        },
                        "BudgetYearFour": {
                            "val": "8.748"
                        },
                        "BudgetYearFive": {
                            "val": "7.335"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "1"
                            },
                            "CurrentYear": {
                                "val": "1"
                            },
                            "BudgetYearOne": {
                                "val": "2"
                            },
                            "BudgetYearOneBase": {
                                "val": "2"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Aerial target systems, Target Control (TC), and associated Target Augmentation and Auxiliary Systems (TA\/AS) are developed to support test and evaluation and advanced fleet training for Joint Strike and Littoral Warfare Systems required to defend fleet surface and air units in a hostile environment.  In addition to hardware, software and operational concept development, studies will be performed by a University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development.  For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion.  For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach.\nAs to specific harware development, this project includes:\n- Supersonic Targets:  GQM-163A (to include high diver capability development) and GQM-173A.  Supersonic targets represent supersonic anti-ship cruise missile threats in direct support of Developmental Test and Evaluation (DT&E), Operational Test and Evaluation (OT&E) and Live Fire Test and Evaluation of major combat weapons programs and of fleet training.\n- Subsonic Targets:  BQM-177A development primarily represents subsonic anti-ship cruise missile threats in direct support of the Test & Evaluation of major combat weapons systems programs and of fleet training.  \n- TC and TA\/AS development: TC provides command and control of targets to enable the execution of threat-representative mission profiles.  The mission also includes the support design, development and qualification of various Target Mission Support Systems including but not limited to:  Scalar Scorers, Scoring Ground Station, Telemetry Antennas, Radar and Locator Beacons, Identification, Friend or Foe, and associated Test Sets.  TA\/AS enables each target to be uniquely configured for specific mission profiles.  TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics.  TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets"
                                    },
                                    "Description": {
                                        "val": "The GQM-173A target emulates a two-stage anti-ship cruise missile.  The GQM-173A will have a subsonic bus stage vehicle which will tumble and fall into the sea, and a supersonic sprint stage vehicle which continues flight to impact.  The fielded system will provide threat representation in support of DT&E and OT&E and will identify deficiencies in shipboard air defense systems.  Funding will also continue for GQM-163A upgrades\/evolutionary development to keep pace with evolving threat characteristics.  Efforts include continued development of performance envelope characteristics to include flight termination performance and quad launch capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.595"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Completed design trade studies.  Conducted ground testing, wind tunnel testing and the first of the Sprint Booster testing.  Completed initial release of the developmental simulation and the Hardware in the Loop (HIL) test bed.  Conducted Integrated Baseline Review, Program Managment Reviews (PMR), technical design meetings, a Schedule Risk Assessment (SRA) and completed Life-cycle cost estimate for rebaselined program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.248"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Continue ground and captive carry testing, perform supersonic vehicle flight tests, and begin validation of the models and simulations.  Conduct PMRs, System Functional Review, SRAs and technical design meetings. Commence quad launch effort which will provide the required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets from two to four."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "63.614"
                                            },
                                            "Articles": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "63.614"
                                            },
                                            "Articles": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Continue ground testing, continue separation flight tests, and continue validation of the models and simulations utilizing the HIL test bed and actual test data.  Conduct PMRs, Preliminary and Critical Design Reviews, SRAs and technical design meetings.  Continue quad launch effort which will provide the required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets from two to four."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets"
                                    },
                                    "Description": {
                                        "val": "The BQM-177A represents subsonic anti-ship cruise missile threat in direct support of the Test & Evaluation of major combat weapons systems programs and fleet training. It is the follow-on to the BQM-74 and BQM-34 targets, featuring increased speed, longer range, lower cruise altitudes and greater maneuverability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted developmental ground testing and qualification testing of software functionality and Rocket Assisted Take Off\/structures.  Conducted design reviews and flight tests to validate integrity of target. Provided government program management, engineering and logistics support and contract support services towards accomplishment of developmental efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue testing for qualification of software functionality and Rocket Assisted Take Off (RATO)\/structures.  Continue to conduct design reviews and flight tests to validate integrity of target. Provide government program management, engineering and logistics support and contract support services towards accomplishment of developmental efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.903"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.903"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete testing for qualification of RATO\/structures.  Continue to conduct design reviews and complete flight tests to validate integrity of target.  Provide government program management, engineering and logistics support and contract support services towards accomplishment of developmental efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Control (TC) and Target Augmentation and Auxiliary Systems (TA\/AS)"
                                    },
                                    "Description": {
                                        "val": "Continue to support TC and TA\/AS capable of supporting Test and Evaluation (T&E) and fleet training activities.  TC involves the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data. Continue to support design, development and qualification of Target Mission Support Systems (TMSS) including but not limited to Scalar Scorers, Scoring Ground Station, Telemetry Antennas, Radar and Locator Beacons, Identification Friend or Foe and associated Test Sets. Augmentation and Auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness and training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence. Support the development and qualification of TMSS."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 228000"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "39.460"
                                        },
                                        "CurrentYear": {
                                            "val": "45.683"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.792"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.792"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "81.678"
                                        },
                                        "BudgetYearThree": {
                                            "val": "83.406"
                                        },
                                        "BudgetYearFour": {
                                            "val": "93.537"
                                        },
                                        "BudgetYearFive": {
                                            "val": "95.426"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "WPN 612020"
                                    },
                                    "Title": {
                                        "val": "Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.374"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.657"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.657"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.939"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.943"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude                  0.95 M @ 6.6 ft @              0.90 M @10.0 ft @           TBD\n EMD                   [Mach (M) at feet (ft) above wave                 Sea State 5                             Sea State 3\n program              crest at WMO Sea State conditions]\n                   \n GQM-173A       Speed of separated sprint                               Mach 2.2 to Mach 3.5           Threshold=Objective             TBD\n EMD                   vehicle\n\n TC-TA\/AS          High Frequency Band Microwave Threat Simulation Systems-                         100 Watts output             High Fidelity Threat Electronic Attack & Active Emitter Simulators       Threshold=Objective             TBD\n  Target Threat                   Second Source                                              power\n  Simulation Program"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.664"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "31.818"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.818"
                        },
                        "BudgetYearTwo": {
                            "val": "32.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.048"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "77.530"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "2"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "5"
                            },
                            "BudgetYearOneBase": {
                                "val": "5"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems used exclusively for test and evaluation of naval weapons systems which closely represent current and projected threats to fleet units in the joint strike and the littoral warfare environments. These representations must include characteristics related to size, performance envelope, and electromagnetic and infrared signatures. As threats change, changes must be made to keep the targets threat representative in response to changes in the test requirements of the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Superiority Target (AST)"
                                    },
                                    "Description": {
                                        "val": "The AST is being developed as the follow-on to the current Full Scale Aerial Target and is an Air Force managed program.  The QF-16 is a converted F-16 aircraft that provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight maneuvers. The AST target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter (JSF), AIM-9X Sidewinder missile, Advanced Medium Range Air-to-Air Missile (AMRAAM), and Standard Missile 6 (SM-6)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.391"
                                            },
                                            "Articles": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Procurement of two AST assets with RDT&E,N funding.  Conduct depreservation and conversion of two more QF-16 aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.000"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.000"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Procure five AST assets with RDT&E,N funding. Conduct depreservation and conversion of additional QF-16 aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "QF-4 FSAT"
                                    },
                                    "Description": {
                                        "val": "The Full Scale Aerial Target (FSAT) is a supersonic, high altitude, remote-controlled aerial target.  This target has full command and control capability through normal flight maneuvers.  The program will include engineering and logistics support for the FSAT, including aviation depot level repairables and procurement of kit material. The QF-4 target presentations support aircraft and weapons systems testing and development, including that of the JSF, AIM-9X Sidewinder missile, AMRAAM and Standard Missile 6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate the fielded inventory for the Navy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate the fielded inventory for the Navy."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-4                Flight Termination Sys.- Reliable                 Achieve requirement        Threshold=objective       Satisfactory\nFull                  & effective auto & manual failsafe\nScale                 fast destruct, orbit destruct, &\nTarget               destruct receiver capability\n\nAST - Air           Capable of carrying, operating                   Achieve requirement           Threshold=objective        TBD\nSuperiority         and monitoring required\nTarget                payloads\n(QF-16)"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.363"
                        },
                        "CurrentYear": {
                            "val": "1.262"
                        },
                        "BudgetYearOne": {
                            "val": "1.236"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.236"
                        },
                        "BudgetYearTwo": {
                            "val": "1.299"
                        },
                        "BudgetYearThree": {
                            "val": "1.274"
                        },
                        "BudgetYearFour": {
                            "val": "1.303"
                        },
                        "BudgetYearFive": {
                            "val": "1.329"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.363"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed short burst data communication by satellite with Portable Command and Control Unit (PCCU) aboard seaborne platforms. Evaluated transmission latency and applicability with over the horizon counter-swarm strategies. Supported software development and continued testing of the transition to single hardware platform for joint hosting of PCCU and System for Naval Target Control (SNTC). Developed PCCU ground station enhancements allowing for control of greater than 15 independent remote targets. Reviewed existing capabilities of seaborne Program of Record (POR) platform inventory with regard to threats, weapons test schedules and evolving fleet training requirements. Evaluated fleet counter-swarm efforts and evaluated adequacy of existing POR targets for fleet support. Evaluated high-speed targets with regard to Anti-Surface Warfare (ASuW) weapons test requirements and recommended a path forward. Refined Hummanequin Graphical User Interface (GUI) on PCCU display to ease utility. Improved scoring algorithms for real-time feedback for small caliber weapons. Worked with Multiple Integrated Laser Engagement System (MILES) systems developers to incorporate larger shipboard weapon systems with MILES technology. Developed updated Technical Data Package (TDP) for replacement Mobile Ship Target (MST) based upon lessons learned and emerging ship-sized target requirements. Provided cost analysis of new missile capable patrol boat simulator. Initiated development of upgraded polyethylene hull components for towed targets with goal of reduced unit cost and enhanced survivability. Refined design and fabrication of passive Radio Frequency (RF) reflectors across varied aperture lengths to reduce unit cost and ease fabrication. Developed large polyethylene towed target (>50') for ASuW alternatives to high value powered targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research potential target modifications and operational changes to reduce Explosive Ordnance Disposal (EOD) involvement during exercises involving High Explosive (HE) or tracer rounds. Research inboard JP-5 engine version of High Speed Maneuverable Surface Target (HSMST) to increase engine service life when JP-5 fuel is required. Research electronic steering remote control interface for powered seaborne targets. Support software development and continued testing of the transition to single hardware platform for joint hosting of PCCU and SNTC. Test PCCU ground station enhancements allowing for control of greater than 15 independent remote targets. Review existing capabilities of POR seaborne targets inventory with regard to threats, weapons test schedules and evolving fleet training requirements. Evaluate fleet counter-swarm efforts to date and evaluate adequacy of existing POR targets for fleet support. Continue working with MILES systems developers to incorporate larger shipboard weapon systems with MILES technology. Work with MILES systems developers to increase realism and utility of MILES for training against surface threats. Continue refining design and fabrication of passive RF reflectors across varied aperture lengths to reduce unit cost and ease fabrication. Research additional lower cost manufacturing and fielding methods for POR targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and test electronic steering and throttle remote control interfaces for powered seaborne targets. Perform tests for development of streamlined High Speed Maneuverable Seaborne Target (HSMST). Develop upgrades to PCCU software to increase utility and safety. Work with Multiple Integrated Laser Engagement System (MILES) systems developers to increase training effectiveness on Navy platforms. Re-baseline radar cross section measurements for various target configurations to meet changing threats. Revise remote control system designs to reduce component costs. Research and test new configurations of Low Cost Modular Target (LCMT) to meet changing weapon system testing and fleet training requirements. Review existing capabilities of Program of Record (POR) seaborne targets inventory with regard to threats, weapon system test schedules, and evolving fleet training requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5455"
                                    },
                                    "Title": {
                                        "val": "ASW Range SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.990"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "84.837"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/5429"
                                    },
                                    "Title": {
                                        "val": "ASW SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.593"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.593"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.870"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.605"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.850"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.075"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "59.993"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets to meet fleet requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2159"
                    },
                    "ProjectTitle": {
                        "val": "ASW TARGET"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.008"
                        },
                        "CurrentYear": {
                            "val": "9.160"
                        },
                        "BudgetYearOne": {
                            "val": "4.054"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.054"
                        },
                        "BudgetYearTwo": {
                            "val": "1.505"
                        },
                        "BudgetYearThree": {
                            "val": "1.266"
                        },
                        "BudgetYearFour": {
                            "val": "1.327"
                        },
                        "BudgetYearFive": {
                            "val": "1.358"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "A new cost effective Advanced Expendable Mobile ASW Training Target (new nomenclature MK1 Mod 0 Parrotfish Expendable Target) is required to acoustically and dynamically emulate threat submarines for fleet qualification and proficiency training on and off undersea ranges.  Acoustically a new target is required to stimulate higher fidelity active sonar systems and torpedo sonar systems which have expanded frequency coverage than current systems.  These sonar and torpedo systems are being fielded on the P-8, SH-60R, and AN\/SQQ-89 capable surface ships and the MK54 Mod 0 and MK48 Mod 7 Torpedoes. Dynamically the target needs to emulate both low and high speed ends of threat submarines performance envelope to provide required training realism."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ASW Target Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.008"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported acquisition documentation development and specification development to be supported by performing risk reduction engineering analysis in areas of transducers, high energy batteries, water entry,  air & surface launch technologies, and underwater commandability.  Engaged fleet commands\/users to develop and refine detailed system performance requirements, industry engagement, and draft RFP release."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "RDT&E,N funding in FY15 will be used to fund modifications to MK30 Mod 1 and Mk39 EMATT TER targets to address some of the performance shortfalls identified in ASW Targets AoA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "RDT&E,N funding in FY16 will be used to continue to address performance shortfalls in the current fleet of ASW Targets and to conduct gap analysis and technology development for next-generation ASW Targets programs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "3141"
                                    },
                                    "Title": {
                                        "val": "ASW Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.135"
                                        },
                                        "CurrentYear": {
                                            "val": "2.515"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.912"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.912"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.861"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.876"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.084"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.308"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "59.691"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "- Frequent IPT meetings with contract and government technical program personnel.\n- Rigorous acoustic, environmental and in-water dynamic test program.\n- Specification with threshold and objectives requirements.\n- Issue initial RFI to industry.\n- Draft RFP released for industry review"
                        }
                    }
                }
            ]
        }
    }
}