{
    "id": "bfa94d377507a655390f31e0292965a37a4d89ce",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305199D8Z"
        },
        "ProgramElementTitle": {
            "val": "Net Centricity"
        },
        "R1LineNumber": {
            "val": "216"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.005"
            },
            "CurrentYear": {
                "val": "23.950"
            },
            "BudgetYearOne": {
                "val": "18.130"
            },
            "BudgetYearOneBase": {
                "val": "18.130"
            },
            "BudgetYearTwo": {
                "val": "18.518"
            },
            "BudgetYearThree": {
                "val": "19.550"
            },
            "BudgetYearFour": {
                "val": "20.773"
            },
            "BudgetYearFive": {
                "val": "21.053"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Funds will be used to provide technical analysis, systems engineering and capability management oversight of programs, projects, initiatives and activities to maximize the Department’s return on investment in information technology resources and affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved systems performance and military operations. Emphasis is placed on the information transport, information assurance\/cyber security, network and spectrum management, command and control (C2) applications, systems and services, information sharing capabilities, commercial mobile devices (CMD), applications and infrastructure, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of command, control, communication, computing network, and Information Infrastructure (C4II) capabilities and programs.  This program is funded under Budget Activity 7, Operational System Development.  \n\n     This project provides the resources necessary to implement net centric processes and authoritative analytic methods that provide the capability to synchronize interdependent C4II capabilities across all layers (ground, air, space) of the joint information environment (JIE) architecture, to forecast and achieve a balance in supply and demand for network capacity, and field effective capabilities more rapidly and efficiently as an enabler for C4II capabilities applications and services.  Resources are required to transform current networks and information infrastructure into an operationally unified and architecturally diverse joint information environment that will provide end-to-end communications transport layer, computing networks, and mission application capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, contested communications on the move, Position Navigation and Timing (PNT), C2 mission applications, commercial mobile devices, and information sharing capabilities.  These funds provide the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance capabilities with other joint information environment capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).  \n\n     In addition, funding will continue to be used to support the Defense Information System's Agency's (DISA) and Services' interoperable improvement efforts and processes in the development of common standards and protocols.  This effort includes initiating the Joint Interoperability Enhancement Process (IEP) that allows operators, engineers, and program managers to verify capabilities and identify issues in a design with Joint \/Allied units prior to system fielding, or with fielded systems to identify required systems changes for systems upgrade planning.  DISA and the Joint Forces Combatant Command lead the effort to transform the current standards and interoperability management tools to a common set of Joint network-enabled standards to ensure adherence to the Global Information Grid (GIG) enterprise-wide technical baseline and for implementation of future Tactical Data Link (TDL) capabilities. These joint standards, protocols, and processes will be used for implementation and testing to ensure the TDL capabilities are synchronized with the development and integration timelines of other planned network-enabled Global Information Grid (GIG) initiatives.  The threats to the networking waveforms and the Joint NC migration will also be looked at in cooperation with the Intelligence agencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.490"
                },
                "CurrentYear": {
                    "val": "23.984"
                },
                "BudgetYearOne": {
                    "val": "17.446"
                },
                "BudgetYearOneBase": {
                    "val": "17.446"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.005"
                },
                "CurrentYear": {
                    "val": "23.950"
                },
                "BudgetYearOne": {
                    "val": "18.130"
                },
                "BudgetYearOneBase": {
                    "val": "18.130"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.485"
                },
                "CurrentYear": {
                    "val": "-0.034"
                },
                "BudgetYearOne": {
                    "val": "0.684"
                },
                "BudgetYearOneBase": {
                    "val": "0.684"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.478"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "0.732"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.732"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.034"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Asumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.048"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.048"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  SBIR\/STTR Reduction -0.478 million, Program Adjustment -0.007 million.\nFY 2015:  FFRDC Reduction -0.034 million.\nFY 2016:  Economic Assumption -0.048 million, Program Adjustment 0.732 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "199"
                    },
                    "ProjectTitle": {
                        "val": "GIG Evaluation Facilities (GIG-EF) and GIG Enterprise-Wide Systems Engineering Advisory Activities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.005"
                        },
                        "CurrentYear": {
                            "val": "23.950"
                        },
                        "BudgetYearOne": {
                            "val": "18.130"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.130"
                        },
                        "BudgetYearTwo": {
                            "val": "18.518"
                        },
                        "BudgetYearThree": {
                            "val": "19.550"
                        },
                        "BudgetYearFour": {
                            "val": "20.773"
                        },
                        "BudgetYearFive": {
                            "val": "21.053"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds will be used to provide technical analysis, systems engineering and capability management oversight of programs, projects, initiatives and activities to maximize the Department’s return on investment in information technology resources and affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved systems performance and military operations. Emphasis is placed on the information transport, information assurance, network and spectrum management, command and control (C2) applications, systems and services, information sharing capabilities, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of command, control, communication, computing network, and Information Infrastructure (C4II) capabilities and programs.  This program is funded under Budget Activity 7, Operational System Development.  \n\n     This project provides the resources necessary to implement net centric processes and authoritative analytic methods that provide the capability to synchronize interdependent C4II capabilities across all layers (ground, air, space) of the joint information environment architecture, to forecast and achieve a balance in supply and demand for network capacity, and field effective capabilities more rapidly and efficiently as an enabler for C4&II capabilities applications and services.  Resources are required to transform current networks and information infrastructure into an operationally unified and architecturally diverse joint information environment that will provide end-to-end communications transport layer, computing networks, and mission application capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, contested communications on the move, Position Navigation and Timing (PNT), C2 mission application, and information sharing capabilities.  These funds provide the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance capabilities with other joint information environment capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).  \n\n     In addition, funding will continue to be used to support the Defense Information System's Agency's (DISA) and Services' interoperable improvement efforts and processes in the development of common standards and protocols.  This effort includes initiating the Joint Interoperability Enhancement Process (IEP) that allows operators, engineers, and program managers to verify capabilities and identify issues in a design with Joint \/Allied units prior to system fielding, or with fielded systems to identify required systems changes for systems upgrade planning.  DISA and the Joint Forces Combatant Command lead the effort to transform the current standards and interoperability management tools to a common set of Joint network-enabled standards to ensure adherence to the Global Information Grid (GIG) enterprise-wide technical baseline and for implementation of future Tactical Data Link (TDL) capabilities. These joint standards, protocols, and processes will be used for implementation and testing to ensure the TDL capabilities are synchronized with the development and integration timelines of other planned network-enabled Global Information Grid (GIG) initiatives.  The threats to the networking waveforms and the Joint NC migration will also be looked at in cooperation with the Intelligence agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Net Centricity Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.005"
                                            },
                                            "Text": {
                                                "val": "Conducted research on Use of Commercial Wireless Devices to support CMD strategy implementation; assessed effects of new cybersecurity policies on commercial wireless devices.\n–  updated CMD certification process, Mobile Application Management (MAM) and Mobile Device Management (MDM) guidance, developed approved product matrix for CMD and MDM.\n– Developed the Mobile Application Strategy and initial DoD Blackberry Strategy\n– Developed Mobile Application Approval process guide, DoD Mobile PKI guidance, and CMD procedure for Electronic Flight Bag (EFB)\n– Provided technical\/business case analyses for CMD and voice encryption.\n– Developed initial Radio\/Communication Security modernization plan for tactical radios.  Analyzed Service implementation data calls \n– Conducted analysis to update Combined Joint Task Force (CJTF) Architecture v5.0 to reflect component C4II capability plans \n– Supported development of interoperable Land Mobile Radio (LMR) standards to support public safety communications and FirstNet\n– Analyzed requirements and technologies\/standards; established procedures for Waveform Development and Management in the DoD\n– Developed Waveform Implementation Guide and authoritative list of DoD-approved waveforms, with a process\/supporting repository to maintain the approved waveform baseline \n– Provided technical analysis on methods for securing ISR data over wireless platforms and extended encryption of these devices, assessed implementation through UAS encryption data calls\n– Conducted technical SATCOM analysis (Protected, Wideband, Narrowband, Commercial); developed initial SATCOM capability strategy\n– Updated SATCOM Synchronization Architectures for Protected, Wideband, Narrowband and Commercial SATCOM capabilities. Developed improvements to integrate SATCOM Sync Architectures into overall DoD CIO assessment processes\n– Conducted compliance reviews of select programs; identified shortfalls in program bandwidth supportability planning and analysis; provided recommendations for corrective action.\n– Updated Defense Acquisition Guidebook (DAG) procedures to improve bandwidth supportability\n– Conducted SATCOM Gateway Right-sizing Study and assessed approaches to optimize SATCOM gateways across the defense enterprise.  \n– Conducted technical analysis to support PACOM gateway implementation.\n– Conducted technical and requirements analysis to determine way ahead for future Narrowband SATCOM capabilities.  Assessed feasibility on implementing legacy narrowband solutions for MUOS payload\n– Conducted analysis to determine approach to implement JIPM evolution and deployment strategy\n– Conducted technical analysis to assess options in support of the Protected SATCOM AoA\n– Conducted technical analysis and developed options to improve DoD utilization of Commercial SATCOM capabilities   \n– Conducted capability gaps analysis and developed an initial capability document for Airborne ISR (AISR) transport capabilities.  Developed AISR transport reference architecture to support the ICD\n– Developed a PNT capability inventory strategy and process to support the long term PNT strategy.\n– Provided technical development and analysis to support the evolution of Multi-National Information Sharing programs, related acquisition strategies, and functional requirements to enable continued development of C2 Information Sharing mechanisms and capabilities to enhance capability strategies.\n– Conducted technical analysis and policy support with emphasis on Coalition C2 and Multi-National Information Sharing (MNIS), including technical analysis of Coalition C2 functional requirements, strategic policy development and capability strategies addressed by the international community (inclusive of multilateral and bi-lateral engagements)  \n– Conducted technical analysis of selected joint and military Service C2 programs and initiatives to promote net-centric approaches for data, services and enterprise deployments and support integrated sustainment and modernization planning.\n– Provided technical assessments to inform and influence Mission Partner Environment (MPE) development and implementation activities.  \n– Provided technical analysis and support for the development of Common Mission Network Transport (CMNT) capability. \n– Conducted technical analysis to inform updates to Joint C2 technical and architectural artifacts to guide transition of Global Command and Control Family of Systems to a network enabled, joint information enterprise.\n– Analyzed approaches, potential costs and schedules to establish net-centric C2 capabilities consistent with Department objectives.\n– Conducted requirements\/gap analysis of all joint requirements documents and associated architectures for C4II capabilities\n– Conducted technical analysis for Airborne ISR data delivery.  Developed AISR SATCOM reference document, GIG Technical Profile, and architecture artifacts to support evaluation of alternatives\n– Conducted Common Data Link (CDL) technical analysis and demonstrated RIVET as a candidate database for CDL management\n– Performed DoD Commercial Mobility implementation and systems engineering analysis including: evaluation of alternatives for Mobility IDAM; analysis of industry rates for bringing commercial broadband to DoD sites; and workflow, provisioning and cost analysis for Defense Mobile Unclassified Capability (DMUC)\n– Developed Blackberry Transition Strategy; developed guidance to implement derived credentials.\n– Conducted analysis of LTE technology for DoD tactical use\n– Developed Network Management (NM) interoperability, architecture and data artifacts to support NM strategy implementation\n– Developed concept of operations, capabilities profiles and architecture considerations for JIE tactical processing nodes (TPNs).\n– Conducted analysis and developed a proposed framework and assessment plan for implementation of Tactical Secure Voice Communications Interoperability Specification (TSVSIC) for tactical radios  \n– Continued efforts to determine strengths, weaknesses, and uses of waveforms and network management capabilities; identified gaps; assessed new technologies in support of waveform and network management efforts\n– Conducted technical analysis\/developed GIG Technical Profiles and Reference Implementations for network management\n– Developed data ontologies and NIEM compliant Information Exchange Package Descriptions (IEPDs) for network management.   \n– Conducted technical analysis to support C4II related policies, plans, studies, roadmaps, and C4II capability assessments.   \n– Conducted analysis of the Narrowband SATCOM environment; developed the Future Narrowband SATCOM Architecture artifacts\n– Conducted studies and developed analytical papers to support DoD Mobile Device Strategy and Mobile Device Security Efforts\n– Conducted technical analysis\/studies related to the migration of current applications and services to DoD Core Data Centers.  Developed decision matrices to support the rationalization of applications for the JIE.\n– Conducted technical analysis to support the Joint Technology Synchronization Office (JTSO) Integrated Design Team (IDT) efforts related to implementation of JIE capability upgrades, and support JIE Increment 2 technical planning.\n– Conducted studies and analysis to refine metrics and assess progress of Joint Information Environment (JIE) technical implementation \n– Conducted analysis of Tactical Secure Voice Cryptographic Interoperability Specification (TSVCIS) to support tactical radios \n– Conducted analysis and developed implementation strategies to promote IPV6 use in tactical systems.\n– Continued follow-on Joint Aerial Layer Network analysis with Joint Service JALN Council, overseeing Service implementation efforts\n– Continued JALN capability Non-Recurring Engineering (NRE) development.\n– Continued technical efforts to stand up Interoperability Enhancement Process (IEP) working with DISA, J6, and Services.\n– Conducted technical and policy assessments to enable Tactical Data Link (TDL) migration.\n– Initiated Common Data Link (CDL) movement to documenting a Drafted MIL-SPEC to support Joint Interoperability.\n– Supported Allied and Coalition interoperability efforts including NATO migration plan, Joint Strike Fighter (JSF) partner interoperability, US\/Swedish Master Information Exchange Agreement (MIEA), and integration of US and foreign communications and C2 systems\n– Published 2014 Joint Tactical Data Link (TDL) Migration Plan (JTMP) with both policy and migration plan.\n– Conducted Network Analysis of Inter-network Architectures including Inter Mobile Ad-hoc Network (MANET) Routing (InterMR) alternatives to support Joint Aerial Layer Network (JALN) capabilities.\n– Assessed JALN Line of Sight (LOS) communications with ground and flight test evaluations to characterize radio frequency performance for JALN aerial, ground, and maritime nodes, Advanced Networking Waveform Two (ANW2) used to support the tests.\n– Evaluated feasibility of Delay Tolerant Networking (DTN) architectures and alternatives to support JALN capabilities.\n– Refined gateway right sizing options, proposed RF terminal solutions and baseband equipment suites including the number and types of equipment needed to meet the future needs of the war fighter.  Coordinated and facilitated Teleport Program Office oversight initiatives.\n– Conducted follow-on analysis to formalize JIPM evolution and deployment strategies to support video dissemination and two-way GBS capabilities to inform follow on implementation across the Department.\n– Conducted analysis for the SATCOM International Standards Committee (SISC).  Support development of US lead Standardized Agreements (STANAGS) and provided technical reviews of other nation's STANAG's for accuracy, completeness, and feasibility.  \n– Developed acquisition strategy for U.S. support to NATO SATCOM post 2019.\n– Provided technical analysis and facilitated execution of the SATCOM Systems Engineering Group (SSEG).\n– Reviewed, Assessed and Processed FY14 DISN Tech Refresh Plan for CIO approval.  \n– Coordinated, facilitated and recorded DISN Quarterly reviews to assessed progress and issues in transport and network infrastructure, unified capabilities and network management  \n– Developed and coordinated with Services a JIE Infrastructure Framework to support MILDEP and DISAs JIE infrastructure deployment or implementation \nDeveloped acquisition like review of JIE objectives, plans, technical approach, schedule and cost factors to support review"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.950"
                                            },
                                            "Text": {
                                                "val": "$5.000 million supports classified program, Details can be provided at a higher classification under separate cover.\n\n$18.950million supports:\n– Conduct technical assessment\/refine commercial wireless policy guidance to support CMD strategy implementation; continue assessments of the effects of cybersecurity policy.\n– Refine CMD certification processes, Mobile Application Management (MAM)\/Mobile Device Management (MDM) guidance, and guidance for personal user based enforcement; update approved product matrix for CMD\n– Conduct implementation assessments to refine Mobile Application Strategy and Blackberry Strategy\n– Update Mobile Application Approval process guide, DoD Mobile PKI guide, and procedure for the Electronic Flight Bag (EFB)\n– Provide technical and business case analyses for Commercial mobile devices and voice encryption.\n– Update the Radio and Communication Security modernization plan for tactical radios.  Assess Service implementation \n– Conduct analysis and update the CJTF Architecture to reflect component C4II capability plans \n– Continue development of interoperable Land Mobile Radio (LMR) standards to support public safety communications and FirstNet\n– Conduct analysis to update LMR policy to refine procedures for LMR implementation in the DoD \n– Conduct analysis and refine procedures for Waveform Development and Management in the DoD.  \n– Evolve the Waveform Policy Implementation Guide to ensure an authoritative list of DoD-approved waveforms, with a process and supporting repository to solicit waveform applications and maintain the approved waveform baseline \n– Provide technical analysis on methods for securing ISR data over wireless platforms and extended encryption of these devices, conduct implementation assessments through UAS encryption data calls\n– Provide technical analysis and support for Protected, Wideband, Narrowband, and Commercial SATCOM.  Developed an initial strategy and policy to guidance optimize SATCOM capabilities.\n– Update SATCOM Synchronization Architectures for Protected, Wideband, Narrowband and Commercial SATCOM capabilities. Continue efforts to integrate SATCOM Sync Architectures into overall DoD CIO assessment processes\n– Conduct compliance reviews of select programs; identify shortfalls in program bandwidth supportability planning and analysis and provide recommendations for corrective action.  Submit annual Bandwidth report to Congress as required by NDAA \n– Continue SATCOM Gateway Right-sizing Study and develop implementation approaches to optimize SATCOM gateways across the defense enterprise.  Provide technical analysis to support PACOM gateway implementation.\n– Continue technical and requirements analysis to determine way ahead for future Narrowband SATCOM capabilities.  Continue feasibility assessments for implementing legacy narrowband solutions for MUOS payload\n– Continue analysis to determine approach to implement JIPM evolution and deployment strategy\n– Provide technical analysis to assess options in support of the Protected SATCOM AoA\n– Continue technical analysis to implement approaches to improve DoD utilization of Commercial SATCOM capabilities   \n– Conduct an evaluation of alternatives to address Airborne ISR (AISR) transport capability gaps.  Update AISR transport reference architecture artifacts to support assessments.\n– Continue technical analysis of Coalition C2 and MNIS, analyze Coalition C2 functional requirements, strategic policy development and capability strategies to guide Mission Partner Environment development.   \n– Conduct technical analysis of selected joint and Service C2 programs\/initiatives to promote enterprise approaches for data and services consistent with joint C2 sustainment and modernization plans.\n– Provide technical analysis for the implementation of Common Mission Network Transport (CMNT) capability.\n– Provide technical analysis of MNIS programs and initiatives, related acquisition strategies, and functional requirements; continue development of C2 information sharing metrics and mechanisms consistent with capability strategies\n– Conduct analysis to refine the joint C2 technical and architectural artifacts and inform transition of GCCS Family of Systems to a network enabled applications and services rationalized for the JIE\n– Provide studies and analysis of the C2 capability gaps to inform investment strategies, enable investment tracking, and POM development \n– Conduct analyses to address adoption and evolution of C2 mission services as candidate enterprise services for the JIE.\n– Continue requirements\/gap analysis of all joint requirements for C4II capabilities\n– Continue wireless architecture and advanced technologies analysis to inform implementation of mobility solutions.\n– Conduct technical analysis to support compliance oversight of waveform policies and technical profile specifications\n– Develop updates to Department-wide communications policies applicable to commercial mobile devices\n– Continue DoD Commercial Mobility implementation and systems engineering analysis Defense Mobile Unclassified and Classified Capabilities (DMUC\/DMCC)\n– Conduct analysis to support DMUC derived credentials implementation.\n– Continue analysis of LTE technology for DoD tactical use\n– Continue technical analysis for Network Management (NM) interoperability, architecture and data artifacts\n– Continue systems engineering and architecture analysis for JIE tactical processing nodes (TPNs).\n– Continue analysis to address Tactical Secure Voice Communications Interoperability Specification (TSVSIC) implementation  \n– Continue efforts to determine strengths, weaknesses, and uses of waveforms and network management capabilities; identified gaps; assesse new technologies in support of waveform and network management efforts\n– Conduct technical analysis\/develop GTPs and Reference Implementations in support of network management strategy and roadmap.\n– Continue development of data ontologies and NIEM compliant IEPDs for network management.   \n– Conduct technical analysis in support of C4II policies, plans, studies, roadmaps, and capability assessments.   \n– Continue end-to-end analysis of the SATCOM environment; support evaluations and analysis of end-to-end capabilities \n– Conduct studies and develop analytical papers in support of the DoD CIO’s Mobile Device Strategy and Mobile Device Security Efforts\n– Continue technical analysis\/studies related to the migration of current applications and services to DoD Core Data Centers and support rationalization of applications for the JIE.\n– Provide technical analysis to support the Joint Technology Synchronization Office (JTSO) Integrated Design Team (IDT) efforts related to implementation of JIE capability upgrades and technical planning.\n– Conduct studies and analysis to finalize metrics and assess progress of JIE technical implementation actions. \n– Conduct technical analysis and studies related to Software Defined Networking (SDN) as an approach to network normalization \n– Continue follow-on JALN analysis with Joint Service JALN Council, overseeing Service implementation efforts\n– Continue JALN capability Non-Recurring Engineering (NRE) development.\n– Develop foundation for Interoperability Enhancement Process (IEP) for Joint capabilities with DISA\/J6 Enterprise Toolset and Data Base.\n– Conduct technical and policy assessments to enable Tactical Data Link (TDL) migration.\n– Continue Joint Common Data Link (CDL) documentation of official waveform in support of Joint interoperability.\n– Support Allied and Coalition interoperability efforts including NATO migration plan, JSF partner interoperability, US\/Swedish MIEA, and integration of US and foreign communications and C2 systems\n– Publish Joint TDL Migration Department of Defense Issuance (DoDI) for Joint migration policy.\n– Evaluate available Delay Tolerant Network (DTN) technology and architecture alternatives to support JALN capability development.\n– Evaluate High Frequency (HF) waveform characteristics and performance (including anti-jam) to support JALN capabilities.\n– Analyze available Gateway architecture alternatives to support inter-platform connectivity and reach back to JALN.\n– Assess performance of airborne and ground tactical domain waveform alternatives to support additional platforms, emerging applications and Service mission needs in support of JALN capabilities. \n– Analyze available directional networking technologies to support scalable Tactical Data Link (TDL) communications in high threat environments such as the JALN Anti Access\/Area Denial (A2\/AD) operations.  \n– Refine gateway right sizing options; propose RF terminal solutions and baseband equipment suites including the number\/types of equipment needed to meet the future warfighter needs.  Coordinate and facilitate Teleport Program Office oversight initiatives.\n– Conduct analysis to evolve SATCOM networks toward an EOIP modem architecture.  Continue support of video dissemination and two-way GBS capabilities to inform follow on implementation across the Department.\n– Conduct analysis for the SATCOM International Standards Committee.  Support development of US lead Standardized Agreements (STANAGS) and provide a technical review of other nation's STANAG's for accuracy, completeness, and feasibility.   \n– Develop acquisition strategy for U.S. support to NATO SATCOM post 2019.\n– Provide technical analysis and facilitate execution of the SATCOM Systems Engineering Group (SSEG).\n– Review, Assess and Process FY15 Defense Information Systems Network (DISN) Tech Refresh Plan for CIO approval.  \n– Support DISN Quarterly reviews to assessed progress and issues in transport and network infrastructure, unified capabilities and network management  \n– Coordinate with DISA and MILDEPs to maintain and expand the JIE Infrastructure Framework to evolve into an infrastructure synchronization roadmap that tracks infrastructure deployment or implementation\n– Revise acquisition like review of JIE objectives, plans, technical approach, schedule and cost factors \n– Support the development of business case activities as required for C4II capabilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.130"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.130"
                                            },
                                            "Text": {
                                                "val": "– Continue technical assessment\/refine commercial wireless policy guidance to support CMD strategy implementation; continue assessments of the effects of cybersecurity policy.\n– Continue CMD certification processes, refine Mobile Application Management (MAM)\/Mobile Device Management (MDM) guide, and guide for personal user based enforcement; update  approved product matrix for CMD\n– Continue implementation assessments to refine Mobile Application Strategy and Blackberry Strategy\n– Review\/refine Mobile Application Approval process guide, DoD Mobile PKI guide, and procedure for the Electronic Flight Bag (EFB)\n– Continue technical and business case analyses for Commercial mobile devices and voice encryption.\n– Update the Radio and Communication Security modernization plan for tactical radios.  Assess Service implementation \n– Continue analysis to update the CJTF Architecture to reflect component C4II capability plans \n– Continue development of interoperable Land Mobile Radio (LMR) standards to support public safety communications and FirstNet\n– Continue analysis to of LMR policy implementation, refine procedures to support LMR implementation in the DoD \n– Continue analysis of Waveform Development and Management in the DoD.  \n– Continue analysis to maintain authoritative list of DoD-approved waveforms and supporting repository to maintain waveform baseline \n– Continue technical analysis on methods for securing ISR data over wireless platforms and extended encryption of these devices, conduct implementation assessments through UAS encryption data calls\n– Continue technical analysis and support for Protected, Wideband, Narrowband, and Commercial SATCOM.  Assess strategy alignment.\n– Update SATCOM Synchronization Architectures for Protected, Wideband, Narrowband and Commercial SATCOM capabilities. \n– Continue compliance reviews of select programs; identify shortfalls in program bandwidth supportability planning and analysis and provide recommendations for corrective action.\n– Continue efforts to implement SATCOM Gateway Right-sizing approaches to optimize SATCOM gateways across the defense enterprise.  \n– Continue technical\/requirements analysis and feasibility assessments for implementing legacy narrowband solutions for MUOS payload\n– Continue analysis to support implementation approaches for JIPM evolution and deployment strategy\n– Conduct follow-on analysis in support of the Protected SATCOM AoA\n– Continue technical analysis to improve DoD utilization of Commercial SATCOM capabilities   \n– Conduct Airborne ISR (AISR) transport AoA follow-on analysis.  Update AISR transport reference architecture to support implementation\n– Continue technical analysis of Coalition C2 and MNIS, analyze Coalition C2 functional requirements, strategic policy development and capability strategies to guide Mission Partner Environment development.   \n– Continue technical analysis of selected joint and Service C2 programs\/initiatives to promote enterprise approaches for data and services consistent with joint C2 sustainment and modernization plans.\n– Continue technical analysis for the implementation of Common Mission Network Transport (CMNT) capability.\n– Continue technical analysis of MNIS programs and initiatives, related acquisition strategies, and functional requirements; continue development of C2 information sharing metrics and mechanisms consistent with capability strategies\n– Continue analysis to refine the joint C2 technical and architectural artifacts and inform transition of GCCS Family of Systems to a network enabled applications and services rationalized for the JIE\n– Continue studies and analysis of the C2 capability gaps to inform investment strategies, enable investment tracking, and POM development\n– Continue analyses to address adoption and evolution of C2 mission services as candidate enterprise services for the JIE.\n– Continue requirements\/gap analysis of all joint requirements for C4II capabilities\n– Continue wireless architecture and advanced technologies analysis to inform Department-wide policies and implementation of mobility solutions.\n– Continue technical analysis to support compliance oversight of waveform policies and technical profile specifications\n– Continue efforts to refine communications policies and analysis technologies applicable to commercial mobile devices\n– Continue DoD Commercial Mobility implementation and systems engineering analysis Defense Mobile Unclassified and Classified Capabilities (DMUC\/DMCC)\n– Continue analysis to support DMUC derived credentials implementation.\n– Continue analysis of LTE technology for DoD tactical use\n– Continue technical analysis for Network Management (NM) interoperability, architecture and data artifacts\n– Continue systems engineering and architecture analysis for JIE tactical processing nodes (TPNs).\n– Continue analysis to address implementation of TSVSIC for tactical radios  \n– Continue efforts to determine strengths, weaknesses, and uses of waveforms and network management capabilities; identified gaps; assesse new technologies in support of waveform and network management efforts\n– Continue technical analysis to support implementation of the network management strategy and roadmap.\n– Continue development of data ontologies and NIEM compliant IEPDs for network management.   \n– Continue technical analysis in support of C4II policies, plans, studies, roadmaps, and capability assessments.   \n– Continue end-to-end analysis of the SATCOM environment; support technical evaluations of end-to-end capabilities \n– Continue studies and analysis in support of the DoD CIO’s Mobile Device Strategy and Mobile Device Security Efforts\n– Continue technical analysis\/studies related to the migration of current applications and services to DoD Core Data Centers and support rationalization of applications for the JIE.\n– Continue technical analysis to support implementation of JIE capability upgrades and technical planning.\n– Continue studies and analysis to progress of JIE technical implementation actions. \n– Continue technical analysis and studies related to SDN as an approach to network normalization and security\n– Continue follow-on JALN analysis with Joint Service JALN Council, overseeing Service implementation efforts\n– Continue JALN capability NRE development.\n– Stand up Joint IEP team starting with Link 16 and work on adding Variable Message Format (VMF), Link 11\/22, Multifunction Advanced Data Link (MADL), and Common Data Link (CDL) through the FYDP.\n– Continue technical and policy assessments to enable TDL migration.\n– Continue efforts to finalize Joint MIL-SPEC for CDL and initiate documentation for MADL in coordination with JSF team.\n– Continue support for Allied and Coalition interoperability efforts including NATO migration plan, JSF partner interoperability, US\/Swedish MIEA, and integration of US and foreign communications and C2 systems\n– Publish Joint TDL Migration plan in support of TDL Migration policies.\n– Assess available technologies for adaptive digital radio frequency beam forming capabilities for robust and scalable networking in JALN A2\/AD environments.\n– Analyze available Gateway technology alternatives to address JALN capabilities in the evolving threat environment with both physical (eg jamming) and cyber-attacks.\n– Assess developing waveform technologies for improving the robustness and scalability of current TDL networks supporting JALN including lab and flight testing.\n– Assess developing Laser communications technologies available to support JALN capabilities.\n– Continue efforts to refine gateway right sizing options, propose RF terminal solutions and baseband equipment suites including the number and types of equipment needed to meet the future needs of the war fighter.  Coordinate and facilitate Teleport Program Office oversight initiatives. \n– Continue analysis to evolve SATCOM networks toward EOIP modem architecture.  Continue support of video dissemination and two-way GBS capabilities to inform follow on implementation across the Department.\n– Continue analysis for the SATCOM International Standards Committee (SISC).  Participate in the development of US lead Standardized Agreements (STANAGS) and provide a technical review of other nation's STANAG's for accuracy, completeness, and feasibility.  \n– Continue efforts to develop acquisition strategy for U.S. support to NATO SATCOM post 2019\n– Continue technical analysis and facilitate execution of the SATCOM Systems Engineering Group (SSEG)\n– Continue efforts to review, assess and process DISN Tech Refresh Plan for CIO approval.  \n– Coordinate, facilitate and record DISN Quarterly reviews to assessed progress and issues in transport and network infrastructure, unified capabilities and network management  \n– Continue efforts to maintain JIE Infrastructure Framework and synchronization roadmap to track  infrastructure deployment or implementation \n– Continue acquisition like review of JIE objectives, plans, technical approach, schedule and cost factors to support review of JIE\n– Support the development of business case activities as required"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "– PPBE related issue development and approval\n– Successful technical development and analysis of the CIO and DCIO C4IIC portfolio of programs and activities\n– Develop comprehensive risk assessment and mitigation approaches of the CIO and DCIO C4IIC portfolio of programs and activities"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Studies and Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.149"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.967"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.967"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.732"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.810"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.293"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.293"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.514"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.967"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.799"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.799"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.088"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.084"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.176"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.169"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.169"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "R&D Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.310"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.899"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.818"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.818"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "Net Centricity R4.gif"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "FY14 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY15 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY16 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY18 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 Project Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}