{
    "id": "c15a065546b4caeb21bdb238ca1ba653b2dbbdca",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605075D8Z"
        },
        "ProgramElementTitle": {
            "val": "DCMO Policy and Integration"
        },
        "R1LineNumber": {
            "val": "127"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "50.023"
            },
            "PriorYear": {
                "val": "19.318"
            },
            "CurrentYear": {
                "val": "19.324"
            },
            "BudgetYearOne": {
                "val": "2.223"
            },
            "BudgetYearOneBase": {
                "val": "2.223"
            },
            "BudgetYearTwo": {
                "val": "1.986"
            },
            "BudgetYearThree": {
                "val": "1.644"
            },
            "BudgetYearFour": {
                "val": "1.339"
            },
            "BudgetYearFive": {
                "val": "1.648"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "To produce and sustain a Business Enterprise Architecture (BEA) to guide business transformation and business system investment actions for the DoD.  The requirement to produce and maintain a BEA is codified in NDAA 2012, USC Title 10, Section 2222 with amplifying guidance from OMB.  The proposed program provides improved capabilities to access and use the BEA information including descriptions of business processes and associated information assets; required capabilities and associated performance requirements; and governing laws, regulations and policies (LRPs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.969"
                },
                "CurrentYear": {
                    "val": "19.351"
                },
                "BudgetYearOne": {
                    "val": "16.227"
                },
                "BudgetYearOneBase": {
                    "val": "16.227"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.318"
                },
                "CurrentYear": {
                    "val": "19.324"
                },
                "BudgetYearOne": {
                    "val": "2.223"
                },
                "BudgetYearOneBase": {
                    "val": "2.223"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.651"
                },
                "CurrentYear": {
                    "val": "-0.027"
                },
                "BudgetYearOne": {
                    "val": "-14.004"
                },
                "BudgetYearOneBase": {
                    "val": "-14.004"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.651"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.027"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Adjustments due to mission change, inflation and to support other department priorities."
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-14.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-14.004"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "075"
                    },
                    "ProjectTitle": {
                        "val": "DCMO Policy and Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "50.023"
                        },
                        "PriorYear": {
                            "val": "19.318"
                        },
                        "CurrentYear": {
                            "val": "19.324"
                        },
                        "BudgetYearOne": {
                            "val": "2.223"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.223"
                        },
                        "BudgetYearTwo": {
                            "val": "1.986"
                        },
                        "BudgetYearThree": {
                            "val": "1.644"
                        },
                        "BudgetYearFour": {
                            "val": "1.339"
                        },
                        "BudgetYearFive": {
                            "val": "1.648"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "To produce and sustain a Business Enterprise Architecture (BEA) to guide business transformation and business system investment actions for the DoD.  The requirement to produce and maintain a BEA is codified in NDAA 2012, USC Title 10, Section 2222 with amplifying guidance from OMB.  The proposed program provides improved capabilities to access and use the BEA information including descriptions of business processes and associated information assets; required capabilities and associated performance requirements; and governing laws, regulations and policies (LRPs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DCMO Policy and Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.318"
                                            },
                                            "Text": {
                                                "val": "BEA Compliance, Standards, and DCMO Tools Implementations\n• Designed, developed and deployed a restructured BEA application and information resource capability that provides more\nefficient and effective execution of DCMO Section 2222 of Title 10, U.S.C. responsibilities for the Defense BEA.\n• Designed, developed, and delivered DoD enterprise wide Business Intelligence and Analytics (BIA) visualizations and\nexaminations throughout the Investment Review Board, Enterprise Transition Plan, and Out of Cycle review seasons.\n• Designed, developed, and delivered SharePoint solutions to support the DoD Business Mission Area (BMA), Office of the\nDCMO, Planning and Performance Management, and government responsibilities for DoD Conference Reporting.\n• Enabled innovation through utilization of technology to support more and better alignment of business operations for the\nDepartment. Innovations incorporated a strategic alignment of BEA views of operational activities to include the capture of\nresources, processes and enabling technologies.\n• Further developed and implemented the BEA technology strategy to improve the articulation of business requirements and\nperformance metrics and strengthen outreach to DoD and Federal business stakeholders, decision makers and civilian and\ncommercial business leaders.\n• Collaborated with DoD CIO regarding interoperability and data requirements and Joint Information Environment (JIE) alignment,\nimplementation and compliance methods and information sharing standards for the BMA.  Provided input on progress of business system milestones and documented status in the Congressional Report on Defense Business Operations.\n• Encouraged the evolution of architecture and data standards in support of DoD requirements and processes for implementing\nopen standards and enterprise level applications.\n• Initiated actions to transition BIA hosting environment to the Defense Information Systems Agency.\n• Collaborated with the Federal CTO and Federal CIO in support of Federal Reporting and Performance Initiatives.\n• Supported IT Business Acquisition Oversight by providing technical standards and real time BEA compliance reporting and\nanalytical support to IRBs.\n• Designed, developed and deployed tools for management of business system problem statements, support to Combatant\nCommanders (COCOMS) in support of their business systems, pilots to support process and policy change in the business\nmission area and oversight tools for DCMO."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.324"
                                            },
                                            "Text": {
                                                "val": "BEA Compliance, Standards, and DCMO Tools Implementations\n• Design and deliver more efficient and effective applications and information resource capabilities supporting DCMO Title 10 Section 2222 responsibilities for Defense Business Enterprise Architecture.\n• Design and deliver new enterprise architecture products comprising BEA content to support OSD business outcomes, performance\/process improvement initiatives and Federal reporting requirements.  This includes content collected during business process system reviews.\n• Incorporate other mission area owner requirements and provide interoperability development to ensure Warfighter, Enterprise Information Environment, and Intelligence Mission Area architectural alignment, implementation, and information sharing (including compliance reporting) with the BMA.\n• Address revised design and deployment requirements to support BEA restructuring supporting OSD organization actions and reviews.  This includes structure improvements for Business Case Analysis (BCA) and Service Development and Delivery Process (SDDP) artifacts.\n• Further design, develop, and deploy DoD enterprise wide visualization and analysis capabilities for organizational Business Process System Reviews (BPSRs) as well as overall DoD mission area system oversight analysis.\n• Continue technology innovation to support more and better alignment of business operations for the Department. Innovations will further support a strategic alignment of BEA views of operational activities and processes to include the capture of BCA\/SDDP reference models, outcomes and performance measures.\n• Continue data integration for automated processing of authoritative data source information and staging of content in a shared web-service cloud environment.\n• Further develop and implement the BEA technology strategy to improve the articulation of document business requirements and performance metrics, strengthening outreach to DoD and Federal business stakeholders, decision makers and civilian and commercial business leaders.\n• Continue evolution of open architecture and data standards in support of DoD requirements and processes for enabling and implementing enterprise level business applications.\n• Enable deployment of Defense Business system (DBS) capabilities consistent with evolving BEA direction and guidance.\n• Design, develop and deploy tools for the evolving and changing emphasis in oversight of the BMA with continued emphasis on support to policy and process change and technology insertion. Continue to operate and deploy pilot activities and tools in the BMA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.223"
                                            },
                                            "Text": {
                                                "val": "• Design and deliver more efficient and effective applications and information resource capabilities supporting DCMO Title 10 Section 2222 responsibilities for Defense Business Enterprise Architecture.\n• Design and deliver new enterprise architecture products comprising BEA content to support OSD business outcomes, performance\/process improvement initiatives and Federal reporting requirements.  This includes content collected during BPSRs.\n• Continue incorporating other mission area owner requirements and provide interoperability development to ensure Warfighter, Enterprise Information Environment, and Intelligence Mission Area architectural alignment, implementation, and information sharing (including compliance reporting) with the BMA.\n• Assess requirements and innovative utilization of technology to support enhanced alignment of business operations for the Department. \n• Continue technology innovation to support enhanced alignment of business operations for the Department.\n• Continue evolution of open architecture and data standards in support of DoD requirements and processes enabling and implementing enterprise level business applications.\n• Establish requirements for the evolving and changing emphasis in management of the OSD with continued emphasis on support to policy and business process change and technology insertion. \n• Design, develop and deploy tools for the evolving and changing emphasis in oversight of the BMA with continued emphasis on support to policy and process change and technology insertion. Continue to operate and deploy pilot activities and tools in the BMA."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Section 2222 of Title 10, USC required that a single Business Mission Area (BMA) Investment Review Board (IRB) be established. As part of the stand-up of this single IRB, Principal Staff Assistant (PSA) and DoD Components are charged with specifying and delivering required business outcomes for the Department. These business outcomes are then incorporated into the architecture data products making up the Department's Business Enterprise Architecture (BEA), under the oversight and direction of the Defense Business Council. This metric measures the incorporation of the Component identified business outcomes into the BEA. FY 2014 Goal: 80% of  business outcomes and BRM\/PRM performance data incorporated into the BEA. FY 2015 Goal: 90% of  business outcomes and BRM\/PRM performance data incorporated into the BEA.  FY 2016 Goal: 100% of  business outcomes and BRM\/PRM performance data incorporated into the BEA."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Design enterprise architecture taxonomy"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCMO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mark Center"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "50.023"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.363"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.763"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Capability to automate and generate metadata on ingest of architecture information"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCMO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mark Center"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.999"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.763"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Extend user access to BEA via web services"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCMO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mark Center"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.956"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.899"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.223"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.223"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Port BEA into Cloud environment"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCMO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mark Center"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.899"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "RDOC R4 (2015-01-05).jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Sub projects"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Design enterprise architecture taxonomy"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Capability to automatically generate metadata on ingest of architecture information"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "User access to BEA via web services"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Port BEA to a cloud environment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}