{
    "id": "c17614f04b0ca9fe301082ed6085533516919913",
    "meta": {
        "filename": "dod-2016_RDTE_2016_MDA_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603294C"
        },
        "ProgramElementTitle": {
            "val": "Common Kill Vehicle Technology"
        },
        "R1LineNumber": {
            "val": "42"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "67.796"
            },
            "CurrentYear": {
                "val": "25.639"
            },
            "BudgetYearOne": {
                "val": "46.753"
            },
            "BudgetYearOneBase": {
                "val": "46.753"
            },
            "BudgetYearTwo": {
                "val": "75.262"
            },
            "BudgetYearThree": {
                "val": "71.476"
            },
            "BudgetYearFour": {
                "val": "86.814"
            },
            "BudgetYearFive": {
                "val": "99.701"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2016 increase to Common Kill Vehicle Technology, MD85, begins the concept definition for a Multi-Object Kill Vehicle (MOKV) to address an emerging threat."
        },
        "ProgramElementMissionDescription": {
            "val": "On 15 March 2013, the Secretary of Defense announced steps to bolster protection of the homeland and stay ahead of the evolving quantity and complexity of long range ballistic missile threats.  These steps included adding Ground-Based Interceptors (GBI) and shifting resources to develop advanced kill vehicle technology to improve all ballistic missile defense interceptors that operate outside the earth's atmosphere.  The successful first phase of the Common Kill Vehicle Technology effort defined concepts for the redesign of the GBI Exo-atmospheric Kill Vehicle (EKV).  This effort completed advanced technology development and transitioned to the redesigned kill vehicle effort in FY 2014.  \n\nThe next phase of the Common Kill Vehicle Technology effort will enhance our interceptor performance by improving discrimination and adding the capability to destroy several objects within a threat complex using multiple kill vehicles carried on a single interceptor.  The Agency is developing the concepts for a MOKV based on a modular, open architecture designed to common interfaces and standards, making upgrades easier and broadening our vendor and supplier base.  The Agency will focus on the competitive development of a MOKV concept(s) with industry in FY 2016.\n\nThis capability relies on a Ballistic Missile Defense System (BMDS) architecture that balances performance across the sensor, Command, Control, Battle Management and Communications, and kill vehicle elements. The Agency anticipates deploying this capability across the interceptor fleet in the next decade to address the evolving threat.  \n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to the MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "70.000"
                },
                "CurrentYear": {
                    "val": "25.639"
                },
                "BudgetYearOne": {
                    "val": "33.171"
                },
                "BudgetYearOneBase": {
                    "val": "33.171"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "67.796"
                },
                "CurrentYear": {
                    "val": "25.639"
                },
                "BudgetYearOne": {
                    "val": "46.753"
                },
                "BudgetYearOneBase": {
                    "val": "46.753"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.204"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.582"
                },
                "BudgetYearOneBase": {
                    "val": "13.582"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.095"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.109"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "13.582"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.582"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2016 $13.582 million increase to Common Kill Vehicle Technology, MD85, begins the concept definition for a Multi-Object Kill Vehicle (MOKV) to address an emerging threat. The FY 2016 increase reflects a realignment of Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD85"
                    },
                    "ProjectTitle": {
                        "val": "Common Kill Vehicle Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "67.796"
                        },
                        "CurrentYear": {
                            "val": "24.327"
                        },
                        "BudgetYearOne": {
                            "val": "44.558"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.558"
                        },
                        "BudgetYearTwo": {
                            "val": "71.515"
                        },
                        "BudgetYearThree": {
                            "val": "67.671"
                        },
                        "BudgetYearFour": {
                            "val": "82.007"
                        },
                        "BudgetYearFive": {
                            "val": "94.027"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The FY 2016 increase to Common Kill Vehicle Technology, MD85, begins the concept definition for a Multi-Object Kill Vehicle (MOKV) to address an emerging threat."
                        },
                        "ProjectMissionDescription": {
                            "val": "In calendar year 2014, Phase I of the Common Kill Vehicle (CKV) resulted in the transition of industry concepts for a Re-designed Kill Vehicle (RKV).  The concepts informed the Agency's development of system requirements.  These requirements are the foundation for product development of the RKV.  \n\nThe Agency's focus in FY 2016 is to develop government and industry concepts for a MOKV as a second phase of common kill vehicle technology.  A key element is the requirement for industry to comply with a modular, open architecture with common standards and interfaces defined by the government.  These requirements make future upgrades easier and broaden our vendor and supplier base.  In FY 2016, the Agency will award several contracts with industry to define concepts for a Multi-Object Kill Vehicle (MOKV) based on this open architecture.  The Government will develop MOKV system engineering guidelines from the industry concept(s), government analysis, modeling, and simulation along with hardware-in-the-loop (HWIL) prototype concept demonstration(s).  The kill vehicle HWIL prototype concept(s) and identified technologies will formulate the trade space across cost, risk, and kill vehicle performance to establish requirements that are feasible and affordable for the engineering, manufacturing and development of a future MOKV.\n\nThe effectiveness of the Ballistic Missile Defense System (BMDS) relies on balancing in the performance requirements across the elements in the architecture.  For example, the goal of the sensor portion of the architecture is to detect, acquire, track and discriminate the lethal object(s) from the spent stage, deployment debris, and countermeasures the enemy may deploy to spoof the system.  If the warfighter launches several interceptors at each object designated lethal by the system it is critical that the system do this with nearly perfect accuracy.  \n\nThe sensor architecture performance is not perfect, and analysis shows that having multiple kill vehicles on each interceptor dramatically improves the performance of the system, while it significantly reduces the burden of our interceptor inventory, reducing our cost to defend the Homeland.\n\nThe Agency's past efforts on multiple kill vehicle research showed that the most difficult technical challenge for Multi Kill Vehicles (MKV) was managing the many-on-many engagements that occur.  In FY 2016, the Agency will resume tackling this challenge by investigating the engagement management concepts authored by industry as well as our government concepts.  The Agency will test these algorithms and strategy using our HWIL, and invest in key technologies that will enable an MOKV concept including Kill Vehicle-to-Kill Vehicle communications, and more accurate and lighter weight inertial measurement unit (IMU). \n\nThe MOKV industry prototype concept(s) will identify and reduce development risk; identify technology readiness; and demonstrate critical technical features and capabilities.  The Agency will use industry concept models to assess MOKV performance and the utility of a MOKV architecture.  The prototype demonstration will validate the industry concept models for higher confidence and prove the viability of the MOKV.  These results will inform Agency requirements development efforts that may support a future milestone decision.  \n\nAccurate and reliable IMUs are essential for accurate navigation during the long Kill Vehicle flight times required to engage Intercontinental Ballistic Missile threats.  The Multi-Object Kill Vehicle (MOKV) investments will develop precise, small, lightweight, highly reliable, and low cost Inertial Measurement Units (IMUs) to increase Kill Vehicle performance for long Kill Vehicle flight times.  Continued investment will satisfy the IMU performance needed for the small, high performance Kill Vehicle concepts that can defeat future interceptor threats.  This IMU will demonstrate improved performance over current state of the art by reducing navigation error.  The initial hardware IMU prototype will demonstrate reduced size, weight and power requirements.  \n\nHigh band width Kill Vehicle-to-Kill Vehicle and Kill Vehicle-to-ground communications will enable engagement management for MOKV architecture.  The MOKV investments will focus on minimizing size, weight and power of a software defined radio that provides flexible communication capabilities that are robust and reliable.  Design and development efforts of this communications technology in 2016 will lead to a future prototype demonstration of high band-width communications using software defined radio technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Kill Vehicle"
                                    },
                                    "Description": {
                                        "val": "The Missile Defense Agency is developing common kill vehicle technology to address emerging threats and enable the missile defense of our homeland."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "67.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Focused on developing kill vehicle common technology for both the Ground-Based Interceptor (GBI) and Standard Missile-3 (SM-3) missiles that enhance interceptor capability against the evolving and future threat.  These investments in a kill vehicle common technology approach will help ensure the viability of our homeland ballistic missile defenses.\n\nSpecifically, the Agency:\n- Completed joint government and industry concept definition for the redesign of the GBI Exoatmospheric Kill Vehicle.  The kill vehicle concepts aided the Agency in establishing the requirements foundation for the redesigned GBI Kill Vehicle\n- Completed inertial and alternative navigation technology trade study that identified the concept design parameters for an inertial measurement unit that will increase the probability of kill and reliability while decreasing seeker mass of future interceptors   \n- Completed digital focal plane array design that improves reliability and discrimination for future interceptors\n- Developed systems engineering guidelines for joint government and industry concept definition of a MOKV that reduces the cost of production and weapon system operations through new kill vehicle architectures and scalable technology  \n- Developed kill vehicle modular architecture, to take advantage of common component interfaces for the development of future kill vehicles while broadening the vendor base"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.327"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop Kill Vehicle payload criteria to support Broad Agency Announcement (BAA) for the MOKV concept definition  \n- Receive and assess proposals for MOKV concept definition award(s) in FY2016\n- Develop government MOKV concept for independent performance predictions via government simulations to establish baseline for contractor concept assessment(s)\n- Improve focal plane array yield by optimizing the manufacturing processes\n- Develop a second source design of a 512x512 digital Read Out Integrated Circuit (ROIC) focal plane array to support enhanced discrimination for future BMDS interceptors\n- Develop initial inertial measurement unit (IMU) design using a ring laser gyro and a micro-electro-mechanical system (MEMS) accelerometer to upgrade BMDS interceptors  \n- Conduct radiation environment screening of IMU parts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- The FY 2016 $13.221 million increase to Common Kill Vehicle Technology, MD85, begins the concept definition for a Multi-Object Kill Vehicle (MOKV) to address an emerging threat\n- Award industry contracts for the development of MOKV concept(s)\n- MOKV industry contractor(s) will deliver initial concepts and modeling parameters for preliminary government assessment\n- Initiate development of the MOKV engagement management algorithms to address managing the many-on-many engagement challenges due to complex threats\n- Update and refine government Multi-Object Kill Vehicle (MOKV) concept for independent performance predictions via government simulations to initiate contractor concept assessment(s)\n- Build, assemble and test initial inertial measurement unit prototype to support model validation\n- Initiate design and analysis of a high band width software defined radio to support kill vehicle-to-kill vehicle and kill vehicle-to-ground communications"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.919"
                                        },
                                        "CurrentYear": {
                                            "val": "8.470"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.227"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.932"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.249"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.268"
                                        },
                                        "CurrentYear": {
                                            "val": "54.068"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.389"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.389"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.912"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.115"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.595"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.797"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.025"
                                        },
                                        "CurrentYear": {
                                            "val": "16.584"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.919"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.380"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.069"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.457"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.271"
                                        },
                                        "CurrentYear": {
                                            "val": "58.503"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.074"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.655"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.194"
                                        },
                                        "BudgetYearFive": {
                                            "val": "57.162"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy consists of three focus areas. First, through competition with missile integration contractors, develop kill vehicle architecture and interfaces with follow on competitive design of multi-object kill concepts incorporating engagement management concept of operations, lightweight kill vehicles and enhanced discrimination capability.  Second, conduct risk reduction activities to identify and mature the technology necessary to increase the reliability and performance of our kill vehicles using the Advanced Technology Innovation Broad Agency Announcement and competitive procurements.  Make the necessary investments to maturing component technology; enhanced inertial navigation and kill vehicle-to-kill vehicle communications.  Third, leverage the technical expertise of Federally Funded Research and Development Centers, University Applied Research Centers, and Universities and government laboratories to independently develop reference concept using proven modeling\/analysis techniques."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program Wide Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.312"
                        },
                        "BudgetYearOne": {
                            "val": "2.195"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.195"
                        },
                        "BudgetYearTwo": {
                            "val": "3.747"
                        },
                        "BudgetYearThree": {
                            "val": "3.805"
                        },
                        "BudgetYearFour": {
                            "val": "4.807"
                        },
                        "BudgetYearFive": {
                            "val": "5.674"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY 2015 transferred from Technology Program Element in accordance with the FY 2014 Consolidated Appropriations Act (P.L. 113-76) with a proportional allocation to RDT&E program elements.\nProgram Wide Support estimate reflects proportional changes FY 16-20 as a result of increases\/decreases in Common Kill Vehicle Technology program element."
                        },
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Services, and Federally Funded Research and Development Center (FFRDC) support.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office and equipment leases; utilities; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes:0305103C Cyber Security Initiative, 0603274C Special Program, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Wide Support"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- FY 2014 Accomplishments were captured in multiple Program Elements under MD40 Budget Project"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.312"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Beginning in FY 2015, Program Wide Support was proportionately allocated to Common Kill Vehicle Technology\n- See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- See paragraph A:  Mission Description and Budget Item Justification."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}