{
    "id": "c4db56c33dc7715ef5a6fbf524700f65f39915eb",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804767D8Z"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2)"
        },
        "R1LineNumber": {
            "val": "173"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "119.364"
            },
            "PriorYear": {
                "val": "38.245"
            },
            "CurrentYear": {
                "val": "38.950"
            },
            "BudgetYearOne": {
                "val": "43.811"
            },
            "BudgetYearOneBase": {
                "val": "43.811"
            },
            "BudgetYearTwo": {
                "val": "43.914"
            },
            "BudgetYearThree": {
                "val": "43.492"
            },
            "BudgetYearFour": {
                "val": "43.486"
            },
            "BudgetYearFive": {
                "val": "44.074"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "These programs support readiness of the joint force by creating a Joint Training Environment to replicate the complex and changing operational environment.  The funding increase beginning in FY 2015 represents planned growth and internal reprogramming decisions to accelerate development of a cloud-enabled joint training environment.  These investments directly support defense strategic guidance and enhance joint warfighting readiness by building training capabilities that support the operational readiness of the force.  The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n- Joint Simulation System (JSS)\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n- U.S. Forces Korea Training & Exercise Support (USFK)\n- Air Force Joint National Training Capability (JNTC)\n- Navy Joint National Training Capability (JNTC)\n\nJNTC:  The mission of the Joint National Training Capability (JNTC) program is to advance joint capabilities and interoperability by concentrating on emerging joint training requirements through collective training experiences using a managed set of globally distributed capabilities and activities. The program resources Service and SOF joint training and enabling capabilities that improve interoperability and realism of tactical and operational joint training between the Services and USSOCOM. JNTC enables joint collective training for Combatant Commands and Services by developing relevant joint training content and ensuring global distributed access. The enabling capabilities support the Services and USSOCOM in their requirement to provide trained and ready forces in support of Combatant Command operational requirements. This program will focus efforts on improving, rather than consuming, readiness and create a ready surge force consistent with Chairman’s guidance.\n\nJSS:  The Joint Simulation System (JSS) provides a low cost, distributed or deployable, web-based joint training capability with a small technical and operator footprint.  The JSS funding provides warfighters with joint simulations and tools that enhance and enable Joint training across Services, Combatant Commands, Combat Support Agencies, NATO and multinational partners. The Joint simulations and tools provided by JSS funding are critical enablers that support the delivery of trained, capable, and interoperable joint forces.  JSS’s intent is to maintain a capability to share simulation environments with coalition partners.\n\nJKDDC:  Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the JS J7 program of record for online joint training that implements and operationalizes the OSD T2 JKDDC.  JKO directly supports the CE2T2 program by developing, delivering, tracking, and reporting online training for Combatant Command exercises; Combatant Command required training; doctrinally based Joint Operations Core Curriculum; multinational, coalition, IA training; and OSD required training (externally funded).  JKO also expends funding for leading edge technology review, market research, and integration to directly enhance specific aspects of the training capability as required for J7 support to Combatant Commanders. JKO satisfies all requirements necessary to provide the CE2T2 stakeholders with a distributed learning capability and access to web-based training content.\n\nUSFK:  FY 2015 is the last year for dedicated funding within the overall program.  The U.S. Forces Korea (USFK) Training & Exercise Support program develops simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  Interoperability with the Republic of Korea-developed Korean Simulation System (KSIMS) is a critical and unique requirement of this USFK RDT&E program.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences -- tactical to strategic -- in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit other combatant commander training programs that use the aging Joint, Live, Virtual, and Constructive (JLVC) simulations and the emerging JLVC 2020 simulations.  \n\nAir Force JNTC:  The Air Force JNTC funding provides a focused upgrade to develop models for space-based capabilities for integration into the JLVC environment.  The Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements, and significantly increases the training audience to additional joint and coalition participants.  \n\nNavy JNTC:  These funds enable the Navy to develop unique maritime capabilities that integrate JLVC elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and Coalition Forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "38.909"
                },
                "CurrentYear": {
                    "val": "44.005"
                },
                "BudgetYearOne": {
                    "val": "43.084"
                },
                "BudgetYearOneBase": {
                    "val": "43.084"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.245"
                },
                "CurrentYear": {
                    "val": "38.950"
                },
                "BudgetYearOne": {
                    "val": "43.811"
                },
                "BudgetYearOneBase": {
                    "val": "43.811"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.664"
                },
                "CurrentYear": {
                    "val": "-5.055"
                },
                "BudgetYearOne": {
                    "val": "0.727"
                },
                "BudgetYearOneBase": {
                    "val": "0.727"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.016"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.648"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.055"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Program Realignment to O&M"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Baseline Program Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.164"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.164"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.109"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.109"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Joint Warfighting - Space"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decreased funding for the USFK program is attributed to the fact that the program is nearing completion and will no longer require RDT&E funding.  Funding was realigned in FY 2016 to the O&M appropriation to support other priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "63.547"
                        },
                        "PriorYear": {
                            "val": "18.977"
                        },
                        "CurrentYear": {
                            "val": "22.948"
                        },
                        "BudgetYearOne": {
                            "val": "31.808"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.808"
                        },
                        "BudgetYearTwo": {
                            "val": "32.816"
                        },
                        "BudgetYearThree": {
                            "val": "32.116"
                        },
                        "BudgetYearFour": {
                            "val": "32.107"
                        },
                        "BudgetYearFive": {
                            "val": "32.581"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Investment in the Joint National Training Capability (JNTC) program will enable Service and Combatant Commands to train as they operate.  The net funding increase in FY 2015 is planned growth to accelerate development of the cloud-enabled joint training environment.  The funding requested continues development of exercise Scenario Management Tools and services that support planning and execution of joint training, and continued maturation of a single integrating architecture for Joint Training.  Funding supports the development of cloud-enabled modular training application services.  Program intent is to reduce dependence on touch labor, and mitigate the impact of reductions in operation and sustainment funding.  Focus must be maintained to deliver operationally relevant training environments and respond to changes in the warfighter’s operational environment.  JNTC enables the Department of Defense to be responsive to the warfighters’ pace of changing operational concepts, threat environments, and best practices. In FY 2016, this investment expands access for Service and Combatant Command trainers to plan and execute joint training.  Funds support improved relevance and realism of training by providing capabilities that replicate the contemporary and future operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "JNTC provides the technical standards, architecture (blueprint), and development processes required to integrate\/link joint training programs.  The Joint Training Environment is envisioned as an integrated network of training sites and nodes, and accessible joint training and force development services.  By leveraging existing training programs and initiating specific actions, JNTC develops credible opposing force capabilities and expanded access to assets typically unavailable to the training audience.  This enhances the integration of joint training objectives into Service training events.  Funding in this account supports the technical integration of Joint and Service modeling and simulation training capabilities.  Technical integration enables selective aggregation of training audiences at the Combatant Command, Joint Task Force, and Component Command Headquarter levels.  The funding supports modernization of the Joint Training Environment (JTE) to increase warfighter access to automated training enablers (through web-based and cloud capabilities). \n\nThe Adaptive Training Capability Program (ATCP) is a subordinate component of JNTC that enables the Joint Force to be responsive to the warfighters’ pace of changing operational concepts, threat environments, and best practices.  ATCP funding advances joint capabilities and interoperability by addressing emerging joint training requirements through a managed set of globally distributed JLVC enablers.  ATCP funding promotes joint context to Service training programs and joint enablers supporting Combatant Command training requirements and CJCS High Interest Training Items identified in the Chairman’s Annual Training Guidance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.977"
                                            },
                                            "Text": {
                                                "val": "• Established the Joint Training Enterprise Architecture (JTEA) (Blueprint).  This blueprint enables the DoD training community to produce technical designs that adhere to standards, meeting DoD mandates for data center consolidation and technical alignment with the Joint Information Environment (JIE).  \n• Conducted successful JLVC 2020 modeling and simulation training capability integration events with the Services to prepare for limited operational capability in FY 2015.\n• Continued to build JTE modeling and simulation, networking, and information technology applications into a cloud-enabled modular service supporting Combatant Command and Service joint training requirements.  \n• Demonstrated the Virtual Collective Training Environment (VCTE) in development.  VCTE is a Virtual World Framework capability that provides a virtual collaboration space with linkages to real world systems that will allow for virtual interaction of training activity participants. \n• Developed the Joint After Action Review-Resource Library (JAAR-RL), Version 3.1 capability.  Provided a virtualized, web-enabled suite of enterprise after action review services supporting the Joint Training Enterprise Architecture (JTEA).\n• Upgraded USAF Space simulation capabilities for Global Positioning Satellite and infrared sensor representations which adapted a capability to capture classified data into training\/simulation capabilities.\n• Developed a graphic user interface that assists migration of map datum in the U.S. National Global Spatial vector dataset supporting terrain development requirements for the USMC Marine Air Ground Task Force Tactical Warfare Simulation in support of Joint, Coalition and multi-Service training events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.948"
                                            },
                                            "Text": {
                                                "val": "• In accordance with Deputy Assistant Secretary of Defense (Readiness) (DASD(R)) direction to “Advance Joint Training Environment to exist within a future JIE and Data Center Consolidation Initiative,” continue development and refinement of the JTE strategy, roadmap, and conceptual design working with the Services, Combatant Commands, Coalition partners, agencies, and the DoD modeling and simulation community to deliver a training environment reliant on cloud-enabled modular services with an initial operating capability in FY 2016, and full operating capability in FY 2022.\n• Conduct JLVC 2020 Integration Events with Services to prepare for limited operational capability release in CY 2015.\n• Continue development of a capability that provides Combatant Command and Service consumers the ability to search for and download across the exercise network, exercise order of battle data from different data sources for initiating exercise modeling and simulation systems.\n• Continue Service simulation integration by providing direction, specification, standards, and testing environments to enable the integration of Service, Joint Combatant Command, and Agency simulations, services and tools. \n• Complete development of a 3-D immersive virtual environment to facilitate a distributed collaboration environment. \n• Develop an amphibious scheduling service that provides U.S. Marine Corps doctrinally correct amphibious events\/effects in support of training without USMC Subject Matter Experts present. \n• Develop an unconventional warfare service that is intended to simulate Special Operations Forces (SOF) Unconventional Warfare at the Operational Level. This service is intended to be used for cases where the training audience is at the Combatant Commands, JTF, or SOF Component level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.808"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.808"
                                            },
                                            "Text": {
                                                "val": "• IAW DASD(R) direction to “enhance adaptivity by implementing innovative collective\/individual training,” achieve JTE initial operating capability in FY 2016 in order to provide the home station user with initial ability to conduct small Joint Command Post simulation exercises and individual staff section simulation training at home stations.\n• Continue Service simulation integration by providing direction, specification, standards, and testing environments to enable the integration of Service, Joint Combatant Command and Agency simulations, services and tools.  \n• Invest in Information Technology capabilities to support expected growth in home-station training Joint training enabler demand driven by returning forces, and a fiscally-driven adaptive training model that relies more heavily on home-station activities.  \n• Continue development of JTE tools\/services that support reduction in out-year training operations and sustainment costs, for planning, designing, provisioning and executing Combatant Command and Service joint training activities.\n• Develop cloud management services that automatically provide JTE services (i.e. data, simulation, planning tools, virtualize C2, etc.) through additional computing power\/resources based on user demand.\n• Develop a network planning service that allows the user to create the physical layout of the training domain (i.e. computer workstations, C2 Systems, Simulation Workstations, SIPR Machines, printers, etc.) being used for the exercise\/event."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.037"
                                        },
                                        "CurrentYear": {
                                            "val": "25.732"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.341"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "36.341"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.880"
                                        },
                                        "BudgetYearThree": {
                                            "val": "35.865"
                                        },
                                        "BudgetYearFour": {
                                            "val": "35.308"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.328"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on the performance metrics below.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; access, cost, realism, relevance and technology as defined below:\n\n•  Access – Develop design standards that enable participation across DoD and, as applicable, with Coalition Partners. Make the environment available to meet user demands.\n•  Cost – Enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow. \n•  Realism – Enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow.\n•  Relevance – Maintain operational relevance through adaptation to the changing operational environment.\n•  Technology – Sustain the training environment network through developments for distributed home station training that include modular cloud-enabled training services.\n\nMeasures:\n•  Provide external access and data usage from the Consolidated Data Center. (FY 2015)\n•  Conduct integration events with Services and gain enterprise consensus for publishable standards. (FY 2015)\n•  Set conditions for Service participation in model decomposition. (FY 2015)\n•  Service performs decomposition of legacy models and simulations. (FY 2016)\n•  Develop\/deliver Amphibious Scheduling Service (FY 2015)\n•  Initiate\/Develop individual staff section training (FY 2015)\n•  Increase the number of Order of Battle data sources accessible across the training network for search and download (FY 2015 and FY 2016)\n•  JLVC 2020 achieves Initial Operating Capability (FY 2016)\n•  Publish standards for developing JTE modular services (FY 2015\/2016)\n•  Conduct at least one small Joint Command Post distributed training event from home station (FY 2016)"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "761"
                    },
                    "ProjectTitle": {
                        "val": "Joint Simulations Systems (JSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.225"
                        },
                        "PriorYear": {
                            "val": "3.036"
                        },
                        "CurrentYear": {
                            "val": "2.193"
                        },
                        "BudgetYearOne": {
                            "val": "2.324"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.324"
                        },
                        "BudgetYearTwo": {
                            "val": "1.406"
                        },
                        "BudgetYearThree": {
                            "val": "1.408"
                        },
                        "BudgetYearFour": {
                            "val": "1.409"
                        },
                        "BudgetYearFive": {
                            "val": "1.423"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Simulation System (JSS) will decompose, harvest, and reuse DoD investment in joint simulations to develop cloud-enabled modular services (CEMS), reaching Initial Operating Capability in FY 2016.  JSS will further development of existing Joint Conflict and Tactical Simulation (JCATS) and Joint Theater Level Simulation (JTLS) as required, to remain relevant and responsive to meet Combatant Command training requirements as the Joint Training Environment is implemented.  JSS will provide design and development of web-based applications used as services in CEMS environment.  The decrease in funding from FY 2014 to FY 2015 represents the programmed plan to complete the cloud-enabled modular services (CEMS) development of decomposed\/harvested capabilities of legacy simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Simulation System (JSS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides warfighters with joint simulations and tools that enhance and enable Joint training across Services, Combatant Commands, agencies and coalition partners.  These joint simulations and tools are part of an overall JLVC baseline of training capabilities.  They represent a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the joint training environment.  The joint simulations and tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.036"
                                            },
                                            "Text": {
                                                "val": "• Continued transition to JLVC 2020 by decomposing, harvesting, and re-using DoD investment in Joint simulations to develop cloud-enabled modular services (CEMS).\n• Delivered operating system and information assurance development for the Joint Theater Level Simulation (JTLS) & Joint Conflict and Tactical Simulation (JCATS) to enable continued use to meet COMBATANT COMMAND’s training requirements.\n• Provided design and development of web-based applications used as services in CEMS environment.\n• Began design and development of Tactical Electronic Intelligence (TAC ELINT) Service and Satellite (SAT) Service as part of the decomposition and harvesting from the legacy simulations.\n• Continued to provide low cost, small support footprint, web-enabled and\/or deployable solutions critical to Combatant Command training programs.\n• Continued JLVC 2020 development of cloud-enabled modular services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.193"
                                            },
                                            "Text": {
                                                "val": "• Sustain joint training capability using JTLS and JCATS to meet Combatant Command training requirements until the next generation of Joint Training Modeling and Simulation Federation is fielded with like-capabilities.\n• Continue development of JCATS and JTLS to meet Combatant Command training requirement gaps during transition to Joint Training Modeling and Simulation Federation. \n• Provide design and development of web-based applications used as services in cloud-based modular services environment supporting.\n• Provide  Joint Training Modeling and Simulation Federation.  Develop the service for the web-based Air Tasking Order Generator and an Air Tasking Order Translator that interfaces with the JLVC-2020 Runtime Database. \n• Develop the Unconventional Warfare Service.  This service will simulate Special Operations Forces Unconventional Warfare at the Operational Level.\n• Complete development of TAC ELINT and SAT Services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.324"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.324"
                                            },
                                            "Text": {
                                                "val": "• Continue to develop\/support JTLS and JCATS as a low cost, small support footprint, web-enabled and\/or deployable solution in order to meet Combatant Command and mission partner training requirements as well as Coalition and Service interoperability needs until next generation Joint Training Modeling and Simulation services are fielded with like-capabilities.\n• Perform test and integration for new development work completed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JSS O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.957"
                                        },
                                        "CurrentYear": {
                                            "val": "0.953"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.943"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.943"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.444"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer capabilities synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• JTLS and JCATS availability in use for support of Service, Combatant Command, agency, and Coalition training activities is above 95%.\n• Enhance joint model and simulation capabilities to meet 65% of Combatant Command training requirements in hybrid threats and Anti-Access\/Area-Denial functional areas.\n• Develop the following modular services: Air mission scheduling service, and Unconventional warfare service."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.031"
                        },
                        "PriorYear": {
                            "val": "3.950"
                        },
                        "CurrentYear": {
                            "val": "4.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.984"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.984"
                        },
                        "BudgetYearTwo": {
                            "val": "3.989"
                        },
                        "BudgetYearThree": {
                            "val": "4.087"
                        },
                        "BudgetYearFour": {
                            "val": "4.088"
                        },
                        "BudgetYearFive": {
                            "val": "4.129"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the DoD unique and authoritative source for online joint training.  JKDDC JKO is tasked to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to OSD(P&R) CE2T2 Program Goals & Objectives guidance, CJCS High Interest Training Items, Joint Staff J7 training priorities, and JKDDC JKO Stakeholder (Combatant Commands, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education, and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKO research and development will improve:  \n\n•  Small Group Scenario Trainer (SGST) desktop modeling and simulation based training: These capabilities train and prepare tens of thousands of military and civilian personnel deploying to COMBATANT COMMAND theaters prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. \n•  JKO mobile courseware training device development:  This facilitates the global distribution of web-based joint training content on portable, hand-held platforms.  \n•  JKO Learning Content Management System (LCMS): JKO LCMS development is required to host and deliver JKO courses and track\/report students’ completions more efficiently."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) technology initiatives principally include Small Group Scenario Trainer (SGST) desktop modeling and simulation based training, mobile courseware training devices, and the JKO Learning Content Management System (LCMS) application.  JKO mobile courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for DoD personnel.  The JKO LCMS development is required to host and deliver JKO courses and track\/report students’ completions more efficiently."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.950"
                                            },
                                            "Text": {
                                                "val": "• Developed, tested, and delivered an update to the Small Group Scenario Trainer (SGST) desktop modeling and simulation based training application.  Updated product derived from Combatant Command user feedback provided a more effective and efficient training capability that was integrated within the JKO Learning Content Management System (LCMS).  This update improved the OSD endorsed Blended Learning Training component of Combatant Command collective training exercises. \n• Assessed, refined, and continued implementing JKO’s comprehensive plan to develop mobile training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Planned components included existing JKO courseware conversion to hand-held devices, emerging FY 2014 training courseware requirements, and the leveraging of other DoD agencies, interagency, and multinational training courseware ported to mobile training devices.  \n• Developed, tested and delivered three JKO Learning Content Management System (LCMS) releases resulting in a more effective and efficient online training delivery and management application that is interoperable with DoD personnel management systems.  Requirements were derived from Combatant Command user feedback and DoD training priorities.  These enhancements facilitated approximately 30,000 daily log-ins and approximately 110,000 course completions per month by DoD personnel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "• Assess, refine, and continue executing JKO’s comprehensive plan to develop mobile training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components include existing JKO courseware conversion to portable, hand-held devices, emerging FY 2015 training courseware requirements, and the leveraging of other DoD agencies, interagency, and multinational training courseware ported to mobile training devices.  \n• Develop, test and deliver three JKO Learning Content Management System (LCMS) releases resulting in a more effective and efficient online training management application that is interoperable with DoD personnel management systems.  \n• Develop, test, and deliver one JKO Small Group Scenario Trainer (SGST) desktop modeling and simulation application release resulting in a more effective and efficient training capability integrated within JKO Learning Content Management System (LCMS).  The SGST will be used to prepare individuals serving in approximately six Combatant Command collective training exercises."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.984"
                                            },
                                            "Text": {
                                                "val": "• Assess, refine, and continue executing JKO’s comprehensive plan to develop mobile training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Anticipate the development\/conversion of ~150 training courses, eBooks, Podcasts, job aids, and videos resulting in tens of thousands of hours spared for DoD personnel required to take this training. \n• Develop, test and deliver three JKO Learning Content Management System (LCMS) releases.  Requirements will be derived from Combatant Command user feedback and DoD training priorities directed by DASD(R) for JKO to “develop content for pre-exercise training and support, as required by the Army and Marine Corps and supported GCCs, and support individual and unit training for REF\/SP-MAGTF missions.”  Anticipate these enhancements will improve the ease of use for the current approximately 30,000 daily log-ins and approximately 110,000 course completions per month by DoD personnel.  \n• Develop, test, and deliver one JKO Small Group Scenario Trainer (SGST) desktop modeling and simulation application release resulting in a more effective and efficient training capability integrated within JKO Learning Content Management System (LCMS)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JKDDC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.937"
                                        },
                                        "CurrentYear": {
                                            "val": "6.031"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.038"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.038"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.928"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.030"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.774"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.774"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Augment the ability to provide cultural context training for Combatant Command Joint Mission Essential Task functional areas by one geographic area of responsibility, and two mission areas per year.\n• Provide small group training focused on Joint Exercise Life Cycle specified mission areas for pre-requisite in exercise augmentation, or post exercise remediation training for three exercise response cells per year.\n• Add techniques to modify JKO software to automate certain courses to become more adaptive to the learner. \n• Provide a systematic, steady-state process for integrating cultural context, small group training, and intelligent remediation requirements into the Joint Training System.\n• Provide cost model for evaluating level of effort, additional conditions and standards for cultural context, small group training, and intelligent remediation to Joint Mission Essential Task training solutions for the Joint Training System."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "770"
                    },
                    "ProjectTitle": {
                        "val": "U.S. Forces Korea Training and Exercise Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "24.050"
                        },
                        "PriorYear": {
                            "val": "5.997"
                        },
                        "CurrentYear": {
                            "val": "4.483"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.530"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The U.S. Forces Korea (USFK) Training & Exercise Support program develops simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  Interoperability with the Republic of Korea-developed Korean Simulation System (KSIMS) is a critical and unique requirement of this USFK RDT&E program.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences -- tactical to strategic -- in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit other combatant commander training programs that use the aging Joint, Live, Virtual, and Constructive (JLVC) simulations and the emerging JLVC 2020 simulations.  FY 2015 is the last year for dedicated funding within the overall program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USFK Training & Exercise"
                                    },
                                    "Description": {
                                        "val": "This program provides Joint Training Environment support to the 2015 stand-up of KORCOM as a sub-unified command under USPACOM.  This program develops a jointly accredited, supported, and funded federation of constructive models and simulations which are capable of satisfying all joint exercise training requirements in the Korean Theater of Operations (and which is interoperable with KSIMS).  While supporting U.S. Forces Korea specific training requirements, this solution is inextricably linked to the JLVC 2020 modeling and simulation capability via Cloud-Enabled Modular Services.  This will provide a common, interoperable simulated battlespace which realistically represents the operating environment to all levels of training audiences (tactical to strategic) in Korean theater exercises and across the Combatant Commands, Services, and coalition Partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.997"
                                            },
                                            "Text": {
                                                "val": "• Enhanced Army, Air Force, Navy, and Marine Corps Live, Virtual, and Constructive capabilities and fully integrated these into the JLVC 2020 modeling and simulation capability to meet USFK theater specific, Combatant Command, Service, and coalition training requirements.\n• Achieved interoperability of joint service and ROK modeling and simulations, capable of supporting large (e.g. > 1 million entities), high-intensity combat scenarios .  Efforts allow for near seamless connection between JLVC Federation and Korean peninsula simulations, allowing for cross-model combat emulation interaction.\n• Documented the future “to be” Joint Training Environment in the DoD Architecture Framework (DoDAF) artifacts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.483"
                                            },
                                            "Text": {
                                                "val": "• Continue to enhance Army, Air Force, Navy, and Marine Corps Live, Virtual, and Constructive capabilities and fully integrate these into the JLVC 2020 modeling and simulation capability to meet USFK theater specific, Combatant Command, Service, and Coalition training requirements.\n• Invest in technology necessary to address Korean\/U.S. modeling and simulation interoperability challenges and joint training requirements on Peninsula.  Efforts are intended to support Joint\/Service modeling and simulation with ROK modeling and simulation capable of supporting large (e.g. > 1 million entities), high-intensity combat scenarios under a single integrating architecture for Joint Training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "U.S. Forces Korea Training & Exercise Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.309"
                                        },
                                        "CurrentYear": {
                                            "val": "0.299"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.299"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer capabilities synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Develop software for interoperability of JLVC versions along with initial integration of the Army’s Multi-Resolution Federation (MRF). Additionally, provide a validated approach for Cross Domain Information Sharing technologies and Korea Battle Simulation Center (KBSC) simulations to the joint training enterprise that meets USFK technical training requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.996"
                        },
                        "PriorYear": {
                            "val": "2.189"
                        },
                        "CurrentYear": {
                            "val": "2.716"
                        },
                        "BudgetYearOne": {
                            "val": "2.783"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.783"
                        },
                        "BudgetYearTwo": {
                            "val": "2.787"
                        },
                        "BudgetYearThree": {
                            "val": "2.855"
                        },
                        "BudgetYearFour": {
                            "val": "2.855"
                        },
                        "BudgetYearFive": {
                            "val": "2.884"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Air Force JNTC funding provides a focused upgrade to develop models for space-based capabilities for integration into the Joint Live, Virtual, Constructive (JLVC) environment.  The Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements, and significantly increases the training audience to additional joint and coalition participants"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "The Air Force continues to develop joint enablers that drive realistic\/effective training by producing a deployable Electronic Warfare training capability for Europe which replicates highly advanced Surface-to-Air Missiles and advance Anti-Aircraft Artillery threats for U.S. and coalition forces.  Additionally, the Air Force assists in the engineering, development, and deployment of Joint Cross Domain Information Sharing (JCDIS) Enterprise Network Architecture which will enable joint and coalition participants to train while protecting classified information.  Furthermore, the Air Force is creating cyber-contested environments in the distributed mission operations setting to challenge the joint exercise\/training audience.  Finally, comprehensive space effects are being integrated into the Joint Live, Virtual, and Constructive (JLVC) federation of models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.189"
                                            },
                                            "Text": {
                                                "val": "•  Cyber Simulation: Developed a Live, Virtual, and Constructive(LVC) cyber simulator to train tactical cyber operators in offensive and defensive operations.  Modeled cyber effects on adversary networks for presenting the cyber effects for the conventional force through the Air and Space Collaborative Environment Information Operations Suite (ACE-IOS).\n•  Joint Cross Domain Information Sharing (CDIS) Enterprise Network Architecture: Participated in a cooperative project of USAF\/US Navy Research to develop and engineer a persistent enterprise level CDIS network architecture to achieve maximum NATO, coalition, and agency participation in joint and service training events.  \n•  Air and Space Collaborative Environment Information Operations Suite (ACE-IOS) - Developed the ACE-IOS to incorporate interfaces to C2 systems.  Created a seamless integrated environment to exploit Services simulations to support joint training regardless of the federation it currently resides.\n•  Space Simulations: Improved space simulation capabilities in the GPS and infrared sensor representations in the ACE-IOS.  Enhanced the capability to incorporate top secret data into the simulation capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.716"
                                            },
                                            "Text": {
                                                "val": "•  Cyber Simulation:  Continue improving a LVC Cyber Simulator to train tactical cyber operators in offensive and defensive operations.  Continue modeling cyber effects on adversary networks for presenting the cyber effects for conventional forces through the ACE-IOS.\n•  Joint CDIS Enterprise Network Architecture: Continue to develop and engineer a persistent enterprise level CDIS network architecture to achieve maximum NATO, coalition, and agency participation in joint and service training events.\n•  ACE-IOS: Migrate the ACE-IOS to meet the new standards being developed for JLVC 2020.  Improve the efficiency of the ACE-IOS through performance enhancing techniques and improved data generation capabilities.\n•  Simulation Integration:  Integrate the mission training simulators for the Predator\/Reaper Unmanned Aerial System platforms into the Distributed Mission Operation federation of simulators.\n•  Space Simulations: Improved Space simulation capabilities in the GPS and infrared sensor representations in the ACE-IOS.  Enhance the capability to incorporate top secret data into the simulation capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.783"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.783"
                                            },
                                            "Text": {
                                                "val": "•  Space and Cyber Simulation: Continue to develop the cyber capabilities and migrate these capabilities to the JLVC 2020 standards. \n•  ACE-IOS: Continue to migrate the capabilities to the JLVC standards."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.194"
                                        },
                                        "CurrentYear": {
                                            "val": "12.043"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.514"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.514"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.274"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.358"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.299"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.299"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer capabilities synchronize with warfighter requirements.  Performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Cyber: Establish a persistent simulation environment that can be configured rapidly and accurately to reflect the desired operating environment of the training audience.  Also, create an ability to reflect cyber activities against a live Integrated Air Defense system.\n• Joint CDIS Enterprise Network Architecture: develop Joint Cross Domain Information Sharing (JCDIS) Enterprise Network Architecture which provides a persistent, enterprise-level, government off-the-shelf (GOTS) CDIS architecture to achieve maximum joint\/coalition and agency participation in joint training events.  This effort will provide a native live, virtual, constructive, protocol-based, lower-cost, higher performance, and non-proprietary capability currently lacking in the JLVC training environment.\n•  ACE-IOS: The Air Force's Air, Space, and Cyber Constructive Environment (ASCCE) suite of LVC models are modified to fully integrate with Joint Staff - J7's JLVC 2020 LVC models.\n• Space: a fully operational GPS environment which allows space operators to actively participate in Distributed Mission Operations-Space LVC missile warning, GPS disruption and Infrared special events."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.515"
                        },
                        "PriorYear": {
                            "val": "4.096"
                        },
                        "CurrentYear": {
                            "val": "2.610"
                        },
                        "BudgetYearOne": {
                            "val": "2.912"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.912"
                        },
                        "BudgetYearTwo": {
                            "val": "2.916"
                        },
                        "BudgetYearThree": {
                            "val": "3.026"
                        },
                        "BudgetYearFour": {
                            "val": "3.027"
                        },
                        "BudgetYearFive": {
                            "val": "3.057"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These funds enable the Navy to develop unique maritime capabilities that integrate Joint Live, Virtual, and Constructive (JLVC) elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and Coalition Forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Develops unique maritime capabilities that integrate Joint Live, Virtual, and Constructive (JLVC) elements into a seamless joint training environment.  Using a scientific and phased approach that focuses on modeling ground, air, space, and maritime capabilities, this program researches new technologies and methods that provide a crucial technology-based foundation that supports all JNTC Training Transformation (T2), JLVC Federation, and Combatant Commanders Exercise and Engagement (CE2) operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.096"
                                            },
                                            "Text": {
                                                "val": "• Aligned Navy LVC training standards with JLVC training standards, particularly next generation JLVC and Joint Training Enterprise Architectures.\n• Developed ballistic missile defense (BMD) training capabilities (including “Aegis Ashore”) to train and certify all personnel deploying for the President’s mandate to provide regional missile defense for Europe and numerous EUCOM\/CENTCOM BMD models.\n• Integrated new cyber and information operations training systems, including the STALLION Information Operations trainer and unmanned aircraft systems (UAS) streaming video generation and distribution systems.\n• Integrated additional Coalition Partner nation capabilities including Japanese PATRIOT and Air Defense Ground Environment.\n• Extended and integrated virtual and augmented reality into training to facilitate the mastery of tasks not easily addressed in live training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.610"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of Navy LVC training standards with JLVC training standards.\n• Reduce and limit development of BMD training capabilities due to 40% reduction in resourcing baseline.  Efforts to integrate Aegis Ashore and upgrade EUCOM\/CENTCOM BMD models will be minimal.\n• Reduce efforts related to integration of additional Coalition Partner nation capabilities due to resourcing constraints."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.912"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of Navy LVC training standards with JLVC training standards.\n• Conduct research and development of integrated capabilities between Navy tactical training ranges and synthetic training capabilities in support of Navy LVC efforts.\n• Conduct limited research and development of combat identification training simulation as an enabler for spectrum operations in support of the information warfare commander (IWC).\n• Minimal exploration of technologies to enable Integrated Air and Missile Defense (IAMD) and other combined warfare area and joint training with coalition partners in the Pacific Fleet (PACFLT) Area of Responsibility including Japan, Korea and Australia.\n• Continue collaborative development with Service and Agency partners to improve the realism and relevancy of tactical to operational level of war training capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Navy JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.607"
                                        },
                                        "CurrentYear": {
                                            "val": "6.992"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.877"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.877"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.876"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.881"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.881"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\n• The Navy will produce one Navy Training Baseline (NTB) software release to include documentation; will design and implement upgrades to Joint Semi-Automated Forces (JSAF) consistent with approved requirements and CRs and document the effects of JSAF capabilities (robustness) and stability.  Will design, implement, test, and integrate NTB enhancements in accordance with requirements.\n\n• For JSAF, Joint Simulation BUS (JBUS) reliability, scalability, and tactical control, the Navy will continuously update the Common Operational Picture (COP) during large scale JLVC exercises."
                        }
                    }
                }
            ]
        }
    }
}