{
    "id": "c86c67d1d9265f4d8b4f5561a572d4de856fd309",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603122D8Z"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism Technology Support"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "182.808"
            },
            "PriorYear": {
                "val": "98.197"
            },
            "CurrentYear": {
                "val": "94.541"
            },
            "BudgetYearOne": {
                "val": "71.171"
            },
            "BudgetYearOneBase": {
                "val": "71.171"
            },
            "BudgetYearTwo": {
                "val": "73.706"
            },
            "BudgetYearThree": {
                "val": "77.811"
            },
            "BudgetYearFour": {
                "val": "82.672"
            },
            "BudgetYearFive": {
                "val": "83.789"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "100.754"
                },
                "CurrentYear": {
                    "val": "69.675"
                },
                "BudgetYearOne": {
                    "val": "71.627"
                },
                "BudgetYearOneBase": {
                    "val": "71.627"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "98.197"
                },
                "CurrentYear": {
                    "val": "94.541"
                },
                "BudgetYearOne": {
                    "val": "71.171"
                },
                "BudgetYearOneBase": {
                    "val": "71.171"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.557"
                },
                "CurrentYear": {
                    "val": "24.866"
                },
                "BudgetYearOne": {
                    "val": "-0.456"
                },
                "BudgetYearOneBase": {
                    "val": "-0.456"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "25.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.515"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.042"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.134"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 16 Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.277"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.277"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.179"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.179"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 budget reduced due to fiscal constraints and higher priorities within the Department."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "484"
                    },
                    "ProjectTitle": {
                        "val": "Combating Terrorism Technology Support (CTTS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "182.808"
                        },
                        "PriorYear": {
                            "val": "98.197"
                        },
                        "CurrentYear": {
                            "val": "94.541"
                        },
                        "BudgetYearOne": {
                            "val": "71.171"
                        },
                        "BudgetYearOneBase": {
                            "val": "71.171"
                        },
                        "BudgetYearTwo": {
                            "val": "73.706"
                        },
                        "BudgetYearThree": {
                            "val": "77.811"
                        },
                        "BudgetYearFour": {
                            "val": "82.672"
                        },
                        "BudgetYearFive": {
                            "val": "83.789"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Combating Terrorism Technical Support (CTTS) program identifies capabilities to combat terrorism and irregular adversaries and delivers these capabilities to U.S., interagency, and international users through rapid research and development, advanced studies, and technical innovation.  Projects are distributed among 10 mission categories, in line with the interagency Technical Support Working Group (TSWG): Advanced Analytics and Capabilities, Chemical, Biological, Radiological, Nuclear, and Explosives; Improvised Device Defeat; Investigative Support and Forensics; Personnel Protection, Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support;  Training Technology Development; and a new working group, Irregular Warfare and Evolving Threats.  The CTTS program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility or effectiveness of technology when applied to combating terrorism requirements.  It includes technology capability development, proof-of-principle demonstrations in field applications, and coordination to transition from development to operational use.  CTTS manages approximately 450 individual projects in support of Defense, federal, state, local, and international customers and partners. \n\nThe CTTS program justified in the R-2 exhibit identifies the projects fully or partially funded by Congressional appropriations for the CTTS program.  However, the Combating Terrorism Technical Support Office (CTTSO) develops technology and provides support using external funds provided by other DoD and other Federal Departments and International partnerships. These projects and support activities are not necessarily reflected in this justification R-2; but the number of activities do reflect positively on the trust and competence that CTTSO has earned throughout the Department and interagency to rapidly conduct critical RDT&E and provide innovative products.  \n\nIn FY 2014, CTTS focused on DoD requirements that supported military forces in demanding or hostile environments such as Afghanistan, Yemen, Africa, the \n\nPhilippines, Mexico, and Colombia; by rapidly developing and delivering leading edge products such as tactical sensors and unmanned vehicles, personal and physical protection, user friendly apps for analytical tools and reference guides, and weapons, sights, and ammo modifications.  Several of the highly successful products include Legacy human source information programs in Afghanistan and Mexico, the Lighthouse and PALANTIR information collection and analysis systems, the Enhanced Mortar Targeting System (EMTAS), and Insider Threat Situation Awareness Training. \n\nFor U.S. federal, state and local law enforcement and first responders, CTTS improved personal protection equipment for chemical, biological, radiological, nuclear, and high explosive protection; as well as developed apps for interactive reference data to assist in identifying and neutralizing threat agents in the field and in laboratories.  CTTS also hosted interagency and foreign partner information exchange seminars and capability exercises to share and enhance response techniques and procedures for first responders.  \n\nFY15 plans for CTTS will continue to address combating terrorism requirements from Defense, federal, state, local, and international customers and partners at home and abroad.  As the withdrawal of U.S. forces from Afghanistan accelerates, CTTS will continue to address force protection needs for the remaining forces.  Additionally, CTTS will increasingly address technology requirements requested from USSOCOM’s field components as they increase their regional operations tempo in other parts of the world. Special emphasis will be for the Theater SOF in Africa and to support Theater SOF in the Pacific in support of the National Strategy to shift focus towards the Pacific.  Specifically, CTTS will address personnel and physical security for small forces deployed to austere and hostile environments. In parallel, CTTS is increasing its support of the USMC as they reconstitute and improve the capacity and capabilities of the Marine Expeditionary Units.  Another area of increased emphasis that has become even more concerning will be the protection of U.S. personnel, to include State Department personnel in embassy and consulate locations overseas that need increased security.  \n\nCTTS will continue to actively support the Department’s Homeland Defense mission at NORTHCOM, including Defense support of civil authorities, interagency coordination, Special Operations support, and security cooperation.  Consistent with that focus, this office will also work to address Department of Defense Security requirements for advanced technology and capabilities that will (1) enhance security along the U.S. Southwest Border and (2) proactively address improvised devices and other chemical, biological, nuclear and radiological threats in a domestic environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Analytic Capabilities (AAC)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Analytic Capability (AAC) Subgroup’s objective is to develop and deploy integrated analytic capabilities; enabling Warfighters and Mission Partners to make better\/faster decisions at the “Tactical Edge”.  AAC projects improve sense-making, decision-making, and data management across a range of mission areas: counterterrorism, counterinsurgency, stabilization\/re-construction missions and cyber-defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.273"
                                            },
                                            "Text": {
                                                "val": "Completed development of an enhanced integrated analytic platform that enabled analyses of diverse and disparate data sources to support near real-time decision making, collaboration, and training to support varied workflows tailored to operational requirements. Developed and began preparation for delivery an advanced audit tool to determine, over network or serial communications, whether the security configuration settings on field devices in industrial control systems are in compliance.  Developed and delivered prototype software that enabled fusion of imagery and text-based data that relates changes in patterns of life to variables affecting quality of life. Began developing a prototype entity extraction\/guided clustering software that significantly improves the quality and accuracy of data analyses by enabling analysts to change relationships in the data in real-time as part of a “guided clustering” capability while automating the actual analysis. Initiate the development of an enhanced Critical Thinking Tool that will support the application of evidence-based reasoning to intelligence questions and capture analytic problem-solving approaches. Started integration & performed initial operational evaluation of an Interagency analytic & situational awareness platform enabling fusion of existing sensors, social media, & analytic systems into a single platform. Continued development and proof of concept for multi-model analyses using Model Predictive Controllers (MPC) to make better decisions and establish measures of effectiveness for multiple courses of action. Initiated the application of an additional MPC model that allows regional agent-based analyses that also reduces dependence on subject matter experts for MPC analyses once conditions are initially set. Initiated development of a secure multi-intelligence collection & distributed processing platform with an open Application Programming Interface architecture capable of operating within a network at multiple classification levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.986"
                                            },
                                            "Text": {
                                                "val": "Continuing development of  a prototype entity extraction\/guided clustering software that significantly improves the quality and accuracy of data analyses by enabling analysts to change relationships in the data in real-time as part of a “guided clustering” capability while automating the actual analysis. Completing the development of an enhanced Critical Thinking Tool that will support the application of evidence-based reasoning to intelligence questions and capture analytic problem- solving approaches. Continuing integration & performing initial operational evaluation of an Interagency analytic & situational awareness platform enabling fusion of existing sensors, social media, & analytic systems into a single platform. Finalize operational application of the Model Predictive Controller & evaluate with user communities to demonstrate significant improvements in identifying the quantity & quality of alternate courses of action, better decision making & resource optimization. Continue integration of Realistic Decision Models into Model Predictive Controllers to demonstrate data injection capabilities & reduced Subject Matter Expert dependence. Continue development & assessment of a secure multi-intelligence collection & distributed processing platform with an open Application Programming Interface architecture capable of operating within a network. Begin development and coordinate user testing of a new tool to rapidly build and\/or model the baseline of an Operational or Tactical environment sufficient to distinguish anomalies & responses to stimulation. Initiate development of a target & asset management system to provide Navy users that incorporates Intelligence, Meteorological & Oceanographic and adversary behavior to maximize the allocation of limited assets against an uncertain target set. Initiate development of an accurate social science modeling & measures of effectiveness tool to fill identified gaps & collaborate with existing efforts to support development of a community standard. Initiate research & development of new workflows based on an understanding of existing social media & open source work flows thereby reducing analytical time & decreasing material cost for users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.121"
                                            },
                                            "Text": {
                                                "val": "Operationalize Model Predictive Controller with user communities to demonstrate significant improvements in identifying the quantity & quality of alternate courses of action, better decision making & resource optimization. Complete integration of Realistic Decision Models into Model Predictive Controllers & demonstrate data injection capabilities & reduced Subject Matter Expert dependence with user communities. Complete development & assessment of a secure multi-intelligence collection & distributed processing platform with an open Application Programming Interface architecture capable of operating within a network.  Finalize development and coordinate user testing of a new tool to rapidly build and\/or model the baseline of an Operational or Tactical environment sufficient to distinguish anomalies & responses to stimulation. Finalize development, deliver a target & asset management system and perform testing with Navy users by incorporating Intelligence, Meteorological & Oceanographic and adversary behavior to maximize their allocation of limited assets against an uncertain target set. Complete and perform testing of an accurate social science modeling & measures of effectiveness tool to fill user’s gaps & collaborate with user’s existing efforts to support development of a community standard. Finalize development & support user testing & evaluation of newly designed standardized workflows intended to reduce analytical time & decrease material cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CHEMICAL, BIOLOGICAL, RADIOLOGICAL, NUCLEAR, AND EXPLOSIVES (CBRNE)"
                                    },
                                    "Description": {
                                        "val": "The CBRNE subgroup’s objective is to improve defense capabilities to meet tomorrow’s CBRNE threats. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation on threat characterization; materials attribution; personal protective equipment; detection of CBRNE materials at trace and bulk levels at point, proximity and stand-off distances; development of information resources and decision support tools to assist response elements with risk-based decision making; and consequence management for post-event activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.945"
                                            },
                                            "Text": {
                                                "val": "Completed development of a flexible, powered, air purifying respirator for Chemical, Biological, Radiological, and Nuclear (CBRN) environments, redesigning the system to give a lighter, low-profile capability.  Completed development of a new Chemical and Biological (CB) protective mask for use in tactical environments and interoperability with tactical equipment.  Continued development of a next generation National Fire Protection Association (NFPA) 1994 Class 3 CB sock for improved comfort.  Continued development of a decision support tool for determining proper work\/rest cycles in CB protective clothing.  Completed evaluation of enhanced liquid tight integrity testing methods\/procedures for the evaluation of CB protective ensembles.  Initiated development of analytical and sampling procedures for the non-destructive evaluation of CB protective clothing for key contaminants in the field.  Continued development of a next generation CB glove for improved comfort and dexterity.  Completed development of a pump free, gravity driven water purifier capable of producing potable water for an operator in austere conditions.  Completed development of a desalination filter which provides several liters of drinking water in austere environments.  Completed development of a filter which provides up to 300 liters of drinking water in austere environments.  Continued development of a powder material with imbedded chemical detection and decontamination properties.  Continued development of an unobtrusive, colorimetric detection system capable of discreetly notifying the operator of a positive detection of select chemical warfare agents.  Completed evaluation of a portable system to quickly screen personnel for explosive threats at temporary venues.  Initiated development of a miniature, hand-portable mass spectrometer for the detection of chemical and explosive threats.  Initiated development of explosives detection technology for monitoring cargo containers.  Initiated development of enhanced sampling materials and high volume samplers for CBRNE threats.  Continued development of colorimetric fabrics for the detection of bulk explosive materials.  Continued development of a spatially offset Raman technology capable of identifying materials through non-metallic packaging.  Completed development of a low-cost, single-use test kit to rapidly identify explosives and explosive precursors.  Continued development of a handheld, explosives particulate detector for inorganic homemade explosives threats.  Initiated development of a novel bio-sensor based upon pyroelectric transducer technology for the detection of biological warfare agents.  Completed development of a low cost, Raman spectroscopy instrument for the detection of explosive materials.  Completed development of a threat\/no threat detector for the detection of primary and secondary explosives.  Initiated development of a portable glove box suitable for working with CBRN materials in field operations.  Continued to evaluate potential methods of production of threat materials, and identify key indicators and warnings of clandestine production methodologies for response personnel.  Continued development of decision support tools to provide on-scene responders with evidence-based information to support decision making for emergency medical response to chemical events, chemical detection, radiological response, firefighting guidance, and countering improvised explosive threats.  Initiated development of a modified commercial endoscope capable of CB agent collection that can be manipulated into tight spaces.  Completed development of a computer-based training program for the use of ion mobility spectrometry based explosives detection equipment. Initiated development of optimized sampling media for the collection of trace explosive materials. Initiated development of next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.096"
                                            },
                                            "Text": {
                                                "val": "Conduct field evaluations of a new CB protective mask for use in tactical environments and interoperability with tactical equipment.  Conduct field evaluations of a next generation CB glove for improved comfort and dexterity.  Evaluate a next generation NFPA 1994 Class 3 CB sock for improved comfort. Complete development of a decision support tool for determining proper work\/rest cycles in CB protective clothing. Revise the American Society for Testing and Materials enhanced liquid tight integrity testing methods\/procedures for the evaluation of CB protective ensembles. Continue development of analytical and sampling procedures for the non-destructive evaluation of CB protective clothing for key contaminants in the field, and initiate incorporation of findings into a decision support matrix. Initiate development of a water filtration system capable of producing potable water for 20-50 operators in austere conditions. Initiate development of a ruggedized one piece garment which provides NFPA 1994, Class 2 protection from exposure to the harmful effects of all traditional CB warfare agents and the toxic industrial chemicals listed in NFPA 1994, 2012 edition while allowing for communication and interoperability with tactical equipment.  Initiate development of a ruggedized garment which provides NFPA 1994, Class 3 and NFPA 1992 protection. Initiate NFPA 1999 testing on protective clothing for emergency medical operations. Continue development of a powder material with imbedded chemical detection and decontamination properties. Continue development of an optimized sampling media for the collection of trace explosive materials. Continue development of an unobtrusive, colorimetric detection system capable of discreetly notifying the operator of a positive detection of select chemical warfare agents. Continue development of a miniature, hand-portable mass spectrometer for the detection of chemical and explosive threats. Complete development of explosives detection technology for monitoring cargo containers. Initiate testing and evaluation of colorimetric fabrics for the detection of bulk explosive materials.  Complete development of a spatially offset Raman technology capable of identifying materials through non-metallic packaging.  Continue development of next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats.  Continue development of enhanced sampling materials and systems for CBRNE threats. Complete development of a handheld, explosives particulate detector for inorganic homemade explosives threats. Continue development of a novel bio-sensor based upon pyroelectric transducer technology for the detection of biological warfare agents.  Initiate testing of new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices.  Complete evaluation of the effects of decontamination products on deoxyribonucleic acid signatures of interest.  Initiate development of advanced analytical tools for the analysis of chemical and biological agent production methods. Continue development of decision support tools to provide on-scene responders with evidence-based information to support decision making for emergency medical response to chemical events, chemical detection, radiological response, firefighting guidance, and countering improvised explosive threats.  Complete development of a portable glove box suitable for working with CBRN materials in field operations. Complete development of a modified commercial endoscope capable of CB agent collection that can be manipulated into tight spaces. Initiate development of a scalable, vacuum, evidentiary collection device for the collection and preservation of known or suspected biological agent powders. Continue to evaluate potential methods of production of threat materials, and identify key indicators and warnings for response personnel.  Initiate development of a modular computer\/web-based training package for hand-held explosive detection technologies.  Initiate development of new algorithms that increase the specificity and improve the overall utility of commercial Raman explosive detection systems. Initiate development of enhanced decontamination procedures for a post CBRN event."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.100"
                                            },
                                            "Text": {
                                                "val": "Continue development of a ruggedized garment which provides NFPA 1994, Class 3 and NFPA 1992 protection.  Continue development of a ruggedized one piece garment which provides NFPA 1994, Class 2 protection from exposure to the harmful effects of all traditional CB warfare agents and the toxic industrial chemicals listed in NFPA 1994, 2012 edition while allowing for communication and interoperability with tactical equipment.  Continue field evaluations of a new CB protective mask for use in tactical environments and interoperability with tactical equipment. Complete field evaluations and certify a next generation NFPA 1994 Class 3 CB sock for improved comfort.  Complete field evaluations and certify a next generation CB glove for improved comfort and dexterity.   Continue development of a water filtration system capable of producing potable water for 20-50 operators in austere conditions.  Initiate development of next generation chemical protective materials, systems, and ensembles. Initiate CBRN respirator testing against additional toxic industrial chemicals representing the current threats encountered. Complete development of a powder material with imbedded chemical detection and decontamination properties. Complete development of an unobtrusive, colorimetric detection system capable of discreetly notifying the operator of a positive detection of select chemical warfare agents. Continue development of a miniature, hand-portable mass spectrometer for the detection of chemical and explosive threats. Continue testing and evaluation of optimized sampling media for the collection of trace explosive materials. Complete development of colorimetric fabrics for the detection of bulk explosive materials. Continue testing and evaluation of a next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats.  Continue evaluation of enhanced sampling materials and systems for CBRNE threats.  Continue testing and evaluation of a novel bio-sensor based upon pyroelectric transducer technology for the detection of biological warfare agents.  Continue testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices. Continue incorporation of analytical and sampling procedures for the non-destructive evaluation of CB protective clothing for key contaminants in the field into a decision support matrix.  Continue evaluation of advanced analytical tools for the analysis of chemical and biological agent production methods.  Continue evaluation of decision support tools for providing medical information and recommendations in hostile environments.  Continue evaluation of potential methods of production of threat materials, and identify key indicators and warnings for response personnel.  Continue development and evaluation of a modular computer\/web-based training package for hand-held explosive detection technologies.  Continue development of new algorithms that increase the specificity and improve the overall utility of commercial Raman explosive detection systems.  Continue development of a scalable, vacuum, evidentiary collection device for the collection and preservation of known or suspected biological agent powders.  Continue development of decision support tools to provide on-scene responders with evidence-based information to support decision making for emergency medical response to chemical events, chemical detection, radiological response, firefighting guidance, and countering improvised explosive threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMPROVISED DEVICE DEFEAT (IDD)"
                                    },
                                    "Description": {
                                        "val": "The IDD Subgroup’s objective is to provide rapid prototyping, capability development and delivery of advanced technologies, tools, and information to improve the operational capabilities of federal, state, and local bomb squads and the U.S. military Explosive Ordnance Disposal (EOD) community to defeat and neutralize the full spectrum of terrorist explosive devices. In collaboration with military, federal, state, and local agencies, the IDD Subgroup identifies and prioritizes multi-agency user requirements through joint working groups and then actively works with vendors and end-users to deliver advanced prototype systems that provide more efficiency and a greater degree of safety for Bomb Technicians to investigate, access, evaluate, and if needed render safe or dispose of suspect devices whether emplaced, person borne, vehicle borne or water borne. The Subgroup supports the Homeland Security Presidential Directive (HSPD) 19 – Combating Terrorist Use of Explosives in the United States and the National Strategic Plan for Bomb Squads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.075"
                                            },
                                            "Text": {
                                                "val": "Completed development and commercialized the iLIVE inline video enhancement module for robot cameras. Completed development and commercialized the Scalable Improvised Device Disruptor to counter VBIEDs. Completed development and evaluation of a VBIED threat assessment system. Completed development and commercialized a VBIED toolkit. Completed development of a mechanically initiated remote wire cutting tool to increase safe separation from command or detonator wires being cut while maintaining control of the procedure. Completed development and evaluation of the Mobile Explosive Device Neutralizer (MEDN) that provides the capability to remotely unscrew end caps from pipe type IEDs to include jars and jugs of possible precursor materials used in drug or explosive manufacturing. Initiate development of an explosively initiated tool for remotely opening vehicle trunk locking mechanisms. Completed development of a remotely delivered and operated pan-and-tilt render safe capability for IED disruption. Initiated development of a submersible remotely operated vehicle to counter water borne IEDs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.478"
                                            },
                                            "Text": {
                                                "val": "In support of PPD 17 – Countering Improvised Explosive Devices, the IDD subgroup transitions in FY15 to a new name, Improvised Device Defeat\/Explosives Countermeasures (IDD\/EC), but will continue to support the requirements of both military Explosive Ordnance Disposal (EOD) technicians and Public Safety Bomb Squads. Explosives Countermeasures encompasses other explosives threats and hazards that are encountered by other first responders. The remaining projects under EOD\/LIC will transition over to IDD\/EC at the beginning of FY15.  The IDD\/EC subgroup will continue development, evaluation to commercialize an explosively initiated tool for remotely opening vehicle trunk locking mechanisms. Continue development and operational evaluation of a submersible remotely operated vehicle to counter water borne IEDs. Complete development of a Force Feedback Retrofit Kit to provide enhanced visual awareness of pressures exerted on object held in a robot gripper. Initiate development of a capability to robotically conduct on-site desensitization and disposal of sensitive homemade explosives (HMEs) by mixing small quantities of the target HME with a flammable liquid followed by incineration. Develop a Mobile device application for worldwide incidents involving improvised explosive device technical data accessible to bomb technician. Initiate Development of a decision support tool that covers the full range of issues involved in vehicle-borne improvised explosive device (VBIED) response by bomb disposal personnel. Continue development to modify and environmentally harden a remotely delivered and operated pan-and-tilt render safe capability for IED disruption. Continue development for threats presented by use of additive manufacturing processes for construction and concealment of devices containing explosives or their precursors. Initiate Development of a 3-D printable robot for bomb squad use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Text": {
                                                "val": "Continue development to make improvements to the submersible remotely operated vehicle to counter water borne IEDs based on operational evaluation. Complete development and commercialize a capability to robotically conduct on-site desensitization and disposal of sensitive homemade explosives (HMEs) by mixing small quantities of the target HME with a flammable liquid followed by incineration. Complete Development of a decision support tool that covers the full range of issues involved in vehicle-borne improvised explosive device (VBIED) response by bomb disposal personnel. Continue development of an environmentally hardened, remotely delivered and operated pan-and-tilt render safe capability for IED disruption. Initiate development of a system that can employ X-ray image analytics at the scene of a bomb or IED incident to instantly and automatically identify bomb or IED components from a database of exemplars. Continue development of a 3-D printable robot designed for remote reconnaissance and interrogation of suspect VBIEDs. Continue development of the efficacy of additive manufacturing processes as a means to rapidly prototype and deliver tools for use in counter IED operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INVESTIGATIVE AND FORENSICS SCIENCE"
                                    },
                                    "Description": {
                                        "val": "The IFS subgroup’s objective is to advance combating terrorism capabilities in investigative and forensic science. IFS supports joint, interagency, and other partners who apply investigative and forensic science methods, means, or practices to forensic intelligence or practices to forensic intelligence or investigations. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation of new and advanced technology, equipment, forensic techniques, and tools, as well as development of information resources and decision support tools for risk-based decision making and rapid exploitation of evidence.  Projects emphasize rapid and field DNA analysis, identification of insider threat within agencies, pre- and post-blast forensic examination, electronic evidence data acquisition and analysis, sensitive site exploitation, forensic intelligence, and criminalistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Completed development and dissemination of an extensive forensic system and repository to establish the origin of materials from homemade explosives and IEDs. Completed development of a distributed forensic tool that analyzes counterfeit identity and travel documents and links them to other criminal and terrorist incidents. Completed development of a comprehensive set of forensic procedures to analyze inks to determine if documents are counterfeit or genuine. Completed development of a technology that visualizes latent fingerprints based on novel human antibodies and nano-technology. Completed the primary phase of an interagency research, development, test, and evaluation strategy and roadmap for the federal investigative and forensic science community. Initiated testing and evaluation of commercially available rapid DNA instruments for use in combating terrorism operations. Initiated development of an effective forensic microbial proteomic methodology for biological samples to aid in source attribution. Initiated the development of a field-deployable prototype system for automated rapid processing of human DNA profiles using short tandem repeat loci. Initiated development of advanced methods to analyze visual, verbal, and behavioral cues of persons to determine their likelihood of being an insider threat to commit violence, espionage, and sabotage and build a network of researchers to further advancements in this field. Initiated the development and validation of more productive and effective methods of interrogating and interviewing persons for human intelligence collection in law enforcement and tactical environments. Initiated the development of a forensic opium poppy DNA methodology to determine the geographic origin of heroin. Initiated development of the best practices for expeditionary forensic operations. Initiated development of an advanced facial thermal imaging technology to determine credibility and intent. Initiated development of a comprehensive forensic procedure to separate mixed DNA samples by using nuclear DNA. Initiated the secondary phase of an interagency research, development, test, and evaluation strategy and roadmap for the federal investigative and forensic science community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.840"
                                            },
                                            "Text": {
                                                "val": "Complete the secondary phase of the interagency research, development, test, and evaluation strategy and roadmap for the federal investigative and forensic science community.  Complete testing and evaluation of a commercially available rapid DNA instruments for use in combating terrorism operations.  Complete development of an effective forensic microbial proteomic methodology for biological samples to aid in source attribution. Complete development of a field-deployable prototype system for automated rapid processing of human DNA profiles using short tandem repeat loci. Complete development of advanced methods to analyze visual, verbal, and behavioral cues of persons to determine their likelihood of being an insider threat to commit physical violence, espionage, and sabotage.  Complete development of more productive and effective methods of interrogating and interviewing persons for human intelligence collection in law enforcement and tactical environments.  Complete development of a forensic opium poppy DNA methodology to determine the geographic origin of heroin. Initiate development of a tool that automatically ingests and analyzes data from mobile device and produces intelligence reports. Initiate the development of an automatic tool that recognizes and identifies faces in uncontrolled files and images. Initiate the development of a remote identification card image system for the detection of suspected fraudulent ID cards at checkpoints. Initiate the development of a system for acquiring and identifying chemical signatures of substances found at incident scenes.  Complete development of an advanced facial thermal imaging technology to determine credibility and intent."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.840"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.840"
                                            },
                                            "Text": {
                                                "val": "Complete development of a comprehensive forensic procedure to separate mixed samples DNA by using nuclear DNA. Complete development of a tool that automatically ingests and analyzes data from mobile device and produces intelligence reports. Complete development of an automatic tool that recognizes and identifies faces in uncontrolled files and images. Complete development of a remote identification card image system for the detection of suspect fraudulent ID cards at checkpoints. Complete development of a system for acquiring and identifying chemical signatures of substances found at incident scenes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Irregular Warfare and Evolving Threats (IW\/ET)"
                                    },
                                    "Description": {
                                        "val": "U.S. Forces face a threat environment where irregular, state-sponsored and non-state hybrid and conventional adversaries armed with easy to employ precision weapons, global surveillance and networking will have the capability to undercut the operational and technical superiority of U.S. Conventional and Special Operations Forces. These evolving threats will progressively blur the boundaries between conventional and irregular warfare. Offering foresight about disruptions of this nature through rapid, adaptive demonstration of novel operational concepts so that concept developers can explore new models and capabilities before a conflict begins must be a primary goal.\n\nThe IW\/ET subgroup develops new concepts and capabilities for warfighters and inter-agency partners who are confronting the complexity of the current operational environment, while simultaneously looking outward rather than inward to appropriately size, shape and develop their forces. In accordance with the QDR’s emphasis on preparation to defeat adversaries and succeed in a wide range of contingencies, IW\/ET will engage in operational assessment, concept development, and independent validation of unique prototype capabilities to identify, confront and defeat evolving threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.064"
                                            },
                                            "Text": {
                                                "val": "Continued development of a field prototype digital workflow management and content approval capability called Nightingale for members of the Counter Terrorism Strategic Communication community of practice who actively engage on social media platforms.  This effort provided critical test and evaluation for operational deployment.   Continued research and development of a non-material effort intended to better understand indirect and irregular threats currently facing the US, and how to implement effective measures against them. The studies and related activities undertaken for this project fall under three broad lines of effort: 1) an analysis of indirect\/irregular actions employed historically and how these capabilities may be applied to today’s threat environment; 2) an analysis of current and the evolving irregular threat environment; and 3) identification and analysis of which of the capabilities the US could apply to prevail against irregular\/indirect threats now and in the future. Initiated research and development of a low-cost, effective and efficient method of extending or creating sustainable governance in large urban environments through relevant doctrine, training, technology and innovative partnerships. Utilizing Secure Unclassified Network (SUNet) architecture, this effort facilitated dialog and information sharing among entities involved in developing community resilience\/resistance in the face of armed violence and the development of a platform to test and evaluate tools and TTPs for use in the \"ungoverned\" or \"under-governed\" urban environment. Initiated research and analysis providing support for: planning and organizing integration of influence capabilities into cyber planning and execution, understanding and planning for the impact and implications of “now media,” and planning and organizing to conduct military deception, as well as the distillation and dissemination of best practices in the planning, execution, and assessment of information operations (IO)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Complete development of the Nightingale effort, which fielded a prototype digital workflow management and content approval capability for members of the Counter Terrorism Strategic Communication community of practice who actively engage on social media platforms.  This effort entirely novel to the United States Government will provide critical test and evaluation for operational deployment, enabling US operators to more effectively contest the informational domain.  Complete development of a non-material effort intended to better understand indirect and irregular threats currently facing the United States and implement effective measures against the threats. This effort will support the Army Special Operations Command and will include war-gaming and experimentation, strategy assessment and recommendations for future operations planning.  Continue research and development of a low-cost, effective and efficient method of extending or creating sustainable governance in large urban environments through relevant doctrine, training, technology and innovative partnerships. Utilizing Secure Unclassified Network (SUNet) architecture, this effort facilitates dialog and information sharing among entities involved in developing community resilience\/resistance in the face of armed violence and creates a platform to test and evaluate tools and TTPs for use in the \"ungoverned\" or \"under-governed\" urban environment. Continue research and analysis providing support for: planning and organizing integration of influence capabilities into cyber planning and execution, understanding and planning for the impact and implications of “now media,” and planning and organizing to conduct military deception, as well as the distillation and dissemination of best practices in the planning, execution, and assessment of information operations (IO). Initiate an operational test of Network Enablement Capability with Special Operations Command Africa called Clever Enabler.  This effort will test the ability of Special Operations personnel to deliver the Legacy model with the contractor in select African countries.  In addition, the focus of Clever Enabler will expand the Legacy model into an exportable all source intelligence partner nation capacity building effort.  Initiate an effort to determine how the Department of Defense (DoD), Interagency and Allied Nations conduct partner capacity building operations.  The end state is to design a holistic common interagency analytical and planning approach that better identifies capabilities authorities and funding, links US, Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions. Initiate the development of an automated capability to intuitively visualize geographic and functional areas of latent and\/or emergent instability in the Dark Web.  Discerning, then monitoring latent instability manifest in Dark Web precursors would enable the development of more nuanced, contextually appropriate and proactive theater-strategic policy reflected in: 1) more efficient and effective strategic communications and military information support operations (MISO), 2) enhanced military-to-military engagements, and 3) with an emphasis on unclassified and shareable information\/knowledge, and the creation of “shared understanding” amongst partners and Allies leading to combined mitigation actions. Initiate an effort to develop solutions and\/or enhance the integration of intelligence and military operations with information operations (IO). This effort will explore how cognitive and information dimensions can be better displayed both geospatially and temporally, and seeks to integrate multiple databases from all sources of intelligence and information (HUMINT, SIGINT, MASINT, GEOINT, OSINT, and social media) to provide the IO community an intuitive visualization of the information environment per Joint Publications 3-13 (Information Operations) and 2-01.3 (Joint Intelligence Preparation of the Operational Environment). Initiate the development of new concepts and constructs for understanding the role of virtual currencies in threat finance. This effort will explore the unique and required skills necessary to understand and react to the rapidly evolving architecture of threat finance networks within a radically connected hybrid warfare context and will develop solutions to combat vulnerabilities posed by virtual currencies. Initiate development of multiple next-generation information related capabilities (IRCs) and associated technical means that advance concepts and pursue capabilities identified in IW\/ET’s FY14 net-assessment of next-gen IO and information related capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.615"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.615"
                                            },
                                            "Text": {
                                                "val": "Complete development of a low-cost, effective and efficient method of extending or creating sustainable governance in large urban environments through relevant doctrine, training, technology and innovative partnerships. Utilizing Secure Unclassified Network (SUNet) architecture, this effort facilitates dialog and information sharing among entities involved in developing community resilience\/resistance in the face of armed violence and creates a platform to test and evaluate tools and TTPs for use in the \"ungoverned\" or \"under-governed\" urban environment. Complete research and development for providing support: planning and organizing integration of influence capabilities into cyber planning and execution, understanding and planning for the impact and implications of “now media,” and planning and organizing to conduct military deception, as well as the distillation and dissemination of best practices in the planning, execution, and assessment of information operations (IO). Complete the development and operational test of Clever Enabler Network Enablement Capability with Special Operations Command Africa. Final deliverable will be an exportable all source intelligence training curriculum for use with partner nations.  Complete the design of a holistic common interagency analytical and planning approach that better identifies capabilities authorities and funding, links US, Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions. Complete the effort to develop an automated capability that intuitively visualizes geographic and functional areas of latent and\/or emergent instability in the Dark Web.  Discerning, then monitoring latent instability manifest in Dark Web precursors would enable the development of more nuanced, contextually appropriate and proactive theater-strategic policy reflected in: 1) more efficient and effective strategic communications and military information support operations (MISO), 2) enhanced military-to-military engagements, and 3) with an emphasis on unclassified and shareable information\/knowledge, and the creation of “shared understanding” amongst partners and Allies leading to combined mitigation actions. Complete and deliver a capability that enhances the integration of intelligence and military operations with information operations (IO). This effort will explore how cognitive and information dimensions can be better displayed both geospatially and temporally, and seeks to integrate multiple databases from all sources of intelligence and information (HUMINT, SIGINT, MASINT, GEOINT, OSINT, and social media) to provide the IO community an intuitive visualization of the information environment per Joint Publications 3-13 (Information Operations) and 2-01.3 (Joint Intelligence Preparation of the Operational Environment). This is especially important as the emergence of hybrid warfare continues to erode the lines between violence, coercion, influence and insurgency that, left unobserved, will leave decision makers with little time or options for action. Complete and deliver new concepts and constructs for understanding the role of virtual currencies in threat finance. This requirement will explore the unique and required skills necessary to understand and react to the rapidly evolving architecture of threat finance networks within a radically connected hybrid warfare context and will develop solutions to combat vulnerabilities posed by virtual currencies. Continue to develop and deliver, through the end of the contract in FY17, a Secure Unclassified Network (SUNet) which provides a unique virtualization of a single hardware suite of servers and software that will provide protected  dynamic enclaves of capability for multi-agency users (Law Enforcement, Interagency, Coalition, and Foreign Nationals). This effort enables an inter-organizational collaborative area and enhanced capabilities of data upload, searching and sharing from headquarters down to smartphones, tablets or laptops. Completion of the Lawfare initiative, which will provide applicable lessons from literature and expert practitioners on Lawfare and other analogous policy tools.  The effort will also provide recommendations for a framework outlining how the US and its allies can effectively defend against and conduct offensive legal warfare. Initiate new efforts to develop and deploy capabilities that support DoD, interagency and foreign partners and allies who are confronting ever evolving threat networks and complex global operational environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERSONNEL PROTECTION"
                                    },
                                    "Description": {
                                        "val": "The Personnel Protection Subgroup’s objective is to develop new equipment, reference tools, and standards to improve the protection of personnel. Projects focus on putting innovative tools such as automated information management systems, communication devices, tagging, tracking and locating devices, mobile surveillance systems, as well as personal and vehicle protection equipment in the hands of personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.231"
                                            },
                                            "Text": {
                                                "val": "Continued development for systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts for operational evaluation and deployment. Completed development and deployed a mobile surveillance platform that captures, records, encrypts, and streams multi-channel video and audio with associated GPS position information to a command center for enhanced situational awareness and incidence response. Completed development and delivered micro unmanned aerial systems that provide real-time situational awareness to military and law enforcement personnel for operational evaluation.  Continue development of a capability that activates a vehicle tracking, tagging, and locating device upon detection of a blast.  Completed development and delivered a multifunctional earpiece that provides in ear hearing protection as well the ability to collect pressure and acceleration data during blast or blunt impact events.  Continued development of techniques that assess brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury.  Continue development of a whole body deformation tool that provides analysis and protective solutions for vehicles, ships, and buildings.  Completed development and testing for a novel vehicle armor solution for alternative fuel vehicles. Initiated development of a mobile blast mitigation barrier that mitigates fragmentation effects of a behind the wall improvised explosive device.  Initiated development for a tethered aerial platform that enhances situational awareness and communication capabilities. Initiated development for counter unmanned aerial vehicle capabilities. Initiated development of a concealable armor system that provides rifle threat protection.  Initiated development of a novel lightweight armor material that provides rifle protection.  Initiated development of automated exploitation algorithms for light detection and ranging data. Initiated development of a three dimensional personnel tracking and locating system for use within structures. Initiated development of a capability for local data storage of maps for operational use in austere environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.986"
                                            },
                                            "Text": {
                                                "val": "Continue development and delivery of systems that enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Complete development and deploy a capability that activates vehicle tracking, tagging, and locating device upon detection of a blast.  Completed development and delivery a whole body deformation tool and analysis for the development of protective solutions for vehicles, ships, and buildings.  Initiate development of a wireless tactical communications headset.  Continue development of a tethered aerial platform for enhanced situational awareness and communication capabilities.  Continue development of counter unmanned aerial vehicle capabilities.  Continue development of a concealable armor system that provides rifle threat protection.  Continue development of a novel lightweight armor material that provides rifle protection.  Continue development of automated exploitation algorithms for light detection and ranging data.  Continue development of a three dimensional personnel tracking and locating system for use within structures.  Complete development of a capability for local data storage of maps for operational use in austere environments.  Complete development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury.  Completed development of a mobile blast mitigation barrier that mitigates fragmentation effects of a behind the wall improvised explosive device.  Initiate development a multi radio device that combines multiple radios, GSM and Iridium communication capabilities into one device.  Initiate development of a miniaturized transmitter device that can accommodate a Tier 1 unmanned aerial vehicle (UAV) to transmit the UAV video feed over the cellular network for enhanced situational awareness.  Initiate development of a multifunctional head protection system that can achieve ballistic and blast protection, and incorporates communication and data display capabilities.  Initiate development of an enhanced personal duress system to increase system range and decrease device form factor to a novel size. Initiate development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.150"
                                            },
                                            "Text": {
                                                "val": "Complete Development of systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Complete development of a wireless tactical communications headset.  Complete development of a tethered aerial platform for enhanced situational awareness and communication capabilities.  Completed development of counter unmanned aerial vehicle capabilities.  Completed development of a concealable armor system that provides rifle threat protection.  Completed development a novel lightweight armor material that provides rifle protection.  Complete development automated exploitation algorithms for light detection and ranging data.  Continue Development of a three dimensional personnel tracking and locating system for use within structures. Continue development of a multi radio device that combines multiple radios, GSM and Iridium communication capabilities into one device.  Complete development a miniaturized transmitter device that can accommodate a Tier 1 unmanned aerial vehicle (UAV) to transmit the UAV video feed over the cellular network for enhanced situational awareness.  Continue development of a multifunctional head protection system that provides ballistic and blast protection, and incorporates communication and data display capabilities.  Complete development of an enhanced personal duress system that can operate at increased range and a decreased device form.  Continue development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PHYSICAL SECURITY"
                                    },
                                    "Description": {
                                        "val": "Develop capabilities to address physical security vulnerabilities associated with forward deployed military and civilian personnel, domestic security and first responder personnel, and U.S. Government facilities in the U.S. and abroad, and rapidly transition those capabilities to the users.\nFocus technology development efforts in support of joint and interagency requirements that are directed along the U.S. borders, at U.S. embassies and consulates, at mass transportation and commerce nodes, in Maritime port and littoral environments, and in support of large scale public gatherings."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.511"
                                            },
                                            "Text": {
                                                "val": "Completed development of database and Vulnerability Assessment and Protection Option (VAPO) development program on blast response against multi-layered systems and Forward Operating Bases to improve protection capabilities. Completed development of a comprehensive homemade explosives database with multiple levels of access. Completed development of decision support aids for the intelligence and technology community regarding novel explosives threats. Completed development and implementation of an International Homemade IED Working Group Roadmap for communities of interest to facilitate collaboration and consolidation of ongoing parallel and complementary efforts.  Completed development of an HME desensitization guide for first responders. Completed development of a man-portable Bandolier line charge system to disrupt a path of earth with the intent of exposing or disrupting nonmetallic\/metallic buried IED threats. Completed development of a rapidly and easily deployable and recoverable self-contained security and video observation\/surveillance system. Completed development of a swimmer\/small vessel detection technology based on electro-optical sensors to provide situational awareness for port security and open water operations. Continued development of a modular air-droppable force protection kit that includes mini-radar, trip wire sensor and electro-optical\/IR camera sensor. Continued development of a fast-running, CHINOOK-based computational tool to assist Federal and municipal planners and first responder personnel in predictive blast analysis in an urban environment. Initiated development of explosive testing methodology to reinforce critical infrastructure design for mitigated and unmitigated brick tunnels. Completed development and rollout of the Web-enabled Blast Information Systems (WBLIS) database. Initiated development of a tool for an understanding of TNT equivalency that will provide operational forces necessary information for protecting personnel and infrastructure. Initiated development of forced-entry, ballistic and blast resistant doors to support US facilities abroad. Continued development of an automatic target recognition and improved gimbal control, to maneuver in rough terrain, for on-the-move, standoff IED detection and for stand-off underground void and tunnel detection. Initiated development of a rapidly deployable, temporary antipersonnel barrier system to protect fixed and expeditionary facilities in response to increased threat levels. Initiated development of an IR-based detection system with automatic focus to allow for enhanced detection of explosive and weapon threats in operational environments. Initiated development of tactical arresting systems designed to stop vehicles over a short distance. Initiated development of an Advanced Diver Data Display System final prototype for combat swimmers.  Completed development of a remote control adjustable charge capable of deployment by mobile platforms to effectively neutralize defined IED threats. Completed development of a multi-purpose advanced tactical timer prototype for operational test and evaluation. Continued development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations. Completed initial multi-phased testing of the HALO Maritime Barrier System to validate performance in stopping power against small boat threats and in automated Gate Opening\/Closing capability. Completed development of non-lethal medium and large vessel immobilization systems. Completed development of protection capabilities and counter measure decision aids regarding ultra-high performance concrete. Initiated and completed development of a resource guide and specification workbook to assist security professionals in identifying active vehicle barrier (AVB) requirements and selecting appropriate AVB’s for their site. Initiated development of an upgraded tactical compact aerostat system for intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces.  Continue the development and assessment of the Military Blast Expert Evaluation Software to aid commanders in protecting US military expeditionary bases globally."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.270"
                                            },
                                            "Text": {
                                                "val": "Complete development of a modular air-droppable force protection kit that includes mini-radar, trip wire sensor and electro-optical\/IR camera sensor. Complete development of a fast-running, CHINOOK-based computational tool to assist Federal and municipal planners and first responder personnel in predictive blast analysis in an urban environment. Complete development of explosive testing methodology to reinforce critical infrastructure design for mitigated and unmitigated brick tunnels. Continue development of a tool for an understanding of TNT equivalency that will provide operational forces necessary information for protecting personnel and infrastructure. Complete development of forced-entry, ballistic and blast resistant doors to support US facilities abroad. Complete development of an automatic target recognition and improved gimbal control, to maneuver in rough terrain, for on-the-move, standoff IED detection and for stand-off underground void and tunnel detection. Continue development of a rapidly deployable, temporary antipersonnel barrier system to protect fixed and expeditionary facilities in response to increased threat levels. Continue development of an IR-based detection system with automatic focus to allow for enhanced detection of explosive and weapon threats in operational environments. Continue development of tactical arresting systems designed to stop vehicles over a short distance. Complete development of an Advanced Diver Data Display System final prototype for combat swimmers. Complete development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations. Continue development and upgrade of a tactical compact aerostat surveillance system for intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces. Initiate development of decision aids for first responders and militaryengineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures. Initiate development of an in-tunnel unmanned aerial vehicle (UAV) that will provide the ability to safely conduct reconnaissance of discovered illicit tunnels and\/or scheduled inspections of underground municipal infrastructures (UMIs) for evidence of interconnecting tunnel activity. Initiate development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments. Initiate development of a high performance towed sled to provide increased payload and deployment options for existing combatant craft used by Naval Special Warfare (NSW). Initiate development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the Force in Tactical Combat Outposts. Initiate development of computer modeling and simulation program to determine the smallest booster size needed to initiate detonation of Ammonium Nitrate Prill in shipping configuration to determine screening and detection capability needed to prevent the weaponization of fertilizer being transported in public areas. Initiate development of materials and mechanisms for tactical delivery of novel non-lethal solutions for maritime vessel disablement. Initiate development of US Navy life cycle cost benefit analysis in support of POM decision by conducting intermediate system integration and environmental testing of the HALO Barrier System.  Initiate development of a mobile application to enhance and host the Vehicle Explosion Analysis Software.  Complete the development and assessment of the Military Blast Expert Evaluation Software to aid commanders in protecting US military expeditionary bases globally."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.320"
                                            },
                                            "Text": {
                                                "val": "Complete development of a software tool for an understanding of TNT equivalency that will provide operational forces necessary information for protecting personnel and infrastructure. Complete development of a rapidly deployable, temporary barrier system to protect fixed and expeditionary facilities in response to increased threat levels. Complete development of an IR-based detection system with automatic focus to allow for enhanced detection of explosive and weapon threats in operational environments. Complete development of tactical arresting systems designed to stop vehicles over a short distance. Complete development and upgrade of a tactical compact aerostat surveillance system for intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces. Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures. Continue development of an in-tunnel unmanned aerial vehicle (UAV) that will provide the ability to safely conduct reconnaissance of discovered illicit tunnels and\/or scheduled inspections of underground municipal infrastructures (UMIs) for evidence of interconnecting tunnel activity. Continue development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments. Continue development of a high performance towed sled to provide increased payload and deployment options for existing combatant craft used by Naval Special Warfare (NSW). Continue development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the Force in Tactical Combat Outposts. Continue development of computer modeling and simulation program to determine the smallest booster size needed to initiate detonation of Ammonium Nitrate Prill in shipping configuration to determine screening and detection capability needed to prevent the weaponization of fertilizer being transported in public areas. Continue development of materials and mechanisms for tactical delivery of novel non-lethal solutions for maritime vessel disablement. Continue development of US Navy life cycle cost benefit analysis in support of POM decision by conducting intermediate system integration and environmental testing of the HALO Barrier System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE, COLLECTION AND OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "Identify high-priority user requirements and special technology initiatives focused primarily on countering terrorism through offensive operations.  Enhance US intelligence capabilities to conduct retaliatory or preemptive operations and reduce the capabilities and support available to terrorists."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.187"
                                            },
                                            "Text": {
                                                "val": "Completed development of the selection and assessment tools for the selection process of Special Operations Forces. Completed enhanced custom force tagging, tracking and locating capabilities. Initiated development of a standard explosives scent kit for training explosive detector dogs. Initiated development of Special Operations Forces training programs to leverage Cyber Operational Preparation of the Environment (C-OPE). Initiated development field technical surveillance capabilities and enhanced custom force tagging, tracking and locating capabilities. Initiated development of a new capability to manage and protect privacy and personal information to include social networks, public, and private databases.  Initiated development of Utilized Unmanned Aerial Vehicles platforms as novel communication relay nodes. Initiated development of new language technologies into operational media exploitation tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.068"
                                            },
                                            "Text": {
                                                "val": "Initiating development of customized force tracking capabilities into existing fielded technologies. Initiating integration of public and private databases into a single user interface application to protect privacy and personal information. Initiating development of cyber-related tools for the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theatre-wide exploitation of tactical intelligence. Initiating development of cyber-related tools for the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theatre-wide exploitation of tactical intelligence. Initiating development of enhance research technology to assist analysts with biometric intelligence and reporting. Continue development and test standardized canine explosive scent training kits. Continue development an enhanced capabilities to leverage Cyber Operational Preparation of the Environment (C-OPE). Initiated deployment of field technical surveillance capabilities and enhance custom force tagging, tracking and locating capabilities. \nContinue to develop a capability to manage and protect privacy and personal information to include social networks, public, and private databases.  Continue development of Unmanned Aerial Vehicles to reduce payloads for effective and efficient communication relays. Continue development translation and exploitation tools in new languages for social media exploitation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.175"
                                            },
                                            "Text": {
                                                "val": "Continuing development of enhance research technology to assist analysts with biometric intelligence and reporting. Complete development of standardized canine explosive scent training kits.  Continue developing and expanding upon enhanced capabilities to leverage Cyber Operational Preparation of the Environment (C-OPE). Continue to develop customized force tracking capabilities into existing fielded technologies and transition existing systems and tools.  \nContinue development in Identity Management tools. Continue development of Unmanned Aerial Vehicles to reduce payloads for effective and efficient communication relays. Continue development of translation and exploitation tools in new languages for social media exploitation. Initiating development and improving surveillance capabilities and enhance custom force tagging, tracking and locating capabilities. Initiating development of cyber-related tools for the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theatre-wide exploitation of tactical intelligence. Initiating development of export template-based lessons and activities to a variety of mobile devices for continuous tactical situational awareness and learning beyond the classroom."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "The Tactical Operations Support subgroup’s mission is to execute rapid research and development projects that enhance capabilities of DoD and Interagency special operations tactical teams engaged in finding, fixing, and finishing terrorists.  This includes support to state and local law enforcement agencies to combat domestic terrorism.  The development focus is enabling small tactical units of dominance by providing state of the art overmatch capabilities in:  Offensive Systems; Specialized Access Systems; Tactical Communications; Intelligence, Surveillance, Target Acquisition, and Reconnaissance Systems (ISTARS); Unconventional Warfare; Survivability Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.777"
                                            },
                                            "Text": {
                                                "val": "Completed development of a specialized application for commercially available smart phones providing a mass alert tool capability that reports and disseminates incidents to U.S. Border Patrol agents enabling rapid response and increased interdictions, arrests and seizures via geo-rectified text messages, pictures and full motion video. Completed development of a next generation tactical mesh network system that provides a self-healing, ad hoc mesh network for the transmission of real-time communications (voice and data) utilizing an Android and Windows application.  Delivered a lightweight organic cell phone network that provides secure voice and secure high speed data services to at least 16 users simultaneously.  Delivered a system that alerts a ground force commander as to the status of his deployed sniper teams, to include still video of shooter’s visual on target, in real-time, over organic radio links.  Developed and delivered a system of clip-on small arms illumination, pointing and infrared imager devices that operate in both the visible, near, and short wave infrared spectrums.  Delivered and continued development of a 20 pound micro tactical ground robot capable of negotiating rugged terrain and climbing complex obstacles for visual and acoustic surveillance and reconnaissance missions and to identify and defeat improvised explosive devices.  Delivered a tactical audio video collection and recording system integrated and worn in civilian clothing.  Delivered a hand emplaced, remotely operated, real-time, tactical visual surveillance system that has an integrated power supply and SATCOM\/Cellular data link.  Completed development of a remotely controlled tactical robotics platform capable of casualty evacuation (CASEVAC), emergency resupply, counter – improvised explosive device (C-IED), and chemical, biological, radiological, nuclear, and explosive (CBRNE) tasks.  Delivered a real-time, standoff imaging capability for the detection of concealed weapons.  Developed a single man-portable, collapsible-wing tactical micro unmanned aerial system with a secure mobile ad-hoc mesh radio network data-link that is capable of being assembled and hand-launched in less than 60 seconds.  Delivered a mobile-mesh network enabled Trojan Scout Unmanned Aerial system providing dismounted operators with an enhanced organic capability to identify threat networks in remote environments with safe stand-off from potential adversaries.  Delivered a fused thermal and image intensified clip-on small arms night vision weapons sight.  Completed development of a lightweight, modular handheld intelligence, surveillance, target acquisition, reconnaissance system.  Delivered a modular concealable sniper rifle with all components measuring less than 16.5 inches.  Generated internal flight and terminal ballistic data on the 6.8mm x 43 round optimized for military applications, in order to determine the suitability of an intermediate caliber for combat operations as compared to 5.56mm and 7.62mm designs.  Delivered an enhanced mobile mortar targeting system mounted on a non-standard vehicle with an integrated Fire Control System that provides extremely rapid and highly accurate indirect fire solutions using legacy 81mm mortar ammunition.    Delivered an upper receiver group that provides a significant reduction in size and improvement to suppression of both sound and flash compared to the current U.S. standard M4 rifle.  Continued to provide program of instruction advanced training and kit to Special Operations Forces (SOF) and select interagency tactical operations snipers to improve long range target interdiction of multiple targets at varying ranges, resulting in a maximum effective range of 1,800 meters.  Completed development of a small, weapon rail mounted, un-cooled long wave infrared detector system to provide snipers with an advanced high resolution thermal imagery to conduct target interdiction operations effectively and efficiently at distances out to 1,800 meters.  Initiated and delivered social media mobile training teams for tactical user preparation of the environment, operational surety, and force protection.  Delivered a spiral development defensive tactical level cyber enabled digital operations program of instruction.  Delivered ballistic protective tactical eyewear capable of near instantaneous transition from clear to amber, blue, and dark gray for use in dynamic lighting environments in combat operations.  Initiated development of a Special Operation Forces (SOF) advanced ballistic engine and rangefinder capability to increase first round hit capability and provide for ease-of-use shot correction information for warfighters. Initiated development of a sniper ballistic and downwind sensor system to increase first round hit capability.  Delivered microSD cards capable of high computing and lower power use for handheld smartphones.  Initiated development of an acoustic tooth communicator system for low-visibility operations.  Delivered a handheld electronic optical device that provides stabilization when trying to view targets on an unstable viewing platform for Special Reconnaissance.  Initiated development of a high-definition aerial Intelligence, Surveillance, and Reconnaissance (ISR) gimbal payload for specified air platforms that will significantly upgrade situational awareness and intelligence through higher fidelity imaging capabilities.  Initiated development of a man-portable aerial radar system that can detect unmanned aerial vehicles and ultralights at the tactical edge.  Initiated development of a tactical tethered aerial ISR capability via an indigenous, non-standard mobility platform that provides austere locations with rapid and improved organic situational awareness.  Initiated development of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long range target acquisition in challenging environments.  Initiated development of a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities.  Initiated and delivered an online and social media awareness video for DOD and Interagency family members to educate on current threats and mitigate vulnerabilities. Initiated the development of a cyber-advanced support operations course focused on training tactical operators to screen social media with anonymity for operational preparation of the environment and force protection.  Initiated development of an air mobility vehicle with analysis of alternatives initiative to conduct training and an operational feasibility assessment for unconventional warfare.  Initiated development of a tactical platform marking kit capable of discretely tagging stationary and moving targets for tracking with legacy night vision devices.  Initiated development of a portable tactical micro marker system to enhance personnel recovery operations.  Initiated an effort to test and evaluate a new ground mobility vehicle for Special Operations Forces (SOF) to increase survivability and provide signature reduction.  Initiated development of an underwater vision enhancement device for ship hull inspections in turbid water and for maritime to land operations.  Initiated development of an extremely low volume, low profile, concealable GPS logger."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.134"
                                            },
                                            "Text": {
                                                "val": "Deliver a Special Operations Forces (SOF) advanced ballistic engine and rangefinder capability to increase first round hit potential and provide for ease-of-use shot correction information for warfighters. Deliver a sniper ballistic and downwind sensor system to increase first round hit capability.  Develop and deliver next generation small arms signature reduction suppressors for the MK18 CQBR and M4.  Initiate development of a lightweight intermediate caliber cartridge utilizing polymer material technologies to reduce combat load and enhance terminal ballistics.  Initiate development of a 5.56mm polymer round to reduce weight for standard issue rounds, enhancing combat effectiveness and reducing warfighter fatigue and cost.  Initiate development of a lethal miniature aerial munition system (LMAMS) with substantially improved maneuverability, attack angle, loiter time, and lethality with a full mission profile flight training variant. Initiate and deliver an enhanced military free fall navigation board that incorporates Android applications for greater command and control and mission planning\/execution.  Deliver an acoustic tooth communicator system for low-visibility operations.  Initiate the development of a tactical communications gateway system that can provide repeater services and cross connect capability with different communications sources from multiple agencies in a modular tactical box that can be deployed in austere environments.  Initiate development of a capability to connect tactical and commercial operator command and control communications (C4I) devices and accessories through secure wireless signals.   Initiate development of microSD chips that provide state-of-the-art high computing at very low power that can create dual personas, enabling secure communication on a smartphone device.  Complete delivery of a 20 pound micro tactical ground robot capable of negotiating rugged terrain and climbing complex obstacles for visual and acoustic surveillance and reconnaissance missions and to identify and defeat improvised explosive devices.  Complete delivery of a single man-portable, collapsible-wing tactical micro unmanned aerial system with a secure mobile ad-hoc mesh radio network data-link that is capable of being assembled and hand-launched in less than 60 seconds.  Deliver a high-definition aerial Intelligence, Surveillance, and Reconnaissance (ISR) gimbal payload for specified air platforms that will enhance situational awareness and intelligence through higher fidelity imaging capabilities. Deliver a man-portable aerial radar system that can detect unmanned aerial vehicles and ultralights at the tactical edge.  Deliver a tactical tethered aerial ISR capability via an indigenous, non-standard mobility platform that provides austere locations with rapid and improved organic situational awareness.  Deliver a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long range target acquisition in challenging environments.  Develop and demonstrate a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities. Initiate and deliver a man-portable optical camera system capable of being deployed in complex urban confined spaces, traversing 90 degree corners and obstacles to provide high fidelity situational awareness to law enforcement and SOF tactical teams.  Deliver a tactical platform marking kit capable of discretely tagging stationary and moving targets for tracking with legacy night vision devices.  Deliver a portable tactical micro marker system to enhance personnel recovery operations.  Complete a test and evaluation of a new ground mobility vehicle for Special Operations Forces (SOF) that increases survivability and provides signature reduction.  Deliver an underwater vision enhancement device for ship hull inspections in turbid water and for maritime to land operations.  Deliver an extremely low volume, low profile, concealable GPS logger.  Initiate development of a non-pyrotechnic diversionary device that will mitigate collateral damage in confined spaces.  Initiate development of a maritime command, control, and tracking capability for surface craft, surface swimmers, and deployed divers.  Initiate development of a Multi-Role Thermal Survivability System (MRTSS) to support tactical operators conducting aviation, ground mobility, and first responder combating terrorism (CbT) missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.350"
                                            },
                                            "Text": {
                                                "val": "Deliver a lightweight intermediate caliber cartridge utilizing polymer material technologies to reduce combat load and enhance terminal ballistics.  Deliver a 5.56mm polymer round to reduce weight for standard issue rounds, enhancing combat effectiveness and reducing warfighter fatigue and cost.  Deliver a lethal miniature aerial munition system (LMAMS) with substantially improved maneuverability, attack angle, loiter time, and lethality with a full mission profile flight training variant.  Deliver a tactical communications gateway system that can provide repeater services and cross connect capability with different communications sources from multiple agencies in a modular tactical box that can be deployed in austere environments.  Deliver a capability to connect tactical and commercial operator command and control communications (C4I) devices and accessories through secure wireless signals.  Deliver microSD chips that provide state-of-the-art high computing at very low power that can create dual personas, enabling secure communication on a smartphone device.  Deliver a non-pyrotechnic diversionary device that will mitigate collateral damage in confined spaces.  Deliver a maritime command, control, and tracking capability for surface craft, surface swimmers, and deployed divers.  Deliver a Multi-Role Thermal Survivability System (MRTSS) to support tactical operators conducting aviation, ground mobility, and first responder combating terrorism (CbT) missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGY DEVELOPMENT"
                                    },
                                    "Description": {
                                        "val": "The TTD Subgroup’s objective is to provide SOF, DoD, and the interagency community with an agile, rapid response, R&D process and SME resource for increasing readiness for tomorrow’s threats.  To meet this objective, the subgroup focuses on immersive simulations; augmented reality; advanced training content programs; rapid and adaptive learning environments; and mobile technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.626"
                                            },
                                            "Text": {
                                                "val": "Completed evaluation of a program designed to improve a soldier’s kinetic eye movement and target acquisition skills and expanded to an OCONUS evaluation.  Completed enhancements to the existing Minigun simulator system.  Completed development of a validated negotiations model for negotiation skills in high stakes situations with additional CONUS and OCONUS users.  Completed installation and evaluation of an additional immersive parachute simulation system for practicing military free fall emergency procedures.  Completed development and evaluation of a PC-based simulation tool to train technical and tactical embassy security skills.  Initiated development of models and a training capability for EOD technicians and first responders that identify safe areas\/distances to perform duties with minimal risk of injury from overpressure and blast fragmentation caused by IEDs and breaching charges.  Completed development of software models and a mobile application to train features and functions of non-standard and foreign weapons.  Completed development of a software solution for a digital interactive visual dictionary (DIVD) and user training to be used in an environment that allows instructor cadre role players and students to interact with data visually to increase and enforce learning, retention, and recall capabilities.  Completed development and implementation of interactive, video-based simulator training scenarios to enhance situational awareness and decision-making for novice and experienced law enforcement personnel during and immediately following incident response.  Initiated analysis, design, and development of an advanced game engine interface and additional 3D virtual target and range models to support advanced simulation training for mission readiness and risk reduction for military personnel.  Initiated design of a system of systems that integrates psychological, physiological, and behavioral information and technology to predict and enhance human physical performance.  Initiated development of a system and simulation that enables training for the tactical employment of task organized forces to conduct operations supporting efforts to combat transnational organized crime.  Completed development and evaluation of a course on the topic of 802.11 standards and signature reduction for civilian law enforcement.  Completed development of a Digital Interactive Survival, Evasion, and Recovery Manual (SERE Manual) iBook and eBook that provide a digital interactive Survival training environment for Service members to prepare for operations in a counter-terrorism environment.  Completed development of a mobile version of a field interview card for use by law enforcement when collecting information about objects and people.  Completed development of a simulation based training package to enhance squad leader decision making in high stress environments.  Initiated design and development of a performance support system for computer-based training of Regionally Aligned Forces (RAF) Units with customized content based on real-world socio-cultural data from security\/stability missions.  Initiated design of three-dimensional ordnance models for a scalable, immersive, online learning environment using COTS technology.  Completed an analysis and equipment selection to enhance maritime surveillance technology and skillsets for personnel to illuminate IED networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.183"
                                            },
                                            "Text": {
                                                "val": "Complete development and implementation of a training capability for EOD technicians and first responders that identify safe areas\/distances to perform duties with minimal risk of injury from overpressure and blast fragmentation caused by IEDs and breaching charges.  Complete development and evaluation of an advanced game engine interface and additional 3D virtual target and range models to support advanced simulation training for mission readiness and risk reduction for military personnel.  Initiate Development of enhancements for a live fire target simulation training system for developing and maintaining long range shooting skill sets. Complete development and evaluation of a system of systems that integrates psychological, physiological, and behavioral information and technology to predict and enhance human physical performance.  Continue design and development of a system and simulation that enables training for the tactical employment of task organized forces to conduct operations supporting efforts to combat transnational organized crime.  Complete development and validation of a performance support system for computer-based training of Regionally Aligned Forces (RAF) Units with customized content based on real-world socio-cultural data from security\/stability missions.  Complete development of three-dimensional ordnance models and implement models into a scalable, immersive, online learning environment using COTS technology.  Initiate design of a technology research, integration, and development test bed to optimize current shooting simulation technology and training methodology, integrate dissimilar separate systems to form a common, scalable, SOF training and simulation architecture, and demonstrate the integrated simulation benefits to the SOF warfighter.  Initiate design and development of a full motion platform\nthat can be mounted on an aerial work platform to replicate air\/boat movement for marksmanship training.  Design and develop scenario-based training to provide analysts with enhanced capabilities for detecting activities and facilities of interest.  Initiate development of low-cost robotic targets that move autonomously on a live-fire training range to enhance marksmanship skills and decision making.  Initiate design and development of a training and performance support tool for use on mobile devices in operational environments.  Initiate design and development of a suite of augmented reality tools for mobile wearable platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.900"
                                            },
                                            "Text": {
                                                "val": "Complete development and implementation of a system and simulation that enables training for the tactical employment of task organized forces to conduct operations supporting efforts to combat transnational organized crime.  Complete development and implementation of enhancements for a live fire target simulation training system for developing and maintaining long range shooting skill sets.  Complete development of a technology research, integration, and development test bed to optimize current shooting simulation technology and training methodology, integrate dissimilar separate systems to form a common, scalable, SOF training and simulation architecture, and demonstrate the integrated simulation benefits to the SOF warfighter.  Complete the development and evaluation of a full motion platform that can be mounted on an aerial work platform to replicate air\/boat movement for marksmanship training.  Complete development and implement scenario-based training to provide analysts with enhanced capabilities for detecting activities and facilities of interest.  Complete development of low-cost robotic targets that move autonomously on a live-fire training range to enhance marksmanship skills and decision making.  Complete development and evaluation of a training and performance support tool for use on mobile devices in operational environments.  Complete development of a suite of augmented reality tools for mobile wearable platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}