{
    "id": "d0f39d9f7018de4630622519278479c4d316f447",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DISA_RDTE_JustificationBook_Defense_Information_Systems_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Information_Systems_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0302019K"
        },
        "ProgramElementTitle": {
            "val": "Defense Info. Infrastructure Engineering and Integration"
        },
        "R1LineNumber": {
            "val": "194"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "93.715"
            },
            "PriorYear": {
                "val": "11.031"
            },
            "CurrentYear": {
                "val": "9.612"
            },
            "BudgetYearOne": {
                "val": "10.186"
            },
            "BudgetYearOneBase": {
                "val": "10.186"
            },
            "BudgetYearTwo": {
                "val": "9.720"
            },
            "BudgetYearThree": {
                "val": "9.913"
            },
            "BudgetYearFour": {
                "val": "9.963"
            },
            "BudgetYearFive": {
                "val": "10.052"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Information Infrastructure Engineering and Integration effort encompasses two projects: Modeling and Simulation and DoD Information Network (DODIN) (formerly Global Information Grid (GIG)) Systems Engineering and Support. There are two major activities under the Modeling and Simulation project: Modeling and Simulation and DODIN Enterprise Wide Systems Engineering (EWSE).\n\nThe DODIN EWSE activity resolves near term (one to three years) high-priority technical issues defined by Department of Defense Chief Information Officer (DoD CIO) and Defense Information Systems Agency (DISA), that impact operational capabilities affecting DODIN End-to-End (E2E) interoperability and performance. \n\nThe Modeling and Simulation project provides architecture, systems engineering and E2E analytical functions for DISA and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Ongoing beneficiaries of these capabilities include DoD CIO, the DISA Network Services Directorate, the DISA Enterprise Services Directorate, Program Executive Office-Mission Assurance, the Defense Information Systems Network Command Center and Joint Communications Simulation System users in DoD.\n\nThe DODIN Systems Engineering and Support project defines and validates that the overall technical strategies for DISA are aligned with key DoD Strategic Planning and Execution documents. These documents include the DoD IT Efficiency strategy, DoD CIO’s Campaign Plan, Joint Information Environment (JIE) Roadmap and Concept of Operations, DoD Instructions and Memorandum, other critical high-level guidance documents and target architectures and transition plans. These strategies establish the foundation for technology investments, technical developments, and the operations and sustainment of critical net-centric products and services provided by DISA. The DISA Chief Technology Officer (CTO) conducts technical system engineering reviews and oversight.  CTO's early identification of technology needs in coordination with DARPA and will be managed through the DISA Technology Information Repository (DTIR).  CTO conducts system engineering oversight, as well as critical technology evaluations and technical maturity assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.831"
                },
                "CurrentYear": {
                    "val": "9.657"
                },
                "BudgetYearOne": {
                    "val": "8.678"
                },
                "BudgetYearOneBase": {
                    "val": "8.678"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.031"
                },
                "CurrentYear": {
                    "val": "9.612"
                },
                "BudgetYearOne": {
                    "val": "10.186"
                },
                "BudgetYearOneBase": {
                    "val": "10.186"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.200"
                },
                "CurrentYear": {
                    "val": "-0.045"
                },
                "BudgetYearOne": {
                    "val": "1.508"
                },
                "BudgetYearOneBase": {
                    "val": "1.508"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.200"
                                },
                                "CurrentYear": {
                                    "val": "-0.045"
                                },
                                "BudgetYearOne": {
                                    "val": "1.508"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.508"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2014 increase of +$0.200 is attributable to an increase in analysis to better shape and influence transport services related investments.   \n\nThe FY 2015 decrease of -$0.045 complements analysis efforts which will examine application of commercial 4G wireless technologies in DODIN to include tactical environments.\n\nThe FY 2016 increase of +$1.508 will increase the Warfighters' competitive advantage by delivering critical innovative solutions to the Warfighters and evaluate, develop and implement a number of emerging technological innovations. Key technologies, such as the Next Generation of Cloud Services, will be developed and delivered to the Joint Information Environment community, the DoD, Combatant Commanders, and other Government agencies.  Additionally, key technology initiatives such as future infrastructure architectures, Cyber Security, Software Defined Networks, Big Data solutions, cloud computing, mobile computing, mobile applications, wireless, social media, and knowledge management systems and services will be implemented."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E65"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "66.543"
                        },
                        "PriorYear": {
                            "val": "3.774"
                        },
                        "CurrentYear": {
                            "val": "6.391"
                        },
                        "BudgetYearOne": {
                            "val": "6.079"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.079"
                        },
                        "BudgetYearTwo": {
                            "val": "5.672"
                        },
                        "BudgetYearThree": {
                            "val": "5.829"
                        },
                        "BudgetYearFour": {
                            "val": "5.849"
                        },
                        "BudgetYearFive": {
                            "val": "5.901"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Modeling and Simulation project provides architecture, systems engineering and end-to-end (E2E) analytical functions for the Defense Information Systems Agency (DISA) and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Modeling and Simulation activities support the Department of Defense (DoD) communications planning and investment strategy, including: application performance assessments, contingency planning, network capacity planning and diagnostics, and systems-level modeling and simulation. Project efforts provide across-theater information awareness for Combatant Commands through application solutions for integrated networks, including DoD’s missions in Afghanistan and the Defense Information Systems Network (DISN) by: (1) supporting the development and implementation of DoD Information Network (DODIN) Enterprise Wide Systems Engineering (EWSE) processes essential to evolving the DODIN in a manner that enables interoperability and E2E performance for critical DODIN programs; (2) developing standardized DISA systems analyses and integration processes to improve systems integration across DISA for all DISA developed communication systems and services; and (3) providing the underlying modeling and simulation and analytical support for E2E DISA and DoD systems engineering and assessment. \n\nProject efforts provide DoD decision makers with services and a suite of tools capable of identifying key points of impact on DoD command and control information systems and recommending trade-offs within the DODIN configuration with regard to prioritized performance, availability, and security. This effort will reduce the risk in products deployed to the warfighter through improved network performance and traffic analysis, and an efficient means of troubleshooting and subsequent redesign."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.774"
                                            },
                                            "Text": {
                                                "val": "Continued EWSE efforts to resolve near term (one to three years) high-priority technical issues impacting end-to-end interoperability and performance of DODIN capabilities in transport, computing services, applications, IA, NetOps and enterprise services. \n\nContinued FY 2013 efforts to enhance modeling capabilities to provide DISN IP and Transport Capacity Planning models.  These enhancements included: (1) preparing for the FY 2015 Technology Refresh (feasibility tests required prior to hardware being added to the DODIN) and new user requirements; (2) enhanced modeling and instrumentation techniques for Enterprise Services and customer needs in DISA program\/project decisions and planning (e.g. Joint Information Environment and Defense Enterprise Computing Centers); (3) DoD Internet traffic models and analyses for capacity planning and IA initiatives for the DISA Director, Cybercom, and Network Services; (4) enhanced modeling tools and techniques to provide inputs to network planning in support of Unified Communications and E2E security goals of the evolving DISN; and (5) an updated version of the Joint Communications Simulation System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.391"
                                            },
                                            "Text": {
                                                "val": "Will continue EWSE efforts to resolve high-priority technical issues impacting E2E capabilities of DODIN in transport, computing services, applications, information assurance (IA), network operations (NetOps) and enterprise services. Will analyze additional cloud computing services that can be integrated or interoperated with DoD capabilities. Will examine application of commercial 4G wireless technologies in DODIN to include tactical environments.  The results of analysis and examination will be socialized with the DoD community for action and adoption.  Where appropriate, the results will also be documented in GIG Technical Profiles (GTP) for compliance by the Programs of Record (POR).\n\nWill continue efforts to enhance modeling capabilities that will provide DISN IP and Transport Capacity Planning models, modifying tools and processes to reflect the operational DISN architecture and technologies as evolved under Joint Information Environment (JIE) initiatives and technical advances.  These enhancements include: (1) preparing for the FY 2016 Technology Refresh (feasibility tests required prior to hardware being added to the DODIN) and new user requirements; (2) enhanced modeling and instrumentation techniques for new or evolving enterprise Services and customer needs in DISA program\/project decisions and planning (e.g. JIE and Defense Enterprise Computing Centers); (3) DoD Internet traffic models and analyses for capacity planning and IA initiatives for the DISA Director, CYBERCOM, and Network Services; (4) enhanced modeling tools and techniques to provide inputs to network planning and performance assessments in support of Unified Communications and E2E security goals of the evolving DISN; and (5) an updated version of the Joint Communications Simulation System.\n\nThe increase of +$2.617 from FY 2014 to FY 2015 funds efforts to resolve high-priority technical issues impacting the DODIN E2E performance in transport, computing services, applications, IA, NetOps and Enterprise Services.  Specific work includes maturation of a system which will encrypt DoD data and allow its storage on commercial cloud technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.079"
                                            },
                                            "Text": {
                                                "val": "Will continue EWSE efforts to resolve high-priority technical issues impacting interoperability of DODIN capabilities in communications, computing services, applications\/services, information assurance (IA) and net-centric operations (NetOps). Will analyze\/prototype cloud computing services that can be integrated or interoperated with DoD capabilities. Will examine application of Software Defined Networking (SDN) technologies for Core Data Centers and DISN. The results will be socialized with the DoD community for action\/adoption or further development. Where appropriate, the results will also be documented in GIG Technical Profiles (GTP) for compliance by the Programs of Record (POR).\n\nWill continue efforts to enhance modeling capabilities that will provide DISN IP and Transport Capacity Planning models, modifying tools and processes to reflect the operational DISN architecture and technologies as evolved under Joint Information Environment (JIE) initiatives and technical advances. These enhancements include: (1) preparing for the FY 2016 Technology Refresh (feasibility analyses required prior to hardware being added to the DODIN) and new user requirements; (2) enhanced modeling and instrumentation techniques for new or evolving enterprise Services and customer needs in DISA program\/project decisions and planning (e.g. JIE and Defense Enterprise Computing  enters); (3) DoD Internet traffic models and analyses for capacity planning and IA initiatives for the DISA Director, CYBERCOM, GIG Operations, Mission Assurance, and Network Services; (4) enhanced modeling tools and techniques to provide inputs to network planning and performance assessments in support of Unified Communications and E2E security goals of the evolving DISN; and (5) an updated version of the Joint Communications Simulation System.\n\nThe decrease of -$0.312 between FY 2015 and FY 2016 is attributable to reduction in research efforts for Enterprise Wide Systems Engineering; specifically the Service Level Interoperability for Tactical Edge and Core (SLITEC) area."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0302019K"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance, Defense-Wide"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.328"
                                        },
                                        "CurrentYear": {
                                            "val": "2.051"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.045"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.045"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.336"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.432"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.432"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "EWSE uses contractors to assist\/supplement the Government lead\/team for technical activities. Subject matter experts in both large and small businesses are sought for the engineering support. Firm fixed price contracts with one option year are typically used in open competition. Furthermore, technical work with Federally Funded Research and Development Centers (FFRDCs) such as MITRE and MIT Lincoln Lab are established and coordinated when the Government can leverage their expertise and R&D in the key technology.  \n\nModeling and Simulation uses a range of contractors for modeling support to the various projects. Contractors range from small to large business, predominantly using open competition methods and Firm Fixed Price (FFP) tasks and utilizing multi-year (base plus option years) contracts where possible. Support includes network modeling tool and processes development to adapt to ever-evolving OSD\/DISA programs and projects, analyses, capacity planning, and network redesign using the models. Some specific support (e.g., integration with proprietary software) will require contracting with OPNET (e.g., sole source). FFRDCs are also considered depending upon the task."
                        },
                        "PerformanceMetrics": {
                            "val": "DISN core bandwidth sufficiency, tied to transport and IP capacity planning and activation of bandwidth in the DISN core, to keep at least 25% spare capacity, to allow for provisioning of unforeseen requirements and rerouting under outages.  Current status stands at 59.85% capacity, thus maintaining spare capacity in excess of 25%.\n\nThe EWSE projects will be measured by the number of systems engineering artifacts and\/or DODIN Technical Profiles that are published to support interoperability of DoD programs; and the number of engineering\/ technical solutions that are adopted by programs\/initiatives across DoD, Combatant Commands (COCOMs), and the Services. These solutions will be coordinated with the stakeholders\/users to ensure EWSE has the right solution to the right problem."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OPNET Tech, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bethesda, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.244"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.864"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.296"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APPTIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.562"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.127"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Noblis"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.312"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.312"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 4"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen, Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.668"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.542"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.569"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 5"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.100"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 6"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Soliel, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.086"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.766"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.025"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 7"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Estrela Tech, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Vienna, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.479"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.326"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 8"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMPTEL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.926"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.335"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.335"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.261"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 9"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.565"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.475"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.599"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.205"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.205"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 10"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.011"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.458"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.384"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.384"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Wide Systems Engineering 11"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.784"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.784"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Clear Sky Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL Terremark"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Narus"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.450"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.450"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cyber Accelerator"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.516"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.516"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Commercial Integration Demonstration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.750"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.750"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Web Content Filtering:  Perimeter Defense Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oberon Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.854"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.854"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Host Based Security Ops Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Summit Technologies, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.700"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Secure Configuration Management Ops Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cyber Security research and Solutions Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.964"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.964"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Comptel"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.072"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.072"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Horizontal Engineering"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Horizontal Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Applications"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Modeling and Simulation Applications"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T62"
                    },
                    "ProjectTitle": {
                        "val": "GIG Systems Engineering and Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "27.172"
                        },
                        "PriorYear": {
                            "val": "7.257"
                        },
                        "CurrentYear": {
                            "val": "3.221"
                        },
                        "BudgetYearOne": {
                            "val": "4.107"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.107"
                        },
                        "BudgetYearTwo": {
                            "val": "4.048"
                        },
                        "BudgetYearThree": {
                            "val": "4.084"
                        },
                        "BudgetYearFour": {
                            "val": "4.114"
                        },
                        "BudgetYearFive": {
                            "val": "4.151"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Chief Technology Officer (CTO) has the responsibility of defining and validating the overall technical strategies for the Defense Information Systems Agency (DISA) in line with the DoD IT Efficiency strategy and Department of Defense Chief Information Officer (DoD CIO) Campaign Plan. These strategies establish the foundation for technology investments, technical development, Cooperative Research and Development Agreements, and the operations and sustainment of critical net-centric products and services provided by DISA. DISA CTO conducts technical system engineering reviews and oversight. CTO’s early identification of technology needs will be managed through the Technology Management Framework (TMF), a part of the broader Advanced Technology Identification and Insertion Process (ATIIP). TMF uses as its substrate an institutionalized, directorate partnering construct (i.e. DISA CIO, CTO, Strategic Planning and Information (SPI)), based upon an Enterprise Architecture (EA) methodology. \n\nThe CTO supports end to end (E2E) technology evaluations, assessments, process improvements, as well as the analysis and review of potential technology solutions, products, capabilities and services to ensure consistency with DoD Information Network (DODIN) architecture and standards.  Our products provide actionable, decision-oriented information to the Secretary of Defense, Joint Staff, Military Services, Combatant Commands, and other mission partners in satisfying DoD mission objectives.\n\nThe CTO maintains the Technology Environment, which provides the infrastructure, tools, processes, and techniques to perform various types of assessments and evaluations. These include informal quick looks, technology demonstrations, proof-of-concept events, and technology piloting events, as well as formally orchestrated operational assessments.  The Technology Environment is capable of supporting a broad range of topics and issues such as EA, wireless and mobile computing, transport technologies, net-centricity compliance, unified capabilities services, Web 2.0, cloud computing, and social networking."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense Information Network (DODIN) Systems Engineering and Support (formerly Global Information Grid (GIG) Systems Engineering and Support)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.257"
                                            },
                                            "Text": {
                                                "val": "CTO utilized the DISA Technology Information Repository (DTIR) and further expanded its support of the DoD Campaign Plan and the DISA Strategic Plan to identify, demonstrate and assess new technology concepts and compatibilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.221"
                                            },
                                            "Text": {
                                                "val": "To support the transition of applications and services to Core Data Centers for Joint Information Environment (JIE) capabilities, concepts and operations, CTO will develop and mature cloud computing technologies and service delivery models. These technologies include, cyber threat and exploitation vectors and mitigations, full featured Geo-Location Policy Based Mobile Device Management and secure mobile multi user\/environment technologies, next generation Software Defined Networks, and supporting concept of operations.\n\nThe decrease of -$4.036 from FY 2014 to FY 2015 is attributable to transitioning of pilots and research and development programs to programs of record and a reduction in DISA's performance of research, assessment, development, proof-of-concepts and pilots, adoption and integration, and transition of emerging and next generation technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.107"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.107"
                                            },
                                            "Text": {
                                                "val": "CTO will develop the Technology Environment (TE), composed of the technical infrastructure, associated processes, practices, and methodologies that are used to evaluate and characterize new technologies.  Within the TE, CTO will continue to perform technical assessments and proof of concepts for key capability portfolios (Networking, computing & storage, UC, mobility, cyber security, and network operations).  Also included are future cloud computing technologies and innovative service delivery models, mobile devises, application development and vetting best practices, and next generation virtualized Software Defined Networks for automating and virtualizing the DoDIN.  CTO will continue to partner with commercial partners, academia, technical analysis centers, as well as member organizations within the Intelligence Community, to bring state of the art capabilities to DISA for better communications and monitoring tools, enterprise services and improved end-user services and capabilities.\nInnovation funds will continue to explore, develop and deliver emerging technologies to the Warfighter.  The funding will allow the Department to leverage technology to drive efficiencies and cost saving to DoD, the Warfighter, and other Government Agencies. Technologies including Cloud Services, future infrastructure architectures, Cyber Security, Software Defined Anything, Big Data, cloud computing, mobile computing, mobile applications, wireless will be piloted, mature and developed.\n\nThe increase of +0.886 from FY 2015 to FY 2016 will increase the Warfighters' competitive advantage by delivering critical innovative solutions to the Warfighters."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M, DW\/PE 0302019K"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance, Defense-Wide"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.550"
                                        },
                                        "CurrentYear": {
                                            "val": "5.052"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.730"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.730"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.673"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.890"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.925"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.026"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Market research during the acquisition process includes a review of DISA contracts, other DoD contract vehicles, and other Federal Government agency contracts which are advertised for Government-wide usage.  This market research also includes consideration of small businesses including minority\/women owned (8A) businesses, Historically Black Colleges and Universities, mentor\/protégé and other specialized contract vehicles and processes. Market research evaluates all contractors available from DISA sources for their ability to deliver the products specifically required for the unique program efforts.  The program works collaboratively with vendors to obtain generic cost data for planning and analysis purposes.  Past and current contract prices for similar work and other government-wide agency contracts provide additional sources of information.  Quotes from multiple sources help provide averages for more realistic cost estimates.  DISA makes a concerted effort to award many of its contracts to small businesses.  Additionally, many of the DISA contracts are awarded with multiple option periods. These have the benefit of fixing labor costs over an extended period and minimizing the administrative costs associated with re-issuing short-term contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance is measured by project milestones and the adoption of these technologies into existing Programs of Record (PORs) or as new program offerings to the DoD and intelligence communities. Metrics that will be used include number and percentage of emerging and mature technologies adopted by DISA and DoD, number and percent of technology research and development initiatives and investments in the DoD, peering organizations and industry partners attributable to technology research. These investments and evolution plans identify, promote, channel and align technology research and investments to reduce time to field emerging technologies to satisfy warfighter requirements. See specific metrics below:\n\n1.  Metric:  Performance is measured by the number of technologies assessed and the adoption or influence of the technologies assessed on DoD, DISA or IC programs, projects or services.  Technologies are identified by many venues to include research and development initiatives, technology watch-lists from various sources (e.g. in-house, peer organizations, industry and\/or academic advisors) and commercial product releases that have potential applicability to the warfigher mission area.  These measures will allow CTO to align technology research and development with capabilities gaps and needs resulting in improved operational effectiveness and efficiencies.\n\n      Measure\/Goal:  Number of pilot and technology assessments instantiated within the CTO Technical Environment.  Number research initiatives designed, developed and demonstrated and transitioned to programs, projects, or services.  \n\n      FY14 Actual:  8 Assessed and 5 transitioned  \n      FY15 Target:  8 Assessed and 5 transitioned  \n      FY16 Target:  8 Assessed and 5 transitioned"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.836"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.485"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.484"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.484"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Industry Tech Res"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gartner"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.249"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.249"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.249"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GIG Technical Insertion Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SRA, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.211"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.211"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.211"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.601"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.601"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.601"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAMA-C"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Micro-electronics Activity"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.794"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.794"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.794"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Thin Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.450"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.26"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.26"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Moya Technologies, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.212"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.212"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.212"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.262"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.053"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.315"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.315"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science and Technology Associates, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.643"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.508"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.551"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.551"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.376"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.376"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.376"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.691"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.691"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.691"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TWM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.181"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.021"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.202"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.202"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SOLERS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.400"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.595"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.995"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.995"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.351"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.351"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.351"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.415"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.326"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.533"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.533"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IV2: IT Consulting Services, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Jackson, WY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.074"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Information Assurance TWM Follow On"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.440"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.440"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Technical Direction Agent (TDA)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Technical Direction Agent (TDA)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Support"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Industry Technical Research"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Industry Technical Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}