{
    "id": "d5155de4086f7181c8e310a3520c9e669c5572ad",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineNumber": {
            "val": "139"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "63.944"
            },
            "CurrentYear": {
                "val": "45.573"
            },
            "BudgetYearOne": {
                "val": "51.550"
            },
            "BudgetYearOneBase": {
                "val": "51.550"
            },
            "BudgetYearTwo": {
                "val": "52.773"
            },
            "BudgetYearThree": {
                "val": "49.718"
            },
            "BudgetYearFour": {
                "val": "54.607"
            },
            "BudgetYearFive": {
                "val": "57.071"
            }
        },
        "ProgramElementNote": {
            "val": "FY16 increase is required to preserve Test and Evaluation test capability."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element provides critical front-end investments for development of new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of modeling and simulation (M&S) and instrumentation prototypes; and the full development of test instrumentation for the United States Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); and Redstone Test Center (RTC), Redstone Arsenal, Alabama. OTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas. These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives. Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for modeling and simulation (M&S) and instrumentation systems to assure adequate test data collection capabilities. This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the Joint Light Tactical Vehicle (JLTV), Network Integration Evaluation (NIE), Patriot Advance Capability Phase 3 (PAC-3), Warfighter Information Network - Tactical (WIN-T), Stryker, Bradley, Guided Multiple Launch Rocket System (GMLRS), Joint Tactical Radio System (JTRS),and the Distributed Common Ground System - Army (DCGS-A)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "66.025"
                },
                "CurrentYear": {
                    "val": "45.596"
                },
                "BudgetYearOne": {
                    "val": "42.618"
                },
                "BudgetYearOneBase": {
                    "val": "42.618"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "63.944"
                },
                "CurrentYear": {
                    "val": "45.573"
                },
                "BudgetYearOne": {
                    "val": "51.550"
                },
                "BudgetYearOneBase": {
                    "val": "51.550"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.081"
                },
                "CurrentYear": {
                    "val": "-0.023"
                },
                "BudgetYearOne": {
                    "val": "8.932"
                },
                "BudgetYearOneBase": {
                    "val": "8.932"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.023"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.081"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "8.932"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.932"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.350"
                        },
                        "CurrentYear": {
                            "val": "32.991"
                        },
                        "BudgetYearOne": {
                            "val": "41.688"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.688"
                        },
                        "BudgetYearTwo": {
                            "val": "42.691"
                        },
                        "BudgetYearThree": {
                            "val": "34.265"
                        },
                        "BudgetYearFour": {
                            "val": "35.911"
                        },
                        "BudgetYearFive": {
                            "val": "38.021"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Homemade Explosive Characterization Study ends in FY 2015."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC). These capabilities are required to support developmental testing requirements of high priority Army systems supporting Army modernization efforts. Where practical, efficiencies will be gained through the common use of developmental instrumentation in operational testing.  A key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of body armor and other soldier protective equipment, advanced methods for testing the survivability of ground vehicles and aircraft, a new six degree-of-freedom vibration system to improve missile testing efficiency, and an expanded instrumentation suite in support of the growing mission to test Command, Control, Communication and Computer (C4) systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires and sustains critical test technology and instrumentation: Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment and other test capabilities to successfully develop and test Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities and models and simulations needed for testing the Army materiel. Acquires instrumentation for reliability, availability and maintainability (RAM) data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition tests; supports development of common data collection instrumentation used in testing across all test commodity areas and test lifecycles; acquires instrumentation for electromagnetic environmental effects (E3) on ground and air systems; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry equipment used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert plus tropic environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire, and active protection systems; upgrades and replaces mobile range communications equipment and digital end devices; and develops advanced test technologies and instrumentation for testing next generation materiel such as advanced armor protection, multi-spectral sensors, and advanced soldier systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.446"
                                            },
                                            "Text": {
                                                "val": "Continued to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.549"
                                            },
                                            "Text": {
                                                "val": "Continue to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.688"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.688"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing. Will complete enhancements to body armor testing methods and instrumentation in accordance with recommendations from the National Institute of Standards and Technology (NIST).  Initiate development of next-generation communications and network testing tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Homemade Explosive Characterization Study"
                                    },
                                    "Description": {
                                        "val": "Homemade explosives are the prevalent underbody threat in Operation Enduring Freedom area of operation. Currently live fire testing cannot use Army G2-validated homemade explosive surrogate because its performance has varied greatly from test-to-test. This study will characterize subscale and full scale repeatability of Army G2-validated surrogate homemade explosive charge for use in live fire test events and compare the performance relative to TNT standard. Results from this homemade explosive characterization will inform efforts to improve combat vehicle survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.462"
                                            },
                                            "Text": {
                                                "val": "Continued to obtain data to quantify target responses of homemade explosive surrogates and additional standard TNT mine threats used in live fire testing and provide data set to support future verification, validation, and accreditation (VV&A) of underbody blast modeling and simulation tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.442"
                                            },
                                            "Text": {
                                                "val": "Complete the quantification of target responses of homemade explosive surrogates and additional standard TNT mine threats used in live fire testing and provide data set to support future verification, validation, and accreditation (VV&A) of underbody blast modeling and simulation tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Test and Evaluation Command (ATEC) Common Test Technology for Developmental Testing, Operational Testing, and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Army Test and Evaluation Command (ATEC) Common Test Technology for Developmental Testing, Operational Testing, and Evaluation. Provides support for development of a Test and Evaluation Enterprise Architecture to facilitate use of common tools and standards; support for critical Test Technology Domain Focus Areas of Instrumentation, Modeling and Simulation, Threats, Data Management, and Networks; and support,  implementation of ATEC Regulation 70-15"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.442"
                                            },
                                            "Text": {
                                                "val": "Due to the consolidation of headquarters functions within ATEC, most efforts funded by this project have been transferred to the appropriate headquarters account. This project will continue to support the sustainment of the Starship instrumentation monitoring and control software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.594"
                        },
                        "CurrentYear": {
                            "val": "12.582"
                        },
                        "BudgetYearOne": {
                            "val": "9.862"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.862"
                        },
                        "BudgetYearTwo": {
                            "val": "10.082"
                        },
                        "BudgetYearThree": {
                            "val": "15.453"
                        },
                        "BudgetYearFour": {
                            "val": "18.696"
                        },
                        "BudgetYearFive": {
                            "val": "19.050"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "The US Army Test and Evaluation Command (USATEC) plans, conducts and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of War Fighting Systems.  Operational Test (OT) Instrumentation collects required data from both the systems being tested and the surrounding activities.  OT simulation enhances the live forces conducting operational testing by simulating additional units, message traffic, effects, and terrain. The Army's OPTEMPO has reduced the number of tactical units and vehicles available to support OT, making augmentation through simulation needed at times to test in a realistic, operational environment. The Program Executive Office for Simulation, Training, and Instrumentation (PEO STRI) Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) provides development of major simulation and instrumentation systems while ATEC adapts systems from other organizations, purchases off-the-shelf systems, develops minor new systems, and sustains all ATEC simulation and instrumentation systems.  The OT Simulation and Instrumentation (S&I) (Sustainment and Minor Development) program funds the expertise and the adaptation, purchases, minor development and sustainment requirements that support systems undergoing OT. Costs unique to specific systems under test may require Program Manager (PM) funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling, Simulation and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Develop and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Improve and sustain our Real-Time Casualty Assessment (RTCA) (including geo-pairing) capabilities. Plus develop, enhance, and sustain our Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems together with their associated data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.594"
                                            },
                                            "Text": {
                                                "val": "FY14 Planned Programs - Sustain and develop ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Begin an effort to improve our Real-Time Casualty Assessment (RTCA) (including geo-pairing) capabilities to support future AMPV and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Plus develop and sustain our Performance Instrumentation Systems and associated data management, Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.582"
                                            },
                                            "Text": {
                                                "val": "FY15 Planned Programs - Continue to sustain and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Continue to improve our Real-Time Casualty Assessment (RTCA) (including geo-pairing) capabilities to support future AMPV and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain and develop our Performance Instrumentation Systems and associated data management, Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.862"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.862"
                                            },
                                            "Text": {
                                                "val": "FY16 Planned Programs - Will continue to sustain and enhance ATEC's Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Continue to improve our Real-Time Casualty Assessment (RTCA) (including geo-pairing) capabilities to support future AMPV, and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain and develop our Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems and associated data management."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}