{
    "id": "d5671794a538a7bdf149c1317d714cfdfa45a964",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602747N"
        },
        "ProgramElementTitle": {
            "val": "Undersea Warfare Applied Res"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "99.302"
            },
            "CurrentYear": {
                "val": "86.880"
            },
            "BudgetYearOne": {
                "val": "123.750"
            },
            "BudgetYearOneBase": {
                "val": "123.750"
            },
            "BudgetYearTwo": {
                "val": "148.777"
            },
            "BudgetYearThree": {
                "val": "183.056"
            },
            "BudgetYearFour": {
                "val": "207.873"
            },
            "BudgetYearFive": {
                "val": "211.996"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE funds applied research efforts in undersea target detection, classification, localization, tracking, and neutralization.  Technologies being developed within this PE are aimed at enabling Sea Shield, one of the core operational concepts detailed in the Naval Transformational Roadmap.  Associated efforts focus on new Anti-Submarine Warfare (ASW) operational concepts that promise to improve wide-area surveillance, detection, localization, tracking, and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments.  Related efforts are aimed at leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship, and air ASW assets. Research focused on understanding the impacts on marine mammals of manmade underwater sound is also conducted in the Program Element.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "103.041"
                },
                "CurrentYear": {
                    "val": "86.880"
                },
                "BudgetYearOne": {
                    "val": "79.067"
                },
                "BudgetYearOneBase": {
                    "val": "79.067"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "99.302"
                },
                "CurrentYear": {
                    "val": "86.880"
                },
                "BudgetYearOne": {
                    "val": "123.750"
                },
                "BudgetYearOneBase": {
                    "val": "123.750"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.739"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "44.683"
                },
                "BudgetYearOneBase": {
                    "val": "44.683"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.765"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.974"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "45.880"
                                },
                                "BudgetYearOneBase": {
                                    "val": "45.880"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.197"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.197"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Undersea Warfare Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "99.302"
                        },
                        "CurrentYear": {
                            "val": "86.880"
                        },
                        "BudgetYearOne": {
                            "val": "123.750"
                        },
                        "BudgetYearOneBase": {
                            "val": "123.750"
                        },
                        "BudgetYearTwo": {
                            "val": "148.777"
                        },
                        "BudgetYearThree": {
                            "val": "183.056"
                        },
                        "BudgetYearFour": {
                            "val": "207.873"
                        },
                        "BudgetYearFive": {
                            "val": "211.996"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE funds applied research efforts in undersea target detection, classification, localization, tracking, and neutralization. Technologies being developed within this project are aimed at enabling Sea Shield which is one of the core operational concepts detailed in the Naval Transformational Roadmap. Associated efforts focus on new ASW operational concepts that promise to improve wide-area surveillance, detection, localization, tracking, and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments. Related efforts are aimed at leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship, and air ASW assets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ANTI-SUBMARINE WARFARE (ASW) DISTRIBUTED SEARCH"
                                    },
                                    "Description": {
                                        "val": "ASW Distributed Search focuses on the development of technologies for the non-covert tactical search for undersea targets ranging from hours to weeks, using automated sensor systems deployed around operating areas, including along key transit routes to protect naval\/maritime forces, around temporarily fixed sea base regions and naval force operating areas, or around fixed defensive regions and areas of interest, such as key US\/Allied ports. \"Non-covert\" implies availability of airborne assets for sensor deployment (although other means may also be used), and the ability to employ active sonar along with passive and non-acoustic methods. \"Search\" is conducted in concentrated areas, typically exploiting cues received from surveillance systems. The submarine target must be detected beyond its weapons release range. The objective is to develop rapidly deployable systems employing automated detection and classification capabilities for use in both shallow and deep water operating environments. Distributed Search supports the ASW protected passage Maritime Shield operational constructs. Related efforts include the development of distributed systems employing optimization as well as active acoustic sensing and processing techniques, navy-unique transduction and underwater networking technology. Efforts also include the development of Unmanned Undersea Vehicle-based and affordable off-board deployable sensing systems employing persistent detection concepts and components. These efforts provide an extended reach of organic platform-based systems through the use of new sensor concepts, improved materials for advanced sensors, optimized deployment, employment, and automated operation of distributed sensor fields. The cornerstone of Distributed Search is the development of rapidly deployable, long-endurance active sensors with automated processing suitable for use in a wide variety of operational environments. \n\nFunding increase from FY 2014 to FY 2015 is due to realignments required to re-prioritize S&T investments resulting in an increase in ASW Initiatives.  \n\nFunding increase from FY 2015 to FY 2016 is due to 3 new programs funded in this PE: The Virtual Acoustic Sensing Array (VASA),  Forward Deployed Energy & Communications Outpost (FDECO) (FY16-FY19) INP, and the Anti Submarine Warfare Mission Packages (ASW MP) (FY16-FY20)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued prototype development of a LF underwater acoustic holographic beamforming lens for manipulating the phase fronts of narrow-band sound waves. \n- Continued development of a thermophone acoustic projector technology for use in sonar applications. \n- Continued development of signal processing algorithms aimed at reducing clutter-generated false alerts. \n- Continued development\/improvement of multi-static signal processing techniques for systems employing coherent sound sources. \n- Continued development of \"intelligent\" algorithms aimed at optimizing distributed multistatic sources\/receivers. \n- Continued a collaborative follow-on Joint Research Project for Next Generation Autonomous Sensing (NGAS). \n- Continued research into the characterization and classification of deep-ocean clutter sources to improve active sonar system performance in Convergence Zone (CZ) and other deep-ocean propagation conditions. \n- Continued development of Non-Traditional Transduction Methods (NTTM) which fundamentally departs from conventional ASW transduction techniques. \n- Continued development of Non-Acoustic Fiber Optic Sensors (NA-FOS) for ASW applications. \n- Continued research aimed at adaptive design and synthesis of networked distributed sensors. \n- Continued effort to demonstrate the effectiveness of structural acoustic-based classifier techniques to detect, localize and identify. \n- Completed effort to create compact, low power, highly sensitive directional, and low frequency (10-100 Hz) acoustic sensors. \n- Initiated development of non-traditional distributed search systems for deployment on air vehicles. \n- Initiated development of novel parametric source and receiver technologies. \n- Initiated effort to develop compressive beamforming algorithms for vector sensor towed arrays. \n- Initiated effort to develop and demonstrate real time onboard processing for a UUV to detect, classify, and track submarines using active sonar."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.490"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above. \n- Complete prototype development of a LF underwater acoustic holographic beamforming lens for manipulating the phase fronts of narrow-band sound waves."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as complete above.\n- Continue development of \"intelligent\" algorithms aimed at improving ASW performance of distributed multistatic sonar systems.\n- Complete development of a thermophone acoustic projector technology for use in sonar applications. \n- Complete effort to develop compressive beamforming algorithms for vector sensor towed arrays. \n- Complete development\/improvement of multi-static signal processing techniques for systems employing coherent sound sources.\n- Complete research into the characterization and classification of deep-ocean clutter sources to improve active sonar system performance in Convergence Zone (CZ) and other deep-ocean propagation conditions.\n- Initiate development of signal and information processing algorithms for improved ASW performance of high duty cycle active sonar systems.\n- Initiate the Forward Deployed Energy & Communications Outpost (FDECO) INP project."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ANTI-SUBMARINE WARFARE (ASW) PRECISION LOCALIZATION"
                                    },
                                    "Description": {
                                        "val": "Precision Localization focuses on the development and demonstration of technologies which use information from surveillance or search systems to determine an area of uncertainty (AOU) relative to target range, bearing, and depth adequate to handoff to an attack system. Precision Localization employs non-acoustic techniques such as magnetic and optical sensing to highly localize submerged threats. The objective is to increase magnetic sensor range and robustness, enable deployment on Unmanned Air Vehicles (UAVs), and increase optical sensing search rates. Efforts include the development of non-traditional tracking and advanced magnetic and electric field sensors and processing. These technologies will provide a decreased AOU size thus enabling the effective use of smaller, more versatile torpedoes as well as increased performance gain in detection, targeting, tracking\/trailing, and homing via target acquisition and covert prosecution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.442"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of a non-traditional tracking system for deployment on undersea vehicles. \n- Continued testing of a non-traditional tracking system. \n- Continued development of alternative active optical sources and sensor devices for Non-Acoustic ASW systems. \n- Continued an effort to extend the technology base for blue laser sources for Undersea Warfare applications including underwater communications. \n- Continued an effort to extend the technology base for high performance electro-optic detectors and filters suitable for Undersea Warfare applications including underwater communications. \n- Continued an effort to develop consistent and comprehensive modeling and simulation tools for photonic Undersea Warfare and underwater communications components and systems. \n- Continued an effort to develop optical signal processing and hybrid computing technology appropriate for Undersea Warfare and underwater communications systems. \n- Continued development of ASW sensor technologies capable of being deployed by a gun or missile launcher\n- Initiated development of non-traditional tracking methods and systems for deployment on air vehicles. \n- Initiated development of low-cost, platform based sensor networks. \n- Initiated development of quantum sensor technologies for Magnetic Anomaly Detector (MAD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ANTI-SUBMARINE WARFARE (ASW) SURVEILLANCE"
                                    },
                                    "Description": {
                                        "val": "ASW Surveillance focuses on dramatically improving detection, classification, and localization capabilities in large ocean areas relative to the capabilities of legacy ASW surveillance systems. The related technologies support the conduct of covert, wide-area surveillance ranging from one day to six months. The objectives are to develop and demonstrate technologies that provide clandestine indications and warnings in far forward and contested operating areas, and in complex operational environments against all submarine threats, including new threats with unknown target signatures and tactics. Covertness implies use of non-observable platforms and\/or deployed automated sensors employing passive sonar, or other non-detectable methods. The surveillance process includes initial detection and classification. Efforts include the development of Unmanned Undersea Vehicle-based and affordable, off-board deployable sensing systems employing a wide variety of surveillance concepts and components. These efforts focus on alternative detection phenomena, vector\/tensor sensors, automated acoustic processing, more compact and longer lasting power sources, and high bandwidth, acoustic communications links.\n\nFY 2014 to FY 2015 decrease is due to the INP LD UUV moving from the 6.2 portion of applied research to the 6.3 applied development portion of the program in PE 0603747N and completion of the ATLAS Imaging Sonar and the Modular Undersea Heavyweight Vehicle (MUHV) efforts.  \n\nFY 2015 to FY 2016 increase is due to the development of technology for integration of large UUVs on Navy platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "67.341"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development an AUV-deployable bottom surveillance array networked by low complexity acoustic modems. \n- Continued development of tools which can be used to assess and exploit acoustic communications emissions. \n- Continued development of velocity sensitive processors for passive discrimination of quiet targets. \n- Continued development of Non-Acoustic, Underwater Communications. \n- Continued development of Advanced Imaging Methods (AIM) to provide expanded spatial, temporal and spectral imaging options. \n- Continued an effort to research improved seawater electrodes for Underwater Electric Potential (UEP) sensing in ASW applications. \n- Continued research, the goal of which is to form underwater magnetic sensors into a virtual gradiometric array via non-cabled communications. \n- Continued development of an acoustic\/magnetic hybrid sensor. \n- Continued development of low cost, compact, combined acoustic sensor. \n- Continued electroactive polymer smart sensor development. \n- Continued research to improve detection of quiet, diesel-electric submarines using passive sonar arrays in deep ocean environments. \n- Continued research to predict performance of automated passive sonar detection and classification algorithms in shallow and deep ocean environments. \n- Continued biomimetic and nano sensor development. \n- Continued 'hockey puck' transducer\/amplifier module development. \n- Continued broadband, directional, high power array development. \n- Continued development of a long endurance, air independent energy source for Large UUVs. \n- Continued development of Autonomy for operation of UUV in the littorals. \n- Continued development of core UUV technologies to extend the reliability and endurance of UUV operating in the littorals. \n- Continued at sea testing of prototype LD-UUV technologies. \n- Continued Consortium for Robotics and Unmanned Systems Research (CRUSER) in support of the LD UUV program. \n- Continued effort to develop and test waveguide invariant-based methods of depth-classification for quiet submerged targets in littorals. \n- Completed effort to identify chemical and\/or biological signatures that can be exploited to develop underwater non-acoustic sensors for MCM or ASW. \n- Completed effort to develop a statistical reverberation model that reduces false targets caused by rocky outcrops on the ocean floor to improve torpedo performance. \n- Initiated Modular Undersea Heavyweight Vehicle (MUHV) efforts.\n- Initiated the development of advanced data exfiltration methods and systems. \n- Initiated the development of advanced sensor data triage methods and systems. \n- Initiated the development of highly sparse aperature sensing methods and systems. \n- Initiated the development of dynamic energy distribution network methods and systems. \n- Initiated effort to develop ultra-low power, high sensitivity, miniature, optically pumped scalar magnetometers for undersea surveillance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "53.631"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above. \n- Complete effort to develop and test waveguide invariant-based methods of depth-classification for quiet submerged targets in littorals. \n- Complete development of tools which can be used to assess and exploit acoustic communications emissions. \n- Complete development of velocity sensitive processors for passive discrimination of quiet targets. \n- Initiate development of long endurance air independent energy source for \"SMALL\" UUV's and forward deployed sensor nodes. \n- Initiate development of next generation (non-Penetrating) Power and communications technologies for underwater operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "83.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "83.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as complete above.\n- Complete development an AUV-deployable bottom surveillance array networked by low complexity acoustic modems. \n- Complete development of next generation (non-Penetrating) Power and communications technologies for underwater operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE MAMMALS"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to support: (1) marine mammal research related to understanding impacts of underwater sound (especially sonar) on marine mammal behavior, hearing, physiology, distributions and ecology; (2) development and testing of new technologies for the detection of marine mammals at sea; (3) research on the bio-acoustic properties, use of sound for detection of, and effects of sound on fish and lesser marine organisms; and (4) research on optically important biota in the coastal ocean in support of Naval Mine, Undersea, and Special Warfare (including oceanic bioluminescence and the development and testing of bioluminescence sensors).\n\nThe marine mammals research conducted in this Program Element (PE) represents part of a total effort executed in coordination with complementary research performed in PE 0602435N.\n\nThe emphasis of efforts within PE 0602747N Marine Mammals Activity focuses on the effects on the behavior of marine mammals of manmade sound transmitted underwater which includes Integrated Ecosystem Research, Controlled Exposure Experiments (free-ranging US waters), Marine Mammal Hearing, and part of the Monitoring & Detection thrust (Autonomous platform development; gliders, profilers, etc.), Population-level Consequences of Acoustic Disturbance, effects of chronic stress (captive\/modeling studies), and risk assessment modeling.\n\nThis Activity has been created specifically to address the work associated with determining and mitigating the effects on the behavior of marine mammals of manmade sound transmitted underwater.\n\nFunding decreases from FY 2014 to FY 2015 due to completion of studies to examine sensitivity of fish to anthropogenic sound and completion of bioluminescence studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.792"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued multi-investigator, coordinated field research to test responses of marine mammals (especially beaked whales) to controlled sound exposures. \n- Continued development of new technologies for detection and localization of marine mammals, including (but not restricted to) gliders equipped with passive acoustic sensors, radar and thermal imagery. \n- Continued research examining hearing sensitivity of marine mammals (including temporary and permanent threshold shifts). \n- Continued research efforts examining distributions and abundances of marine mammals relative to prey fields and basic oceanographic parameters. \n- Continued development of and evaluate models that predict time- and space-dependent sound fields produced by anthropogenic noise sources and mammal responses to the noise. \n- Continued development and testing of multi-frequency acoustic technologies for detection, identification and enumeration of fish. \n- Continued research on effects of chronic physiological stress related to acoustic exposure of marine mammals in the wild. \n- Continued research on the population level consequences of acoustic disturbance to marine mammals.\n- Completed research to examine sensitivity of fish to anthropogenic sound. \n- Completed research leading to better predictability of bioluminescent and pigment-bearing planktonic organisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.482"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015.\n- Complete development and testing of multi-frequency acoustic technologies for detection, identification and enumeration of fish."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UNDERSEA WEAPONRY"
                                    },
                                    "Description": {
                                        "val": "Undersea Weaponry focuses on the development of enabling technologies to counter threat submarines and surface vessels by increasing Probability of Kill and platform survivability. Weapon technology focus areas include: Explosives and Warheads, Guidance and Control (G&C), Simulation Based Design, Propulsion, Power Sources, Supercavitation, and Counter Weapons\/Counter Measures. The ultimate goal of this activity is to provide revolutionary capabilities needed to fill Sea Shield and Sea Strike Warfighter Capability Gaps, to accommodate unique payload limitations through the development of modular and reduced sized undersea weapons based on common technology enablers (where possible), to provide improved platform pre-engagement positioning and fire-control solutions for effective weapon-to-target engagement, and provide countermeasures and counterweapons against current and next-generation undersea weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.175"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued limited collection and evaluation of small supercavitating vehicle. \n- Continued concept designs for advanced warheads. \n- Continued design\/formulation and early-stage testing of propulsion system components for advanced undersea platforms. \n- Continued development and testing of technologies for rapid reaction defense against undersea threats.\n- Completed CONOPs and tactical-level analysis and employment for advanced undersea weapons.\n- Completed studies, field-test planning and hardware development for Anti-Surface Warfare Weapon Upgrade Program. (Transfers to Future Naval Capability Program in FY14)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.923"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.923"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall metrics of applied research in undersea warfare are to develop technologies aimed at improving target detection, classification, localization, tracking, increasing attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments, countering enemy torpedoes, providing the ability to conduct long-range engagements, increasing weapons load-out, providing multi-platform connectivity, increasing endurance\/survivability, and reducing size and power requirements."
                        }
                    }
                }
            ]
        }
    }
}