{
    "id": "d62f40e64ec90b497fb1fd263a2171c74b8ab620",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605601A"
        },
        "ProgramElementTitle": {
            "val": "Army Test Ranges and Facilities"
        },
        "R1LineNumber": {
            "val": "138"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "335.270"
            },
            "CurrentYear": {
                "val": "274.980"
            },
            "BudgetYearOne": {
                "val": "277.646"
            },
            "BudgetYearOneBase": {
                "val": "277.646"
            },
            "BudgetYearTwo": {
                "val": "258.464"
            },
            "BudgetYearThree": {
                "val": "257.963"
            },
            "BudgetYearFour": {
                "val": "267.441"
            },
            "BudgetYearFive": {
                "val": "272.691"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016 OSD Resource Management Decision (RMD) fund restoration."
        },
        "ProgramElementMissionDescription": {
            "val": "This project provides the institutional funding required to operate test activities, in accordance with Section 232 of the FY2003 National Defense Authorization Act (NDAA FY03), required by Department of Defense (DOD) Program Executive Officers, Program and Product Managers, and Research, Development, and Engineering Centers.  Resources provided by this project operate seven elements of the DOD Major Range and Test Facility Base (MRTFB):  White Sands Test Center (WSTC),White Sands Missile Range, New Mexico; High Energy Laser System Test Facility (HELSTF), White Sands Test Center, White Sands Missile Range, New Mexico; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; and Yuma Test Center (YTC), Yuma Proving Ground, Arizona, Cold Regions Test Center (CRTC) Fort Greely, Alaska and Tropic Regions Test Center (TRTC) at various locations. This project also funds the Army's test capability at Redstone Test Center (RTC), Redstone Arsenal, Alabama. \n\nThis project finances the overhead (institutional) test operating costs not billable to DOD test customers per NDAA FY03, which include recurring test infrastructure\/capability sustainment requirements, replacement of test equipment, test operating procedures, and test revitalization\/upgrade projects to maintain current testing capabilities and improvements to safety, environmental protection, efficiency of test operations, and technological advances. The test capabilities at these ranges have been uniquely established, are in place to support test and evaluation (T&E) requirements of funded weapons programs, and are required to assure technical performance, adherence to safety requirements, reliability, logistics supportability, Title 10 Live Fire Test and Evaluation, transportability, environmental effects, electromagnetic effects, and quality of materiel in development and in production.\n\nThis project sustains the T&E capability required to support Army as well as Joint Service or Other Service systems, materiel, and technologies. Types of systems scheduled for testing include: Aircraft, Air Delivery, Unmanned Aerial Systems, Unmanned Ground Vehicles, Air and Missile Defense Systems, Engineering Equipment, Direct fire, Indirect fire, Nonlethal weapons, Ammunition, Automotive Systems, Intelligence Surveillance and Reconnaissance, Ground Soldier System, Missiles, Rockets, Mission Command Network, and Tactical Command, Control, and Communication.\n\nSpecific systems supported in FY15 with continued support in FY16 include: Network Integration Evaluations (NIE), Joint Light Tactical Vehicle (JLTV), Stryker Engineering Change Proposals (ECPs), Guided Multiple Launch Rocket System (GMLRS), M270A1 Improved Armor Cab, Rifleman Radio, Joint Assault Bridge, Warfighter Information Network Tactical (WIN-T Inc 2), AN\/TPQ53 Radar, Counter Rocket Artillery and Mortar System (CRAM), Distributed Common Ground System - Army (DCGS-A), Aviation Transformation (AH-64E), missile defense (PAC-3), Army Integrated Air and Missile Defense (AIAMD), Nett Warrior, XM25 Counter Defilade Target Engagement (CDTE), Shadow Tactical Unmanned Aerial Systems, Gray Eagle, Joint Tactical Radio System (JTRS), Soldier Radio Waveform Applique, and Soldier Protective System M829E4 120MM Advanced Kinetic Energy.\n\nDirect costs are borne by materiel developers in accordance with DoD Directive 3200.11 and DOD Financial Management Regulation 7000.14R."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "340.477"
                },
                "CurrentYear": {
                    "val": "275.025"
                },
                "BudgetYearOne": {
                    "val": "269.802"
                },
                "BudgetYearOneBase": {
                    "val": "269.802"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "335.270"
                },
                "CurrentYear": {
                    "val": "274.980"
                },
                "BudgetYearOne": {
                    "val": "277.646"
                },
                "BudgetYearOneBase": {
                    "val": "277.646"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.207"
                },
                "CurrentYear": {
                    "val": "-0.045"
                },
                "BudgetYearOne": {
                    "val": "7.844"
                },
                "BudgetYearOneBase": {
                    "val": "7.844"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.045"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.207"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.844"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.844"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "F30"
                    },
                    "ProjectTitle": {
                        "val": "Army Test Ranges & Facilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "335.270"
                        },
                        "CurrentYear": {
                            "val": "274.980"
                        },
                        "BudgetYearOne": {
                            "val": "277.646"
                        },
                        "BudgetYearOneBase": {
                            "val": "277.646"
                        },
                        "BudgetYearTwo": {
                            "val": "258.464"
                        },
                        "BudgetYearThree": {
                            "val": "257.963"
                        },
                        "BudgetYearFour": {
                            "val": "267.441"
                        },
                        "BudgetYearFive": {
                            "val": "272.691"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Note applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides the institutional funding required to operate test activities, in accordance with Section 232 of the FY2003 National Defense Authorization Act (NDAA FY03), required by Department of Defense (DOD) Program Executive Officers, Program and Product Managers, and Research, Development, and Engineering Centers.  Resources provided by this project operate seven elements of the DOD Major Range and Test Facility Base (MRTFB):  White Sands Test Center (WSTC),White Sands Missile Range, New Mexico; High Energy Laser System Test Facility (HELSTF), White Sands Test Center, White Sands Missile Range, New Mexico; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; and Yuma Test Center (YTC), Yuma Proving Ground, Arizona, Cold Regions Test Center (CRTC) Fort Greely, Alaska and Tropic Regions Test Center (TRTC) at various locations. This project also funds the Army's test capability at Redstone Test Center (RTC), Redstone Arsenal, Alabama. \n\nThis project finances the overhead (institutional) test operating costs not billable to DOD test customers per NDAA FY03, which include recurring test infrastructure\/capability sustainment requirements, replacement of test equipment, test operating procedures, and test revitalization\/upgrade projects to maintain current testing capabilities and improvements to safety, environmental protection, efficiency of test operations, and technological advances. The test capabilities at these ranges have been uniquely established, are in place to support test and evaluation (T&E) requirements of funded weapons programs, and are required to assure technical performance, adherence to safety requirements, reliability, logistics supportability, Title 10 Live Fire Test and Evaluation, transportability, environmental effects, electromagnetic effects, and quality of materiel in development and in production.\n\nThis project sustains the T&E capability required to support Army as well as Joint Service or Other Service systems, materiel, and technologies. Types of systems scheduled for testing include: Aircraft, Air Delivery, Unmanned Aerial Systems, Unmanned Ground Vehicles, Air and Missile Defense Systems, Engineering Equipment, Direct fire, Indirect fire, Nonlethal weapons, Ammunition, Automotive Systems, Intelligence Surveillance and Reconnaissance, Ground Soldier System, Missiles, Rockets, Mission Command Network, and Tactical Command, Control, and Communication.\n\nSpecific systems supported in FY15 with continued support in FY16 include: Network Integration Evaluations (NIE), Joint Light Tactical Vehicle (JLTV), Stryker Engineering Change Proposals (ECPs), Guided Multiple Launch Rocket System (GMLRS), M270A1 Improved Armor Cab, Rifleman Radio, Joint Assault Bridge, Warfighter Information Network Tactical (WIN-T Inc 2), AN\/TPQ53 Radar, Counter Rocket Artillery and Mortar System (CRAM), Distributed Common Ground System - Army (DCGS-A), Aviation Transformation (AH-64E), missile defense (PAC-3), Army Integrated Air and Missile Defense (AIAMD), Nett Warrior, XM25 Counter Defilade Target Engagement (CDTE), Shadow Tactical Unmanned Aerial Systems, Gray Eagle, Joint Tactical Radio System (JTRS), Soldier Radio Waveform Applique, and Soldier Protective System M829E4 120MM Advanced Kinetic Energy.\n\nDirect costs are borne by materiel developers in accordance with DoD Directive 3200.11 and DOD Financial Management Regulation 7000.14R."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Support"
                                    },
                                    "Description": {
                                        "val": "Funds support test equipment upgrades and maintenance; test facility maintenance; routine calibration; handling and disposal of hazardous materials, transportation, postage, administrative supplies; tools; software; spare parts; test support vehicle maintenance; mission unique installation costs; temporary duty\/training of civilian and contractor personnel; printing and reproduction; communications; land leases; and range road maintenance.  Funding supports indirect cost previously paid by the customer for which funding was realigned, as approved by Assistant Secretary of the Army for Acquisition, Logistics and Technology and validated by Deputy Assistant Secretary of the Army for Cost and Economics, from the Army PEO\/PMs and non-Army DOD customers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "129.433"
                                            },
                                            "Text": {
                                                "val": "Funds supported test equipment upgrades and maintenance; test facility maintenance; routine calibration; handling and disposal of hazardous materials, transportation, postage, administrative supplies; tools; software; spare parts; test support vehicle maintenance; mission unique installation costs; temporary duty\/training of civilian and contractor personnel; printing and reproduction; communications; land leases; and range road maintenance.  Funding supported indirect cost previously paid by the customer for which funding was realigned, as approved by Assistant Secretary of the Army for Acquisition, Logistics and Technology and validated by Deputy Assistant Secretary of the Army for Cost and Economics, from the Army PEO\/PMs and non-Army DOD customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "111.691"
                                            },
                                            "Text": {
                                                "val": "Funds support test equipment upgrades and maintenance; test facility maintenance; routine calibration; handling and disposal of hazardous materials, transportation, postage, administrative supplies; tools; software; spare parts; test support vehicle maintenance; mission unique installation costs; temporary duty\/training of civilian and contractor personnel; printing and reproduction; communications; land leases; and range road maintenance.  Funds support indirect cost previously paid by the customer for which funding was realigned, as approved by Assistant Secretary of the Army for Acquisition, Logistics and Technology and validated by Deputy Assistant Secretary of the Army for Cost and Economics, from the Army PEO\/PMs and non-Army DOD customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "107.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "107.215"
                                            },
                                            "Text": {
                                                "val": "Funds will support test equipment upgrades and maintenance; test facility maintenance; routine calibration; handling and disposal of hazardous materials, transportation, postage, administrative supplies; tools; software; spare parts; test support vehicle maintenance; mission unique installation costs; temporary duty\/training of civilian and contractor personnel; printing and reproduction; communications; land leases; and range road maintenance.  Funding will support indirect cost previously paid by the customer for which funding was realigned, as approved by Assistant Secretary of the Army for Acquisition, Logistics and Technology and validated by Deputy Assistant Secretary of the Army for Cost and Economics, from the Army PEO\/PMs and non-Army DOD customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "T&E Civilian Pay"
                                    },
                                    "Description": {
                                        "val": "This funding supports the overhead costs of the civilian labor for Program Budget Guidance (PBG) authorizations.  The balance is customer funded. The test customer pays all direct costs that are directly attributable to the use of a test facility or resource for testing of a particular program.  Funding is essential to maintain core T&E skills as part of the Government civilian workforce."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "117.006"
                                            },
                                            "Text": {
                                                "val": "Funds supported the overhead costs of the civilian labor for Program Budget Guidance (PBG) authorizations.  The balance is customer funded. The test customer pays all direct costs directly attributable to the use of a test facility or resource for testing of a particular program.  Funding is essential to maintain core T&E skills as part of the Government civilian workforce."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "112.365"
                                            },
                                            "Text": {
                                                "val": "Funds support the overhead costs of the civilian labor for Program Budget Guidance (PBG) authorizations.  The balance will be customer funded. The test customers pay all direct costs directly attributable to the use of a test facility or resource for testing of a particular program.  Funding will be essential to maintain core T&E skills as part of the Government civilian workforce."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "113.488"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "113.488"
                                            },
                                            "Text": {
                                                "val": "Funds will support the overhead costs of the civilian labor for Program Budget Guidance (PBG) authorizations.  The balance will be customer funded. The test customer will pay all direct costs directly attributable to the use of a test facility or resource for testing of a particular program.  Funding will be essential to maintain core T&E skills as part of the Government civilian workforce."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Support"
                                    },
                                    "Description": {
                                        "val": "This funding supports contractor labor costs not billable to the customer.  Contract labor is essential to augment core civilian T&E personnel.  Functions performed include range operations, automotive test support, radar maintenance, warehousing support, project management, maintenance of support fleet aircraft, recurring\/general maintenance to test facilities and data acquisition support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.511"
                                            },
                                            "Text": {
                                                "val": "Funds supported contractor labor costs not billable to the customer.  Contract labor is essential to augment core civilian T&E personnel.  Functions performed included range operations, automotive test support, radar maintenance, warehousing support, project management, maintenance of support fleet aircraft, recurring\/general maintenance to test facilities and data acquisition support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.924"
                                            },
                                            "Text": {
                                                "val": "Funds support contractor labor costs not billable to the customer.  Contract labor will be essential to augment core civilian T&E personnel.  Functions performed include range operations, automotive test support, radar maintenance, warehousing support, project management, maintenance of support fleet aircraft, recurring\/general maintenance to test facilities and data acquisition support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.943"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.943"
                                            },
                                            "Text": {
                                                "val": "Funds will support contractor labor costs not billable to the customer.  Contract labor will be essential to augment core civilian T&E personnel.  Functions performed will include range operations, automotive test support, radar maintenance, warehousing support, project management, maintenance of support fleet aircraft, recurring\/general maintenance to test facilities and data acquisition support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Revitalization\/Upgrade"
                                    },
                                    "Description": {
                                        "val": "Funds support the revitalization\/upgrade of test infrastructure and capabilities. MRTFB elements are required to use institutional funding to sustain, upgrade or create capabilities that support multiple customers.  Funding will be focused on improving test and evaluation capabilities for the highest priority Army programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.320"
                                            },
                                            "Text": {
                                                "val": "Funds supported the revitalization\/upgrade of test infrastructure and capabilities. MRTFB elements will be required to use institutional funding to sustain, upgrade or create capabilities that support multiple customers.  Funds focused on improving test and evaluation capabilities for the highest priority Army programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Funds will support the revitalization\/upgrade of test infrastructure and capabilities. MRTFB elements will be required to use institutional funding to sustain, upgrade or create capabilities that support multiple customers.  Funding will be focused on improving test and evaluation capabilities for the highest priority Army programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}