{
    "id": "da56c5e4e220acbfe2db333e8492bc2f2aa99753",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603794A"
        },
        "ProgramElementTitle": {
            "val": "C3 Advanced Technology"
        },
        "R1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "37.816"
            },
            "BudgetYearOneBase": {
                "val": "37.816"
            },
            "BudgetYearTwo": {
                "val": "38.775"
            },
            "BudgetYearThree": {
                "val": "40.630"
            },
            "BudgetYearFour": {
                "val": "43.120"
            },
            "BudgetYearFive": {
                "val": "43.975"
            }
        },
        "ProgramElementNote": {
            "val": "Efforts in this PE were transferred from PE 0603008A beginning in FY16 for the purposes of correctly identifying the efforts as Command, Control and Communications Advanced Technology.  Project EL4 efforts were transferred from PE 0603008A Project TR1 and Project EL5 efforts were transferred from PE 0603008A Project TR2."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates technologies to address the seamless integrated tactical communications challenge with distributed, secure, mobile, wireless, and self-organizing communications networks and networked transceivers that will operate reliably in diverse and complex terrains, in all environments. Efforts demonstrate seamlessly integrated communications and information security technologies across all network tiers, ranging from unattended networks and sensors through maneuver elements using airborne and space assets. Project EL4 investigates and leverages antennas; wireless networking devices, protocols, and software;  network operations tools and techniques; and combines these and other technology options in a series of command, control, communications, and computers, intelligence, surveillance, and reconnaissance (C4ISR) on-the-move (OTM) network modernization demonstrations to measure their potential battlefield effectiveness. Project EL5 researches information security devices, techniques, services, software and algorithms to protect tactical wired and wireless networks against modern network attacks; generate and distribute tactical cyber situational awareness; and focuses on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.\n\nWork in this PE is complimentary of PE 0602782A (Command, Control, Communications Technology), and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), PE0603270A (Electronic Warfare Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "37.816"
                },
                "BudgetYearOneBase": {
                    "val": "37.816"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "37.816"
                },
                "BudgetYearOneBase": {
                    "val": "37.816"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "37.816"
                                },
                                "BudgetYearOneBase": {
                                    "val": "37.816"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EL4"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Comms and Networking Technology Int"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "23.229"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.229"
                        },
                        "BudgetYearTwo": {
                            "val": "22.769"
                        },
                        "BudgetYearThree": {
                            "val": "24.572"
                        },
                        "BudgetYearFour": {
                            "val": "24.405"
                        },
                        "BudgetYearFive": {
                            "val": "24.890"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Efforts in this project were transferred from PE 0603008A Project TR1 beginning in FY16."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates key communications and mobile networking technologies, such as antennas, transceivers, transceiver components, networking software and novel techniques to provide secure, reliable, mobile network solutions that function in complex and diverse terrains. This project concentrates on four major goals: to provide a series of technology demonstrations of new and emerging command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) technology enabled capabilities to significantly reduce risk associated with the network-of-networks concept; to lower the size, weight power and cost of wireless networking systems deployed on Army platforms through hardware and software convergence; to provide critical improvements in the ability to communicate and move large amounts of information in radio frequency (RF) contested environments, in a seamless, integrated manner across the Army's highly mobile manned and unmanned force structure; and to assess the technology readiness level (TRL) of emerging network technologies in an operationally relevant environment. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Air and Soldier\/Squad portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna and Hardware Technologies (Formerly named Antenna Technologies)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low cost, power efficient, communications and electronic warfare (EW) antenna technologies for terrestrial and tactical satellite ground terminals. The focus is to reduce the visual signature and cost of antennas and reduce the number of antennas required on platforms by proving the capability to transmit and receive on multiple frequency bands, such as X\/K\/KA\/Q for satellite communication (SATCOM) and ultra-high frequency\/very-high frequency (UHF\/VHF) and L Band for terrestrial communications on the same antennas. This effort also develops small form factor interference mitigation hardware for compatibility between communications and electronic warfare (EW) systems.  Work accomplished under PE 0602782A\/project H92 compliments this effort. This effort transferred from PE 0603008A Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.350"
                                            },
                                            "Text": {
                                                "val": "Will perform extensive assessments and demonstrate distributed on-the-move SATCOM antenna arrays, using both live vehicles traversing test tracks and a sophisticated motion table that emulates the test track motions and other worst case scenarios; finalize a Government standard architecture for distributed SATCOM arrays to enable interoperability between various transceivers and antenna arrays; develop and mature small form factor RF interference mitigation hardware for compatibility between EW and communications systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Interoperability Through Convergence"
                                    },
                                    "Description": {
                                        "val": "This effort designs transceiver hardware and software standards and proof of concept that will reduce size, weight, power and cost of multiple communications and EW systems on tactical platforms.  The standard and proof of concept demonstration takes advantage of common components within the communications and EW systems to define the internal and external interfaces to communications and EW devices. The effort includes implementing and publishing a reference architecture and associated specifications for a modular, open systems approach for integrating military communications and EW devices. Work being accomplished under PE 603270A\/project K16 compliments this effort. This effort transferred from PE 0603008A Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will complete the maturation of the radio reference architecture, specification and application program interfaces sufficient to begin detailed design discussions about radio component design and configurations with potential commercial suppliers as well as Military platform developers for integration into their vehicles; continue to expand the reference architecture to include EW systems, and codify in the form of electronics chassis, backplane, wiring, power, mounting, RF, control and topology specification (the A-kit); provide a more realistic demonstration, moving from a lab table-top environment to a demonstrator vehicle mock-up, possibly using an actual vehicle, and with an expanded demonstration of the radio modules,  antennas, filters, switches and radio components (the B-kit)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR On-The-Move (OTM)"
                                    },
                                    "Description": {
                                        "val": "This effort provides a venue for the demonstration of new and emerging C4ISR technologies. This venue performs risk mitigation and technology assessments by evaluating the Technology Readiness Levels (TRLs) of candidate Army science and technology (S&T) and best of Industry efforts to support tactical network modernization. This effort transferred from PE 0603008A Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.846"
                                            },
                                            "Text": {
                                                "val": "Will assess and demonstrate early Operation-Intelligence network convergence concepts in a real field environment using a mix of S&T, Programs Of Record (PORs) and industry offerings to provide early performance feedback to S&T and PORs that rely upon robust tactical networks; apply field based risk reduction techniques to the integration of new S&T technologies as well as adapting\/adopting the best industry products to provide rigorously evaluated demonstrator systems for Soldier assessment; assess new S&T systems and provide data to determine the appropriate TRL to inform PORs preparing to transition these technologies to assure leadership has the right information to make critical acquisition decisions and provide technical risk reduction to assure that any issues are identified early enough to be corrected before formal testing; evaluate both Mission Command and Actionable Intelligence S&T products from a performance perspective and validate their TRLs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication Networking Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and services that enable Army tactical wireless networks to operate more efficiently in both the use of RF spectrum and network resources for terrestrial and Satellite Communication (SATCOM) systems. This effort matures and demonstrates software to improve performance of wireless tactical networks in austere and hostile RF spectrum environments by composing and coding algorithms and protocols that sense network and spectrum conditions, to automatically adapt network node behaviors to make more efficient use of available resources. Efforts target improving RF communications performance in complex terrain, enabling communications while simultaneously operating electronic protection devices. Efforts also include adapting commercial wireless technology for use in the tactical environment. Work accomplished under PE 0602782A\/project H92 and 0603794A EL5 compliments this effort. This effort transferred from PE 0603008A Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.033"
                                            },
                                            "Text": {
                                                "val": "Will investigate and mature tactical waveform protocols and architectures to support frequency hopping at timeslot boundaries using parameters chosen by the waveform software to improve radio network performance in a dynamic spectrum contested environment;  continue to mature tactical multifunction waveform software, algorithms and techniques to optimize coordinated signal scheduling features that allow improved interoperability between RF functions such as communications and EW jamming; continue to mature and begin implementation of suitable routing protocols to increase performance of the network and develop and mature feasible approaches to enable networking in Global Positioning System-denied environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking technologies for Wireless Personal Area Networks (WPAN)"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures wireless personal area network (WPAN) technology for the Soldier in a manner approved by the National Security Agency (NSA) for up to Secret data traffic. This effort is coordinated with PE 0603001A\/Project J50. This effort transferred from PE 0603008A Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will complete evaluations of WPAN system designs for performance, reliability and security; finalize specification and architecture development of WPAN hardware interfaces and software; iform WPAN standards for security and interface development; fabricate and code several candidate WPAN designs; validate WPAN designs for electromagnetic compatibility, low probability of intercept and low probability of detection in the laboratory and RF chamber; conduct field evaluations of selected design(s) on multiple Soldier Systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL5"
                    },
                    "ProjectTitle": {
                        "val": "Secure Tactical Information Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.587"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.587"
                        },
                        "BudgetYearTwo": {
                            "val": "16.006"
                        },
                        "BudgetYearThree": {
                            "val": "16.058"
                        },
                        "BudgetYearFour": {
                            "val": "18.715"
                        },
                        "BudgetYearFive": {
                            "val": "19.085"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Efforts in this project were transferred from PE 0603008A Project TR2 beginning in FY16."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software, algorithms and services that focus on tactical cyber situational awareness, autonomous network defense, cross domain security and encryption solutions to secure the Army's tactical network.  Efforts focus on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.  This project codes, optimizes, and demonstrates software based technologies for intrusion detection, high assurance internet protocol (IP) encryption, seamless communications across security boundaries, as well as information sharing across operations and intelligence functions.  These capabilities to automate, protect, monitor, report and access cyber elements of the tactical network are intended to greatly reduce Soldier burden and protect the Army's tactical network by building upon enterprise solutions from commercial, Department of Defense, Department of the Army and other government agencies.  This project cumulatively builds science and technology capabilities in accordance with Army Cyber Material Development Strategy and the Office of the Secretary of Defense Cyber Community of Interest.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Air and Soldier\/Squad portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications Electronics Research Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Defensive Cyber"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that create new methods for proactively defending resource constrained tactical wireless networks against cyber attack using nontraditional methodologies. Work being performed under PE \/projects 0602782\/H92, 0602783\/Y10 and 0603794A\/EL4 complement this effort. This effort transferred from PE 0603008A Project TR2 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.587"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.587"
                                            },
                                            "Text": {
                                                "val": "Will integrate and mature software to provide a holistic cyber situational awareness picture offering actionable information for the Brigade network assurance team to quickly and accurately assess the cyber battle space, detect\/defend against known cyber weapons being employed against U.S. military assets, and enable network adaptation to ensure commander intent can be exercised in theater; design, fabricate, code and mature a reprogrammable logic single chip cryptographic engine which includes anti-tamper and security boundary technology (both information security functions and crypto engine) and complies with the National Security Agency Crypto Modernization Initiative and the Key Management Infrastructure Program of Record; assess, develop and mature novel network attack\/defense behavior models for tactical radio routing; mature and integrate novel tactical radio cyber behavior sensors to provide cyber situational awareness for military radio networks;  perform analysis of current satellite communications (SATCOM) systems to determine the optimal integration path to achieve protected SATCOM architectures that will support protection methods aimed at hardening the modulation methods, software coding and component redundancy used in SATCOM systems; mature and optimize precision polarization concepts to optimize communications system security by employing multiple communications paths and bandwidth expansion techniques; perform modeling, simulation and emulation of network systems to assess performance in contested environments; design and develop\nsecurity for network protocols."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}