{
    "id": "db39f1c1168fba1d03010d8ba845dee34dc7d6b6",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.546"
            },
            "CurrentYear": {
                "val": "24.257"
            },
            "BudgetYearOne": {
                "val": "27.520"
            },
            "BudgetYearOneBase": {
                "val": "27.520"
            },
            "BudgetYearTwo": {
                "val": "27.686"
            },
            "BudgetYearThree": {
                "val": "24.906"
            },
            "BudgetYearFour": {
                "val": "25.199"
            },
            "BudgetYearFive": {
                "val": "25.701"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps.  Efforts include: hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the U.S. Department of Energy to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; experimentation and red teaming of rapidly deployable technologies that enable troops at small, remote bases or integrated within local communities to detect, assess, and defend against a range of enemy threats; and  red-teaming to stress and assess emerging systems earlier in the life-cycle, providing a more holistic understanding of employment risks in operationally-representative environments and against potential threats.\n\nThis Program Element supports the Command, Control, Communications and Intelligence (C3I), Ground, and Innovation Enablers Portfolios.\n\nWork in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603270A (Electronic Warfare Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Program Element is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center (ERDC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.046"
                },
                "CurrentYear": {
                    "val": "24.270"
                },
                "BudgetYearOne": {
                    "val": "27.722"
                },
                "BudgetYearOneBase": {
                    "val": "27.722"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.546"
                },
                "CurrentYear": {
                    "val": "24.257"
                },
                "BudgetYearOne": {
                    "val": "27.520"
                },
                "BudgetYearOneBase": {
                    "val": "27.520"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.500"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "-0.202"
                },
                "BudgetYearOneBase": {
                    "val": "-0.202"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.013"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.500"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.202"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.202"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.546"
                        },
                        "CurrentYear": {
                            "val": "24.257"
                        },
                        "BudgetYearOne": {
                            "val": "27.520"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.520"
                        },
                        "BudgetYearTwo": {
                            "val": "27.686"
                        },
                        "BudgetYearThree": {
                            "val": "24.906"
                        },
                        "BudgetYearFour": {
                            "val": "25.199"
                        },
                        "BudgetYearFive": {
                            "val": "25.701"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps.  Efforts include: hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the U.S. Department of Energy to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; experimentation and red teaming of rapidly deployable technologies that enable troops at small, remote bases or integrated within local communities to detect, assess, and defend against a range of enemy threats; and red-teaming to stress and assess emerging systems earlier in the life-cycle, providing a more holistic understanding of employment risks in operationally-representative environments and against potential threats.\n\nThis project supports the Command, Control, Communications and Intelligence (C3I), Ground, and Innovation Enablers Portfolios.\n\nWork in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603270A (Electronic Warfare Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Intelligent Power (HI Power)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates intelligent power management hardware and software to reduce the use of fossil fuel in tactical generators while increasing energy security. The intelligent power management technologies are plug-and-play to enable faster power grid setup times and to eliminate human error as well as to reduce soldier planning burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.828"
                                            },
                                            "Text": {
                                                "val": "Continued to define and demonstrate standards and protocols for tactical microgrids; developed a universal device controller able to monitor and manage power sources and loads; continued to advance technologies that enable the use of renewable power sources and energy storage systems for storing any excess grid power; demonstrated a grid power manager that can utilize all power assets on the battlefield to insure optimum power utilization based on mission requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapidly Deployable Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts live, virtual, and mixed-scenario experiments to stress and assess emerging technology systems that are targeted to support troops operating in forward areas, improving technology design, development, and ultimate employment. These technologies must be readily transportable; require minimal set up, take down, and operational effort; and easily adaptable across a variety of missions, environments, and threats. This effort is coordinated with PE 0602784A, PE 0602786A, and PE 0603734A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.887"
                                            },
                                            "Text": {
                                                "val": "Analyzed and selected emerging threats that expeditionary units operating at remote bases or integrated with local communities may face in the future.  Developed and conducted a set of five experiments using live, virtual, and mixed scenarios in representative operational environments to stress deployable force protection developing technologies; integrated and assessed over 20 technology systems in experiments at Camp Roberts, CA, Stennis, MS, Marine Corps Base Quantico, VA and Fort Harrison, MT.   Incorporated technologists, capability developers and Soldiers from a variety of military occupations and specialties as part of experiments and demonstrations; added interagency operators into Warfighter-executed scenarios; integrated and assessed  Army S&T products from logistics basing and other force protection basing development efforts.  Introduced PACOM scenarios into experiments, adding to CENTCOM, SOUTHCOM and AFRICOM scenarios; expanded challenge events to identify potential technology and employment vulnerabilities during denial of service attacks\/conditions.  Expanded and automated the Warfighter Technology Tradespace Methodology to identify and characterize potential system employment vulnerabilities; provided feedback to developers for systems improvement and needed research areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.060"
                                            },
                                            "Text": {
                                                "val": "Increase focus on active defense measures for small expeditionary units based on critical threats associated with one or two high-priority operational environments; develop and integrate critical measures of success into the Warfighter Technology Tradespace Methodology to include assessing systems' means to adapt, as well as new measures specific to one or two select new theaters; expand quantitative protocols for field-based experiments; implement narrative-based modeling and assessment tool for Warfighter feedback on technologies to expose and eliminate barriers affecting technology acceptance and use; conduct a series of experiments using live and virtual scenarios and coordinated demonstrations to identify, expose, and mitigate system vulnerabilities; leverage ongoing activities with units such as Special Operations Teams where possible to conduct in-country assessments and garner feedback on performance of high-priority systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.060"
                                            },
                                            "Text": {
                                                "val": "Will incorporate Army G-2 and TRADOC-provided threat information, as well as the expertise of Special Forces Soldiers, to develop a series of operationally relevant experiments that stress the performance limits of emerging and fielded systems geared for small unit expeditionary forces. Will integrate PACOM, AFRICOM, SOUTHCOM and\/or CENTCOM-based scenarios into experiments and target specific environments of interest (e.g., wooded, marine, urban, contested and congested radio frequency (RF)). Will replicate relevant threat\/overmatch capabilities (e.g., commercially available computer network, RF, and electromagnetic (EM) attack methodologies) and integrate, train, and operate technology systems in increasingly complex blue\/red team scenarios. Will expand and refine quantitative measures of success for the Warfighter Technology Tradespace Methodology, and assess systems’ performance across technical, user, supportability, and adaptability factors. Will uncover technology system vulnerabilities, including risks to user acceptance, and recommend mitigation options and\/or areas for additional development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Systems Adaptive Red Teaming"
                                    },
                                    "Description": {
                                        "val": "This effort seeks to challenge conventional approaches to technology and systems development and insertion, and increase the awareness of risks and opportunities earlier in the lifecycle in order to improve system design, development and employment. It builds on the concepts and methodology developed under the Deployable Force Protection Adaptive Red Teaming effort and applies them to other high-priority areas for the Army. It designs and conducts a series of live, virtual and mixed scenarios and demonstrations to evaluate the most promising technologies. It stresses and assesses developing technology systems for both individual and system-of-system performance across a representation of operational environments, realistic scenarios and emerging threats. Activities include: identifying, integrating and examining system performance at live demonstration venues with experienced operators; emulating emerging threats and alternative futures to challenge assumptions regarding scenarios and system employment; and identifying and informing of potential vulnerabilities in systems and systems-of-systems, including but not limited to, performance degradation in congested\/contested environments, interoperability, and adaptability. This effort is coordinated with program element 0602618A, 0602270A and 0603270A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.831"
                                            },
                                            "Text": {
                                                "val": "Selected developing electronic warfare technology systems for demonstration and evaluation; analyzed and selected current and emerging operationally relevant scenarios and threats for use in system experimentation, developed a set of experiments to stress system and operator performance and identified potential user acceptance risks when employed. Incorporated Soldiers from a variety of Military Occupation Specialties to acquire user feedback; applied and expanded the Warfighter Technology Tradespace Methodology and analysis to address system-specific factors of success; and provided systems assessment to inform technology development, systems integration, training, logistics and employment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.121"
                                            },
                                            "Text": {
                                                "val": "Utilize stakeholder analysis, operational scenarios and findings from technology vulnerability assessments to identify three to four high-priority developmental systems that support Army acquisition programs within areas such as intelligence, surveillance, and reconnaissance (ISR), electronic warfare, and\/or communications. Conduct in-depth, phased assessments that incorporate near-peer threats and live experiments with Warfighters to stress the systems under different scenarios and uncover vulnerabilities pertaining to systems integration, interoperability, adaptability and technology employment. Recommend means to harden systems against vulnerabilities and reduce risks arising from operational and logistics contexts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.298"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.298"
                                            },
                                            "Text": {
                                                "val": "Will incorporate intelligence, requirements, acquisition, and science and technology community stakeholder input to identify developmental systems that support key Army acquisition programs, either current or planned. System areas of interest include: Positioning, Navigation and Timing; Weapons Systems Guidance and Control; Threat Detection\/Hostile Fire Detection; Counter-Rocket, Artillery and Mortar (C-RAM), Counter-Precision Guided Munitions (C-PGM), and\/or Counter-Unmanned Aerial Systems (C-UAS); Platform Common Architectures; Sensor Protection Technologies; Robotics and Autonomous\/Semi-Autonomous Systems; and Denial and Deception Technologies. Will design and conduct a series of in-depth, phased assessments that incorporate near-peer threats and field experiments with experienced Warfighters; will stress the systems under various, operationally-relevant scenarios and uncover potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments. Will recommend means to mitigate or reduce systems' vulnerabilities, with the goal of informing current or future acquisition programs early in the development lifecycle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Platform Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture and systems integration.  Specifically, this effort focuses on maturing and demonstrating integrated vehicle power management, generation and distribution technologies to increase ground vehicle energy efficiencies and ensure ground platforms have enough power to enable future capabilities such as electromagnetic armor, active protections systems, IED detect and defeat technologies, advanced situational awareness and future network integration technologies. This effort is coordinated with PE 0603005A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Conduct analysis of vehicle architecture and power systems. Evaluate Government and contractor developed platform architectures and conduct trades studies, analysis and interface testing to ensure common power architecture designs meet known future vehicle power requirements.  Update VICTORY architecture standards to drive next generation combat platform data and electrical architectures to enable affordable future upgrade capability for the combat fleet. Investigate advanced capability in integrated platform power management and electrical power generation and distribution while reducing parasitic thermal burdens on the vehicle system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will analyze the next generation power and data architecture and the corresponding system design’s interface with vehicle subsystems, specifically powertrain subsystems. Will demonstrate electronic control communication between powertrain system components. Will mature the engine controls architecture to optimize engine power density, fuel efficiency and heat rejection. Will finalize requirements for demonstrating a system design of the next generation power and data architecture integrated on a combat vehicle, in order to validate the open architecture and power and data capabilities required for the Combat Vehicle Prototyping program and future vehicle modernization efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced technologies that enable military ground vehicles to become significantly more energy efficient.  It collaborates with the U.S. Department of Energy to demonstrate technologies in: advanced combustion engines and transmissions; lightweight structures and materials; energy recovery and thermal management; alternative fuels and lubricants; hybrid propulsion systems; batteries and energy storage; and analytical tools (e.g., modeling and simulation). This effort is coordinated with program element 0602601A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.076"
                                            },
                                            "Text": {
                                                "val": "Support the Advanced Vehicle Power Technology Alliance (AVPTA) to mature advanced modeling tools to understand the behavior of batteries at the component, cell and module\/pack levels and aid future efforts to develop new energy storage systems; conduct reliability studies utilizing military form factor advanced chemistry batteries to drive military standards into the commercial sectors, with the intent to reduce the Army cost of advanced batteries; investigate advanced lightweight materials and demonstrate advanced manufacturing techniques to reduce platform structural weight and drive down associated costs; and leverage significant investments in commercial trucking industry to demonstrate fuel efficient and active safety technologies for Army tactical vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.162"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.162"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the Advanced Vehicle Power Technology Alliance (AVPTA) with the Department of Energy (DOE) to mature and demonstrate technologies within the alliance technology focus areas.  Will complete demonstration of lightweight structures and materials using advanced manufacturing techniques.  Will develop advanced lubricants to help mitigate frictional losses in powertrain to increase vehicle efficiency.  Will develop the capability to model advanced chemistry batteries and batteries in extreme temperature conditions.  Will investigate autonomy-enabled technologies and vehicle electrification to leverage common military and industry investments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}