{
    "id": "e26e7961296614ef100306e877f220103906e103",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305600D8Z"
        },
        "ProgramElementTitle": {
            "val": "International Intelligence Technology and Architectures"
        },
        "R1LineNumber": {
            "val": "227"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5.593"
            },
            "PriorYear": {
                "val": "4.363"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "9.956"
            }
        },
        "ProgramElementNote": {
            "val": "Funding was transferred to Air Force in FY 2015."
        },
        "ProgramElementMissionDescription": {
            "val": "Provided for the identification, migration and integration of existing and advanced multi-lateral and bi-lateral international intelligence information virtual advanced analytics, algorithmic data fusion, and multi-level security cross domain technologies into an integrated US, North Atlantic Treaty Organization (NATO), and coalition intelligence service oriented architecture\/data repository such as the US and NATO Battlefield Information Collection and Exploitation System(s) (BICES).  Provided rapid implementation of US BICES Extended (US BICES-X) capabilities into the Distributed Common Ground\/Surface System (DCGS) and the Defense Intelligence Information Enterprise (DI2E) intelligence decision applications and data mechanisms in support of the Under Secretary of Defense's (Intelligence) mission to ensure necessary intelligence information is being acquired, analyzed, and disseminated rapidly among our allies and coalition partners.  Developed US BICES-X as the \"enduring\" coalition intelligence support element of the DI2E.  Continued the development of the Trusted Network Environment (TNE) multi-level security database, web, and e-mail capabilities for U.S. Central Command (CENTCOM), U.S. European Command (EUCOM), U.S. Africa Command (AFRICOM), and U.S. Pacific Command (PACOM), U.S. Special Operations Command (SOCOM), Northern Command (NORTHCOM), Southern Command (SOUTHCOM) and other related organizations.  Supported the research and development of 50+ High Assurance Connection Interfaces to Combatant Command identified bi-lateral and multi-lateral partners, developed the multi-level security rule sets and developed Ozone Widget Framework with applicable cloud widgets that can transverse the multi-level security boundaries.  Developed, tested, and integrated intelligence mission applications that interface with and support the development of the DoD\/CIO Coalition Partner Network (CPN).\n\nFunding transfers to Air Force starting in FY 2015."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.363"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.363"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "Funding transfers to Air Force starting in FY 2015."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "997"
                    },
                    "ProjectTitle": {
                        "val": "International Intelligence Technology and Architectures"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.593"
                        },
                        "PriorYear": {
                            "val": "4.363"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.956"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funding transfers to Air Force beginning in FY 2015."
                        },
                        "ProjectMissionDescription": {
                            "val": "Provided for the migration and integration of existing and advanced multinational and bi-lateral international intelligence information virtual advanced analytics,  algorithmic data fusion and multi-level security cross domain technologies into an integrated US, NATO and coalition intelligence service oriented architecture\/data repository such as the US and NATO BICES. Provided for rapid implementation of US BICES capabilities into the DCGS and the DI2E intelligence decision applications and data mechanisms in support of USD(I)’s mission to ensure necessary intelligence information is being acquired, analyzed and disseminated rapidly among our allies and coalition partners. Developed US BICES as the \"enduring\" coalition intelligence component of the DI2E.  Continued development of the TNE multi-level security database, web and e-mail capabilities for US BICES."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Intelligence Technology and Architectures"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.363"
                                            },
                                            "Text": {
                                                "val": "Continued migration of other federated architectures to incorporate multi-level security (Oracle Trusted Cross Domain Systems) capabilities for bi-lateral and multi-lateral data dissemination and discovery information sharing techniques into existing US, NATO and coalition networks supporting on-going SOF and conventional operational intelligence needs.  Further incorporated design of DI2E capabilities for US BICES. Continued US BICES application integration. Developed and migrated critical mission applications to run within the TNE multi-level security boundary.  Allowed multiple bi-lateral and multi-lateral connections through the High Assurance Connection Interfaces to access the operational intelligence mission software portals and services with the data elements tagged to allow only the intelligence information that is releasable to the particular partner to be exchanged.  Provided research and development of the software applications necessary to ensure the PL-4 level security certification remains intact and will allow multi-level security between the secret, secret releasable, and NATO secret levels.  Provided research into whether the unclassified level can be connected in conjunction with higher level security levels.  Provided research and development to allow for US intelligence analysts to view not only US SIPRNET but multiple bi-laterals and multi-lateral windows on a single workstation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0305600D8Z  Proc DW"
                                    },
                                    "Title": {
                                        "val": "International Intelligence Technology and Architectures"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.678"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "16.678"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0305600D8Z  O&M DW"
                                    },
                                    "Title": {
                                        "val": "International Intelligence Technology and Architectures"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "60.632"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "60.632"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Performance was monitored on a monthly basis via Program Reviews, Current Expenditures, Estimated Future Expenditures and Cost\/Schedule Adherence.  Research and Development provided increased intelligence information sharing capabilities in support of US and coalition forces utilizing the US BICES and NATO virtual networks within the Afghanistan theater and provided increased database information via Distributed Common Ground System - Army.  Provided an increase in intelligence disciplines (Imagery Intelligence, Signal Intelligence and potential Human Intelligence) in support of US and Allied\/Coalition forces that currently is very limited to the warfighter.  Increased intelligence advanced analytics tools will be migrated from Joint Intelligence Operations Center-IT and DI2E developments and will significantly increase the timeliness of intelligence and bring US BICES\/NATO Special Operations Forces Headquarters\/NATO Intelligence Fusion Center capabilities into the current technology baselines.  Developed and provided a federated TNE that incorporates the Asian Pacific Intelligence Information Network being developed to support the National Defense Strategy as we transition out of Afghanistan and into the Pacific.  Provided multi-level security intelligence bi-laterals and multi-laterals to meet Combatant Commander Integrated Priority Lists.  Developed the Coalition Partner Network for CENTCOM, the Coalition Information Exchange Network for SOUTHCOM, and the Coalition Partner Network for EUCOM and AFRICOM.   Developed the US BICES connections with these bi-lateral and multi-lateral federated TNEs that make up the US BICES-X Enterprise Network in support of Commander SOCOM requirements for conventional and coalition operations as the US migrates into other Combatant Command regions."
                        },
                        "PerformanceMetrics": {
                            "val": "Assessment and Analysis - Whether it can easily be adapted or adjusted to meet the current or projected capabilities gap for Allied or Coalition Intelligence Information Sharing and for the Intelligence integration into the Future Mission Network.  \nRealism – Allows exploration of new environments and capabilities through participation in exercise environments that utilize bi-lateral and multi-lateral intelligence enterprise solutions such as US BICES-X.\nAdvancement - Increases the current capabilities for the sharing of intelligence information and determines if it actually adds functionality in support of Combatant Commanders requirements through exercises such as Unified Vision, Enterprise Challenge, and the MAJIIC (multi-sensor aerospace ground joint intelligence, surveillance, and reconnaissance interoperability coalition) exercises. \nUtility - Whether it can be integrated into the existing national or multinational architectures in a timely and cost effective manner and the extent to which it increases the discovery and dissemination of intelligence information to the Allies or Coalition forces."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Funds will transfer to Air Force beginning in FY 2015."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Funds will transfer to Air Force beginning in FY 2015."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Air Force"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.393"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.965"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.358"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Funds will transfer to Air Force beginning in FY 2015."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Air Force Research Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.200"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.398"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".598"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Software Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Continue migration of other federated architectures."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Continue US BICES application integration."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Funds transfer to Air Force beginning in FY 2015."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Funds transfer to Air Force beginning in FY 2015."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}