{
    "id": "e3d2a63bbb5aef1c7ed5e37bc7027bebb405ae97",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603264S"
        },
        "ProgramElementTitle": {
            "val": "Agile Transportation for the 21st Century (AT21) Theater Capability"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5.221"
            },
            "PriorYear": {
                "val": "3.754"
            },
            "CurrentYear": {
                "val": "2.544"
            },
            "BudgetYearOne": {
                "val": "2.679"
            },
            "BudgetYearOneBase": {
                "val": "2.679"
            },
            "BudgetYearTwo": {
                "val": "0.496"
            },
            "BudgetYearThree": {
                "val": "0.496"
            },
            "BudgetYearFour": {
                "val": "0.496"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Through the Theater Enterprise Deployment and Distribution (TED2) analysis, the Geographic Combatant Commanders identified several gaps between United\nStates Transportation Commands strategic lift processes and Geographic Combatant Commander's distribution processes. Highlighted is a lack of capability to (1.) manage transportation planning and execution processes for cargo and passenger movement within their respective theaters of operation or (2.) match global movement requirements against available lift assets to produce an optimized transportation schedule that meets delivery requirements.  AT21 Theater Capability, through the implementation of process improvements, integration of commercial transportation management and optimization tools, and development of additional deployment and distribution supporting technology, will provide the capability for combatant commanders to manage theater operations with improved visibility and control for those transportation movements originating from the port of debarkation and delivered to the point of need."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.865"
                },
                "CurrentYear": {
                    "val": "7.575"
                },
                "BudgetYearOne": {
                    "val": "7.781"
                },
                "BudgetYearOneBase": {
                    "val": "7.781"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.754"
                },
                "CurrentYear": {
                    "val": "2.544"
                },
                "BudgetYearOne": {
                    "val": "2.679"
                },
                "BudgetYearOneBase": {
                    "val": "2.679"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.111"
                },
                "CurrentYear": {
                    "val": "-5.031"
                },
                "BudgetYearOne": {
                    "val": "-5.102"
                },
                "BudgetYearOneBase": {
                    "val": "-5.102"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.111"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-5.031"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.084"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.084"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.018"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2014 Support OSD urgent request for funding: -$1.242 \nFY2015 Other Program Reduction (Budget Control Act 2011): -$5.031 million\nFY2016 Other Program Reduction (Budget Control Act 2011): -$5.096 million"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Agile Transportation for the 21st Century (AT21) Theater Capability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.221"
                        },
                        "PriorYear": {
                            "val": "3.754"
                        },
                        "CurrentYear": {
                            "val": "2.544"
                        },
                        "BudgetYearOne": {
                            "val": "2.679"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.679"
                        },
                        "BudgetYearTwo": {
                            "val": "0.496"
                        },
                        "BudgetYearThree": {
                            "val": "0.496"
                        },
                        "BudgetYearFour": {
                            "val": "0.496"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Through the Theater Enterprise Deployment and Distribution (TED2) analysis, the Geographic Combatant Commanders identified several gaps between United\nStates Transportation Commands strategic lift processes and Geographic Combatant Commander's distribution processes. Highlighted is a lack of capability to (1.) manage transportation planning and execution processes for cargo and passenger movement within their respective theaters of operation or (2.) match global movement requirements against available lift assets to produce an optimized transportation schedule that meets delivery requirements. AT21 Theater Capability, through the implementation of process improvements, integration of commercial transportation management and optimization tools, and development of additional deployment and distribution supporting technology, will provide the capability for combatant commanders to manage theater operations with improved visibility and control for those transportation movements originating from the port of debarkation and delivered to the point of need."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Agile Transportation for the 21st Century (AT21) Theater Capability"
                                    },
                                    "Description": {
                                        "val": "AT21 Theater will, in conjunction with the GCCs, continue business process analysis, business process automation development, and business process technology integration to improve the integration and transition of business processes between the strategic and theater segments, as well as improve theater deployment and distribution business processes and support. Theater business process analysis will identify opportunities for insertion of industry best practices and technology to improve the efficiency and effectiveness of managing theater deployment and distribution planning and execution.  Based on operational requirements emerging from the theater business processes, AT21 will develop, prototype, adapt and transition technologies to enable theater deployment and distribution capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.754"
                                            },
                                            "Text": {
                                                "val": "Continue  End-to-End  (E2E) supply chain integration to support analysis of deployment and distribution requirements in support of AT21 theater development efforts. Continue data architecture analysis\/services work to support reengineered business processes to ensure the seamless transition of deployment and distribution information between strategic & theater operations.  Prototyping, development and integration of Theater Transportation Planning Enablement (TTPE) optimization solutions (includes the modification, configuration and integration of Commerical Off-The-Shelf (COTS)\/Government Off-The-Shelf (GOTS) tools into the Joint Deployment and Distribution Environment (JDDE).  Provide an AT21 theater optimization tool that automates the Joint Operational Support Airlift Center (JOSAC) scheduling process and optimizes airlift mission schedules for operational support airlift requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.544"
                                            },
                                            "Text": {
                                                "val": "Continue to develop an AT21 theater optimization tool that automates the Joint Operational Support Airlift Center (JOSAC) scheduling process and optimizes airlift mission schedules for operational support airlift requirements.  Complete E2E supply chain integration to support analysis of deployment and distribution requirements in support of AT21 theater development efforts.  Continue data architecture analysis\/services work to support reengineered business processes to ensure the seamless transition of deployment and distribution information between strategic & theater legs.  TTPE capabilities to be spirally transitioned as respective Geographic CCMD requirements are addressed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.679"
                                            },
                                            "Text": {
                                                "val": "Complete data architecture analysis\/services work to support reengineered business processes to ensure the seamless transition of deployment and distribution information between strategic & theater legs.  TTPE capabilities to be spirally transitioned as respective Geographic CCMD requirements are addressed.  Complete development of an AT21 theater optimization tool that automates the Joint Operational Support Airlift Center (JOSAC) scheduling process and optimizes airlift mission schedules for operational support airlift requirements"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Development of core integrated strategic and theater process maps delineating gaps in information flow and prototype systems to facilitate synchronized transportation management and execution capabilities to improve performance in theater transportation planning and execution operations.  >80% transition rate of proven technologies\/capabilities."
                        }
                    }
                }
            ]
        }
    }
}