{
    "id": "e55aafe1d6ec91289cc7e443c8da45fcd7d6e2a1",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603005A"
        },
        "ProgramElementTitle": {
            "val": "Combat Vehicle and Automotive Advanced Technology"
        },
        "R1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "146.486"
            },
            "CurrentYear": {
                "val": "147.485"
            },
            "BudgetYearOne": {
                "val": "113.071"
            },
            "BudgetYearOneBase": {
                "val": "113.071"
            },
            "BudgetYearTwo": {
                "val": "118.252"
            },
            "BudgetYearThree": {
                "val": "124.969"
            },
            "BudgetYearFour": {
                "val": "124.973"
            },
            "BudgetYearFive": {
                "val": "127.363"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures, integrates and demonstrates combat and tactical vehicle automotive technologies that enable a lighter, more mobile and more survivable force. This PE executes the Army's Combat Vehicle Prototyping (CVP) program to mature, integrate and demonstrate ground vehicle leap ahead technologies in support of future combat vehicles. Project 221 matures, integrates and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and occupant safety devices to address both current and emerging advanced threats to ground vehicles. Project 441 matures and demonstrates advanced ground vehicle power and mobility technologies such as powertrains, power generation and storage, water and fuel logistics, and running gear subsystems for military ground vehicles to enable a more efficient, mobile and deployable force. Project 497 matures, integrates, and demonstrates vehicle electronics hardware (computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms) and software that result in increased crew efficiencies, vehicle performance, reduced size, weight, and power (SWaP) burdens and vehicle maintenance costs. Project 515 matures and demonstrates unmanned ground vehicle (UGV) technologies with a focus on sensors, perception hardware and software, and robotic control algorithms that enable UGV systems to maneuver on- and off-road at speeds which meet mission requirements with minimal human intervention.  \n \nWork in this PE is coordinated with, PEs 0602105A (Materials), 0602120A (Sensors and Electronic Survivability, Robotics Technology), 0602601A (Combat Vehicle and Automotive Technology), 0602618A (Ballistics Technology), 0602624A (Weapons and Munitions Technology), 0602705A (Electronics and Electronic Devices), 0603004A (Weapons and Munitions Advanced Technology), 0603125A (Combating Terrorism Technology Development), 0603270A (Electronic Warfare Technology), 0603313A (Missile and Rocket Advanced Technology), and 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n \nWork in this PE is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "146.992"
                },
                "CurrentYear": {
                    "val": "110.031"
                },
                "BudgetYearOne": {
                    "val": "114.799"
                },
                "BudgetYearOneBase": {
                    "val": "114.799"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "146.486"
                },
                "CurrentYear": {
                    "val": "147.485"
                },
                "BudgetYearOne": {
                    "val": "113.071"
                },
                "BudgetYearOneBase": {
                    "val": "113.071"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.506"
                },
                "CurrentYear": {
                    "val": "37.454"
                },
                "BudgetYearOne": {
                    "val": "-1.728"
                },
                "BudgetYearOneBase": {
                    "val": "-1.728"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.046"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "37.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.951"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.457"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.728"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.728"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "221"
                    },
                    "ProjectTitle": {
                        "val": "Combat Veh Survivablty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.311"
                        },
                        "CurrentYear": {
                            "val": "53.744"
                        },
                        "BudgetYearOne": {
                            "val": "55.476"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.476"
                        },
                        "BudgetYearTwo": {
                            "val": "60.567"
                        },
                        "BudgetYearThree": {
                            "val": "64.465"
                        },
                        "BudgetYearFour": {
                            "val": "63.389"
                        },
                        "BudgetYearFive": {
                            "val": "64.553"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures, integrates and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and occupant safety devices to address both current and emerging advanced threats to ground vehicles. This project integrates complimentary survivability technologies to enable advanced protection suites, providing greater survivability and protection against emerging threats. This project executes the Army's APS program to mature and demonstrate APS technologies in order to increase protection against current and emerging advanced threats while maintaining or reducing vehicle weight by reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection and active countermeasures. This project develops an APS Common Architecture that defines the component interface standards and component specifications enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required. \n\nWork in this project supports the Army S&T Ground Maneuver Portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan in collaboration with the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Grounds, MD, Armament Research, Development and Engineering Center (ARDEC), Picatinny, NJ, Aviation and Missile Research, Development and Engineering Center (AMRDEC), Huntsville, AL and Communications-Electronics Research, Development and Engineering Center (CERDEC), Aberdeen Proving Grounds, MD and Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vision Protection:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates devices to protect occupant's eyes, vehicle cameras and electro-optic fire control systems against anti-sensor laser devices as well as reduce the sensor's optical signature. Anti-sensor laser devices can deny vision either temporarily by flooding the sensor with too much light (jamming) or permanently by damaging the sensor. These jamming or damaging effects can slow our battle tempo, disrupt fire control solutions, or prevent vehicles from completing their mission. This effort focuses on demonstrating the effectiveness of optical systems that protect sensors and Warfighter vision from pulsed, continuous wave and future laser threats to maintain fire control capability and situational awareness. Coordinated work is also being performed in PEs 0602120A, 0602705A, 0602712A, and 0602786A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.760"
                                            },
                                            "Text": {
                                                "val": "Conducted vulnerability studies of electro-optical (day-camera) sensors against pulsed-laser energy threats to determine the laser energy required to render individual pixels, full pixel columns and the entire focal plane array of the sensor ineffective or damaged; and refined the integration technique required to apply the laser protection technology to electro-optical (day-camera) sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.120"
                                            },
                                            "Text": {
                                                "val": "Continue vulnerability studies to determine the energy levels required to make pixels, columns and the entire focal plane of an electro-optical (day-camera) ineffective. Mature concepts for integrating protection materials into the optical path of electro-optical (day-camera) sensors, and evaluate the effects of sensor exposure to pulsed-laser threats on the survivability of the sensors to continue the fire control mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.959"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Text": {
                                                "val": "Will mature optical power-limiting materials to improve protection of camera sensors from laser energy. Will evaluate the power-limiting materials protection capability against low-powered continuous wave and short-pulsed laser threats. Will integrate the power-limiting material onto a current fire-control sensor and determine the improved survivability of the sensor against near term laser threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armor Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates, integrates and evaluates advanced ground vehicle armor systems such as emerging base armor, appliqué armor, multifunctional armor systems (embedded antennas and health monitoring devices); matures scalable \/ modular \/ common armor system integration design standards; creates armor system test & evaluation standards; refines armor modeling and simulation system engineering process. This effort is done in coordination with efforts in PEs 0602105A, 0602601A, 0602618A, and 0708045A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.956"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated advanced tactical and combat vehicle armor technologies by performing environmental, armor attachment durability and ballistic testing; explored new integration techniques for armor systems and prepared for their future integrated armor attachment durability performance testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.952"
                                            },
                                            "Text": {
                                                "val": "Evaluate the performance differences between different transparent armor solutions and determine if additional testing is required to ensure consistent performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Armor Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates, integrates and evaluates advanced ground vehicle armor systems such as advanced passive kinetic energy armor, explosive reactive armor, electromagnetic armor, and adaptive armor. The goal is to optimize armor system technologies and integration methodologies to reduce overall armor system weight; create and mature scalable \/ modular \/ common armor system integration standards for the advanced armor technologies; create armor system test & evaluation standards for advanced armor technologies and leverages the standards for armor component and armor system maturation; refines armor modeling and simulation system engineering process to incorporate advances in armor technologies. This effort is done in coordination with efforts in PEs 0602105A, 0602601A, 0602618A, and 0708045A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.673"
                                            },
                                            "Text": {
                                                "val": "Will begin armor integration approaches to help achieve an overall ground vehicle armor subsystem weight reduction of 10-15%. Will demonstrate advanced passive and explosive reactive armor technologies and design approaches for defeat of kinetic energy threats, chemical energy threats, and improvised explosive devices. Demonstrations will include environmental testing followed by ballistic testing of advanced armor components. Will mature advanced passive armor system design for integration of the armor technology components and attachment schemes. Will mature advanced explosive reactive armor system design for integration of the armor component technologies. Will mature weight optimization methods for holistic vehicle lightweighting that supports and complements the vehicle armor systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Occupant Centric Protection (OCP) Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and validates design philosophies, guidelines, military standards, handbooks, etc. that embody a focused, systems engineering approach to occupant-centric protection in vehicle design. This is accomplished using tools such as modeling and simulation (M&S), full vehicle and subsystem demonstrators, evaluations and component optimizations. This effort addresses and validates the products from requirements generation through design and build to incorporate occupant-centric philosophies. This effort is done in coordination with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.103"
                                            },
                                            "Text": {
                                                "val": "Integrated occupant protection technologies such as seats, restraints and energy absorbing materials onto demonstrators using an approach that focuses on protecting the occupants by designing from the inside out; matured processes for establishing occupant-centric standards and guidelines developed in PE 0602601A; conducted assessments using physical models and proofs of concepts of occupant protection technologies such as seats, restraints and energy absorbing materials to validate M&S and to reduce risk for sub-system and integrated vehicle underbody blast OCP test events; conducted underbody blast tests on subsystem demonstrators of vehicles and hull structures; and matured and integrated solutions into vehicle demonstrators to reduce injuries from secondary effects such as loose cargo becoming flying hazards in blast, crash and rollover events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.315"
                                            },
                                            "Text": {
                                                "val": "Continue integration and demonstration of occupant protection components such as seats, restraints and energy absorbing materials into subsystem demonstrators and OCP vehicle demonstrators. Continue analysis of performance of OCP subsystems and demonstrators; begin subsystem and integrated OCP vehicle live-fire testing to simulate under-body blast events and identify and document a rigorous analytical approach to balance protection with mobility\/weight goals; continue development and refinement of occupant-centric standards, guidelines and procedures\/processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.957"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.957"
                                            },
                                            "Text": {
                                                "val": "Will mature passive and active levels of occupant-centric protection technologies for combat vehicle survivability. Will optimize combat vehicle survivability demonstrator designs using modeling and simulation to include the integration of a lightweight structure design, and occupant protection component technologies. Will conduct optimization to balance weight, mobility and performance goals. Will verify occupant-centric design guidelines and procedures\/processes. Will evaluate the performance of the initial Warrior Injury Assessment Manikin Project (WIAMan) test device in a simulated test environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Mitigation:"
                                    },
                                    "Description": {
                                        "val": "This effort fabricates and matures advanced survivability and protection components, tools and subsystems for enhanced protection against vehicle mines, improvised explosive devices (IEDs) and other underbody blast threats, and vehicle collision and rollover events that result from blast events. This effort also integrates and improves occupant protection technologies such as seats and restraints. This effort creates the laboratory capability needed to enable expeditious performance evaluation through modeling and simulation (M&S), experimentation and instrumented test of blast-mitigating technologies in such areas as active and passive exterior\/hull\/cab\/kits, interior energy absorbing capabilities for seats, floors, restraints, and sensors for active blast mitigating technologies. This effort is done in coordination with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.207"
                                            },
                                            "Text": {
                                                "val": "Continued to mature and demonstrate interior and exterior technologies such as energy absorbing materials in structural design, hull shaping and floor designs to mitigate injuries due to underbody blast events, vehicle collisions and rollovers. Conducted subsystem-level testing to improve: test methods to validate existing M&S models, designed methodologies and assessments of blast mitigation products, and lab and instrumentation capabilities to assess components, sub-system and system level blast mitigation capabilities. Created and maintained standards, guidelines and methodologies for specific blast mitigation technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.799"
                                            },
                                            "Text": {
                                                "val": "Integrate advanced passive and active technologies such as active blast countermeasures, energy absorbing materials and floor designs to mitigate the effects of underbody blast threats; conduct impact and blast tests to evaluate the integration methods for exterior and interior blast mitigation technologies onto components, and sub-systems; characterize performance to build greater knowledge for occupant-centric blast mitigation design guidelines\/standards, M&S tools, test procedures, laboratory processes, experimentation capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.312"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.312"
                                            },
                                            "Text": {
                                                "val": "Will mature and integrate the next generation of seats, restraints, and flooring technologies to mitigate underbody blast effects to the occupant in Combat Vehicle Prototyping (CVP) program concepts. Will demonstrate the CVP concepts' performance using modeling and simulation along with sub-system level blast tests. Will validate integration methods for blast mitigation technologies onto a combat vehicle platform. Will exploit technologies to increase neutralization effectiveness rates against anti-tank mines while maintaining host platform mobility and reliability characteristics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Fire Protection:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates technologies to minimize vehicle and crew vulnerabilities to fires in current and future military ground vehicles. Supporting technologies include modeling and simulation (M&S), sensor systems, software, chemical agents, fire-resistant materials and hardware components. This effort is done in coordination with efforts in 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.468"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate enhanced fire protection technologies for military platforms; evaluated and verified optimized common crew Automated Fire Extinguishing System (AFES) components to establish compliance to the crew AFES requirements; integrated design of the common crew AFES into a vehicle platform demonstrator to validate integration, test, safety, and fielding requirements for common crew AFES on vehicle demonstrators designed for Occupant Centric Platforms; validated and improved common crew AFES M&S based on test results; and enhanced in-house laboratory capabilities to improve assessment and demonstration of vehicle fire protection technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.063"
                                            },
                                            "Text": {
                                                "val": "Conduct system-level evaluation of common crew AFES technologies and utilize the analysis to develop component specifications for common crew AFES; continue to investigate integration opportunities of common crew AFES to enable AFES commonality across vehicle fleet; and demonstrate technologies to mitigate injuries and improve damage mitigation due to thermal events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.643"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.643"
                                            },
                                            "Text": {
                                                "val": "Will improve designs and technologies to minimize vehicle and crew vulnerabilities to fires. Will evaluate next generation materials, components and system level technologies to address emerging military ground vehicle thermal threats. Will validate AFES designs using modeling and simulation (M&S) and testing to improve integration for current and new vehicle configurations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit Avoidance Architecture:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the Army's Active Protection System (APS) Common Architecture that defines the component interface standards and component specifications enabling adaptable APS solutions that can be integrated into multiple Army vehicle platforms. This effort matures an evaluation test-bed to enable maturation of the APS Common Architecture. This effort helps inform requirements of fielding APS including to: develop safety release criteria, identify vehicle integration constraints and engage potential operators to determine how hit avoidance will impact techniques, tactics and procedures. This effort is done in coordination with efforts in PEs 0602601A, 0602618A, 0603004A, 0603270A, and 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.817"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluation of existing APS sensors, countermeasures and controllers and utilized the analysis to develop component specifications for the Army’s future APS efforts; developed fuze board-compliant common APS command and control processor and fire control module to enable APS commonality across vehicle fleet; developed and provided bus protocols, common interface specifications and standards to industry for APS Common Architecture; conducted hardware in the loop analyses of APS components during development and integration of APS component technologies with the common processor; incorporated a laser decoy countermeasure (CM) capability into an existing infrared soft-kill CM; tested and matured soft-kill countermeasure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Continue APS Common Architecture maturation to include an APS common controller. Integrate and fabricate software and hardware for the common controller, enabling integration of active protection components that accommodate varying performance and vehicle needs. Begin integration with Hit Avoidance Technologies and conduct hardware-in-the-loop analyses to validate common controller meets APS interface requirements. Will conduct soft-kill countermeasure environmental and live-fire assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit Avoidance Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates hard-kill (physical countermeasure) and soft-kill (non-kinetic countermeasure such as electronic jamming or spoofing) Active Protection System (APS) components and integrated systems to verify the APS Common Architecture. In demonstrating hard-kill and soft kill-active protection technologies, requirements and specifications will be matured for future integration onto tactical and combat vehicle platforms. This effort is coordinated with efforts in PEs 0602601A, 0602618A, 0603004A, 0603270A, and 0603313A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.995"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate the soft-kill countermeasure with the APS Common Architecture and modular APS common controller to demonstrate soft-kill defeat of anti-tank guided missiles on a combat vehicle. Verify the soft-kill countermeasure is compliant with the APS Common Architecture interface standards. Mature and integrate a hard-kill active protection system demonstrator using the APS Common Architecture and APS common controller and hard-kill tracking sensors and countermeasures that are matured and compliant with the architecture interfaces and protocols. Enhance hard-kill and soft-kill simulation and hardware-in-the-loop evaluation capability to exercise and test software and hardware components to inform requirements and determine trade space for hit avoidance technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.932"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.932"
                                            },
                                            "Text": {
                                                "val": "Will continue maturation of the modular active protection systems (APS) common architecture, and maturation of the modular APS common controller. Will continue software and hardware maturation for the APS common controller, enabling integration of active protection components that accommodate varying performance and vehicle needs. Will enhance soft-kill and hard-kill simulation and laboratory capability to exercise and test software and hardware components against design requirements and determine trade space for APS configurations. Will continue to mature a modular architecture APS configuration with soft-kill and hard-kill capabilities by integrating sensors and countermeasures that are matured and compliant with the APS common architecture interfaces and protocols. Will conduct virtual and physical demonstrations of a modular architecture APS soft-kill configuration defeat capability against anti-tank guided missiles at the subsystem level."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "441"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Mobilty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.723"
                        },
                        "CurrentYear": {
                            "val": "42.032"
                        },
                        "BudgetYearOne": {
                            "val": "43.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.381"
                        },
                        "BudgetYearTwo": {
                            "val": "43.681"
                        },
                        "BudgetYearThree": {
                            "val": "43.297"
                        },
                        "BudgetYearFour": {
                            "val": "43.799"
                        },
                        "BudgetYearFive": {
                            "val": "44.669"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced mobility and electric technologies for combat and tactical vehicles to enable lightweight, agile, deployable, fuel efficient and survivable ground vehicles. Technologies include advanced propulsion, engines, transmissions, power, and electrical components and subsystems. This project will also mature and demonstrate advanced mechanical and electrical power generation systems to increase available onboard electrical power to enable future capabilities such as next generation communications and networking, improvised explosive device (IED) jamming systems and next generation sensor devices can be supported on combat and tactical vehicles. This project also matures and demonstrates water and fuel logistics technologies.\n\nWork in this project supports the Army S&T Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI, in conjunction with Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Onboard Vehicle Electric Power Component Development:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on meeting the Army's demand for more onboard vehicle electric power to enable technologies such as advanced survivability systems, situational awareness systems and the Army network. This effort matures, integrates and demonstrates onboard vehicle power (OBVP) components to include electrical power generation machines and associated power converters  such as high temperature inverters and converters, advanced control algorithms, and high efficiency power conversion (mechanical to electrical) components. Additionally, it matures and integrates advanced electric machines such as Integrated Starter Generator (ISG) and their controls for mild hybrid (system that integrates electric machines to assist internal combustions engines for propulsion) electric propulsion and high power electric generation. Coordinated work is also being conducted under PEs 0602601A and 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.742"
                                            },
                                            "Text": {
                                                "val": "Integrated onboard vehicle power (OBVP) components onto the vehicles to demonstrate increased vehicle power generation capabilities; evaluated performance of vehicle with OBVP against baseline vehicle performance; evaluated reliability of hybrid vehicle components, including electric motors and controllers; and demonstrated bidirectional vehicle-to-grid power flow and mobile microgrid capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.278"
                                            },
                                            "Text": {
                                                "val": "Evaluate combat vehicle performance with integrated onboard vehicle power (OBVP) technologies that verify they provide adequate onboard electrical power to enable future communications, networking, IED jamming and sensors; implement OBVP and hybrid component control approaches to minimize vehicle performance impacts while generating significant electrical power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.401"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.401"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate onboard vehicle power (OBVP) technologies to include inverters and generators for high temperature operation capability, power quality and the ability to provide more compact, power dense electrical power generation. Will demonstrate power technologies to enable application of advanced technologies to vehicles including electromagnetic armor, communications and other technologies enhancing combat vehicle lethality, survivability and situational awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Running Gear:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates running gear components and advanced suspension technologies to increase vehicle mobility and durability in response to increased ground vehicle platform weights. Components and subsystems include new elastomer compounds, lightweight, survivable track systems and road wheels, advanced compensating track tensioners, advanced damping suspension technologies, Electronic Stability Control (ESC) systems, and preview sensing technologies linked to advanced suspension designs. Coordinated work is also being conducted under PEs 0602601A and 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.465"
                                            },
                                            "Text": {
                                                "val": "Fabricated, evaluated and qualified lightweight track technology improvements for the Bradley Fighting Vehicle in direct support of improving vehicle occupant survivability; investigated, baselined and characterized low rolling resistance tire compounds for tactical military applications with the goal of increased fuel efficiency; matured, fabricated and laboratory tested track width adjusting suspension systems to improve vehicle stability; and assessed flush backed track designs to establish baseline data on design improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Text": {
                                                "val": "Fabricate, install and test an external suspension system for a 60-70 ton combat application to evaluate system durability and reliability as well as vehicle performance characteristics; mold high capacity, lightweight track compounds for heavy (60-70 ton) combat vehicle systems and perform vehicle testing to demonstrate the durability and rolling resistance reductions of these compounds; model suspension control architectures for system control of vehicle dynamics, ride and handling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.004"
                                            },
                                            "Text": {
                                                "val": "Will improve elastomer materials and road wheels to demonstrate improved combat vehicle track system durability. Will continue fabrication, integration and optimization of external suspension unit system for 60-70 ton combat vehicle application. Will mature suspension control architectures for system control of vehicle dynamics, ride height and handling. Will characterize combat vehicle external suspension unit functionality, durability and system performance relative to performance metrics. Will execute track and suspension maturation efforts in support of the Combat Vehicle Prototyping program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Vehicle Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture and systems integration. The primary focus of this activity is to mature and demonstrate a series of subsystem demonstrators building off of previous investment in ground combat acquisition and technology programs with the purpose of maturing key technologies to refine and inform future platform requirements and reduce risks in critical ground combat vehicle technology areas. Specifically, this effort focuses on maturing and demonstrating ground combat vehicle mobility technologies such as powertrain subsystems and systems integration technologies such as vehicle structures and concept demonstrators. This effort seeks to optimize platform efficiency and growth potential to ensure the combat fleet is able to accept new technologies as they are developed to bring advanced capability for the Warfighter. This effort is executed in coordination with PEs 0602601A, 0602618A, 0603004A, and 0603125A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.022"
                                            },
                                            "Text": {
                                                "val": "Mature, integrate and evaluate emerging ground vehicle subsystem and component technologies for mobility, survivability and systems integration such as advanced transmission, flooring and vehicle structures to establish subsystem and component performance baselines. Analyze the influence of emerging ground vehicle subsystem technologies on future integrated combat vehicle designs and concepts. Conduct modeling, analysis and trade studies for next-generation ground vehicle subsystems. Assess developmental and existing critical technology areas such as mobility, survivability and vehicle structures for optimal platform configuration. Conduct laboratory assessment of multiple vehicle powertrain subsystems and configurations such as engines and transmissions including both conventional and hybrid powertrain approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.031"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.031"
                                            },
                                            "Text": {
                                                "val": "Will mature the design of a unique high power density, low heat rejection, fuel efficient opposed piston engine concept through the use of advanced lightweight materials and optimization of in-cylinder combustion performance and efficiency to inform future combat vehicle concept development and analyses and its future powertrain subsystem demonstrator. Will optimize engine fuel efficiency and increase commonality of engine components to reduce engine logistical and life cycle costs. Will develop novel future combat vehicle concepts for the Combat Vehicle Prototyping (CVP) program leveraging leap-ahead technologies and technology concepts. Will conduct capability analyses and trade studies on the integration of vehicle mobility and occupant protection technologies into the CVP concepts, in order to optimize the platform configuration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Storage Systems Development:"
                                    },
                                    "Description": {
                                        "val": "The goal of this work is to mature energy storage systems to both enable silent watch capability and increased survivability through power brick energy storage components for pulse power electromagnetic armor. This is accomplished through the maturation and demonstration of advanced ground vehicle energy storage devices such as advanced chemistry batteries, high energy density capacitors and power brick batteries for pulse power. This effort leverages commercial industry battery development efforts to reduce battery volume and weight while improving their energy and power densities. This effort also matures and optimizes a common specification for battery management systems to improve the battery state of charge indicator accuracy and battery state of health information to reduce the frequency of battery replacement and optimize starting, lighting, and ignition functions. Coordinated work is also being conducted under PEs 0602601A and 0602705A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.735"
                                            },
                                            "Text": {
                                                "val": "Matured and optimized an advanced vehicle battery system with improved energy and power density; validated the battery system's performance in military mission scenarios to evaluate reduction on logistics footprint; tested the system to military specifications; integrated battery system onto a vehicle platform; conducted performance characterization; and integrated second generation power brick battery into pulse power electromagnetic armor system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.627"
                                            },
                                            "Text": {
                                                "val": "Optimize the improved second generation power brick battery for pulse power electro-magnetic armor system to evaluate power brick battery performance and ensure it meets military specifications; leverage power brick battery design and testing to create concepts for modular, standardized new high energy, high voltage advanced batteries for mobility applications; and generate common performance specifications for power brick and standardized high voltage battery systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.926"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.926"
                                            },
                                            "Text": {
                                                "val": "Will mature standardized low voltage battery systems to improve fuel efficiency and support vehicle lightweighting. Will mature control electronics and battery management system for advanced, standardized, military specific batteries to improve durability and reliability. Will optimize advanced, standardized, military specific battery system for increased energy density and reliability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pulse Power:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high energy, compact pulse power components, subsystems and systems that enable significantly improved survivability and lethality applications components to include Direct Current (DC) to DC chargers, high energy batteries, pulse chargers, high density capacitors, solid state-switches, control systems and electromagnetic armor panels. Coordinated work is also being conducted under PEs 0602601A, 0602618A, and 0602705A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a second generation power brick and mission module based electromagnetic armor module. Demonstrate multi-hit defeat with fast re-charge time capabilities in a lab environment with an electrical surrogate load. Conduct follow-on ballistic testing of the electromagnetic armor module to demonstrate multi-hit defeat capabilities enabled by the integrated power brick and mission module."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.823"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.823"
                                            },
                                            "Text": {
                                                "val": "Will integrate energy storage and high-voltage power electronic components into a power system to support electromagnetic armor development weight reduction goals of 10% to 15%. Will demonstrate and validate pulse power system and electromagnetic armor module in relevant environments. Will begin integrated demonstration of pulse power and electromagnetic armor systems, including durability and environmental testing, Will validate ballistic performance of the integrated pulse power and electro-magnetic armor system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Primary Power Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort exploits, matures, and demonstrates Auxiliary Power Unit (APU) technologies such as a small modular\/scalable engine-based APUs, a fuel cell reformer system to convert JP-8 to hydrogen, a sulfur tolerant JP-8 fuel cell APU, and novel engine-based APUs for military ground vehicles and unmanned ground systems. This effort also establishes interface control documents for simplified integration of current and future APUs, improves reliability to reduce logistic burdens, as well as reduces acoustic signature for silent operation. Additionally, this effort exploits JP-8 fuel cell and engine APUs to optimize prime power in unmanned ground systems. Coordinated work is also being conducted under PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.356"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a small engine-based APU on an unmanned ground system; evaluated and selected a modular\/scalable small engine for use in a high power APU (25-45kW); integrated and evaluated active noise control hardware on an engine-based APU; and evaluated performance of various APU technologies for higher power applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.646"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a JP-8 fueled small power system integrated onto an unmanned ground system. Integrate and demonstrate acoustic improvements of high power rotary engines for APU use. Perform testing on high power small engines for rotary APU use. Demonstrate the improvements of an integrated APU and Battery system to meet engine off power needs, such as power demands for silent watch, vehicle starting and communications and surveillance equipment. Integrate a fuel cell power system onto a mobile platform to demonstrate silent mobility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.096"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.096"
                                            },
                                            "Text": {
                                                "val": "Will mature power dense, heavy fuel engine, such as JP-8, rotary engine and electrical generator technologies to significantly increase under armor power generation capability for combat vehicles. Will integrate and optimize rotary engine-based auxiliary power unit system for increased fuel efficiency and improve packaging of rotary engine, electrical generator and other components to decrease acoustic signature."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion and Thermal Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and evaluates high power density engines and transmission systems needed to offset increasing combat vehicle weights (armor), increased electrical power generation needs (onboard communications, surveillance and exportable power), improved fuel economy (fuel cost & range), enhanced mobility (survivability), and reduced cooling system burden (size, heat dissipation). This effort also matures thermal management technologies and systems including heat energy recovery, propulsion and cabin thermal management sub-systems to utilize waste heat energy and meet objective power and mobility requirements on combat and tactical vehicles. Lastly, this effort maximizes efficiencies within propulsion and thermal systems to reduce thermal burden on the vehicle while providing the same or greater performance capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.241"
                                            },
                                            "Text": {
                                                "val": "Performed advanced powertrain sub-systems integration and validation testing to include energy efficiencies and performance capabilities by utilizing highly efficient transmissions and engines incorporating advanced algorithms and control strategies, low heat rejection and high power density systems; evaluated waste heat recovery technologies at a system level in a laboratory environment for performance validation; completed the power take off (PTO) system and fan control strategies for increased efficiency in engine cooling performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.607"
                                            },
                                            "Text": {
                                                "val": "Mature and model an advanced powertrain system utilizing a highly efficient transmission and engine and incorporating advanced algorithms and control strategies to enhance energy efficiencies and performance capabilities for future combat vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will mature combat vehicle mechanical automatic transmission design and increase transmission efficiency by targeting the optimal efficiency through all vehicle operating ranges. Will optimize powertrain system mobility and steering performance by delivering increased engine power to the vehicle track system while reducing heat rejection. Will validate model of advanced powertrain system. Will mature transmission quality, reliability and durability to reduce lifecycle costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Projection:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on reducing the logistics footprint, improving fuel efficiency, and ensuring mobility by maturing and demonstrating technologies in areas such as water purification, generation, quality monitoring, storage and distribution and wastewater treatment and reuse; petroleum quality monitoring, filtration, storage and distribution, hydraulic fluids; alternative fuels and fuel additives; lubricants, oil, powertrain fluids and coolants. This effort is done in coordination with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.184"
                                            },
                                            "Text": {
                                                "val": "Conducted performance assessments of waste water treatment and recycling technologies; further matured and demonstrated in-line water quality and process monitoring capability equivalent to the Water Quality Analysis Set - Purification; characterized selected alternative fuels and fuel additives to improve performance and diversify energy sources; assessed the suitability of candidate alternative fuels in military ground systems; evaluated lower viscosity gear oils and hydraulic fluids that increase fuel efficiency through a reduction in hydro-dynamic friction; and continued evaluation of candidate Petroleum, Oil, Lubricants and coolants to meet new military technology requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.680"
                                            },
                                            "Text": {
                                                "val": "Conduct demonstrations of waste water treatment and recycling technologies in a field environment. Demonstrate expanded in-line water quality and process monitoring capability to address pathogens and toxins such as giardia, cryptosporidium, and pesticides. Characterize selected alternative fuels and fuel additives to improve performance and diversify energy sources; evaluate candidate long life coolants designed to reduce the overall logistics burden and meet emerging requirements of military ground systems; and evaluate fluid distribution composite hose technologies to improve logistical burdens of deploying fuel and water pipeline systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Will perform modeling and analysis of waste water treatment and recycling technologies to assess the scalability of technologies and optimize system designs. Will evaluate and qualify synthetic fuels made from non-petroleum sources against performance requirements for use in military ground systems. Will mature and demonstrate fuel sensor technologies and a portable fuel analyzer for contaminate detection. Will validate performance of gear oils and hydraulic fluids using a new test methodology and performance based specification, demonstrating increased vehicle fuel efficiency with limited equipment\/hardware modifications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flood damage assessment and repair of mission equipment"
                                    },
                                    "Description": {
                                        "val": "Flood damage assessment and repair of mission equipment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "In August 2014 heavy rains caused flooding at TARDEC.  Funding was reprogrammed to assess and repair mission equipment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "497"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Electro"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.152"
                        },
                        "CurrentYear": {
                            "val": "7.143"
                        },
                        "BudgetYearOne": {
                            "val": "6.660"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.660"
                        },
                        "BudgetYearTwo": {
                            "val": "7.118"
                        },
                        "BudgetYearThree": {
                            "val": "7.153"
                        },
                        "BudgetYearFour": {
                            "val": "7.202"
                        },
                        "BudgetYearFive": {
                            "val": "7.345"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures, integrates, and demonstrates vehicle electronics hardware such as computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms as well as vehicle software to enhance crew performance, increase vehicle fuel efficiency, reduced Size, Weight, and Power (SWAP) burdens and reduce vehicle maintenance costs. This project also advances open system architectures (power and data) for military ground vehicles to enable common interfaces, standards and hardware implementations. The overall vehicle system architecture is known as VICTORY (Vehicle Integration for C4ISR\/EW Interoperability), which is a long term technology effort that provides an open architecture that will allow platforms to accept future technologies without the need for significant re-design as new technologies are developed and integrated. Additionally this project matures integrated condition based maintenance technologies that reduce the operation and sustainment costs of vehicle electronics and electrical power devices. Technical challenges include: software and algorithm development for increased levels of automation for both manned and unmanned systems, secure vehicle data networks, interoperability of intra-vehicle systems, and implementation of advanced user interfaces. Overcoming these technical challenges enables improved and increased span of collaborative vehicle operations, efficient workload management, commander's decision aids, embedded simulation for battlefield visualization and fully integrated virtual test\/evaluation. \n\nWork in this project supports the Army S&T Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Integration Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, demonstrates and implements next generation military ground vehicle electronics and electrical power open architectures for future ground combat and tactical vehicle systems. Mature and demonstrate technologies to include: next generation video\/data networking and computing equipment, Silicon Carbide (SiC) high voltage power electronics and low voltage smart power distribution. Technologies will reduce currently fielded vehicle overall space, weight and power (SWaP) concerns for vehicle electronics. This effort is coordinated with efforts in PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.226"
                                            },
                                            "Text": {
                                                "val": "Completed preliminary power and data maturation activities; continued to mature the architecture design such as activity and sequence diagrams, use cases, and mission scenarios, as well as produce system operation descriptions and defined both physical and data component interfaces for the network and power hardware and software subsystems; beginning optimization activities for electronics and electrical power component selection and\/or fabrication for reconfigurable combat vehicle cab simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.503"
                                            },
                                            "Text": {
                                                "val": "Further mature and begin implementation of next generation military ground vehicle electronics and electrical power open architectures; conduct market\/trade analysis and integrate applicable high and low voltage vehicle power components, command, control, communications, and combat vehicle computing hardware and software necessary for full architecture system functionality into a reconfigurable combat vehicle cab simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate vehicle electronics architecture to facilitate rapid integration of card-based communication equipment into combat and tactical systems. Will continue all maturation and integration activities of the next generation power and data architecture and corresponding system design in a System Integration Laboratory (SIL). Will verify and validate the next generation power and data architecture through testing traced to power, network and SIL designs and requirements. Will enhance the data transport mechanism for VICTORY, leveraging the next generation power and data architecture and incorporating electronics and electrical power open architecture requirements for future combat vehicles. Will exploit the existing VICTORY (Vehicular Integration for C4ISR\/EW Interoperability) data architecture to demonstrate future combat vehicle functions and components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Architecture and Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort matures technologies and standards for existing and future combat and tactical ground vehicles. Open commercial standards will be evaluated and modified for use in military ground vehicles and possible inclusion in the Army's open, non-proprietary intra-vehicle data network e.g., VICTORY (Vehicular Integration for C4ISR\/EW Interoperability). This effort will also evaluate standards and components for suitability of integration into vehicle platforms. This effort also supplements the design of electronic architectures to support the efficient integration of electronic components into vehicle systems through the use of open standards. Additionally, this effort matures and expands the VICTORY effort to interface with the Modular Active Protection System (APS) Architecture. This effort is coordinated with PEs 0602601A and 0603005."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.926"
                                            },
                                            "Text": {
                                                "val": "Continued to mature and refine the VICTORY standards and open architecture; began improvement of the VICTORY SIL for compatibility with VICTORY standard version 1.6 to support component compliance testing to the latest VICTORY standard release; matured next generation open vehicle architecture by performing analysis of current VICTORY standards for application to combat vehicle architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.640"
                                            },
                                            "Text": {
                                                "val": "Complete update of VICTORY SIL to version 1.6 and begin update of VICTORY SIL to VICTORY standard version 1.7 to demonstrate component compliance testing to latest VICTORY release. Mature and demonstrate current VICTORY interfaces (1.6 vs. 1.7) to support next generation open vehicle architectures in preparation for a data and computing architecture demonstration in FY16."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.152"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.152"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature and validate the VICTORY specification through demonstration in the VICTORY SIL. Will complete the VICTORY SIL update to standard version 1.7, which adds capabilities for Logistics and Training systems and demonstrate component compliance to standard version 1.7. Will begin the VICTORY SIL update to VICTORY standard version 1.8, providing the capability to demonstrate component compliance to the VICTORY standard version 1.8, which adds capabilities for weapons and sensor systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "515"
                    },
                    "ProjectTitle": {
                        "val": "Robotic Ground Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.300"
                        },
                        "CurrentYear": {
                            "val": "7.066"
                        },
                        "BudgetYearOne": {
                            "val": "7.554"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.554"
                        },
                        "BudgetYearTwo": {
                            "val": "6.886"
                        },
                        "BudgetYearThree": {
                            "val": "10.054"
                        },
                        "BudgetYearFour": {
                            "val": "10.583"
                        },
                        "BudgetYearFive": {
                            "val": "10.796"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies to enable Unmanned Ground Vehicles (UGV) including sensor technologies, perception hardware and software, and control technologies that allow the Soldier to perform mission tasks more efficiently. Challenges addressed include: obstacle avoidance, overcoming perception limitations, intelligent situational behaviors, command and control by Soldier operators, frequency of human intervention, operations in adverse weather, and autonomy enabled vehicles protecting themselves and their surroundings from intruders. Mature technologies are incorporated onto existing, Army-owned UGV technology demonstrators so that performance of the enabling technologies can be evaluated.  \n\nThe approach builds upon, complements, and does not duplicate previous and ongoing investments conducted under the Joint Robotics Program Office.\n\nWork in this project supports the Army S&T Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI, in collaboration with the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Ground Systems Technology:"
                                    },
                                    "Description": {
                                        "val": "This project matures, integrates and demonstrates advanced robotic and autonomous technologies for the tactical and combat vehicle fleets. Unmanned ground systems technologies can be employed to overcome critical Army challenges to include automated resupply and sustainment, improved tactical intelligence, and reduced physical and cognitive burden. Challenges can be met by utilizing relevant technologies such as maneuver and tactical behavior algorithms, autonomy kits, sensor and weapons integration, advanced navigation and planning, vehicle self-protection, object and local environment manipulation, local situational awareness, advanced perception, vehicle and pedestrian safety, and robotic command and control. This effort is coordinated with efforts in PEs 0602120A, 0602601A and 0603005."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.300"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated advanced autonomous maneuver, active safety and Soldier load reduction hardware, software, algorithms, control interfaces, and sensor payloads onto demonstrator vehicles to substantiate optionally manned\/unmanned vehicle missions and validate emerging safety methodology and tactics, techniques and procedures; expanded integration of scalable autonomy kits and control interfaces onto representative tactical wheeled vehicles to increase Soldier safety, operational efficiency and effectiveness and culminate with technical demonstrations and robust data analysis in a relevant operational environment; began integration of interoperability standards-compliant components and systems onto manned\/unmanned robotic platforms to increase re-use and reduce costs of current\/future systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.066"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate autonomy-enabling technologies to include: drive-by-wire systems, vehicle active safety technologies, mission packages, and related software, algorithms and control interfaces. Validate emerging safety methodologies and tactics, techniques and procedures. Mature and integrate higher level intelligent behaviors to increase Soldier safety, operational efficiency, effectiveness, and manned\/unmanned teaming. Further integrate components and systems compliant with interoperability standards onto manned\/unmanned platforms to increase re-use and reduce costs of current\/future systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.554"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.554"
                                            },
                                            "Text": {
                                                "val": "Will mature, integrate and demonstrate advanced scalable autonomous technologies onto tactical vehicles to automate driving tasks and reduce logistics support requirements. Will mature and integrate software and behavior algorithms to enable autonomous convoy and autonomous vehicle loading\/unloading operations to improve the effectiveness of unit resupply and sustainment operations. Will mature and demonstrate platform autonomy in increasingly complex environments and mission applications ranging from urban terrain to cross country maneuvers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "533"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Demonstrations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.000"
                        },
                        "CurrentYear": {
                            "val": "17.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Matured and demonstrated decreased chemical agent resistant coating (CARC) curing time, nano-composite materials and modeling capabilities, transparent armor with improved resistance to rock strike and delamination, fastener coating systems with reduced cost and complexity, military specific efficient powertrain, technologies to support an autonomy enabled brigade, ground vehicle coating system with improved shelf life, and a ground systems advanced reliability capability to identify reliability cost drivers and improve cost analysis. Matured and optimized capabilities to evaluate modular active protection components, matured vehicle concepts for the Combat Vehicle Prototyping (CVP) program and the architecture and standards to enable reduction of the logistics burden using autonomy."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "17.500"
                                        },
                                        "Text": {
                                            "val": "Program increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "53D"
                    },
                    "ProjectTitle": {
                        "val": "NAC Demonstration Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.000"
                        },
                        "CurrentYear": {
                            "val": "20.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Matured and demonstrated multiple technologies with the Department of Energy through the Advanced Vehicle Power Technology Alliance (AVPTA), including Thermoelectric Enabled Engine, Lightweight Vehicle Structures, Multi-Material Joining, Computer Aided Engineering for Electric Batteries, Lubricant Formulations to Enhance Fuel Efficiency, and Non Rare Earth Material Motors. Matured and demonstrated water treatment and water generation technologies, vehicle electrification technologies and modeling and simulation capabilities to determine fuel efficiency and water generation capabilities logistical impacts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for alternative energy research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}