{
    "id": "e773e549eccc274df3e0a998bad1df0acb50a0f4",
    "meta": {
        "filename": "dod-2016_RDTE_2016_CBDP_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2016.zzz_unzipped_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "195.160"
            },
            "CurrentYear": {
                "val": "226.317"
            },
            "BudgetYearOne": {
                "val": "208.111"
            },
            "BudgetYearOneBase": {
                "val": "208.111"
            },
            "BudgetYearTwo": {
                "val": "204.941"
            },
            "BudgetYearThree": {
                "val": "209.378"
            },
            "BudgetYearFour": {
                "val": "204.427"
            },
            "BudgetYearFive": {
                "val": "205.879"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Applies research in the areas of physical technologies (CB protective materials, textiles, and filtration, sensors and sensing algorithms, effects modeling, chemical formulations, processes and methods for hazard mitigation), medical technologies (drug discovery and platform technology development, biomarkers and assay development useful in drug development and diagnostics, human mimicking devices and regulatory science), and non-traditional agent medical and physical defense technologies, including characterization of emerging threats.  Major efforts support development of vaccines, therapeutics, next generation diagnostics systems, next generation chemical detectors, nerve agent pretreatments and individual protection advances.\n\nIn the physical sciences area, Project CB2, focuses on continuing improvements in CB defense materiel, including contamination avoidance, decontamination, and protection technologies, as well as biological weapon\/agent surveillance.  \n\nThe medical program, Project TM2, focuses on the development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management.  The Medical Countermeasures Initiative (MCMI) was established to provide the capability for the advancement of regulatory science and flexible manufacturing of biological MCM to address CBR threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases.  \n\nFor Non-Traditional Agents (NTAs), Project NT2 consolidates all NTA efforts (both medical and non-medical) including pretreatments, therapeutics, detection, threat agent science, modeling, and protection and hazard mitigation.  \n\nEfforts under this PE will transition to or will provide risk reduction for Advanced Technology Development (PE: 0603384BP), Advanced Component Development and Prototypes (PE: 0603884BP) and System Development and Demonstration (PE: 0604384BP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "197.065"
                },
                "CurrentYear": {
                    "val": "226.317"
                },
                "BudgetYearOne": {
                    "val": "215.133"
                },
                "BudgetYearOneBase": {
                    "val": "215.133"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "195.160"
                },
                "CurrentYear": {
                    "val": "226.317"
                },
                "BudgetYearOne": {
                    "val": "208.111"
                },
                "BudgetYearOneBase": {
                    "val": "208.111"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.905"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-7.022"
                },
                "BudgetYearOneBase": {
                    "val": "-7.022"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.416"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.321"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.022"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.022"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: N\/A\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.102"
                        },
                        "CurrentYear": {
                            "val": "54.061"
                        },
                        "BudgetYearOne": {
                            "val": "52.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.131"
                        },
                        "BudgetYearTwo": {
                            "val": "54.321"
                        },
                        "BudgetYearThree": {
                            "val": "53.348"
                        },
                        "BudgetYearFour": {
                            "val": "47.020"
                        },
                        "BudgetYearFive": {
                            "val": "47.407"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB2 provides physical science applied research to develop future, multi-disciplinary, multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.  Capability areas in this project include: detection; Information systems technology; protection\/hazard mitigation; and threat agent science.  Detection focuses on developing technologies for standoff and point detection and identification of chemical and biological agents.  Information systems technology focuses on advanced hazard prediction, operational effects and risk assessment, and systems performance modeling.  Protection and hazard mitigation focuses on providing technologies that protect and reduce the chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures.  Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity.  This project focuses on horizontal integration of CB defensive technologies in support of the Joint Services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.124"
                                            },
                                            "Text": {
                                                "val": "Continued the development of new formulations adjusted for agent, material substrate, and environment; combined with optimized application systems and initiated additional efforts based on the results of the dial-a-decon analysis of alternatives.  Continued coatings efforts to examine durable and temporary coatings that pursue reactive and barrier options and initiated efforts based on the results of the coatings analysis of alternatives.  Continued development of delivery and application methods on decontamination efficacy on complex surfaces.  Continued to develop decontamination assurance sprays for biological agents and other agents of interest.  Continued development of enzymes for sensitive equipment\/platform decontamination.  Investigated technologies to decontaminate spores over a wide area, approaches included looking at germinants paired lytic enzymes, directed energy, and predatory nematodes.  Demonstrated the ability of technologies to decontaminate spores in complex, dirty environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.407"
                                            },
                                            "Text": {
                                                "val": "Focus efforts on the Dial-a-Decon and Enzyme Decon projects.  Investigate non-aqueous formulations and responsive coatings.  Initiate the radiological\/nuclear decontamination\/hazard mitigation effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.293"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.293"
                                            },
                                            "Text": {
                                                "val": "Continue Dial-a-Decon, Wide Area Decon of bacillus anthracis, and sensitive equipment decontamination (enzyme) projects.  Continue non-aqueous formulation investigations and incorporate data gathered from surface science investigations to inform design to initiate development of the next generation of hazard mitigation technologies that include integration of multiple systems to achieve efficacy goals.  Continue responsive coatings project to enhance decontaminability as part of the systems approach to achieving efficacy goals.  Continue the decontamination\/hazard mitigation effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators to provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.533"
                                            },
                                            "Text": {
                                                "val": "Continued development of next generation low burden respirator technology.  Developed and integrated novel seal, anti-fogging, and dual cavity technologies.  Developed a scalable respirator technology to quickly configure to different protective capabilities from air purifying respirator (APR) to self-contained breathing apparatus (SCBA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Focus on special purpose tactical applications for high hazard areas.  Explore configurations that rapidly scale from air purification respirators to closed circuit self-contained briefing apparatus."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.411"
                                            },
                                            "Text": {
                                                "val": "Demonstration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals.  Develop components of a hybrid respirator that can scale between different challenge environments.  Components include nanotechnologies, anti-fogging materials, dynamic response breathing, oxygen storage and CO2 scrubbing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Biosurveillance (BSV)"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.102"
                                            },
                                            "Text": {
                                                "val": "Completed effort on biosurveillance data stream evaluation and analysis to identify most useful biosurveillance data streams for prediction and early warning and leverage this research for Biosurveillance (BSV) Ecosystem effort.  Completed effort to devise a structured, outside continental U.S. (OCONUS) expansion roadmap for agent-based epidemiological models and continued to increase OCONUS analytic capability through targeted areas.  Leveraged this research for BSV Ecosystem effort.  Advanced research into data integration platforms through the BSV Ecosystem effort.  Developed approaches for unique and emerging data collection, aggregation and provision of human, vector and animal\/zoonotic health surveillance data.  Developed algorithms, verification, and validation for these data feeds to synthesize and interrogate multiple sources of data to provide high confidence in the prediction, early warning and forecasting (inclusive of mitigation strategies) of infectious disease outbreaks.  Leveraged biosurveillance and point of need diagnostic efforts to support in-context, rapid detection, identification and response capabilities on the global scale through integrated access via the BSV Ecosystem."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.694"
                                            },
                                            "Text": {
                                                "val": "Complete efforts using social media to infer individual and collective health behavior for digital threat surveillance, epidemic planning and response.  Complete effort to develop a flexible set of data driven models that dynamically assesses the socio-economic response to the spread of disease and, in turn, the effect of that response on disease spread.  Complete efforts to refine technology and implement standards to enable diagnostic device to cloud communications in order to fully leverage biosurveillance and point of need diagnostic efforts.  Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench.  Continue effort to develop a trust filter for next generation data sources to be included in biosurveillance analytic capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.983"
                                            },
                                            "Text": {
                                                "val": "Complete effort to develop a trust filter for next generation data sources to be included in biosurveillance analytic capabilities of the BSV Ecosystem.  Initiate effort to explore next generation device-to-cloud capabilities and possible applications for biosurveillance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Detection"
                                    },
                                    "Description": {
                                        "val": "Emphasis on the detection and identification of chemical and biological threats.  Objectives include the development of miniaturized detector for sensing of chemical and biological agents, design for prototype whole pathogen genome sequencing system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.295"
                                            },
                                            "Text": {
                                                "val": "Continued integration studies for Next Generation Chemical Detector (NGCD) based on Micro Electro-Mechanical Systems (MEMS) components for Gas Chromatography (GC) and Mass Spectrometry (MS).  Continued algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.809"
                                            },
                                            "Text": {
                                                "val": "Continue integration studies for Next Generation Chemical Detector (NGCD) based on Micro Electro-Mechanical Systems components for Gas Chromatography and Mass Spectrometry.  Continue algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets.  Initiate concept and technology development for biological threat early warning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.200"
                                            },
                                            "Text": {
                                                "val": "Continue algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets.  Continue concept and technology development for biological threat early warning detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop capability for predicting the source term of releases of chemical, biological, and industrial materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.073"
                                            },
                                            "Text": {
                                                "val": "Continued development of waterborne inverse transport modeling capability in conjunction with the verification and validation effort for waterborne transport models.  Continued interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Initiated verification and validation of interior building transport and dispersion models.  Continued development of a generalized capability for virtual test and evaluation for evaluating\/stressing source characterization and hazard refinement techniques.  Developed and conducted verification and validation on modules emulating a variety of sensors and solid sorbent tubes.  Initiated efforts to work on advancing the urban modeling capability and optimizing the urban sub-system for interfacing transport models of varying fidelity and speed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.931"
                                            },
                                            "Text": {
                                                "val": "Continue development of next-generation waterborne transport models in conjunction with related validation and verification efforts.  Continue interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Complete initial verification and validation of interior building transport and dispersion models.  Continue development of a generalized capability for virtual test and evaluation for evaluating\/stressing source characterization and hazard refinement techniques.  Focus on bridging the gap between meso- and micro-scale turbulence simulations.  Continue advancing the urban modeling capability and optimizing the urban sub-system for interfacing transport models of varying fidelity and speed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.907"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.907"
                                            },
                                            "Text": {
                                                "val": "Complete development of waterborne transport and dispersion models, including advancements to the Incident Command Tool for Drinking Water Protection (ICWater), System for Hazard Assessment of Released Chemicals (SHARC), and associated documentation.  Continue related field studies to validate waterborne transport and dispersion model outputs.  Continue interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Continue high-resolution and probabilistic meteorology research, incremental numerical weather prediction system upgrades, and provide operational support for the Environmental Data Enterprise (EDE).  Initiate work to optimize the urban subsystem modeling capability and develop capability to perform linked Bayesian and increase the fidelity of source term estimation in urban environments.  Continue development of MicroSWIFT\/SPRAY (MSS) to improve hazard prediction in urban environments in Hazard Prediction and Assessment Capability (HPAC).  Continue advancing the urban modeling capability and optimizing the urban sub-system for interfacing transport models of varying fidelity and speed.  Continue research and development to enhance the fidelity of the missile intercept modeling capability within the HPAC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools.  Develop chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.883"
                                            },
                                            "Text": {
                                                "val": "Begin initial chapter development of the Chemical and Biological Agent Effects Manual Number 1.  Initiate field trial data source transport and dispersion community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.353"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.353"
                                            },
                                            "Text": {
                                                "val": "Continue providing access of field trial data sources to transport and dispersion community.  Continue to develop additional chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1).  Draft chapters to be completed include Chapter 12 - Human Factors, Chapter 8 - Structures\/Site Characteristics.  Continue work drafting Chapter 13 - Consequence Assessment and Chapter 15 - Battlespace Management.  Begin work on Chapter 14 - Consequence Management, Chapter 18 - Material Effects, Chapter 19 - Mission Effects, and Chapter 20 - Risk Assessment.  Much of the efforts to become more mature and transition to CB3."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.736"
                                            },
                                            "Text": {
                                                "val": "Continued to develop additional chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations.  Initiated new chapters related to consequence assessment and site characteristics.  Completed study on animal and human effects from time-varying toxic industrial chemical concentration exposures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Operational Effects & Planning"
                                    },
                                    "Description": {
                                        "val": "Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and impacts of CBRN incidents on decision making.  Focus areas include consequence management, population modeling, and human knowledge management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.412"
                                            },
                                            "Text": {
                                                "val": "Continued operational effects research and analysis efforts to provide the CBDP with objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting.  Continued system performance model integration and advanced development for program-wide exploitation.  Initiated operational effects risk management framework development to inform service-specific analyses and decision-makers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.373"
                                            },
                                            "Text": {
                                                "val": "Continue system performance model integration and advanced development for program-wide exploitation for collective and individual protection and contamination avoidance.  Continue operational effects risk management framework development to inform service-specific analyses and decision-makers.  Initiate Decision Support Tool to address Joint Operations Effects requirements and CBDP directed risk-based planning and decision making.  The Decision Support Tools will also address the needs of the Operational Test Agencies (OTAs) infrastructure requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.026"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.026"
                                            },
                                            "Text": {
                                                "val": "Continue system performance model integration and advanced development for program-wide exploitation for collective and individual protection and contamination avoidance.  Initiate health and human effects modeling capability for expanded threat list.  Continued operational effects research and analysis efforts, previously referred to as Decision Support Tool, to provide the CBDP with objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Filtration"
                                    },
                                    "Description": {
                                        "val": "Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals (TICs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Text": {
                                                "val": "Continued development of next generation filtration technology.  Continued focus on low resistance\/low profile novel filter media with augmented performance against TICs and chemical agents.  Continued to replace legacy filter media with novel media that offers broad spectrum protection.  Continued with technology areas to include: metal organic frameworks, novel adsorbents and reactive hybrids and transitioned these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.943"
                                            },
                                            "Text": {
                                                "val": "Transition a synthetic nano-structured material focused on toxic industrial chemical removal, including ammonia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Lightweight Integrated Fabric"
                                    },
                                    "Description": {
                                        "val": "Development of lightweight chemical and biological protective textiles that can be used as an integrated combat duty uniform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.538"
                                            },
                                            "Text": {
                                                "val": "Continued to develop new low burden fabrics and ensemble designs to support the Uniform Integrated Protective Ensemble (UIPE) programs with a focus on whole system assessments.  Continued with development areas that include: evaluation of superoleophobic materials, refinement of \"man in simulant test\" sensors, continuation of aerosol system testing, advanced adsorbent nanofiber\/textile production technology, and smart materials.  Continued exploring multifunctional material design and synthesis to identify dynamic materials that integrate functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Continued exploring integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that sense, transduce, respond and mitigate threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.315"
                                            },
                                            "Text": {
                                                "val": "Transition new low burden fabrics and ensemble designs to the UIPE programs.  Complete development areas that include: evaluation of materials with high resistance to organic compounds, refinement of \"man in simulant test\" sensors, aerosol system testing, advanced adsorbent nanofiber\/textile production technology, and smart materials.  Transition materials that integrate functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Conduct a demonstration of new fabric technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Personnel Decontamination"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to alleviate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical, biological, and radiological agents by neutralizing and\/or physically removing the residual chemical, biological, and radiological agents."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.478"
                                            },
                                            "Text": {
                                                "val": "Initiate Personnel Decontamination hazard mitigation projects to decontaminate individual human remains and manage personal effects following exposure to CWAs\/NTAs\/TICS\/TIMs (Chemical Warfare Agents\/Non-Traditional Agents\/Toxic Industrial Chemicals\/Toxic Industrial Materials).  Determine the fate and residual hazard of chemical, biological, and radiological warfare agents (CBRs) on contaminated human remains and personal effects; develop technological options to remove\/neutralize CBR hazards from individual human remains and personal effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.172"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.172"
                                            },
                                            "Text": {
                                                "val": "Develop both force protection and situational awareness through the improvement of multi-functional materials that exhibit broad-reaching, cross-cutting capabilities in chemical\/biological sensing and detoxification.  Validate response mechanisms of dynamic materials that conform to the challenge amount."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their chemical warfare agent (CWA) filters."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.941"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.941"
                                            },
                                            "Text": {
                                                "val": "Finalize component design and begin verification testing of a satellite filter cartridge system that will be investigated into a field application for long term exposure in an operationally relevant environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Supports defensive countermeasure development against current and emerging chemical and biological threats by delivering the scientific understanding and relevant estimates of the hazards posed to humans by exposure to chemical or biological agents.  Toxicological and\/or infectious-dose information and environmental response supports development and\/or enhancing both operational risk and exposure guidelines; limits for detection and protection; goals for decontamination; and medical countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.693"
                                            },
                                            "Text": {
                                                "val": "Continued investigations that describe fundamental mechanisms that contribute to biological agent persistence and transport in the environment.  Continue effort to define particle properties and predict aerosolization behavior to inform hazard assessment.  Studied biological modulation in natural or laboratory environments through genetic drift to inform forensic examination of threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.440"
                                            },
                                            "Text": {
                                                "val": "Continue to define particle properties and predict aerosolization behavior to inform hazard assessment.  Move towards methods for rapid prediction of agent-substrate interactions\/including correlation of agent physical properties.  Develop models for absorption, distribution, metabolism, and excretion and toxicology (ADMET) for understanding operationally relevant exposure effects and use in building predictive toxicology capabilities.  Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, etc)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.845"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.845"
                                            },
                                            "Text": {
                                                "val": "Continue to define particle and agent properties and predict aerosolization behavior to inform hazard assessment.  Continue developing methods to facilitate rapid prediction of agent-substrate interactions\/ including correlation of physical agent properties.  Continue assessing the impact of environmental factors on threat agent activity (pyrotechnic dissemination, persistence, transport, degradation, resuspension, etc).  Continue developing ADMET models of physiological response to agent and predictive toxicology capabilities.  Characterize priority emerging chemical and biological threats to provide critical agent parameters to decision makers and technology developers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "19.317"
                                        },
                                        "CurrentYear": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.062"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.062"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.676"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.982"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.577"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.698"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "65.230"
                        },
                        "CurrentYear": {
                            "val": "71.534"
                        },
                        "BudgetYearOne": {
                            "val": "67.047"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.047"
                        },
                        "BudgetYearTwo": {
                            "val": "70.538"
                        },
                        "BudgetYearThree": {
                            "val": "73.984"
                        },
                        "BudgetYearFour": {
                            "val": "72.124"
                        },
                        "BudgetYearFive": {
                            "val": "72.677"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT2 provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs).  This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to counter emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination, information systems and modeling and simulation, and medical countermeasures.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of decontamination technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.517"
                                            },
                                            "Text": {
                                                "val": "Initiate development of decontamination technologies against NTAs.  Continued to develop decontamination technologies and formulations that are optimized against NTAs.  Continued to develop, demonstrate, and transition enzyme technology for low-impact decon of NTAs.  Continued to integrate with the Decontamination Family-of-Systems effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.348"
                                            },
                                            "Text": {
                                                "val": "Continue to assess performance and unique aspects of full spectrum of NTAs and develop technologies to optimize performance against NTAs.  This includes the investigation and analysis of additional categories of emerging threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.608"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.608"
                                            },
                                            "Text": {
                                                "val": "Integrate NTAs, including newly identified emerging threats into the continuing Dial-a-Decon, sensitive equipment decontamination (enzyme) projects, responsive coatings, multiple system integration, and the full hazard mitigation technology development portfolio."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to alleviate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.529"
                                            },
                                            "Text": {
                                                "val": "Transition Human Remains storage data to the Family-of-Systems.  Initiate Personnel Decontamination hazard mitigation projects to develop an alternative to RSDL (Reactive Skin Decontamination Lotion).  Initiate mass casualty Personnel Decontamination projects to develop technology to manage the specific issues (through put and efficacy) associated with mass casualty decontamination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Chemical Diagnostics - Medical"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods to detect exposure to non-traditional agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker.  Supports the analytics for traditional agent diagnostics and hand-held diagnostic technologies that might be applied to NTA diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.916"
                                            },
                                            "Text": {
                                                "val": "Identified potential biomarkers that may pre-symptomatically diagnose NTA exposure.  Developed initial methods for identification and validation of NTAs in clinical samples for additional compounds of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.384"
                                            },
                                            "Text": {
                                                "val": "Expand NTA biomarker discovery for additional compounds.  Continue method development for identification and validation of NTAs in clinical samples for additional compounds of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.291"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.291"
                                            },
                                            "Text": {
                                                "val": "Continue to expand NTA biomarkers for additional compounds.  Optimize method development for identification and validation of NTAs in clinical samples for additional compounds of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Chemical Pretreatments - Medical"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.893"
                                            },
                                            "Text": {
                                                "val": "Continued studies to develop new catalytic bioscavengers for Non-Traditional Agent (NTA) exposure.  Pursued development of small molecule pretreatments against NTA exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.093"
                                            },
                                            "Text": {
                                                "val": "Continue studies to develop catalytic bioscavenger for NTA exposure.  Continue development of small molecule pretreatments with high catalytic efficiency against NTA exposure"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.491"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.491"
                                            },
                                            "Text": {
                                                "val": "Continue focused studies to identify lead catalytic bioscavenger candidates against NTA exposure in validated animal models.  Support development of a catalytic bioscavenger cocktail effective against multiple NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Chemical Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury.  Determines the toxic effects of agents by probable routes of field exposure, as well as standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanism(s) of toxicity.  Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to Non-Traditional Agents (NTA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.893"
                                            },
                                            "Text": {
                                                "val": "Continued investigation of advanced and emerging threats including mechanism of action and toxicity, and continued search for effective countermeasures.  Developed centrally active novel therapeutic compounds that cross the blood brain barrier.  Limited screening of currently licensed Food and Drug Administration (FDA) approved countermeasures to determine potential efficacy against other classes of NTAs.  Pursued absorption, distribution, metabolism and excretion studies to further elucidate agent effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.679"
                                            },
                                            "Text": {
                                                "val": "Continue to develop centrally acting novel therapeutic compounds that cross the blood brain barrier.  Continue to screen currently licensed FDA approved countermeasures to determine potential efficacy against other classes of NTAs.  Initiating research projects at the Absorption, Distribution, Metabolism and Excretion (ADME) Research Center of Excellence, with Tier 0, 1 and 2 assay potential at DoD Laboratories as a core program capability and to use to improve agent cellular and mechanistic effects understanding and facilitate countermeasure development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.492"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.492"
                                            },
                                            "Text": {
                                                "val": "Continue optimizing centrally acting novel therapeutic compounds that cross the blood brain barrier.  Investigate identified licensed FDA approved countermeasures for potential efficacy against other classes of NTAs for potential Emergency Use Authorization (EUA).  Continue research projects at the ADME Research Center of Excellence that improves Medical Countermeasure (MCM) profile understanding that will facilitate development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Detection"
                                    },
                                    "Description": {
                                        "val": "Primary focus is to assess the potential of multiple technologies to meet the needs to detect the presence of NTAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.058"
                                            },
                                            "Text": {
                                                "val": "Completed and demonstrated feasibility development of plant sentinel concept.  Continued development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Continued integration studies for chemical aerosol detection into the Next Generation Chemical Detector (NGCD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.267"
                                            },
                                            "Text": {
                                                "val": "Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Complete integration studies for chemical aerosol detection into the Next Generation Chemical Detector (NGCD) MS B.  Initiate concept and technology development for chemical threat early warning detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.623"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.623"
                                            },
                                            "Text": {
                                                "val": "Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Continue concept and technology development for chemical threat early warning detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction.  Develop NTA source term algorithms for predicting chemical hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.138"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of data resulting from experimentation phase of small-scale testing for NTA simulants for use in creating and verifying NTA source terms, for defense against CBRN hazards.  Continue to develop new NTA source term models and flexible NTA scenario models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.849"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of data resulting from small-scale testing of NTA simulants and continue test execution.  Continue sensitivity and validation studies on NTA source term models and update and expand NTA databases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction.  Develop NTA source term algorithms for predicting CBRN hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.375"
                                            },
                                            "Text": {
                                                "val": "Completed experimentation phase of small scale testing for NTA simulants for use in creating and verifying NTA modeling source terms, for defense against CBRN hazards.  Continued to develop new NTA source term scenario models and flexible scenario NTA scenario models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Air Purification"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of filter technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.878"
                                            },
                                            "Text": {
                                                "val": "Continued development and testing of novel materials to improve performance against NTAs.  Replaced legacy filter media with novel media that offers broad spectrum NTA protection.  Continued with technology areas that include: crystalline nano-porous framework materials, novel adsorbents, catalytic, nano-fibrous, composite materials and reactive hybrids.  Transitioned these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.406"
                                            },
                                            "Text": {
                                                "val": "Assess performance of novel adsorbents and develop specific functionalities of absorbents on NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Respirator"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air purifying respirators to provide enhanced protection against NTAs with lower physical burden and improved interface with mission equipment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.123"
                                            },
                                            "Text": {
                                                "val": "Continue the development and integration of novel seal, anti-fogging, and dual cavity technologies to protect against NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.028"
                                            },
                                            "Text": {
                                                "val": "Continued development of low burden technologies to improve overall protective clothing performance against NTAs leading toward verification, demonstration and transition.  Developed treatments that allow fabrics to protect and reduce the penetration of NTAs and increase the useful life of protective garments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.521"
                                            },
                                            "Text": {
                                                "val": "Assess and optimize technologies to improve whole system performance against NTAs.  The whole system performance includes the integration of the percutaneous protection with the respiratory protection, as well as effectiveness of the closures between the components of protective equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Provide enabling science and technology on current and emerging threat agents to prepare for surprise which informs development and testing of NTA defense technology such as detection, decontamination, protection, hazard assessment, and more.  This preliminary assessment of new threats informs decision makers and provides the basis for all countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.672"
                                            },
                                            "Text": {
                                                "val": "Continued assessment of priority classes of novel threat agents providing operationally relevant exposure limits using an integrated systems toxicology approach.  Defined critical physical-chemical properties and characterized\/predicted agent reactivity and interactions with environmental substrates.  Provided supportable knowledge, enabling countermeasure development and testing and informed concept of operations policies, doctrines and procedures.  Moved towards in-silico efforts to characterize threat agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.601"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize the synthesis and physico-chemical properties of priority NTAs (informed by intelligence assessments and program requirements).  Continue preparing toxicity estimates for next priority NTAs.  Refine and deliver human toxicity estimates for next priority NTAs.  Provide supportable data to enable countermeasure development and testing as well as inform concept of operations (CONOPs), policies, doctrines and procedures.  Continue to develop in-silico platforms for predicting human ADMET of threat agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.164"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.164"
                                            },
                                            "Text": {
                                                "val": "Provide supportable data to enable countermeasure development and testing as well as inform concept of operations (CONOPs), policies, doctrines and procedures.  Continue to characterize the synthesis and physico-chemical properties of priority NTAs (informed by intelligence assessments and program requirements).  Continue preparing laboratory and operational toxicity estimates for next priority NTAs.  Refine and deliver human toxicity estimates for next priority NTAs.  Continue to develop in-silico platforms for predicting human ADMET of threat agents.  Characterize priority emerging threats, including those areas where the threats converge, to provide critical agent parameters to decision makers and technology developers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.974"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.423"
                                        },
                                        "CurrentYear": {
                                            "val": "21.574"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.948"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.948"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.392"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.129"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.603"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.759"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "85.828"
                        },
                        "CurrentYear": {
                            "val": "100.722"
                        },
                        "BudgetYearOne": {
                            "val": "88.933"
                        },
                        "BudgetYearOneBase": {
                            "val": "88.933"
                        },
                        "BudgetYearTwo": {
                            "val": "80.082"
                        },
                        "BudgetYearThree": {
                            "val": "82.046"
                        },
                        "BudgetYearFour": {
                            "val": "85.283"
                        },
                        "BudgetYearFive": {
                            "val": "85.795"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM2 provides for applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to all three of radiological, chemical and biological threat agents.  Categories for this project include core science efforts in Medical Chemical, Medical Biological, Diagnostics, and the Medical Countermeasures Initiative (MCMI).  Against radiological threats, this project provides investment for the development of pretreatments (prophylaxis) and post-irradiation therapeutics against radiological\/nuclear exposure.  Against chemical and biological agents, this project funds applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents.  Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents.  Diagnostic research focuses on providing high quality data closer to the point-of-need comprising devise innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools.  \n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advanced development and flexible manufacturing capabilities, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the Warfighter and national security needs.  MCMI efforts within science and technology (S&T) are concentrated in advancing two areas: 1) regulatory science and 2) flexible manufacturing technologies and processes for MCMs.  Efforts conducted in these areas are enablers supporting the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools.  The Chem Bio Defense Program partners with civil agencies and DoD agencies to provide near real-time information and provide USG-wide situational awareness, yielding analytical and predictive capabilities for DoD decision makers including Combatant Commanders."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.603"
                                            },
                                            "Text": {
                                                "val": "Complete effort to develop a flexible set of data driven models that dynamically assesses the socio-economic response to the spread of disease and, in turn, the effect of that response on disease spread.  Complete efforts to refine technology to enable device to cloud communications in order to fully leverage biosurveillance and point of need diagnostic efforts.  Continue the development of the BSV Ecosystem to include analyst collaboration tools and advanced analytics.  Initiate various biosurveillance analytic capabilities, including real-time influence forecasting, agricultural animal population database for zoonotic disease analysis, an online crowdsourcing game for bacterial genome assembly to enhance rapid pathogen discovery and identification, biosurveillance analysis using clinical diagnoses and social media indicators in military populations, capability to assess the risk of disease spread to the United States, a data-driven framework for zoonotic disease prediction, biosurveillance visualization capabilities, a Global Rapid Identification Tool for diagnosing infectious disease bioevents, and a biosurveillance analytics verification and validation capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench.  Continue various biosurveillance analytic capabilities, including real-time influence forecasting, agricultural animal population database for zoonotic disease analysis, an online crowdsourcing game for bacterial genome assembly to enhance rapid pathogen discovery and identification, biosurveillance analysis using clinical diagnoses and social media indicators in military populations, capability to assess the risk of disease spread to the United States, a data-driven framework for zoonotic disease prediction, biosurveillance visualization capabilities, and a Global Rapid Identification Tool for diagnosing infectious disease bioevents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chemical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) or radiological agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.577"
                                            },
                                            "Text": {
                                                "val": "Developed first series of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets.  Transitioned initial Non Traditional Agents (NTA) detection methods and protocols for selected compounds.  Identified generic long-term ion-based markers of nerve agent exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.845"
                                            },
                                            "Text": {
                                                "val": "Continue development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for second series of compounds.  Complete final stability tests and transition Forensic Liquid Analysis Kit (FLAK) to partners.  Expand the discovery for generic long-term ion-based markers of nerve agent exposure and develop confirmatory assays using previously discovered markers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Continue development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds.  Continue developing confirmatory assays for discovered markers and initiate assay verification studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Focuses on in-vitro assay development for viral vaccines."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Develop in-vitro assays for Western, Eastern, and Venezuelan Equine Encephalitis (VEE) virus vaccines.  Develop in-vitro assays for VEE virus protease activity and structure based discovery of viral protease inhibitors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents, whether known or emerging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.153"
                                            },
                                            "Text": {
                                                "val": "Optimized processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Matured pipeline of genomics, proteomics, systems biology, and bioinformatics tools and methods to simultaneously support diagnostic tests, the development of MCMs and the analytic processes required to identify known, emerging, and re-emerging pathogens.  Developed nanomaterial structure designs to enable companion diagnostics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.987"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Continue to develop nanomaterial structure designs to enable companion diagnostics.  Continue testing a method and develop a prototype for transport of biothreat agents in clinical and environmental samples from field to laboratory."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.364"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.364"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Continue to develop nanomaterial structure designs to enable companion diagnostics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Next Generation Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.116"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and mature point of need diagnostic platform technologies with orthogonal capabilities.  Initiated development of a multiplexed point of care diagnostic platform for detection of biothreat agent exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.956"
                                            },
                                            "Text": {
                                                "val": "Expand multiplexed point of need diagnostic platform technologies into syndromic-based panels.  Begin transition of candidate diagnostic technologies to Next Generation Diagnostic Systems, Increment 2.  Develop and evaluate candidate host biomarker diagnostic targets in analytical test environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.050"
                                            },
                                            "Text": {
                                                "val": "Continue development of multiplexed point of need diagnostic platform technologies into syndromic-based panels.  Continue transition of candidate diagnostic technologies to Next Generation Diagnostic Systems, Increment 2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "Integrate the regulatory science and manufacturing technologies and processes developed into the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) as enablers of the advanced development and flexible manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.757"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate organotypic platforms for MCM evaluation: (ex-vivo heart, liver, kidney, alveolar lung sacs, and blood-brain barrier) with the goal of accelerating and enhancing the FDA-regulated medicinal product development process.  Constructed next generation high yield protein expression platforms for biotechnology-based MCMs.  Completed development of high capacity downstream technologies and process analytic technologies to enhance rapid manufacturing process development and control with the goal of accelerating the manufacturing of biotechnology-based MCMs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.847"
                                            },
                                            "Text": {
                                                "val": "Continue one project to investigate organotypic platforms for MCM evaluation: (ex-vivo heart, liver, kidney, lung, or blood-brain barrier) with the goal of accelerating and enhancing the FDA-regulated medicinal product development process.  Construct one next generation high-yield protein-expression platforms for biotechnology-based MCMs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.679"
                                            },
                                            "Text": {
                                                "val": "Ending one project to investigate organotypic platforms for MCM evaluation, demonstrating the integration of 3-4 different organoids on a chip.  Evaluate novel conjugation approaches for polysaccharide based vaccines.  Technology transfer process development and manufacturing activities to long-term partner for Advanced Development Manufacturing capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Viral\/Bacterial\/Toxins Vaccines"
                                    },
                                    "Description": {
                                        "val": "Generate novel or improved vaccines against viral, bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.897"
                                            },
                                            "Text": {
                                                "val": "Continued refining appropriate animal models for aerosolized Burkholderia mallei and pseudomallei as well as Type A Francisella tularensis with regulatory guidance.  Continued preparing and evaluating multiple novel subunit and nanoparticle Burkholderia vaccine candidates in small or large animal models with and without adjuvants.  Continued defining predictive value of correlates of immunity, elicited by Burkholderia species vaccine candidates.  Continued evaluating the tolerability of novel adjuvants using the Anthrax vaccine for proof of concept.  Additionally, continued research to produce vaccine candidates designed to protect against emerging or genetically engineered Anthrax strains.  Prepared multiple novel subunit and nanoparticle vaccine candidates for protection against aerosolized Type A Francisella tularensis infection in appropriate small and large animal models.  Accelerated filovirus vaccine candidate in response to the West Africa Ebola outbreak."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.278"
                                            },
                                            "Text": {
                                                "val": "Continue the most promising in-progress animal model development projects to be refined with regulatory guidance, including animal models for aerosolized Burkholderia mallei, pseudomallei and Type A Francisella tularensis.  Novel subunit Burkholderia vaccine candidates in small or large animal models will be evaluated with and without adjuvants.  A selection of correlates of immunity elicited by Burkholderia species infection may be evaluated for predictive value.  The most promising vaccine candidates designed to protect against genetically engineered Anthrax strains will be tested for safety and efficacy in non-human primates.  Tested novel subunit vaccine candidates for protection against aerosolized Type A Francisella tularensis infection in appropriate small animal models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.682"
                                            },
                                            "Text": {
                                                "val": "Animal model development projects will be refined with regulatory guidance, including animal models for aerosolized Burkholderia mallei and B.  pseudomallei.  Evaluate candidate Burkholderia vaccines in small and large animal models.  Assess correlates of immunity elicited by Burkholderia and Coxiella species.  Test promising vaccine candidates designed to protect against genetically engineered Anthrax strains for safety and efficacy in non-human primates.  Continue testing of vaccine candidates for protection against aerosolized Type A Francisella tularensis infection and initiate alternative candidate vaccine.  Expand to two approaches for Q Fever vaccines.  Develop and evaluate bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates.  Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.618"
                                            },
                                            "Text": {
                                                "val": "Utilized relevant animal models for the evaluation of the immune response to novel multi-antigen platforms.  Further refined the capabilities of the surrogate human immune system, MIMIC, which provides an in vitro assessment of the human immune response.  Continued studies designed to lend regulatory credence to functional assays on the MIMIC to evaluate cross-reactivity of different Filovirus and Alphavirus strains.  Increased efforts to develop methodologies which remove the need for cold storage and transport for vaccines and render them stable in variable and extreme temperatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Use relevant small animal models for the evaluation of the immune response to novel multi-antigen platforms.  Explore continued improvements to viral vectors and DNA vaccine platform technologies.  Further refine, using 1-2 small studies, the capabilities of the surrogate human immune system, MIMIC, which provides an in vitro assessment of the human immune response.  Development novel synthetic molecules as pretreatments in pertinent animal models against relevant targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.741"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.741"
                                            },
                                            "Text": {
                                                "val": "Maintain studies that utilize clinical samples from Filovirus outbreaks in multiple international locations to refine definition of clinically relevant correlates of immunity.  Initiate novel adjuvants as platforms for utilization in biodefense vaccines.  Develop and evaluate bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.938"
                                            },
                                            "Text": {
                                                "val": "Conducted structure-based drug discovery for Alphaviruses.  Developed antibody-based therapeutics for Filovirus infections.  Identified and evaluated novel broad-spectrum host and pathogen directed small molecule therapeutics for emerging infectious diseases (i.e. Alphavirus, Filovirus, Flavivirus, Arenavirus, Bunyavirus)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA-approved drugs for potential repurposing as effective antivirals.  Evaluate novel antibody-based therapeutics for Filovirus infections.  Identify and evaluate novel pathogen-directed therapeutics for Alphaviruses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA-approved drugs for potential repurposing as effective antivirals.  Continue to evaluate novel antibody-based therapeutics for Filovirus infections.  Continue identification and evaluation of novel pathogen-directed therapeutics for Filoviruses and Alphaviruses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.512"
                                            },
                                            "Text": {
                                                "val": "Maintained FDA approved drug screening program for Burkholderia, Francisella tularensis and determined in vitro susceptibilities.  Continued evaluation of novel compounds against bacterial biological warfare agents.  Evaluated bioactive peptides for the ability to stimulate host protective pathways.  Identified and designed new small molecule inhibitors bacterial folate biosynthesis.  Evaluated multidrug efflux systems as a target for broad-spectrum antibacterial development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.112"
                                            },
                                            "Text": {
                                                "val": "Maintain FDA approved drug screening programs for Burkholderia, Francisella tularensis and determine in vitro susceptibilities.  Refocus program on later stage optimization and testing of novel inhibitors of bacterial biological warfare agents, reducing efforts in discovery and addressing a limited number of priority pathogens."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.422"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.422"
                                            },
                                            "Text": {
                                                "val": "Augment FDA approved and late stage development drug screening programs for BWA and determine in vitro susceptibilities.  Evaluate reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates.  Evaluate efficacy of bioactive peptides for the ability to stimulate host protective pathways in mouse models.  Identify and validate novel targets and initiate small molecule screening for inhibitors.  Develop alternative animal models to evaluate efficacy of candidates against otherwise nonpathogenic Multi-Drug Resistant (MDR) BW surrogate strains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.493"
                                            },
                                            "Text": {
                                                "val": "Continued to characterize host proteins that interact with Botulinum Neurotoxin Progenitor (BoNT) and identify small molecule inhibitors preventing host-toxin interactions.  Continued to validate differential expression of host genes involved in neuron response to BoNT intoxication.  Continued to identify and develop therapies that target host proteins involved in BoNT persistence in the neuron.  Continued co-crystallization studies of BoNT-inhibitor complexes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize BoNT small molecule inhibitors in vitro.  Continue co-crystallization studies of BoNT-inhibitor complexes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize BoNT small molecule inhibitors in vitro.  Continue co-crystallization studies of BoNT-inhibitor complexes.  Initiate evaluation of late development and FDA approved drugs for treatment of staphylococcal enterotoxin B intoxication."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Pretreatments, Nerve Agents"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments that provide protection against all organophosphorous nerve agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high enzymatic efficiency for the destruction of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.446"
                                            },
                                            "Text": {
                                                "val": "Continued search for catalytic bioscavenger of V-type nerve agents.  Continued studies to develop a broad spectrum regimen of V- and G-type nerve agent catalytic bioscavengers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.105"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts to develop effective bioscavengers (stoichiometric and catalytic).  Continue development of broad spectrum regimen of catalytic bioscavengers effective against multiple nerve agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.014"
                                            },
                                            "Text": {
                                                "val": "Realign efforts to emphasize catalytic bioscavengers.  Select promising G-type nerve agent catalytic bioscavengers candidates to humanize.  Continue developing V-type nerve agent catalytic bioscavenger, and a regimen of catalytic bioscavengers effective against multiple nerve agents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to CWAs.  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  This work is designed to develop potential candidates that will ultimately be submitted for Food and Drug Administration (FDA) licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.321"
                                            },
                                            "Text": {
                                                "val": "Continued investigations of potential for broad spectrum\/centrally active cholinesterase reactivators.  Continued studies to facilitate therapeutics crossing the blood brain barrier.  Explored molecular, nanomaterial-based drug delivery platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.473"
                                            },
                                            "Text": {
                                                "val": "Formal data package will transfer to advanced development for scopolamine as an adjunct therapeutic.  Continue to reduce the scope of development of technology to facilitate delivery of therapeutic regimen to the central nervous system (crossing the blood brain barrier).  Explore molecular, nanomaterial-based drug delivery platforms.  Continue to investigate the potential for broad spectrum\/centrally acting cholinesterase reactivators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.881"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.881"
                                            },
                                            "Text": {
                                                "val": "Continue focus on refined technology that facilitates delivery of therapeutic regimen to the central nervous system (crossing the blood brain barrier).  Select promising molecular, nanomaterial-based drug delivery platforms for further development.  Continue supporting the development and screening for new potential leads as broad spectrum\/centrally acting cholinesterase reactivators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.516"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "93.949"
                                        },
                                        "CurrentYear": {
                                            "val": "110.310"
                                        },
                                        "BudgetYearOne": {
                                            "val": "93.725"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "93.725"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "96.359"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.445"
                                        },
                                        "BudgetYearFour": {
                                            "val": "96.329"
                                        },
                                        "BudgetYearFive": {
                                            "val": "98.080"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "132.696"
                                        },
                                        "CurrentYear": {
                                            "val": "106.380"
                                        },
                                        "BudgetYearOne": {
                                            "val": "81.916"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "81.916"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.207"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.642"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.949"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.710"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.970"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "253.748"
                                        },
                                        "CurrentYear": {
                                            "val": "179.497"
                                        },
                                        "BudgetYearOne": {
                                            "val": "117.881"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "117.881"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "170.122"
                                        },
                                        "BudgetYearThree": {
                                            "val": "209.182"
                                        },
                                        "BudgetYearFour": {
                                            "val": "215.905"
                                        },
                                        "BudgetYearFive": {
                                            "val": "208.482"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.973"
                                        },
                                        "CurrentYear": {
                                            "val": "48.529"
                                        },
                                        "BudgetYearOne": {
                                            "val": "42.913"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "42.913"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.322"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.153"
                                        },
                                        "BudgetYearFour": {
                                            "val": "25.158"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.371"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.493"
                                        },
                                        "CurrentYear": {
                                            "val": "13.414"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.801"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.801"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.420"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.137"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.943"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.496"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}