{
    "id": "e855b56e47bfe1bfe89c29dac1a1e335670c3fb2",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research Initiative"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "134.637"
            },
            "PriorYear": {
                "val": "44.783"
            },
            "CurrentYear": {
                "val": "37.778"
            },
            "BudgetYearOne": {
                "val": "38.436"
            },
            "BudgetYearOneBase": {
                "val": "38.436"
            },
            "BudgetYearTwo": {
                "val": "38.783"
            },
            "BudgetYearThree": {
                "val": "39.463"
            },
            "BudgetYearFour": {
                "val": "40.134"
            },
            "BudgetYearFive": {
                "val": "40.937"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Defense Threat Reduction Agency (DTRA) is to safeguard the United States and its allies from global weapons of mass destruction (WMD) threats by integrating, synchronizing, and providing responsive expertise, technologies, and capabilities.  This mission directly aligns with several national and Department of Defense (DoD) level guidance\/vision documents.  For Research, Development, Test & Evaluation (RDT&E), these documents include the National Security Strategy, Defense Strategic Guidance (Sustaining U.S. Global Leadership: Priorities for 21st Century Defense), 2014 Quadrennial Defense Review, National Strategy for Combating Terrorism, National Strategy to Combat WMD, Defense Planning Guidance, Guidance for Employment of the Force, 2014 DoD Strategy for Countering WMD, National Military Strategic Plan for the War on Terrorism, and Joint Strategic Capabilities Plan (including the Nuclear Annex).  To achieve this mission, the DTRA has established strategies and tasks to meet the principal objectives of the above referenced documents.  These objectives are: 1) Ensure a safe, secure, and effective nuclear deterrent; 2) Anticipate emerging WMD threats; 3) Provide Combating WMD situational awareness; 4) Assess infrastructure and personnel vulnerabilities; 5) Prevent proliferation and use of WMD; 6) Defend against WMD threats; 7) Defeat WMD threats; 8) Recover from WMD consequences; and 9) Synchronize countering WMD activities. \n\nThe Basic Research Initiative provides for the discovery and development of fundamental knowledge and understanding by research performers comprised from academia and world-class research institutions in Government and industry.  This leverages the DoD's $2 billion plus annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting WMD-related defense missions and by improving knowledge of research efforts that benefit nonproliferation, counter proliferation, and consequence management efforts.  These efforts are closely coordinated with DTRA’s Chemical and Biological Technologies Department, which executes a chemical\/biological basic research program under DoD’s Chemical and Biological Defense Program.  DTRA’s research interests are coordinated with the Defense Advanced Research Projects Agency and the Services’ basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technological areas which are not clearly addressed by other basic research efforts.\n\nDTRA’s Basic Research portfolio supports several National and DoD initiatives directly related to Countering WMD (CWMD) including: Office of Science and Technology Policy Nuclear Defense Research and Development Roadmap, FY 2013-2017; Defense Budget Priorities and Choices for FY 2014;  Countering Weapons of Mass Destruction Science and Technology Priority Steering Council Roadmap;  2012 Defense Strategic Guidance (Sustaining U.S. Global Leadership: Priorities for 21st Century Defense), and the 2014 Quadrennial Defense Review.  In general, these documents direct capability enhancements, projects, and science and technology (S&T) investments that support CWMD and reduce global nuclear dangers. Specifically they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; enhancing nuclear forensics; securing vulnerable materials; developing new verification technologies; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential foes, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based or inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements.  Basic research supporting all of these needs is included in this program element under Project RU-Fundamental Research for Combating WMD. Details are provided in the R-2a exhibit."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.837"
                },
                "CurrentYear": {
                    "val": "37.778"
                },
                "BudgetYearOne": {
                    "val": "38.436"
                },
                "BudgetYearOneBase": {
                    "val": "38.436"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.783"
                },
                "CurrentYear": {
                    "val": "37.778"
                },
                "BudgetYearOne": {
                    "val": "38.436"
                },
                "BudgetYearOneBase": {
                    "val": "38.436"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.054"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.054"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "134.637"
                        },
                        "PriorYear": {
                            "val": "44.783"
                        },
                        "CurrentYear": {
                            "val": "37.778"
                        },
                        "BudgetYearOne": {
                            "val": "38.436"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.436"
                        },
                        "BudgetYearTwo": {
                            "val": "38.783"
                        },
                        "BudgetYearThree": {
                            "val": "39.463"
                        },
                        "BudgetYearFour": {
                            "val": "40.134"
                        },
                        "BudgetYearFive": {
                            "val": "40.937"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages the Department of Defense's (DoD's) $2 billion plus annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting weapons of mass destruction (WMD) related defense missions and by improving knowledge of research efforts that benefit nonproliferation, counter proliferation, and consequence management efforts.  These efforts are closely coordinated with the DTRA’s Chemical and Biological Technologies Department initiatives which execute a chemical\/biological basic research program under the DoD Chemical and Biological Defense Program.  The DTRA’s research interests are coordinated with the Defense Advanced Research Projects Agency and the Services’ basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technological areas which are not clearly addressed by other basic research efforts.\n\nThis project supports several national and Department initiatives directly related to countering WMD including: Office of Science and Technology Policy, Nuclear Defense Research and Development Roadmap, FY 2013-2017; Defense Budget Priorities and Choices for FY 2014; Countering Weapons of Mass Destruction Science and Technology Priority Steering Council Roadmap; 2012 Defense Strategic Guidance (Sustaining U.S. Global Leadership: Priorities for 21st Century Defense), and the 2014 Quadrennial Defense Review.  In general, these documents direct capability enhancements, projects, and Science and Technology (S&T) investments that support Countering WMD (CWMD) and reduce global nuclear dangers.  Specifically, they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; enhancing nuclear forensics; securing vulnerable materials; developing new verification technologies; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based and inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements. Specific activities for Project RU include: Sensing and Recognition – Generation of information that provides knowledge of the presence, identity, and\/or quantity of material or energy in the environment that may be significant; Network Sciences – Enhance fundamental knowledge of theory, representations, and mapping to improve the WMD-related robustness, resiliency, recovery of, and informational and operational utility associated with and derived from, complex disparate but interdependent networks; Protection Sciences – Advance knowledge for protection of personnel, resources, sensitive systems and infrastructure from WMD; Sciences to Defeat WMD – Phenomena that improves success of defeat actions (use of weapons) including explosives, accessing and defeating target WMDs, such as biological agents and weapons modeling; and Sciences to Secure WMD – Improve understanding of phenomena for verification and compliance with treaties, including test detection.  Additional activities for Project RU include the discovery of revolutionary control methods to monitor and secure components, materials, and weapons, and disrupt proliferation pathways; and cooperative research with global partners – research to reduce the global threat of WMD in collaboration with a broad range of international partners. Finally, this project supports and administers the Cooperative Biological Engagement Program for academic engagements which has the core goals of securing dangerous pathogens, promoting open and active disease reporting and response, advancing transparent research to understand pathogens, and developing potential countermeasures.\n\nThe decrease from FY 2014 to FY 2015 reflects a reduced effort in combating WMD basic research resulting in reductions to the number of active basic research awards.  The increase from FY 2015 to FY 2016 maintains the investment in basic research to keep pace with inflation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Fundamental Research for Combating WMD"
                                    },
                                    "Description": {
                                        "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.783"
                                            },
                                            "Text": {
                                                "val": "- Managed over 200 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio continued the CWMD grand challenge for the DoD.\n- Supported the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conducted an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives, to foster collaboration, and build relationships within the scientific community.\n- Conducted an annual external panel review of the basic research program open to DoD research stakeholders. The panel assessed the focus and scope of the program with respect to the CWMD challenges, and assessed the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and to ensure successful partnerships.\n- Developed new model that optimizes timing of treaty inspections based on the probability of detecting relevant isotopes.\n- Developed new formulations that in small scale testing showed an order of magnitude increase in ability to eliminate chemical and biological agents.  Identified for potential use in the next generation counter-WMD weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.778"
                                            },
                                            "Text": {
                                                "val": "- Manage over 150 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addresses the DoD CWMD S&T priority and supports the DoD S&T Priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Support the development of the future Science, Technology, Engineering, and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives, and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program which will be open to DoD research stakeholders.  The panel will assess the focus and scope of the program with respect to the CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.436"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.436"
                                            },
                                            "Text": {
                                                "val": "- Manage over 150 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addresses the DoD Combating WMD S&T priority and supports the DoD S&T Priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Support the development of the future Science, Technology, Engineering, and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives, to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program which will be open to DoD research stakeholders.  The review will assess the focus and scope of the program concerning CWMD challenges, and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community, to avoid duplication and ensure successful partnerships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "21\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.919"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include competitive selection awards through the DTRA’s Broad Agency Announcement and collaborative funding through other organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting DoD educational goals, number of research organizations participating, and percentage of participating universities on the U.S. News & World Report \"Best Colleges\" list."
                        }
                    }
                }
            ]
        }
    }
}