{
    "id": "ecb5390383a68909f45717a0869d08275c22dc88",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "72.934"
            },
            "CurrentYear": {
                "val": "72.908"
            },
            "BudgetYearOne": {
                "val": "57.663"
            },
            "BudgetYearOneBase": {
                "val": "57.663"
            },
            "BudgetYearTwo": {
                "val": "63.457"
            },
            "BudgetYearThree": {
                "val": "74.739"
            },
            "BudgetYearFour": {
                "val": "72.337"
            },
            "BudgetYearFive": {
                "val": "65.412"
            }
        },
        "ProgramElementNote": {
            "val": "FY 16 decrease attributed to early completion of 40mm munition efforts and shirt ofefforts from 6.3 to 6.2 weapons and munitions technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures weapons and munitions components\/subsystems and demonstrates lethal and non-lethal weapons and munitions with potential to increase force application and force protection capabilities across the spectrum of operations. Project 232 focuses on affordable delivery of scalable (lethal to non-lethal) effects for weapons and munitions including: artillery, mortars, medium caliber, tank fired, Soldier weapons and shoulder fired weapons.  Project L96 matures and integrates critical high energy laser subsystems into a mobile demonstrator to explore and validate system performance in relevant environments.   Project L97 demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection.  \n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology),  PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n  \nWork in this PE is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ; Edgewood Chemical Biological Center (ECBC), Edgewood, MD; and the U.S. Army Space and Missile Defense Center (SMDC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "73.885"
                },
                "CurrentYear": {
                    "val": "57.931"
                },
                "BudgetYearOne": {
                    "val": "65.886"
                },
                "BudgetYearOneBase": {
                    "val": "65.886"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "72.934"
                },
                "CurrentYear": {
                    "val": "72.908"
                },
                "BudgetYearOne": {
                    "val": "57.663"
                },
                "BudgetYearOneBase": {
                    "val": "57.663"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.951"
                },
                "CurrentYear": {
                    "val": "14.977"
                },
                "BudgetYearOne": {
                    "val": "-8.223"
                },
                "BudgetYearOneBase": {
                    "val": "-8.223"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.023"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.700"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.651"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.223"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.223"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.488"
                        },
                        "CurrentYear": {
                            "val": "39.808"
                        },
                        "BudgetYearOne": {
                            "val": "40.797"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.797"
                        },
                        "BudgetYearTwo": {
                            "val": "40.794"
                        },
                        "BudgetYearThree": {
                            "val": "45.658"
                        },
                        "BudgetYearFour": {
                            "val": "41.086"
                        },
                        "BudgetYearFive": {
                            "val": "42.144"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies for affordable precision lethal and non-lethal weapons and munitions.  Technologies include advanced energetic materials, insensitive munitions, novel fuze designs, penetrators, scalable effects and millimeter wave sources for high power microwave (HPM) systems.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nEfforts in this project support the Lethality and Ground Maneuver portfolios.\n\nWork in this project is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Based Networked Munitions Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technology for improved capability remotely delivered area denial munition systems to include: networked munition architecture, low hazard effects, delivery mechanisms, and non-lethal response to tampering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.388"
                                            },
                                            "Text": {
                                                "val": "Matured autonomous Non-Lethal Alert technology for personnel detection\/discrimination that was previously developed with improved communications and decreased size and weight to better support the base protection mission; optimized non-lethal effects package for Autonomous Non-Lethal Alert to provide enhanced force protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.992"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate technologies for multi-purpose networked munitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Will develop area denial munition technologies including networked munition level architecture and advanced methods for precision delivery\/location of remote effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Area Protection and Survivability (EAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the use of command-guided medium caliber projectiles for the interception and destruction of incoming rockets, artillery, and mortar rounds (RAM) and unmanned aerial systems (UAS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.519"
                                            },
                                            "Text": {
                                                "val": "Demonstrated integrated system of radar, command guided interceptors and auto cannon by a defeat of a statically placed threat munition; demonstrated performance requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.113"
                                            },
                                            "Text": {
                                                "val": "Optimize and demonstrate an integrated Counter Unmanned Aerial Systems (C-UAS) capability, comprised of algorithms, fire control and command guided interceptor munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Lethality Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates novel penetrator designs (without using depleted uranium (DU)), as well as alternative lethal mechanisms to maintain or exceed tank main gun performance against multiple target types into the future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.009"
                                            },
                                            "Text": {
                                                "val": "Fabricated hardware components, assemble cartridges, and conducted functional and armor tests leading to technology demonstration; conducted technology demonstration (120 mm ballistic testing through all temperatures); analyzed test data; and provided test results to PEO Ammunition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies for 155mm artillery to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with the DoD cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.875"
                                            },
                                            "Text": {
                                                "val": "Performed TRL6 demonstration on complete system which consisted of two major tests - a static arena test on the warhead and a ballistic demonstration test;  the static arena test provided data on the effectiveness of the round which was then used to validate that the system meet the lethality requirements;  the ballistic demonstration test showed the performance of the system in a representative environment and showed the improvement in reliability over traditional Dual-Purpose Improved Conventional Munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Mature the design and demonstrate performance against the expanded target set that now includes tracked and light wheeled tactical vehicles; exploit emerging breakthroughs in warhead technologies that enable defeat of the expanded target sets at a reduced cost (e.g. number of rounds fired to service a target)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will continue maturation of a novel cluster munition policy compliant warhead for 155mm artillery; conduct arena testing of multi-explosive formed penetration optimized for effects against armored targets integrated into a 155mm artillery projectile compliant with DoD cluster munition policy; conduct static and ballistic testing on an integrated projectile, culminating in a TRL6 demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and ammunition handling systems optimized for remote operation.  This effort demonstrates cannon-super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, and the ability to fire a suite of ammunition from non-lethal to lethal, to provide escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.612"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and matured the turret control system in preparation for the integration of the weapon, ammunition handling system and fire control sensor enhancements within a Bradley fighting vehicle; demonstrated system level optimized performance capabilities of a 30mm weapon platform; optimized and down selected the appropriate air bursting fuze technologies for the integration within the 50mm air bursting cartridge; continued to mature and improve the fire control-target based user interface software as well as continued to develop and optimize the design of the 50mm Bushmaster III gun."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Focus is to optimize technologies from Weapon, Fire Control and Turret functional areas together in preparation of demonstrating a system level platform integration with an advanced medium caliber weapon system within a Bradley Fighting Vehicle (BFV) variant.  In support of this effort, finalize and optimize a prototype turret and drive system to support the XM813 30mm weapon system; optimize and mature the advanced sensors (down range wind sensor, dynamic metrology sensor and improved laser range finder) and the scenario based fire control system supporting the XM813 30mm weapon system, 30mm armor piercing (AP) munition and the Mk310 30mm programmable air bursting munitions (PABM);  perform the integration of these technologies within the BFV and demonstrate improved accuracy and lethality performance at a system level.  Additionally, finalize 50mm fuze improvements and perform a fuze shoot off and demonstration to down select and optimize the burst point accuracy of the 50mm PABM munition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.967"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature and optimize weapon, ammunition, fire control, and turret technologies for 50mm cannon; refine the ammunition fuzing approach to improve accuracy and lethality; analyze data collected from integration, test and demonstration to apply to system level improvements; upgrade fire control to meet system level requirements and design turret for integration into a prototype platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Remote\/Robotic Armament System (ARAS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides advanced remote armaments with scalable effects from non-lethal to lethal engagements. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection – Basing. Note: Prior to FY14, this effort was combined with Medium Caliber Weapon Systems above."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated ARAS software\/electronics controls and validated\/improved mechanical subsystems to ensure they met all design specifications to mitigate risks associated with obtaining an Army Test and Evaluation Command (ATEC) limited safety release which was essential for the capstone demonstration; also, in preparation of ATEC testing, performed generation of a Safety Assessment Report (SAR) and other pre-ATEC activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Power and Energy Management for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the technology options available to provide the next generation of gun fired smart munitions, with advanced fuzing and power components for improved performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.118"
                                            },
                                            "Text": {
                                                "val": "For multi-point initiation, demonstrated a distributed four point initiation system in a future warhead application that is capable of achieving simultaneity between points and selectable control; for proximity sensor, demonstrated improved range extraction and enhanced countermeasure protections through ballistic testing; for impact switch, matured and demonstrated a micro electrical mechanical system (MEMS) based impact switch that has multi-level sensing capability against varying targets; for thin film thermal batteries, matured and demonstrated a thin film heat source integrated into existing thin film battery; for super capacitor, demonstrated robustness of design through environmental and ballistic testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Optimize next generation proximity sensor (NGPS) sub-system to meet improved performance requirements; demonstrate and validate NGPS design in an artillery platform to achieve a TRL 6."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the performance and insensitivity of energetic materials ranging from 25mm medium caliber (direct fire) through 155mm large cal (indirect fire) weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.747"
                                            },
                                            "Text": {
                                                "val": "Scaled-up and formulated newly synthesized ingredients for lethality and insensitive munition (IM) benefits; optimized propellant formulations for various applications of interest for extended range; prototyped novel propulsion system concepts; performed live fire and performance testing for nano pressed explosives; conducted IM insult testing on XM1128 projectile; performed IM testing on compatible IM detonation trains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.927"
                                            },
                                            "Text": {
                                                "val": "Perform appropriate test series on mature propellant and explosive formulations to facilitate certification at the Energetic Material Qualification Board (EMQB) level and enable transition of new materials to munitions qualification programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will begin the transition of insensitive energetic materials of interest to the Army; and down-select and evaluate energetic materials to be scaled up to production levels to verify they meet the Army needs and can be produced in large quantity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection and Tactical Overmatch Armament Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved ability to deliver decisive effects by providing hemispherical protection to semi-fixed and mobile sites against personnel, vehicle, and materiel targets to enable tactical overmatch to the Tactical Small Unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.966"
                                            },
                                            "Text": {
                                                "val": "Integrated mature component technologies that have demonstrated effects against threat UAS; demonstrated direct and indirect fired munitions providing hemispherical protection system of systems approach to accurately sense, warn, and respond to threats by delivering decisive effects timely and accurately."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Armament Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort is done in coordination with efforts in PE 0602601A, PE 0602618A, PE 0603004A, PE 0603005A, PE 0603270A, and PE 0603313A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.110"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate hard kill related technologies such as fire control, target detection device and hard kill countermeasures into the Army's APS common architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Text": {
                                                "val": "Will develop hard-kill countermeasure system requirements to ensure proper interface with the Modular APS; continue to mature and merge key hard-kill technologies including fire control, launcher, munition, and warhead for seamless integration with the Army's MAPS controller."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Armament System Integration"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates weapon systems on a semi-autonomous and autonomous unmanned platform while maintaining positive control of weapon system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.836"
                                            },
                                            "Text": {
                                                "val": "Integrated mature component technologies of a medium caliber weapon mounted on a 1+ ton unmanned vehicle and controlled via secure distributed communications operating up to 5 km from a command and control entity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Effects Decision Suite"
                                    },
                                    "Description": {
                                        "val": "This effort provides sensor-to-shooter capabilities to deliver desired effects on target, specifically addressing accurate target location and target hand-off, improving accuracy and lethality at the small combat level."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.511"
                                            },
                                            "Text": {
                                                "val": "Implemented fire support execution matrix; improved target prioritization; improved 3D de-conflictions of fires application; demonstrated target data\/track management and effects planning; demonstrated weapon placement coordination; demonstrated effects planning component."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Non-Line-of-Sight (NLOS) Munition for Light Forces"
                                    },
                                    "Description": {
                                        "val": "This effort will provide a precision technology capability for an 81mm mortar cartridge for light forces for base defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.080"
                                            },
                                            "Text": {
                                                "val": "Improved and optimized down selected 81mm mortar GPS precision design candidate; matured design and integrated into 81mm mortar round system taking into account warhead and propulsion system; validated the 81mm precision mortar design integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.507"
                                            },
                                            "Text": {
                                                "val": "Mature components, build hardware and verify 81mm precision design via a live system test: verify GPS and fuze setter technology and candidate designs with tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Will fabricate and demonstrate 81mm precision mortar design through a series of inert system flight tests culminating in a capability demonstration at the end of FY16."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Active Denial Technology (SS-ADT)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates non-lethal counter-personnel directed energy (DE) technology for crowd control up to 100 meters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.510"
                                            },
                                            "Text": {
                                                "val": "Improved the azimuth and elevation steering capability and develop a Fire Control Suite for Target Tracking; performed demonstration of human target effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Base Defense Hostile Protection System"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates technology to locate unmanned aircraft systems (UAS) in bearing via acoustic sensor arrays as well as the point of origin of mortars and rocket propelled grenades (RPGs) fires."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.510"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and optimized acoustic detection and tracking in bearing of UAS; matured multi node system level fusion to improve performance; repackaged components to reduce logistic burden and optimized power usage for extended mission life and maintenance cycles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range\/Guided 40mm Munition"
                                    },
                                    "Description": {
                                        "val": "This effort develops a 40mm guided, low cost, extended range projectile for use in the M320 launcher. This projectile will be capable of defeating beyond line-of-sight targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.313"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated optimized components for a guidance, navigation and control system for extended range 40mm low velocity grenades; performed improvements and demonstrated extended range technologies to include airframe and Guidance, Navigation and Control;  optimized design and demonstrated a mature warhead integrated into the projectile."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.016"
                                            },
                                            "Text": {
                                                "val": "Mature, integrate and demonstrate component technologies in an extended range guided 40mm projectile to 600 meters (threshold)\/ 1000 meters (objective); demonstrate improved probability of hit at an increased range; provide a low cost integrated guidance navigation and control system with optimized airframe, canards, tail fin, and propulsion system; optimize fuze and warhead design for  enhanced lethality; demonstrate the ability of the projectile to guide to hit targets at ranges between 600 to 1000 meters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Direct\/Indirect Fire Mortar (ADIM)"
                                    },
                                    "Description": {
                                        "val": "This effort develops a line-of-sight\/non-line-of-sight remotely operated mortar system for use in base protection and mobile fire support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.039"
                                            },
                                            "Text": {
                                                "val": "Improved and optimized the baseline, ground-up designed system; demonstrated its capabilities in a controlled environment in order to validate expected increases in performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Adapt the system to be compatible with the 81mm precision mortar cartridge; prepare for an integrated demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Predetonation System"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a system to neutralize improvised explosive devices (IEDs) by leveraging emerging detection, geo-location, and classification technologies mounted on a ground vehicle. It provides an integrated system approach to enhanced neutralization \/ pre-detonation that utilizes data from sensor networks. It integrates technologies transitioned from the IED Neutralization Technology effort in PE 0602642A\/Proj H19 in FY2014\/15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.966"
                                            },
                                            "Text": {
                                                "val": "Demonstrated an improved IED neutralization capability that interoperated with standard communications networks and databases to provide historical and real time IED emplacement data; matured the neutralization system to utilize beam steering algorithms for convoy operations as well as integrated emerging waveforms to defeat a wider class of IEDs; demonstrated reduced Size, Weight and Power (SWaP) requirements for legacy neutralization systems utilizing emplacement data and RF generation enhancements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Sniper Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates advanced projectile designs such as long rod penetrator technologies that will provide snipers with the capability for increased range effectiveness (up to 1500m, possibly greater), hit probability, and armor penetration, for use in man-portable sniper weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.483"
                                            },
                                            "Text": {
                                                "val": "Optimized the performance of the long rod sabot design, notably the slip obturator and discard; demonstrated accuracy improvements associated with design modifications to existing projectiles; investigated the technological advances and viability of guided munitions in small caliber applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.507"
                                            },
                                            "Text": {
                                                "val": "Validate the technology matured through this program by demonstrating improved sniper cartridges fired in common calibers weapons that increase a sniper's probability of hit in non-ideal\/combat relevant conditions at extended ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.011"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.011"
                                            },
                                            "Text": {
                                                "val": "Will optimize demonstrated advanced sniper ammunition concepts through modeling and simulation and design veirfication; and demonstrate selected fully integrated ammunition-weapon designs in relevant operational environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery weapon system and projectile technologies that increase the range by 25% without an increase in platform weight."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.036"
                                            },
                                            "Text": {
                                                "val": "Mature component technologies associated with longer range artillery capabilities to include weapon system components like cannon tube, breech and mount."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.015"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature designs of component technologies associated with longer range artillery capabilities - including cannon tube, breech and mount; conduct initial component verification; and conduct prototype testing of weapon sub-systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Fired Advanced Effect Air Burst Munition"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates technologies for improved lethality  of current air bursting munitions which address emerging requirements from the warfighter."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Mature technologies for neutralization of targets in defilade; mature and demonstrate advanced explosives\/fragmentation warhead designs that increase lethal zone for air burst munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort integrates complementing navigation sensors, actuators and subsystems in order to demonstrate precision delivery capability on an indirect fire munition system in a global positioning system (GPS) denied environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Integrate and optimize critical guidance subsystems; demonstrate airframe and actuator performance through flight testing in order to verify the maneuverability of the projectile."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate image navigation guidance technology with algorithms and associated optics integrated in a projectile through a series of captive flight tests; and demonstrate guidance and control system in a dynamic test to verify the ability to maneuver in flight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guided Enhanced Fragmentation Mortar Munition"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and demonstrate a 120mm precision guided mortar with improved capabilities with respect to the currently fielded 120mm precision guided mortar."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "Build and test fully integrated 120mm precision guided mortar systems to verify designs and demonstrate functionality at nominal and environmental extreme conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Unmanned Aviation System (C-UAS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates modular Counter UAS technologies designed to encompass the entire kill chain including detection, tracking, classification, and defeat of UAS for point defense and mobile applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will mature and integrate technologies for UAS tracking and defeat; evaluate and select weapon systems and munitions for defeat of UAS and integrate into current system of systems for mobile and area defense; integrate precision fire control mechanisms and demonstrate the system of systems defeat of UASs;  evaluate results of demonstrated UAS defeat mechanisms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Munition Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery technologies including rocket and base bleed propulsion, hybrid lifting surfaces and guidance technologies which increase range and accuracy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.329"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.329"
                                            },
                                            "Text": {
                                                "val": "Will mature and integrate projectile technologies for next generation extended range rocket-assisted projectiles including integrated munition designs involving novel rocket motor formulations, advanced flight controls, and precision guidance components that can survive launch conditons in an extended range cannon environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "43A"
                    },
                    "ProjectTitle": {
                        "val": "ADV WEAPONRY TECH DEMO"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Advanced Weaponry Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Matured and demonstrated lethal and non-lethal weapons and munitions with potential to increase force application and force protection capabilities across the spectrum of operations."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Advanced weaponry technology demonstrations"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.277"
                        },
                        "CurrentYear": {
                            "val": "14.375"
                        },
                        "BudgetYearOne": {
                            "val": "12.526"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.526"
                        },
                        "BudgetYearTwo": {
                            "val": "17.728"
                        },
                        "BudgetYearThree": {
                            "val": "24.075"
                        },
                        "BudgetYearFour": {
                            "val": "26.226"
                        },
                        "BudgetYearFive": {
                            "val": "18.143"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology.  The major effort under this project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon.  At entry level weapon power of around 10 kW, SSL technology has the potential to engage and defeat small caliber mortars, unmanned aerial vehicles (UAVs), surface mines, sensors, and optics.  At full weapon system power levels of around 100 kW, SSL technology has the potential to engage and defeat rockets, artillery and mortars (RAM), UAVs, cruise missiles, and anti-tank guided missiles (ATGMs), as well as surface mines, sensors, and optics at tactically relevant ranges.  HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance.  This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n \nWork is performed by the US Army Space and Missile Defense Command\/Army Forces Strategic Command, Technical Center, Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on tactical platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on the High Energy Laser Mobile Demonstrator (HEL MD) platform, and other selected tactical platforms, while ensuring platform volume, weight, and interface specifications are met. The laser system consists of laser devices, such as the laboratory laser devices developed under PE 0602307A, Project 042, and the prime power (PE 0603005A, Project 441), command and control and thermal management subsystems required for the laser device operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.944"
                                            },
                                            "Text": {
                                                "val": "Completed ruggedization efforts for available programmable pulsed power technology to provide prime power for the 50 kW laser device; began ruggedization of available thermal management technology that can cool the 50 kW laser device; provided additional ruggedization of the 50 kW laser device to enable integration into the HEL MD platform; corrected beam control system deficiencies discovered during the 10 kW demonstration, identified additional enhancements required for 50 kW demonstrations during propagation events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.679"
                                            },
                                            "Text": {
                                                "val": "Continue additional ruggedization of a 50kW class laser device for integration on the HEL MD platform; continue ruggedization of thermal management technology that can cool the 50 kW laser device; and initiate power generation function ruggedization for recharging the power storage modules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.059"
                                            },
                                            "Text": {
                                                "val": "Will continue ruggedization of thermal management subsystem and power management subsystem; ruggedize available power storage hardware received from the Tank-Automotive Research Development and Engineering Center (TARDEC) in preparation for integration; continue ruggedization of 50 kW class solid state laser subsystem components; and begin ruggedization of the BMC3 subsystem for the 100 kW laser system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Mobile Demonstrations (HEL MD)"
                                    },
                                    "Description": {
                                        "val": "This effort initially integrates a commercial-off-the-shelf (COTS) 10kW laser subsystem (then later a ruggedized ~50kW laser subsystem) into the existing mobile laser demonstrator platform that includes the ruggedized BCS built under the HEL TD effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high energy laser weapon in a relevant environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.333"
                                            },
                                            "Text": {
                                                "val": "Completed the 10 kW laser demonstration integrated with the HEL MD platform; finished assessment of 10 kW integrated subsystem performance against selected targets; conducted two propagation data collections with the 10 kW laser on the HEL MD, one at Eglin AFB and one at WSMR, to begin anchoring the models at the 1060 nm wavelength; began integration of power subsystem for future 50kW demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.696"
                                            },
                                            "Text": {
                                                "val": "Begin subsystem demonstration and performance validation for the ruggedized thermal management technology that cools the 50 kW laser device; begin subsystem demonstration and performance validation for the ruggedized battle management function that provides controls for the 50kW laser and other subsystems; and begin planning for the integrated 50kW class demonstration, to include objective definition, demonstration reference missions, and long-lead purchases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.467"
                                            },
                                            "Text": {
                                                "val": "Will procure targets and continue coordination activities for 50kW class laser demonstration and data collection events with range, Laser Clearing House, and Federal Aviation Authority (FAA) organizations; begin fabrication of interfaces and integration of thermal management and power management subsystems; begin performance validation of integrated thermal management and power management subsystems for the 50 kW class demonstration; and begin fabrication of interfaces and integration of laser subsystem components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.169"
                        },
                        "CurrentYear": {
                            "val": "3.725"
                        },
                        "BudgetYearOne": {
                            "val": "4.340"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.340"
                        },
                        "BudgetYearTwo": {
                            "val": "4.935"
                        },
                        "BudgetYearThree": {
                            "val": "5.006"
                        },
                        "BudgetYearFour": {
                            "val": "5.025"
                        },
                        "BudgetYearFive": {
                            "val": "5.125"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces.  This project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nWork in this PE is related to, and fully coordinated with, PE 0602622A (Chemical, Smoke and Equipment Defeating Technology) and PE 0603606A, project 608 (Countermine & Barrier Development).   \n\nThis project sustains Army science and technology efforts supporting the Ground Maneuver portfolio.\n   \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.   \n  \nWork in this project is performed and managed by the Army Research, Development, and Engineering Command (RDECOM), Edgewood Chemical Biological Center (ECBC), Edgewood, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.637"
                                            },
                                            "Text": {
                                                "val": "Conducted toxicology studies of optimized grenades; further characterize performance of low hazard visual obscurant grenade."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.697"
                                            },
                                            "Text": {
                                                "val": "Conduct initial dissemination studies on artillery\/mortar delivered low hazard visual obscurant.  Demonstrate low hazard visual smoke grenade."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.836"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.836"
                                            },
                                            "Text": {
                                                "val": "Will continue dissemination studies of artillery\/mortar delivered low hazard visual obscurant."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and home made explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.017"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated Colorimetric Reconnaissance Explosive Sensor System (CRESS) HME detection kit for dismounted Soldiers; fabricated the Chemical Fingerprint Identification System (CFIS) device for unambiguous biometric identification detection of explosives in latent fingerprints; developed a prototype forensic optical imager that will generate digital fingerprints compatible with law enforcement databases and simultaneously determine the chemical composition of trace residue using Raman chemical imaging and fluorescence imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.378"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate Chemical Fingerprint Identification System (CFIS) device for unambiguous biometric identification of an individual linking explosive residue identified and found in latent fingerprints using Raman Chemical Imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.577"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.577"
                                            },
                                            "Text": {
                                                "val": "Will optimize and mature the  Chemical Fingerprint Identification System (CFIS) device for unambiguous biometric identification of an individual linking explosive residue identified and found in latent fingerprints using Raman Chemical Imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.515"
                                            },
                                            "Text": {
                                                "val": "Optimized and matured unified ion mobility based sensing of explosives and chemical agents in the Joint Chemical Detector (JCD) system; demonstrated standoff detection of trace homemade explosives with laser based systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "Demonstrate unambiguous detection of explosives and chemical agents in a unified and integrated system based on ion mobility spectrometry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.927"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.927"
                                            },
                                            "Text": {
                                                "val": "Will expand number of explosive materials detected in the Chemical Explosives Detector (CED) variant of the Joint Chemical Detector (JCD) while retaining CWA and TIC detection capabilities; integrate software and algorithms supporting the detection of explosive materials in the CED; optimize and mature the inlet system for particulate and vapor detection, as well as integrated on-board vapor generators (OVGs) for dopant and calibrant delivery."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}