{
    "id": "f369681d0c13c6dec05ba773e632168cbdc64cf9",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305220F"
        },
        "ProgramElementTitle": {
            "val": "RQ-4 UAV"
        },
        "R1LineNumber": {
            "val": "213"
        },
        "MdapCode": {
            "val": "252"
        },
        "PriorYearsDelta": {
            "val": "2031.377"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2400.088"
            },
            "PriorYear": {
                "val": "120.180"
            },
            "CurrentYear": {
                "val": "241.828"
            },
            "BudgetYearOne": {
                "val": "208.053"
            },
            "BudgetYearOneBase": {
                "val": "208.053"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "289.497"
            },
            "BudgetYearThree": {
                "val": "267.500"
            },
            "BudgetYearFour": {
                "val": "284.605"
            },
            "BudgetYearFive": {
                "val": "289.697"
            },
            "CostToComplete": {
                "val": "280.300"
            },
            "TotalCost": {
                "val": "4381.748"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2016,  PE 0305220F, RQ-4, Project 675148, Common-Airborne Sense & Avoid (C-ABSAA), transferred to PE 0305206F, Airborne Reconnaissance Systems, Project 675148. This transfer will provide greater visibility into this capability and prepares for expanded applications by making the capability program and platform agnostic."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds four (4) related Air Force projects sharing the RQ-4 platform in common: the RQ-4 Block 30 project, the RQ-4 Block 40 project, the RQ-4 Ground Segment\/Communications System project, and MP-RTIP project in FY16 and forward.\n\nGlobal Hawk:\n\nThe RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance Intelligence, Surveillance, and Reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.  This funding supports the development of RQ-4 aircraft, payloads, ground and support segments.  The Block 20\/30\/40 RQ-4B RPA is the successor to the Block 10 RQ-4A, and is designed to employ 3,000 pounds of payload and enable Multi-Intelligence (multi-INT) collecting.  \n\nBlock 30 (Project Number 675145) employs upgraded Synthetic Aperture Radar (SAR) and Electro-Optical\/Infrared (EO\/IR) sensors known as the Enhanced Integrated Sensor Suite (EISS), and the Airborne Signals Intelligence Payload (ASIP) sensor. Activities include mission planning development and testing, enhanced weather capability development and testing, airspace and interoperability enhancements and updates, airframe upgrades, sensor upgrades, risk reduction and integration, ice protection system development and testing, and resolution of issues with Diminishing Manufacturing Sources (DMS).   \n\nThe Block 40 (Project Number 675146) employs the MP-RTIP radar sensor. In FY15 and beyond, this includes the Block 40 costs for the development of enhanced weather capability development and testing, maritime mode utilization, mission planning development and testing, airspace integration activities including Mode 5 Automatic Dependent Surveillance-Broadcast (ADS-B), ice protection system development and testing, airframe and sensor enhancements to the Block 40 fleet.\n\nThe Ground Segment Modernization (GSM)\/Communication System Modernization (CSM) Project Number 675147 includes the GSM project, CSM project and the Next Generation Communication System. The ground segment currently includes the Mission Control Element (MCE), the Launch and Recovery Element (LRE), and the networking resources required to simultaneously disseminate intelligence while remaining compliant with Department of Defense (DoD) cybersecurity network requirements to operate on the Global Information Grid. As a result of the reinstatement of the Block 30s in the FY15 PB, the requirement for ground stations operations significantly increased which increased the need for efforts to address DMS issues.  The GSM project will initiate in FY16 in support of a 20 year operational lifecycle, and will comprise an approach that combines the functionality of legacy MCEs and LREs into a single building-based configuration.  The CSM project will provide enhancements across the RQ-4 communication network.\n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability. Studies and activities may be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aeriel System (UAS) Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS).  GSM and CSM will incorporate UCI and UCS standards. \n\nThe RQ-4 program will maintain and upgrade interoperability for Blocks 20\/30\/40 with system of systems partners and continue to incorporate applicable synergies with other platforms such as  the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.  The networking capability for intelligence dissemination is required to provide the data transport interface between the Weapons System, Operations Centers, and external Intelligence Community customers.\n\nC-ABSAA: \nC-ABSAA is an analysis and developmental effort in the pre-Material Development Decision phase of the acquisition lifecycle which supports emerging warfighter requirements to fully integrate Group 4-5 RPA into the National Airspace System (NAS), international airspace, other nations' sovereign airspace, and operational combat airspace to conduct the entire range of military operations across all mission environments.  C-ABSAA also supports the \"Worldwide Operations\" Key Performance Parameter (KPP) in larger RPA requirement documents, and Public Law 112-239 directing DoD collaboration with the Federal Aviation Administration (FAA) and the National Air and Space Administration (NASA) to safely integrate RPA in the NAS.  Funding in this project supports the development of a Sense and Avoid (SAA) capability set for Group 4-5 RPA and covers analysis, research, and developmental activities as well as infrastructure and other government costs.  Activities included support to the development of warfighter requirements and analysis of possible solution alternatives, the collaboration with the FAA, NASA, and Office of the Secretary of Defense (OSD) to develop national policy and standards, and SAA related studies, analysis, modeling and simulation, program planning and project execution.  RPA platform specific integration and testing is not included.\n\nIn FY16, Project 675148, C-ABSAA, transferred to PE 0305206F, Airborne Reconnaissance Systems, Project 675148, C-ABSAA, in order to provide greater visibility into this capability and prepare for expanded applications.\n\nMP-RTIP:\nThe MP-RTIP sensor was designed as a family of modular, scalable sensors to provide next generation capabilities to support sustainable network centric operations with integrated Command and Control, Intelligence, Surveillance and Reconnaissance (C2ISR) capability. MP-RTIP provides the RQ-4 Block 40 aircraft with advanced Synthetic Aperture Radar (SAR) and Moving Target Indicator (MTI) sensor capabilities.\n\nThis project (67RTIP) includes all MP-RTIP design, development, test, and integration efforts for the RQ-4 Block 40 platform. Integration activities include platform integration of the MP-RTIP sensor and sustainment logistics planning support. MP-RTIP studies and development insertion include the implementation of Maritime Modes (MM), High Range Resolution (HRR) modes, electronic protection, technical refresh, product improvements and other advanced capabilities.  \n\nActivities also include studies and analysis supporting current and future program planning and future modes development based on user requirements.\n\nPer direction of USD(AT&L), the RQ-4 program was restructured from the original project 675144 (Baseline) into multiple projects: (1) Block 30, (2) Block 40, (3) GroundSegment\/Communications System, and (4) C-ABSAA. Prior year funds in the amount of $2031.377M were accounted for in project 675144.\n\nIn FY 2016 and beyond, the RQ-4 Block 30 project 675145 includes budget necessary for systems engineering\/program management, test and evaluation, management services and fielding support for projects 675145, 675146 (Block 40) and 675147 (Ground Segment\/Comm System). This reflects contracting\/acquisition strategy for these common elements within the Global Hawk program. Projects 675148 (C-ABSAA) and 67RTIP (Multi-Platform Radar Technology Insertion Program (MP-RTIP)) reflect separate costs as they are separately managed\/supported programs.\n\nThe Cost to Complete and Total Cost for Major Defense Acquistion Program (MDAP) projects in this program element are documented in the R3. Total Cost on the R2 is not reflective of the total cost for MDAP projects since the R2 does not account for prior years funding for in project 675144.\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "120.180"
                },
                "CurrentYear": {
                    "val": "244.514"
                },
                "BudgetYearOne": {
                    "val": "369.014"
                },
                "BudgetYearOneBase": {
                    "val": "369.014"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "120.180"
                },
                "CurrentYear": {
                    "val": "241.828"
                },
                "BudgetYearOne": {
                    "val": "208.053"
                },
                "BudgetYearOneBase": {
                    "val": "208.053"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-2.686"
                },
                "BudgetYearOne": {
                    "val": "-160.961"
                },
                "BudgetYearOneBase": {
                    "val": "-160.961"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-2.686"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-160.961"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-160.961"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16 (-)$52.9M decrease: Rephasing of Common-Airborne Sense & Avoid (C-ABSAA) to PE 0305206F  \nFY16 (-)$108.1M decrease:  Rephasing of Global Hawk program to improve execution"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675145"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Block 30"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.932"
                        },
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "206.437"
                        },
                        "BudgetYearOne": {
                            "val": "153.687"
                        },
                        "BudgetYearOneBase": {
                            "val": "153.687"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "219.726"
                        },
                        "BudgetYearThree": {
                            "val": "128.608"
                        },
                        "BudgetYearFour": {
                            "val": "116.246"
                        },
                        "BudgetYearFive": {
                            "val": "118.326"
                        },
                        "CostToComplete": {
                            "val": "162.348"
                        },
                        "TotalCost": {
                            "val": "1135.310"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance Intelligence, Surveillance, and Reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios. RDT&E funding in this project supports design, development, integration, and testing of capabilities needed to meet validated requirements for Block 30 aircraft, including continuing aircraft system modernization for Enhanced Integrated Sensor Suite (EISS) sensors and the Airborne Signals Intelligence Payload (ASIP).\n\nThis funding also supports aircraft systems modernization to include continuing aircraft operations surety, cybersecurity, information assurance, and mission critical repair of Government Furnished Equipment (GFE).\n\nIn FY15 and beyond, this RQ-4 Block 30 project 675145 includes budget necessary for enterprise management, test and evaluation, software integration, and fielding support for projects 675145, 675146 (Block 40) and 675147 (Ground Segment\/Comm System) as well as program protection projects, studies and analysis supporting future system enhancements. This reflects the contracting\/acquisition strategy for these common elements within the RQ-4 program.\n\nThe RQ-4 program will maintain capability and interoperability for Block 30 including efforts with system of systems partners and continue to incorporate applicable synergies with other platforms, such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.\n\nActivities include mission planning development and testing, completion of Synthetic Aperture Radar - Complex Imagery development testing, next gen sensor study, enhanced weather capability development and testing, airspace and interoperability enhancements and updates, airframe and software upgrades and deficiency report resolution across RQ-4 fleet, sensor interoperability enhancements and upgrades, upgrades to ASIP SIGINT sensor, Mode 5\/ADS-B development and testing, development and testing activities associated with enhancing sensor capability and sensor integration, development and testing of ice protection system, program protection projects, and studies and analysis supporting future system enhancements.  \n\nThe RQ-4 program will maintain and upgrade interoperability for Blocks 20\/30\/40 with system of systems partners and continue to incorporate applicable synergies with other platforms such as  the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.  The networking capability for intelligence dissemination is required to provide the data transport interface between the Weapons System, Operations Centers, and external Intelligence Community customers.\n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability. Likewise, studies and activities may be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aerial System (UAS) Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Study for Adaptation of U-2 Sensors for RQ-4 Block 30"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Initiated next gen sensor study and conducted assessment for integration of U-2 sensors or alternative sensors of comparable capability onto the RQ-4B to include comparing how differences in flight performance would affect sensor performance such as enhanced weather capabilities, mission planning and airspace and sensor interoperability."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 30 System Development and Demonstration (SDD)"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Development and Demonstration (includes enterprise management, test and evaluation, software integration, and fielding support for projects 675145, 675146 (Block 40) and 675147 (Ground Segment\/Comm System) as well as program protection projects, studies and analysis supporting future system enhancements)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "182.323"
                                            },
                                            "Text": {
                                                "val": "Development activities to support required sensor upgrades for the RQ-4 as well as completion of Synthetic Aperture Radar - Complex Imagery development testing, development of enhanced weather capabilities, mission planning, upgrades to ASIP SIGINT sensor, sensor enhancements and upgrades, airspace integration activities including Mode 5\/ADS-B, integration of advanced sensors, continued system interoperability, cybersecurity and information assurance and reliability & maintainability, and associated testing & evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "128.239"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "128.239"
                                            },
                                            "Text": {
                                                "val": "Continue activities to support required sensor upgrades for the RQ-4 as well as development of enhanced weather capabilities, mission planning, upgrades to ASIP SIGINT sensor, sensor enhancements and upgrades, airspace integration activities including Mode 5\/ADS-B, integration of advanced sensors, continued system interoperability, cybersecurity and information assurance and reliability & maintainability, and associated testing & evaluation, and begin development of ice protection system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block 30 Government Test and Non-Prime Support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- The majority of this funding supports RQ-4 development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for incidental support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS), other interoperability partners and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.114"
                                            },
                                            "Text": {
                                                "val": "Continue government test and non-prime engineering and technical support and Other Government Costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.448"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.448"
                                            },
                                            "Text": {
                                                "val": "Continue government test and non-prime engineering and technical support and Other Government Costs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.000"
                                        },
                                        "CurrentYear": {
                                            "val": "54.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.552"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.020"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.800"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3840.645"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Block 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.747"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.313"
                                        },
                                        "CurrentYear": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOne": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearThree": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFour": {
                                            "val": "67.265"
                                        },
                                        "BudgetYearFive": {
                                            "val": "68.477"
                                        },
                                        "CostToComplete": {
                                            "val": "837.540"
                                        },
                                        "TotalCost": {
                                            "val": "1562.422"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GSRA\/CSRA Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.668"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "23.688"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RQ-4 program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. A suite of contract vehicles is used for development efforts: primarily, an IDIQ contract covers development, modernization, production, retrofit, fielding, and sustainment efforts through FY 2020.\n\nThe next event is a Milestone (MS) C decision (date 2QFY15). Upon a successful MS C decision concluding the Nunn-McCurdy re-certification process, the RQ-4 program plans to transition from the Production and Deployment phase to the Operations and Support phase of the Defense Acquisition System. Future required capabilities beyond the core Acquisition Category I (ACAT) RQ-4 program are planned to be added over time as separate modification programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number. FY15 and beyond contains budget necessary for GH fleet support with Northrop Grumman."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Manufacturing & Development\/IDIQ Block 30"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.982"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "180.903"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "128.139"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "128.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "574.654"
                                                    },
                                                    "TotalCost": {
                                                        "val": "912.678"
                                                    },
                                                    "TargetValue": {
                                                        "val": "912.678"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.420"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.500"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.020"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number. FY15 and beyond contains budget necessary for GH fleet test support."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.950"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.522"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.008"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.008"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "125.490"
                                                    },
                                                    "TotalCost": {
                                                        "val": "159.970"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk Contracts is not segregated by Budget Project Number. FY15 and beyond contains budget necessary for GH fleet management services support."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.270"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.064"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.064"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "26.662"
                                                    },
                                                    "TotalCost": {
                                                        "val": "36.996"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Government Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.322"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.376"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.376"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "17.948"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.646"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SAR Complex Imagery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Enhanced Weather Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mode 5\/ADS-B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIP Inc 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mission Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Gen Sensor Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sensor Enhancements & Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ice Protection System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "412 Test Wing Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675146"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Block 40"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "99.855"
                        },
                        "PriorYear": {
                            "val": "56.600"
                        },
                        "CurrentYear": {
                            "val": "12.636"
                        },
                        "BudgetYearOne": {
                            "val": "6.814"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.814"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.979"
                        },
                        "BudgetYearThree": {
                            "val": "14.299"
                        },
                        "BudgetYearFour": {
                            "val": "15.148"
                        },
                        "BudgetYearFive": {
                            "val": "15.419"
                        },
                        "CostToComplete": {
                            "val": "19.533"
                        },
                        "TotalCost": {
                            "val": "249.283"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "1. The RQ-4 Block 40 Project was directed by an Acquisition Decision Memorandum (ADM) signed 14 Jun 2011 by USD (AT&L). At the time of the ADM signature, and subsequent designation of projects, budgets had already been finalized.  Prior budgets for all projects are captured under the RQ-4 Baseline project, as its related Project (675144) was the core project for the RQ-4 program prior to the directed restructure."
                        },
                        "ProjectMissionDescription": {
                            "val": "The RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance Intelligence, Surveillance, and Reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios. \n\nRDT&E funding in this project supports design, development, integration, and testing of items needed to meet validated requirements for Block 40 aircraft, including further development, integration and test of the Multi-Platform Radar Technology Insertion Program (MP-RTIP) sensor capabilities. The Block 40 program provides critical Synthetic Aperture Radar (SAR) and Ground Moving Target Indicator (GMTI) data to the warfighter. This funding also supports continued aircraft\/communications systems modernization to include Mode 5\/ADS-B, mission planning upgrade development and testing, program protection projects, enhanced weather capability, radar maritime modes, development and testing of ice protection system, and reliability and maintainability improvements. Funding continues RQ-4 unique development and integration of upgraded capabilities. \n\nIn FY15 and beyond, the RQ-4 Block 40 project 675146 includes the delta costs only for the development of above common capabilities funded with the RQ-4 Block 30 project, 675145. The RQ-4 Block 30 project, 675145, contains the budget necessary for systems engineering\/program management, sofware integration, test and evaluation, and fielding support for the fleet.\n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities may be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aerial System (UAS) Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS).\n\nThe RQ-4 program will maintain capability and interoperability for Block 40 including efforts with system of systems partners and continue to incorporate applicable synergies with other platforms, such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.\n\nActivities also include studies and analysis supporting future system enhancements, current and future program planning, and project execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 40 System Development and Demonstration (SDD)"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Block 40 Payload and Aircraft\/Communications Development and Demonstration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.052"
                                            },
                                            "Text": {
                                                "val": "Continued RQ-4 unique development and integration of MP-RTIP upgraded capabilities. Continued Aircraft\/Communication systems modernization to include Mode 5\/ADS-B, mission planning upgrade, and program protection. Continued aircraft operations surety, cybersecurity and information assurance, and reliability & maintainability and associated testing & evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.636"
                                            },
                                            "Text": {
                                                "val": "Plan to conduct IOT&E and continue development of enhanced weather capabilities, mission planning, airspace integration activities including Mode 5\/ADS-B, sensor software, integration of MP-RTIP radar maritime modes, continued enhancements to system interoperability, cybersecurity, information assurance and reliability & maintainability improvements and associated testing & evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.814"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.814"
                                            },
                                            "Text": {
                                                "val": "Continue development of enhanced weather capabilities, mission planning, airspace integration activities including Mode 5\/ADS-B, sensor software, utilization of radar maritime modes, continued enhancements to system interoperability, cybersecurity, information assurance and reliability & maintainability improvements and associated testing & evaluation, and begin development of ice protection system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 40 Government Test and Non-Prime Support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- The majority of this funding supports RQ-4 development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for incidental support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS), other interoperability partners and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.548"
                                            },
                                            "Text": {
                                                "val": "Continued government test and non-prime engineering and technical support for Block 40 IOT&E and Other Government Costs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.000"
                                        },
                                        "CurrentYear": {
                                            "val": "54.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.552"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.020"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.800"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3840.645"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Blk 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.747"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.313"
                                        },
                                        "CurrentYear": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOne": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearThree": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFour": {
                                            "val": "67.265"
                                        },
                                        "BudgetYearFive": {
                                            "val": "68.477"
                                        },
                                        "CostToComplete": {
                                            "val": "837.540"
                                        },
                                        "TotalCost": {
                                            "val": "1562.422"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GSRA\/CSRA Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.668"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "23.668"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305238F"
                                    },
                                    "Title": {
                                        "val": "NATO AGS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "221.589"
                                        },
                                        "CurrentYear": {
                                            "val": "232.851"
                                        },
                                        "BudgetYearOne": {
                                            "val": "197.486"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "197.486"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.292"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "825.015"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RQ-4 program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. A suite of contract vehicles is used for development efforts: a legacy EMD \"C\" contract is being phased out with the completion of current efforts; an  IDIQ contract covers development, modernization, production, retrofit, fielding, and sustainment efforts through FY 2020.\n\nThe next event is a Milestone (MS) C decision (date 2QFY15). Upon a successful MS C decision concluding the Nunn-McCurdy re-certification process, the RQ-4 program plans to transition from the Production and Deployment phase to the Operations and Support phase of the Defense Acquisition System. Future required capabilities beyond the core Acquisition Category I (ACAT) RQ-4 program are planned to be added over time as separate modification programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Target Value of the RQ-4 EMD & IDIQ Contracts is not segregated by Budget Project Number."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 EMD & IDIQ contracts is not segregated by Budget Project Number.  FY15 and beyond budget necessary for RQ-4 fleet support with Northrop Grumman is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Manufacturing & Development\/IDIQ Block 40"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "84.351"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "37.052"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.636"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.814"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.814"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "73.378"
                                                    },
                                                    "TotalCost": {
                                                        "val": "214.231"
                                                    },
                                                    "TargetValue": {
                                                        "val": "214.231"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 contract is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non-Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.712"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.657"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.369"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 effort is not segregated by Budget Project Number. FY15 and beyond budget necessary for GH fleet test support is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.700"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.531"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.231"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 contracts is not segregated by Budget Project Number. FY15 and beyond budget necessary for GH fleet management services support and other government cost is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.208"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.832"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.040"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.884"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.528"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.412"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Block 40 IOT&E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 40 IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 40 FOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GH MP-RTIP Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sensor Enhancement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Enhanced Weather Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mode 5\/ADS-B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mission Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ice Protection System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "412 Test Wing Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675147"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Grnd Segment\/Comm System"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "31.606"
                        },
                        "PriorYear": {
                            "val": "22.309"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "31.460"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.460"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "53.129"
                        },
                        "BudgetYearThree": {
                            "val": "112.791"
                        },
                        "BudgetYearFour": {
                            "val": "141.400"
                        },
                        "BudgetYearFive": {
                            "val": "143.930"
                        },
                        "CostToComplete": {
                            "val": "86.419"
                        },
                        "TotalCost": {
                            "val": "623.044"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "1. The RQ-4 Ground Segment\/Communications System Sub-Program was directed by an Acquisition Decision Memorandum (ADM) signed 14 Jun 2011 by USD (AT&L). At the time of the ADM signature, and subsequent designation of sub-program projects, budgets had already been finalized.  The budgets for all projects are captured under the RQ-4 baseline project, as its related Project (675144) was the core project for the RQ-4 program prior to the directed restructure.    \n\n2. The FY15 PB reinstated the Block 30s. As a result, the operational need for ground stations and modern communications significantly increased. The GSM and CSM projects will resolve Diminishing Manufacturing Supply (DMS) and obsolescence issues in the ground and communication systems and support a 20 year planned operational lifecycle for the Block 20\/30\/40 fleet.  GSM and CSM will leverage previous design and development efforts to implement cost-effective solutions."
                        },
                        "ProjectMissionDescription": {
                            "val": "The RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance intelligence, surveillance, and reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.  \n\nRDT&E funding in this project supports design, development, integration and testing of the weapon system's ground elements and communications capabilities.  The ground segment currently includes the Mission Control Elements (MCE), the Launch and Recovery Elements (LRE), and the networking resources required to simultaneously disseminate intelligence information while remaining compliant with DoD cybersecurity network requirements to operate on the Global Information Grid.\n\nThe RDT&E funding in this project also supports the GSM and CSM efforts, as well as next generation communications capabilities. GSM resolves fleet grounding DMS and obsolescence issues associated with ground segment equipment and provides critical warfighter capabilities such as building-based multi-aircraft control. CSM resolves critical DMS and obsolescence issues in the RQ-4 communication infrastructure and provides enhancements across the RQ-4 communication network. Both GSM and CSM will employ the USAF Unmanned Aerial System (UAS) Command and Control Initiative (UCI) and the DoD's Unmanned Control Segment standards (UCS), using a service-oriented, open architecture approach.\n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities may be initiated to explore the utility of next-generation communications technologies, as well as emerging architectural standards such as UCI and UCS.  \n\nThe RQ-4 program will maintain and upgrade interoperability for Blocks 20\/30\/40 with system of systems partners and continue to incorporate applicable synergies with other platforms such as  the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.  The networking capability for intelligence dissemination is required to provide the data transport interface between the Weapons System, Operations Centers, and external Intelligence Community customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Ground Station \/ Communications System- Critical Obsolescence Issues & Modernization"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Ground Segment\/ Communications System Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.804"
                                            },
                                            "Text": {
                                                "val": "Continued ground station and communication system updates to resolve critical obsolescence issues"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.785"
                                            },
                                            "Text": {
                                                "val": "Continue to resolve critical DMS and obsolescence issues with ground segment equipment and software in support of the planned 20-year operational lifecycle.  Maintain and upgrade interoperability and cybersecurity with system of systems partners and continue to incorporate applicable synergies with other platforms, such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements. Incorporate Air Vehicle (AV) modifications\/upgrades into the ground segment architecture.  Design and develop the Ground Segment Modernization (GSM) project, leveraging earlier efforts which developed a modern aircraft command and control capability on an open-systems architecture.  Remaining development includes software integration, sensor payload command and control, interface implementation, installation of hardware\/software into facilities, testing & evaluation.  Implement Command and Control Initiative (UCI) and Unmanned Control Segment (UCS) standards into the Global Hawk architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Test and Non-Prime support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- The majority of this funding supports Global Hawk development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for incidental support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS), other interoperability and cybersecurity partners and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.505"
                                            },
                                            "Text": {
                                                "val": "Continued government test and non-prime engineering and technical support and Other Government Costs for Ground Segment \/ Comm systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.675"
                                            },
                                            "Text": {
                                                "val": "Continue government test and non-prime engineering and technical support and Other Government Costs for Ground Segment \/ Comm systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.000"
                                        },
                                        "CurrentYear": {
                                            "val": "54.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.552"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.020"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.800"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3840.645"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Block 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.747"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.313"
                                        },
                                        "CurrentYear": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOne": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearThree": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFour": {
                                            "val": "67.265"
                                        },
                                        "BudgetYearFive": {
                                            "val": "68.477"
                                        },
                                        "CostToComplete": {
                                            "val": "837.540"
                                        },
                                        "TotalCost": {
                                            "val": "1562.422"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GS\/CS Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.668"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "23.668"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RQ-4 program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. A suite of contract vehicles is used for development efforts: a legacy EMD \"C\" contract is being phased out with the completion of current efforts; and a 2015 follow-on IDIQ covers development, modernization, production, retrofit, fielding, and sustainment efforts through FY 2020.\n\nThe next event is a Milestone (MS) C decision (date 2QFY15). Upon a successful MS C decision concluding the Nunn-McCurdy re-certification process, the RQ-4 program plans to transition from the Production and Deployment phase to the Operations and Support phase of the Defense Acquisition System. Future required capabilities beyond the core Acquisition Category I (ACAT) RQ-4 program are planned to be added over time as separate ACAT modification programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Target Value of the RQ-4 EMD & IDIQ Contracts is not segregated by Budget Project Number."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 EMD & IDIQ Contracts is not segregated by Budget Project Number. FY16 and beyond budget necessary for RQ-4 fleet support with Northrop Grumman is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering, Manufacturing & Development\/IDIQ Ground Segment and Communication Systems"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.271"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.805"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "30.785"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "30.785"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "534.294"
                                                    },
                                                    "TotalCost": {
                                                        "val": "613.155"
                                                    },
                                                    "TargetValue": {
                                                        "val": "613.155"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 contracts is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non-Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.447"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.291"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.375"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.788"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 effort is not segregated by Budget Project Number. FY16 and beyond budget necessary for RQ-4 fleet test support is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.500"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 contracts is not segregated by Budget Project Number. FY16 and beyond budget necessary for RQ-4 fleet management services support and other government cost is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.269"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.132"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.401"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.119"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.081"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.200"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Grnd Segment Obsolescence Fixes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Segment Maintenance\/Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Segment Modernization Project (GSMP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Comm Sys Obsolescence Fixes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Comm Systems Maintenance\/Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Communication System Modernization Project (CSMP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "412 Test Wing Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675148"
                    },
                    "ProjectTitle": {
                        "val": "Common-Airborne Sense & Avoid (C-ABSAA)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.036"
                        },
                        "PriorYear": {
                            "val": "17.098"
                        },
                        "CurrentYear": {
                            "val": "11.829"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "47.963"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2016,  PE 0305220F, RQ-4, Project 675148, Common-Airborne Sense & Avoid (C-ABSAA), transferred to PE 0305206F, Airborne Reconnaissance Systems, Project 675148. This transfer will provide greater visibility into this capability and prepares for expanded applications by making the capability program and platform agnostic."
                        },
                        "ProjectMissionDescription": {
                            "val": "Common-Airborne Sense and Avoid (C-ABSAA) is an analysis and developmental effort in the pre-Material Development Decision phase of the acquisition lifecycle which supports emerging warfighter requirements to fully integrate Group 4-5 RPA into the National Airspace System (NAS), international airspace, other nations' sovereign airspace, and operational combat airspace to conduct the entire range of military operations across all mission environments.  C-ABSAA also supports the \"Worldwide Operations\" Key Performance Parameter (KPP) in larger Remotely Piloted Aircraft (RPA) requirement documents, and Public Law 112-239 directing DoD collaboration with the Federal Aviation Administration (FAA) and the National Air and Space Administration (NASA) to safely integrate RPA in the NAS.  Funding in this project supports the development of a Sense and Avoid (SAA) capability set for Group 4-5 RPA and covers analysis, research, and developmental activities as well as infrastructure and other government costs.  Ongoing activities include support to the development of warfighter requirements and analysis of possible solution alternatives, the collaboration with the FAA, NASA, and Office of the Secretary of Defense (OSD) to develop national policy and standards, and SAA related studies, analysis, modeling and simulation, program planning and project execution.  RPA platform specific integration and testing is not included."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SAA-Related Requirements Development and Analysis, National Policy Standards Development, and Technology Development and Demonstration"
                                    },
                                    "Description": {
                                        "val": "Support development and analysis of warfighter requirements and analysis of possible solution alternatives.  Develop Sense and Avoid (SAA) technology and capabilities for Group 4-5 RPA.  Collaborate with the FAA, NASA, and OSD to develop national policy and standards.  Conduct SAA-related studies, analysis, modeling and simulation, demonstrations, program planning and project execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.098"
                                            },
                                            "Text": {
                                                "val": "Supported Air Combat Command with development of an Initial Capabilities Document, and prepared to conduct Analysis of Alternatives study.  Collaborated with FAA and NASA on national policy and standards.  Built and exercised modeling and simulation capabilities to support requirements, policy\/standards, and technology development.   Continued SAA science and technology research and development with the AF Research Lab (AFRL)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.829"
                                            },
                                            "Text": {
                                                "val": "Support Air Combat Command with Initial Capabilities Document development and approval, and conduct Analysis of Alternatives study.  Continue to collaborate with FAA and NASA on national policy and standards, and to build and exercise modeling and simulation capabilities to support requirements, policy\/standards, and technology development.   Continue SAA science and technology research and development with the AFRL to demonstrate SAA technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, Project 675148, C-ABSAA, efforts transferred to PE 0305206F, Airborne Reconnaissance Systems, Project 675148."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "C-ABSAA will integrate Better Buying Power 3.0 initiatives throughout its acquisition lifecycle and rely upon acquisition of government data rights to maximize contractor competition from Technology Development through Production. The program uses an incremental acquisition strategy to provide the warfighter with SAA capability for Group 4-5 RPA with increased, time-phased capability improvements as technology and risks achieve satisfactory levels. Group 4-5 RPA platforms will be expected to integrate the C-ABSAA provided capability into their unique systems via retrofit or in production."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "In FY 2016,  PE 0305220F, RQ-4, Project 675148, Common-Airborne Sense & Avoid (C-ABSAA), transferred to PE 0305206F, Airborne Reconnaissance Systems, Project 675148. This transfer will provide greater visibility into this capability and prepares for expanded applications by making the capability program and platform agnostic.\n\nThe Target Value supports multiple technology development contracts."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "C-ABSAA Technology Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.106"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "16.512"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.732"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "45.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "The Target supports multiple technology development contracts."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.930"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.586"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.097"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.613"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Initial Capabilities Document (ICD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Analysis of Alternatives"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Material Development Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Material Solution Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67RTIP"
                    },
                    "ProjectTitle": {
                        "val": "MP-RTIP"
                    },
                    "MdapCode": {
                        "val": "293"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "198.282"
                        },
                        "PriorYear": {
                            "val": "14.173"
                        },
                        "CurrentYear": {
                            "val": "10.926"
                        },
                        "BudgetYearOne": {
                            "val": "16.092"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.092"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.663"
                        },
                        "BudgetYearThree": {
                            "val": "11.802"
                        },
                        "BudgetYearFour": {
                            "val": "11.811"
                        },
                        "BudgetYearFive": {
                            "val": "12.022"
                        },
                        "CostToComplete": {
                            "val": "12.000"
                        },
                        "TotalCost": {
                            "val": "294.771"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY09, the Multi-Platform Radar Technology Insertion Program (MP-RTIP) funding was transferred to program 0305220F (RQ-4) Global Hawk (GH).  Therefore, the data in this package includes only FY09 and subsequent funding related to program 0305220F."
                        },
                        "ProjectMissionDescription": {
                            "val": "The MP-RTIP sensor was designed as a family of modular, scalable sensors to provide next generation capabilities to support sustainable network centric operations with integrated Command and Control, Intelligence, Surveillance and Reconnaissance (C2ISR) capability. MP-RTIP provides the RQ-4 Block 40 aircraft with advanced Synthetic Aperture Radar (SAR) and Moving Target Indicator (MTI) sensor capabilities.\n\nThis project (67RTIP) includes all MP-RTIP design, development, test, and integration efforts for the RQ-4 Block 40 Platform. Integration activities include platform integration of the MP-RTIP sensor and sustainment logistics planning support. MP-RTIP studies and development insertion include the implementation of Maritime Modes (MM), Maritime Inverse SAR (MISAR), technical refresh, product improvements and other advanced capabilities.\n\nActivities also include studies and analysis supporting current and future program planning and future modes development based on user requirements. This program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DRACO classified program administered by GH Program Office with MP-RTIP funds"
                                    },
                                    "Description": {
                                        "val": "Development and integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.751"
                                            },
                                            "Text": {
                                                "val": "Classified"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development and Integration"
                                    },
                                    "Description": {
                                        "val": "MP-RTIP development and integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.422"
                                            },
                                            "Text": {
                                                "val": "Completed MP-RTIP RSD 1.4.5 software build and integrated into KD 2.2.3. Initiated RSD 1.4 increment (1.4.6) & RSD 1.5 software builds. Completed System Level Performance Verification (SLPV)\/Integrated System Evaluation (ISE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.876"
                                            },
                                            "Text": {
                                                "val": "Completing development of the MP-RTIP RSD 1.4 increment (1.4.6) software build. Align development support of RSD 1.5."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.307"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.307"
                                            },
                                            "Text": {
                                                "val": "Will complete RSD 1.5 through Flight Testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "MP-RTIP Test & Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.050"
                                            },
                                            "Text": {
                                                "val": "Complete MP-RTIP Test & Evaluation support for RSD 1.4.6 which will include US Maritime Modes. Initiate and complete Test and Evaluation Planning for remaining requirements including but not limited to test planning, test force and range support, interoperability compliance and third party performance reviews."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.785"
                                            },
                                            "Text": {
                                                "val": "Will complete test & evaluation for flight test of RSD 1.5. Also, initiate Test and Evaluation Planning for remaining requirements including but not limited to test planning, test force and range support, interoperability compliance and third party performance reviews."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.000"
                                        },
                                        "CurrentYear": {
                                            "val": "54.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.800"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.552"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.020"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.800"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3840.645"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Blk 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.747"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.313"
                                        },
                                        "CurrentYear": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOne": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "50.022"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearThree": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFour": {
                                            "val": "67.265"
                                        },
                                        "BudgetYearFive": {
                                            "val": "68.477"
                                        },
                                        "CostToComplete": {
                                            "val": "837.540"
                                        },
                                        "TotalCost": {
                                            "val": "1562.422"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GSRA\/CSRA Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.668"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "23.668"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E: BA07: PE 0305238F"
                                    },
                                    "Title": {
                                        "val": "NATO AGS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "221.589"
                                        },
                                        "CurrentYear": {
                                            "val": "232.851"
                                        },
                                        "BudgetYearOne": {
                                            "val": "197.486"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "197.486"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.292"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "825.015"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The sole source SDD contract is planned to be closed out in FY 2016."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MP-RTIP"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "157.782"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.109"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.697"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.824"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.824"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "40.288"
                                                    },
                                                    "TotalCost": {
                                                        "val": "229.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IRT Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.105"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.105"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.105"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Logistics Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.667"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.667"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.667"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Test Force, Edward AFB, Joint Interoperability Test Center, Navy, & IV&V"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.936"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.780"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.780"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.360"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.126"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.297"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.883"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.973"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.030"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.030"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "8.520"
                                                    },
                                                    "TotalCost": {
                                                        "val": "38.703"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Boston, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.495"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.181"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.458"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.458"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.130"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.470"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Test Phase 2B - Interoperability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSD 1.4.5 Software Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRACO"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSD 1.4.6 Software Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSD 1.5 Software Build (Post IOT&E Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Phase 3 - ISE (SLPV)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOT&E Readiness & IOT&E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Future Software Builds"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}