{
    "id": "f7748d08c5a76e16399ced4f9954941137b4f863",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603781D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI)"
        },
        "R1LineNumber": {
            "val": "62"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.167"
            },
            "CurrentYear": {
                "val": "15.754"
            },
            "BudgetYearOne": {
                "val": "15.202"
            },
            "BudgetYearOneBase": {
                "val": "15.202"
            },
            "BudgetYearTwo": {
                "val": "15.181"
            },
            "BudgetYearThree": {
                "val": "15.653"
            },
            "BudgetYearFour": {
                "val": "16.132"
            },
            "BudgetYearFive": {
                "val": "16.351"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Software is a key to meeting the Department of Defense's (DoD’s) increasing demand for high-quality, affordable, and timely national defense systems.  Systemic software issues are significant contributors to poor program execution, and reliance on software-intensive mobile and net based products and systems has been increasing (for example (e.g.), Joint Tactical Radio System, USS ZUMWALT (DDG-1000), Joint Strike Fighter, F-22, and Army Modernization).  As stated in the 2010 National Research Council of the National Academy of Sciences report entitled Critical Code, “It is dangerous to conclude that we are reaching a plateau in capability and technology for software producibility.”  The report notes that software is “…unconstrained by traditional physical engineering limitations…” and what we can accomplish is derived “…from [the] human intellectual capacity to conceptualize and understand systems….”  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  The Software Engineering Institute (SEI) Program Element (PE) addresses the critical need to research, develop, and rapidly transition state-of-the-art software technology, tools, development environments, and best practices to improve the engineering, management, fielding, evolution, acquisition, and sustainment of software-intensive DoD systems.  The SEI’s program of work coordinates across the Department through Reliance 21, the overarching framework of the DoD’s Science and Technology (S&T) joint planning and coordination process.  This PE directly benefits these DoD S&T Communities of Interest (COI): Command, Control, Communications, Computers, and Intelligence (C4I); Autonomy; Cyber; and Engineered Resilient Systems.  Additionally, this PE benefits every COI to some degree due to the ubiquitous nature of software.  This PE also leverages expertise in government, industry, and academia to enable the development of joint-Service capabilities.\n\nSoftware is more pervasive than ever and computer programs are growing in size and complexity.  Designing, managing, and securing integrated, complex, and large-scale mission-critical systems are abilities that the DoD and the Defense Industrial Base have not yet mastered.  To address this, the PE funds research and development within the SEI Federally Funded Research and Development Center (FFRDC) and, to access particular expertise, in the Services, industry, and academia.\n\nThe SEI FFRDC is the DoD’s dedicated source for software research and development.  It is an institute which enables the exploitation of emerging software technology by bringing engineering, management, and security discipline to software acquisition, development, and evolution.  The SEI FFRDC focuses on software technology areas judged to be of the highest payoff in meeting defense needs.\n\nPrivate sector investment has created rapid advances in information technologies, but the pace of transition to DoD applications is often very slow or the commercial applications do not meet DoD unique needs, e.g., high assurance software or large-scale integrated systems.  The DoD needs to create opportunities to discover emerging technologies, to evaluate their potential to fit DoD needs, and where appropriate, conduct critical tests of the technologies under DoD conditions.  The Software Producibility Initiative, project P783, works across the Services, industry, and academia to research and transition software science and tools that address the capacity to design, produce, assure, and evolve software-intensive systems in a predictable manner while effectively managing risk, cost, schedule, quality, and complexity."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.006"
                },
                "CurrentYear": {
                    "val": "15.776"
                },
                "BudgetYearOne": {
                    "val": "15.778"
                },
                "BudgetYearOneBase": {
                    "val": "15.778"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.167"
                },
                "CurrentYear": {
                    "val": "15.754"
                },
                "BudgetYearOne": {
                    "val": "15.202"
                },
                "BudgetYearOneBase": {
                    "val": "15.202"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.839"
                },
                "CurrentYear": {
                    "val": "-0.022"
                },
                "BudgetYearOne": {
                    "val": "-0.576"
                },
                "BudgetYearOneBase": {
                    "val": "-0.576"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.223"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.616"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Sec 8104"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.022"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.043"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.043"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.533"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.533"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding decreases were used to pay for higher priority DoD bills."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P781"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.148"
                        },
                        "CurrentYear": {
                            "val": "15.754"
                        },
                        "BudgetYearOne": {
                            "val": "15.202"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.202"
                        },
                        "BudgetYearTwo": {
                            "val": "15.181"
                        },
                        "BudgetYearThree": {
                            "val": "15.653"
                        },
                        "BudgetYearFour": {
                            "val": "16.132"
                        },
                        "BudgetYearFive": {
                            "val": "16.351"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Software Engineering Institute (SEI) Federally Funded Research and Development Center (FFRDC) was established in 1984 as an integral part of the Department of Defense’s (DoD’s) initiative to identify, evaluate, and transition software engineering technologies and practices.  The SEI maintains unique software research and program support capabilities in a space where the Defense Industrial Base and academia cannot as readily address challenges.  The mission of the SEI is to provide DoD with technical leadership and innovation through research and development to advance the practice of software engineering and technology.  The Institute works across Government, industry, and academia to improve the state of software engineering from the technical, acquisition, and management perspectives.  The SEI engages in research and development of critical software technologies and tools, and collaborates with the larger software engineering research community.  It facilitates rapid transition of software engineering technologies into practice, and evaluates emerging software engineering technologies to determine their potential for improving software-intensive DoD systems.  Since its inception, the SEI has helped to transform the fields of software engineering and acquisition, network security, real-time systems, software architectures, and software-engineering process management."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute (SEI) Research"
                                    },
                                    "Description": {
                                        "val": "SEI research projects are awarded on a competitive basis across the SEI.  The number of projects will vary from year to year based on the size and scope of proposed projects.  Research projects cross-cut the FFRDC's experience base in order to advance existing SEI research initiatives and explore new technical ideas.  SEI research focuses on the most significant and pervasive software challenges within the DoD such as computing for real-time and embedded-systems, multi-core programming, computing at the tactical edge, System of System architectures, discovering effective agile methods to develop DoD-scale systems, cyber-security, and measurement-driven methods to improve the efficiency of acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.148"
                                            },
                                            "Text": {
                                                "val": "• Developed a technique to enable proactive cost control for major systems, by determining the impact of design choices on the cost of testing.  SEI blog post highly accessed in calendar year (CY) 2014: 166,000 hits.\n• Developed programming techniques for multicore platforms that increase speed and efficiency while guaranteeing real-time performance.  Awarded Top Paper at the 20th Institute of Electrical and Electronics Engineers Real-Time and Embedded Technology and Applications Symposium.\n• Developed a method and tools to aid in assuring quality and affordability in the design of big data systems.  Work tailored to and piloted on the Military Health System. \n• Using the CERT insider threat detection test bed, evaluated trends and developed guidance which substantially improves sustained protection against internal attacks.\n• Transitioned research in vulnerability discovery, for both dynamic and static analysis, resulting in software applications that are hardened and more secure, before and after they are deployed into the DoD infrastructure, including a Major Defense Acquisition Program.\n• Automated the detection of malicious network traffic to identify indicators that expedite detection and response.\n• Prototyped algorithms that will allow DoD to take advantage of computer network modeling and analysis for insider threat and advanced persistent threat faster and at less cost.  Technology transferred to multiple DoD entities and U.S. Government independent establishments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.754"
                                            },
                                            "Text": {
                                                "val": "• Increase the library of algorithms that allow DoD to better utilize computer network modeling and analysis, social network analysis, and command and control decisions.\n• Pilot and evaluate technologies and methods to assess individual and team performance during exercises for cyber mission teams.\n• Prototype software systems for detecting enterprise-wide insider threats.\n• Research disruptive technologies, such as dynamic collaborative human-computer decision systems, insider threat mitigation, and automated vulnerability discovery in mobile platforms; providing new operational cybersecurity capabilities for the DoD.\n• Develop and pilot automated vulnerability discovery tools to assist in determining how to allocate resources towards unique, exploitable software faults, reducing system exposure and cost.\n• Test, validate and release guidelines that will enable DoD programs to successfully use Agile software development approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.202"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.202"
                                            },
                                            "Text": {
                                                "val": "• Develop and pilot high performance, assured software components for the processing, exploitation, and dissemination of information from the tactical edge to the data center.  Evolve programming and computation frameworks for ‘big data’ analysis, network protocols and architectures enabling access to data in disconnected, intermittent, low-bandwidth environments for better situational awareness and response.\n• Evolve model-based engineering of software-reliant systems and assurance evidence with support for automatic generation of secure code, virtual integration of subsystems and assessment of technical debt, automated code vulnerability discovery and synthesis of assurance cases.\n• Advance the state of the practice in electronic warfare and protection on coordinated and distributed network enabled systems, maturing and transitioning tools and techniques for software architectures and adaptive capabilities.  \n• Enhance and deploy scalable and validated methods and software support for the training and development of the cyber and software engineering workforce.\n• Explore new lines of research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 2, PE # 0602751D8Z, P278"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.699"
                                        },
                                        "CurrentYear": {
                                            "val": "9.143"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.824"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.824"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.961"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.471"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.262"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.401"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Transition of tools and practices for use in DoD programs of record and to the Defense Industrial Base, and number of agencies and organizations sponsoring work.\n• Number of publications in refereed journals and peer reviewed reports.\n• Number of external research collaborations and interactions with the broader software engineering research community.\n• Adoption of coding standards and process techniques by standards bodies, working groups, and software\/systems engineering organizations.\n• Number of training courses and curricula developed to contribute to the growth of capability in the software engineering research and development community and software\/system acquisition workforce.\n• Development of new scalable technical and software-enabled cyber security approaches that address software assurance and improve enterprise resiliency.\n• Reduced number of mission-critical software-reliant acquisition program failures and cost and schedule overruns, as well as quantitative improvements in overall system cost, time to develop, and performance – this will be evidenced by: reductions in time to test software and the amount of rework required; improved ability to articulate software requirements; development of techniques that offer orders of magnitude improvement in software productivity; development of new software algorithms and abstractions; and decreased number of software defects found through application of effective process and software development methods."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P783"
                    },
                    "ProjectTitle": {
                        "val": "Software Producibility Initiative"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.019"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Shortcomings in software development often lead to schedule slippage, cost growth, and mission compromise.  These shortcomings can frequently be traced to software development technologies which are not capable of addressing the scale and complexity of the software needed in today’s systems.  The Software Producibility Initiative seeks to conduct an integrated program of research from applied research through demonstration and evaluation to advance the state-of-the-art in the producibility of software for DoD systems, particularly those systems characterized by high complexity, need for robustness, information assurance, real-time performance, and physical distribution.  The Initiative maintains a portfolio of work relevant to the Warfighter and DoD needs by periodically evaluating technology development efforts, retiring those that are under performing, and starting new efforts based on risk-reward priority.  The Initiative demonstrates new underlying software technology and tools in various domains, e.g., Networks, Modeling and Simulation, Avionics, Signals Intelligence, where DoD can benefit and enhance the transition paths for the underlying technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Producibility Initiative"
                                    },
                                    "Description": {
                                        "val": "The Software Producibility Initiative seeks to improve the Department of Defense’s (DoD’s) ability to design, build, test, and sustain software-intensive systems which meet mission critical requirements, exhibit predictable behavior, and enable evolution and interoperability.  Technology thrust areas include specification of complex requirements; “correct-by-construction” software development; scalable composition; high-confidence software and middleware; system architectures for network-centric environments; technologies for system visualization, testing, verification, and validation; model-driven development approaches; timing techniques for real-time embedded-systems; static and run-time analysis of software; design tools and development environments; and secure and efficient coding practices.  Major collaborators and performers include the U.S. Army Aviation and Missile Research Development and Engineering Center (AMRDEC) and the Air Force Research Laboratory (AFRL), as well as academia and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.019"
                                            },
                                            "Text": {
                                                "val": "• Explored model-based design and the use of formal mathematics and logic to build systems that behave as intended, and only as intended.\n• Using model-driven development, demonstrated the value of early discovery of potential system integration issues on the AMRDEC Joint Multi-role Rotorcraft technology demonstration program. \n• Developed a programming language and run-time system (open source) that enables high-level language support for exposing and managing node failure in high performance computing systems and commodity clusters.\n• Established guidance on techniques and principles for design-time and run-time tools that anticipate change and exhibit resilience.\n• Demonstrated and tested a software tool suite that verifies early design through automatically-generated, mathematically-verifiable requirements statements.\n• Developed tools to reduce software bloat and speed up execution time in C, C++, and other-languages. Began transition of tools to customers within the Naval Research Laboratory.\n• Wrote a Software Development fact book and analyzed software engineering acquisition data to determine Return on Investment.\n• Completed development of a technology roadmap that identifies critical capability thresholds to improve software producibility and an intellectual property strategy guide and template.\n• Established a modeling environment for the design of safety-critical applications with better safety guarantees.  Technology transferred through a course developed and delivered at Virginia Polytechnic Institute.\n• Developed, up to run-time implementation, a model for composing parallel applications in a heterogeneous multicore environment that would allow applications to be ported more easily to different computers.\n• Continued work to speed the transition of software research and development that increases the affordability of acquisition programs in accordance with the DoD’s Better Buying Power initiative.\n• Identified which techniques supporting model-based design of complex, heterogeneous, software intensive systems are sufficiently mature for transition into industrial practice, which require further research investment, and which should be abandoned.\n• Successfully concluded the Software Producibility Initiative by transitioning technologies where able and completing plans in remaining execution years."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "• Number of tools developed which enable the specification of interface formalisms, the definition of component interfaces, and the checking of correct composition.\n• Demonstrable reduction in the number of vulnerabilities and errors detected in software code of large software systems.\n• Number of transitions of promising systems and software engineering technologies to the DoD and Defense Industrial Base, and successful adoption of technologies by early adopter partners.\n• Observed improvements in cost, schedule, and performance via advances in the producibility of software for complex DoD systems and the productivity of software developers. \n• Number of multiple, active collaborations achieved between Software Producibility performers and the broader software engineering research community.\n• Number of coordinated and joint-Service activities across research efforts."
                        }
                    }
                }
            ]
        }
    }
}