{
    "id": "f9c98a1cb0a09a96596c51abd771639d754ca684",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603313A"
        },
        "ProgramElementTitle": {
            "val": "Missile and Rocket Advanced Technology"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "81.951"
            },
            "CurrentYear": {
                "val": "79.934"
            },
            "BudgetYearOne": {
                "val": "49.449"
            },
            "BudgetYearOneBase": {
                "val": "49.449"
            },
            "BudgetYearTwo": {
                "val": "52.190"
            },
            "BudgetYearThree": {
                "val": "58.142"
            },
            "BudgetYearFour": {
                "val": "56.688"
            },
            "BudgetYearFive": {
                "val": "59.300"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures, fabricates, and demonstrates advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability. Project 206 develops high fidelity simulations for advanced tactical missiles and interceptors. Project 263 demonstrates missile and interceptor systems with capabilities to provide protection against rockets, artillery, and mortars; provide precision weapons for small units in close combat; provide precision long-range fires; and provide minimum smoke propulsion for aviation missiles. Project 704 demonstrates the capability to detect and track rocket, artillery, mortar, and unmanned air vehicles threats. Project G03 demonstrates missile-based deployable force protection and fire control systems as well as defense against unmanned aerial vehicles and rotary wing aircraft. NA6 is a congressional increase project.\n \nWork in this PE is complimentary to PE 0602303A (Missile Technology), and is fully coordinated with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), PE 0603270A (Electronic Warfare Technology), PE 0603734A (Combat Engineering Systems), and PE 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC) located at Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.975"
                },
                "CurrentYear": {
                    "val": "44.957"
                },
                "BudgetYearOne": {
                    "val": "53.312"
                },
                "BudgetYearOneBase": {
                    "val": "53.312"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "81.951"
                },
                "CurrentYear": {
                    "val": "79.934"
                },
                "BudgetYearOne": {
                    "val": "49.449"
                },
                "BudgetYearOneBase": {
                    "val": "49.449"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.024"
                },
                "CurrentYear": {
                    "val": "34.977"
                },
                "BudgetYearOne": {
                    "val": "-3.863"
                },
                "BudgetYearOneBase": {
                    "val": "-3.863"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.023"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "35.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.700"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.724"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.863"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.863"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Missile Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.226"
                        },
                        "CurrentYear": {
                            "val": "1.764"
                        },
                        "BudgetYearOne": {
                            "val": "1.731"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.731"
                        },
                        "BudgetYearTwo": {
                            "val": "2.435"
                        },
                        "BudgetYearThree": {
                            "val": "2.475"
                        },
                        "BudgetYearFour": {
                            "val": "2.488"
                        },
                        "BudgetYearFive": {
                            "val": "2.574"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced modeling and simulation technologies for missile design and analysis. Evaluation of missile technology by means of modeling and simulation provides a cost-effective method that supports missile maturation throughout the weapon system life cycle. This effort permits a reduction in the number of flight tests required for programs of record as well as improves the confidence of flight test readiness and probability of flight test success.  \n\nThis project support efforts in the Army science and technology Lethality portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center, (AMRDEC) Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced analysis and high fidelity modeling and simulation technologies for advanced missiles and interceptor design and analysis. Evaluation of missile technology through modeling and simulation provides a cost-effective method to support missile maturation throughout the weapon system life cycle. This effort shortens component design timelines, reduces integration activities, enables a reduction of flight tests required for programs of record and improves the confidence of flight test readiness and the probability of flight test success."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.226"
                                            },
                                            "Text": {
                                                "val": "Completed scene generation technology for improved fidelity and runtime of complex millimeter wave (MMW) scenes; improved fidelity of complex modeling and simulation through the leveraging of advancements in microprocessor speed and throughput; enhanced endgame lethality modeling to evaluate the effectiveness of complex shaping of integrated blast fragmentation warheads; conducted component and system level analysis simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.764"
                                            },
                                            "Text": {
                                                "val": "Design a radio frequency scene generation algorithm and begin hardware\/software integration into hardware-in-the-loop to support testing of advanced MMW sensors. Design an integrated, cohesive sensor development modeling and simulation environment to significantly reduce seeker design and development timeline. Complete missile life-cycle cost analysis model, optimized for use during the S&T phase of technology development to design in cost saving features."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.731"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.731"
                                            },
                                            "Text": {
                                                "val": "Will mature radio frequency (RF) scene generation algorithms and continue hardware\/software integration into hardware-in-the-loop to support testing of advanced millimeter wave radar sensors. Will mature a modeling and simulation environment to significantly reduce seeker algorithm design and development timelines. Will refine and validate missile life-cycle cost analysis model against existing life-cycle cost information, optimized for use during the S&T phase of technology development to design in cost saving features. Will design and begin development of a testbed to explore advanced network integration techniques for emerging air and missile defense weapons reducing hardware integration costs and improving weapons pairing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "263"
                    },
                    "ProjectTitle": {
                        "val": "Future Msl Tech Integr(FMTI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.829"
                        },
                        "CurrentYear": {
                            "val": "32.386"
                        },
                        "BudgetYearOne": {
                            "val": "27.572"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.572"
                        },
                        "BudgetYearTwo": {
                            "val": "28.484"
                        },
                        "BudgetYearThree": {
                            "val": "34.629"
                        },
                        "BudgetYearFour": {
                            "val": "34.183"
                        },
                        "BudgetYearFive": {
                            "val": "35.916"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, fabricates, and demonstrates advanced missile and interceptor technologies, such as seekers, guidance and controls, propulsion, and airframes. The project goal is to reduce the life-cycle costs and cost per kill of precision guided missiles and interceptors. \n\nThis project support efforts in the Army science and technology Lethality and Ground Maneuver portfolio.\n\nThis project matures technologies from PE 0602303A and directly supports systems managed by the Program Executive Officer for Missiles and Space. Work in this project is in collaboration with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technologies), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Organic Precision Munition Integrated Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, integrates, and flight demonstrates critical components to enhance system-level performance of a small precision munition. The effort provides a soldier portable, 5.5 pound, precision guided munition to enable small units to organically dominate asymmetric threats in complex terrain. The goals include improved: target tracking that distinguishes soft targets (to include personnel), effects against soft targets, communication with munition in flight, and power sources for increased flight and storage time. This effort matures and demonstrates technology from PE 0602303A, PE 0602624 Project H28, and the Applied Smaller, Lighter, and Cheaper Munition Components effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.223"
                                            },
                                            "Text": {
                                                "val": "Implemented and flight tested enhanced image stabilization and people tracking algorithms in form-factored modular hardware architecture; completed packaged design, fabricated, and flight tested final form-factored digital data link hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Fire Control Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates Technical Fire Control technology necessary to generate and execute a firing solution for defeat of rocket, artillery, and mortar (RAM), Unmanned Aerial Systems (UAS), and\/or Cruise Missile threats in the required timeline to protect ground forces. This effort develops Technical Fire Control technology to complement the interceptor development performed in the Guided Interceptor Technology for Defense against RAM, UAS and\/or Cruise Missile, Hit-to-Kill Interceptor Technology for Defense against RAM, UAS and\/or Cruise Missile, and Counter RAM, UAS and\/or Cruise Missile Tracking and Fire Control (PE 0603313 Project 704) efforts. These combined efforts will conduct multiple interceptor Hardware-in-the-Loop (HWIL) demonstrations each year. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.560"
                                            },
                                            "Text": {
                                                "val": "Continued refinements and enhancements of Technical Fire Control nodes for the Counter RAM, UAS and\/or Cruise Missile interceptors based on analysis of flight test performance; integrated updated Technical Fire Control node test articles with interceptor guidance sections and fire control systems in HWIL set-ups; conducted virtual and flight tests against single RAM, UAS and\/or Cruise Missile targets using Technical Fire Control nodes to control each."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.732"
                                            },
                                            "Text": {
                                                "val": "Continue refinements and enhancements of Technical Fire Control nodes for Counter RAM, UAS, and Cruise Missile interceptors based on current threat analysis. Use these Technical Fire Control nodes to conduct virtual flight tests against emerging threats in HWIL"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guided Interceptor Concept Technology for defense against Rockets, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missiles"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a Guided missile-based Interceptor concept initially focused to defeat RAM, UAS, and Cruise Missile threats with the potential for precision ground-to-ground applications. This effort designs, fabricates, evaluates, and flight demonstrates a guided missile-based interceptor and launch system. The complementary effort in PE 0603313A, Project 704, Technical Fire Control Technology, provides the interceptor with a firing solution and launch command based on tracking of the UAS, RAM, and Cruise Missile threats. This effort will support the design, fabrication, integration, Hardware-in-the-Loop (HWIL) tests, and flight demonstration of multiple guided interceptors. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.909"
                                            },
                                            "Text": {
                                                "val": "Fabricated, integrated, and tested the alternative components for Guided interceptors; performed Hardware-In-The-Loop tests and pre-flight predictions to prepare for flight tests and reduce risk; conducted interceptor flight-test demonstrations against single RAM, UAS and\/or Cruise Missile targets; analyzed test results and correlate to predicted and HWIL performance; updated the Battle Element system; and refined the system simulation based on performance demonstrated through preflight predictions and flight tests. Completed preliminary designs of affordable propulsion and advanced seeker technologies to extend CUAS\/CCM interceptor effective range, enabling the defeat of both current and emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.325"
                                            },
                                            "Text": {
                                                "val": "Complete Critical Design Reviews for alternative components for Guided interceptors to defeat RAM, UAS and Cruise Missile. Test form-factor components in HWIL to provide pre-flight predictions and reduce risk. Updates and refinements of the system simulation will be performed based on performance demonstrated in HWIL pre-flight predictions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit-to-Kill Interceptor Concept Technology for Defense against Rockets, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missiles"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a compact, very light weight, RF seeker guided Hit-to-Kill (HTK) missile-based Interceptor concept initially focused to defeat RAM threats in flight with the potential for use on air launched platforms, small weapons platforms, and ground-to-ground applications. This effort designs, fabricates, and evaluates a Hit-to-Kill counter RAM system consisting of interceptors and a launch system. Complementary efforts include: Technical Fire Control Technology provides the firing solution and launch command and Counter RAM, UAS and\/or Cruise Missile Tracking and Fire Control, PE 0603313A Project 704, provides tracking of the threat for intercept. This effort will support the design, fabrication, integration, and Hardware-in-the-Loop (HWIL) tests of multiple hit-to-kill interceptors. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.384"
                                            },
                                            "Text": {
                                                "val": "Continued flight tests of the Hit-To-Kill interceptor; continue Hardware-In-The-Loop tests and pre-flight predictions to prepare for additional guided flight tests and to reduce risk; conducted additional interceptor flight-test demonstrations against single and multiple RAM, UAS, and\/or Cruise Missile targets; analyzed test results and correlate to predicted and HWIL performance; updated the Battle Element system; and refined the system simulation based on performance demonstrated through preflight predictions and flight tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.001"
                                            },
                                            "Text": {
                                                "val": "Continue integration and testing, and analysis of Hit-to-Kill (HTK) components; begin fabrication and testing of the active seeker for HTK to provide a Fire Control independent solution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Javelin Command Launch Unit (CLU) with External Far Target Locator (FTL)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the designs, fabrication, and demonstration of technology for a highly accurate, externally-mounted Javelin FTL that integrates with the CLU and provides a means to significantly lighten the load of the Javelin close-combat missile system. The system-technology construct comprises an externally mounted FTL connected to the Javelin Command Launcher Units.  This construct will reduce the weight and volume of the FTL capability for close-combat weaponry carried by the individual Soldiers while increasing lethality, survivability, and situational awareness for Small Unit operations. This effort transitions, integrates, and demonstrates technology from PE 0602303A, Project 214, \"Smaller, Lighter, Cheaper Tactical Missile Technologies\" and \"Micro Inertial Navigation Sensor for Networked Javelin Command Launch Unit (CLU) with Far Target Locator (FTL)\"."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Completed: FTL-sensor lightweight-composite housing design; the initial design and fabrication of miniaturized electronics; development and integration of first-build software for the Javelin CLU."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing key enabling technologies for a lower-cost interceptor system for a low- to medium-altitude, medium- to long-range capability. Resulting technologies will enable interceptor integration into a net-enabled Air and Missile Defense Task Force architecture and protection of assets within a 150km diameter Area of Operations. Technologies will be designed for the defeat of tactical UAS and Cruise Missile threats with secondary capability against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS) at extended range and to be interoperable with existing Integrated Air and Missile Defense (IAMD) Force. This effort continues in FY15 in PE 0603313A, Project 704."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.553"
                                            },
                                            "Text": {
                                                "val": "Completed systems and operational analysis of medium- to long-range missile-based interceptor given anticipated area of operations and anticipated force structure. Began detailed design of integrated missile system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Tactical Extended Range Missile"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturation, fabrication, and demonstration of technologies for low-cost precision fires missile capable of deep strike engagements. The aim is to provide extended range and expanded target set capability through advanced propulsion, new payload technology, and maintain effectiveness in Global Positioning System (GPS) challenged environments through new and novel navigation technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Conduct trade studies through simulation to determine subsystem requirements for delivery of enhanced lethal effects to long range targets; evaluate the target sets at various ranges and match payload technologies with the threat sets; match propulsion technologies with range and missile size; evaluate emerging navigation technologies for GPS challenged environments; evaluate requirements for compatibility with both current and future long range launch systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.638"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.638"
                                            },
                                            "Text": {
                                                "val": "Will complete initial simulation trade studies determining subsystem requirements for delivery of enhanced lethal effects to long range targets; mature multi-functional payload technologies to service the broad threat set of targets with one warhead; mature and perform preliminary testing of advanced propulsion technologies that provide low cost energy management to enhance kinematic performance for long range precision fires; mature navigation technologies for GPS challenged environments in order to enhance the precision of long range precision fires in denied environments; design and fabricate control actuation system hardware, develop navigation algorithms and perform structural analysis for tail controlled long range rockets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System Interceptor Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates modular hard-kill Active Protection System (APS) technologies with the Hit Avoidance Architecture and APS Common Controller and matures modeling and simulation for system integration and demonstration. Specifically the hard kill APS portion and modeling and simulation efforts will be addressed by AMRDEC. This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort supports the development of an APS Common Architecture enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required. This effort compliments work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221, and PE 0603270A\/Project K16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.125"
                                            },
                                            "Text": {
                                                "val": "Begin integration of a modular hard-kill active protection sub-system (including countermeasures, detection sensors, and tracking sensors) with a common controller through a common architecture for use in an integrated survivability suite on a combat vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Will advance APS modeling and simulation to configure and evaluate subsystem integration on physical and virtual demonstrator platforms; evaluate mature, hard-kill countermeasure subsystems for adaption to the Modular Active Protection System (MAPS) controller, through the common architecture, allowing hardware integration with a physical demonstrator combat vehicle platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hunter Killer Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, Hardware-in-the-Loop (HWIL) test, and flight demonstration of technology for an affordable discriminate extended range precision missile to include critical component technologies such as advanced propulsion, seekers, fire control, datalink, guidance and controls, and maneuverable airframes."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.003"
                                            },
                                            "Text": {
                                                "val": "Conduct trade studies to determine subsystem requirements. Identify critical components and begin designing and maturation of those critical components such as propulsion, datalink, and tracker. Begin development of system-level modeling and simulation necessary to mature and evaluate concepts for prediction of system capability across a broad spectrum of missions. Evaluate fire control requirements and identify key technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.803"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.803"
                                            },
                                            "Text": {
                                                "val": "Will complete initial trade studies determining system and subsystems requirements for an affordable discriminate extended range precision missile; advance development of system-level modeling and simulation to mature and evaluate concepts for system performance predictions; mature key critical subsystem technologies in support of identified system requirements such as propulsion and navigation; mature maneuverable airframe guidance and controls algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Close Combat Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses close combat weapon systems technology to include seeker, navigation and materials technology to enable a lightweight command launch unit for the man-portable Javelin weapon system, and system trade studies, and technology maturation and demonstration for a next generation close combat precision missile system for dismounted and mounted maneuver. This effort is coordinated with PE 0602709A\/Night Vision Technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.131"
                                            },
                                            "Text": {
                                                "val": "Will finalize fabrication, integration, and testing of reduced weight, advanced composite housing including foam components for Javelin Light Weight Command Launch Unit (LW CLU); fabricate, integrate, and test an inertial navigation sensor with increased accuracy to include on-the-move capabilities (both targeting and navigation) and reduced size, weight, and power (SWaP) to provide precision for far target location; fabricate, integrate, and test a target acquisition sensor for the Javelin LW CLU increasing target acquisition range and reducing SWaP; perform system-level trade studies to identify critical technology needs such as seekers, propulsion and guidance for a next generation close combat missile system; mature key technologies for a next generation close combat missile system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "704"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Missile Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.560"
                        },
                        "CurrentYear": {
                            "val": "10.784"
                        },
                        "BudgetYearOne": {
                            "val": "20.146"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.146"
                        },
                        "BudgetYearTwo": {
                            "val": "21.271"
                        },
                        "BudgetYearThree": {
                            "val": "21.038"
                        },
                        "BudgetYearFour": {
                            "val": "20.017"
                        },
                        "BudgetYearFive": {
                            "val": "20.810"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures advanced missile system concepts and related hardware to enhance weapon system lethality, survivability, agility, versatility, deployability, and affordability for defense against future air and ground, armored and non-armored threats.    \n \nThis project support efforts in the Army science and technology Lethality portfolio.\n\nWork in this project is in collaboration with PE 0602624A (Weapons and Munitions Technologies).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Rockets, Artillery, Mortars (RAM), unmanned aerial systems (UAS), and Cruise Missile Tracking and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates system technology to provide 360 degree, near hemispherical coverage for tracking and intercept of RAM, UAS, and\/or Cruise Missile threats. This effort determines the trajectory and location of the incoming RAM, UAS, and\/or Cruise Missile threats and feeds that information to the technical fire control node to generate a firing solution provided to the guidance section of each of the missile interceptors. Complementary work is conducted in the Technical Fire Control Technology, Guided Interceptor Technology for defense against Rockets, Artillery, and Mortars, and Hit-to-Kill Interceptor Technology for Defense against Rockets, Artillery, and Mortars and Unmanned Aerial Systems, and Cruise Missiles efforts in PE 0603313A Project 263. The demonstration of an active seeker version of the Hit-to-Kill Interceptor is conducted in this effort leveraging the active seeker development in the Seeker and Guidance Technology for Air Defense effort in this Project. These efforts will be evaluated through Hardware-in-the-Loop (HWIL) tests and multiple interceptor flights. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.560"
                                            },
                                            "Text": {
                                                "val": "Used final test bed and\/or existing counter RAM, UAS, and Cruise Missile tracking and fire control systems for interceptor flight tests against RAM, UAS, and Cruise Missile targets, and verified tracking and fire control simulations based on results of Hardware-In-the-Loop and flight tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.498"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and assess performance utilizing existing counter RAM, UAS, and Cruise Missile tracking and fire control systems networked information against the full range of target types (RAM, UAS, Cruise Missile), scenarios and multiple engagements utilizing simulations and HWIL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.254"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.254"
                                            },
                                            "Text": {
                                                "val": "Will test and refine autopilot algorithms of the active Hit-to-Kill (HTK) interceptor to provide protection against incoming RAM threats that can take target location updates from any applicable fire control sensor; refine and verify aerodynamic performance predictions; and update  the HTK system simulation used for system performance prediction and analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort matures key technologies of a lower-cost interceptor system with a low- to medium-altitude, medium- to long-range capability. This effort will enable lower cost interceptor integration into a net-enabled Air and Missile Defense Task Force for the protection of high value assets. Technologies will address the defeat of air defense threats such as Unmanned Aerial Systems (UAS) and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS). This effort continues from 0603313A, Project 263 in FY14."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.286"
                                            },
                                            "Text": {
                                                "val": "Complete initial design of a medium- to long-range interceptor including identification of critical interceptor technology and component performance requirements. Begin development of interceptor component technologies to include propulsion, seeker, guidance, navigation and controls and begin development of an interceptor simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.087"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.087"
                                            },
                                            "Text": {
                                                "val": "Will complete design and begin static testing of solid rocket motor; complete target generator for hardware-in-the-loop calibration and testing of active radar seeker, guidance electronics, and control system; complete wind tunnel testing and aerodynamic analysis of interceptor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker and Guidance Technology for Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation and integration of seeker and guidance technologies supporting air defense missile systems. Technologies addressed enable the defeat of multiple air defense threats such as Rockets, Artillery, and Mortars, Unmanned Aerial Systems (UAS) and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.805"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.805"
                                            },
                                            "Text": {
                                                "val": "Will mature active seeker for the Hit-to-Kill interceptor for utilization against RAM threats in the \"Counter Rockets, Artillery, Mortars (RAM), unmanned aerial systems (UAS), and Cruise Missile Tracking and Fire Control\" effort; mature low-cost active radio frequency (RF) seeker detailed design and begin fabrication and testing of seeker sub-systems for low-cost extended range air defense interceptor; continue maturation of guidance algorithms and navigation technology to support low-cost extended range air defense interceptor; mature low-cost extended range air defense interceptor hardware-in-the-loop simulation and software integration facilities for calibration and testing of active RF seekers, guidance electronics units, and control systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA6"
                    },
                    "ProjectTitle": {
                        "val": "Missile and Rocket Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.336"
                        },
                        "CurrentYear": {
                            "val": "35.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Missile and Rocket advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "19.336"
                                        },
                                        "Text": {
                                            "val": "Matured, fabricated, and demonstrated advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "35.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for missile and rocket advanced technology development"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}