{
    "id": "fa44177679250292ed5a2c7fbf77587f15388964",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V3A_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207601F"
        },
        "ProgramElementTitle": {
            "val": "USAF Modeling and Simulation"
        },
        "R1LineNumber": {
            "val": "162"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.439"
            },
            "CurrentYear": {
                "val": "12.034"
            },
            "BudgetYearOne": {
                "val": "24.994"
            },
            "BudgetYearOneBase": {
                "val": "24.994"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "22.812"
            },
            "BudgetYearThree": {
                "val": "22.180"
            },
            "BudgetYearFour": {
                "val": "22.599"
            },
            "BudgetYearFive": {
                "val": "23.002"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2016, Project Number 674567, M&S Foundations includes new start efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "United States Air Force (USAF) Modeling & Simulation (M&S) Program Element (PE) is broken into two thrust areas:  Modeling and Simulation Foundations, and Warfighter Readiness.  It directly supports Air Force, Joint, Coalition composite training and rehearsal, concept development, and acquisition and testing through modeling and simulation development as well as the integration of these across and within Live, Virtual, and Constructive (LVC) environments.  This program focuses on support of Department of Defense (DoD) Training Transformation (T2), acquisition excellence initiatives, and foundational capabilities needed for interoperability, accessibility, reuse, and scalability.  It allows the authoritative portrayal of new and emerging Air Force capabilities within DoD and coalition LVC environments; as well as reciprocating capabilities within Air Force LVC environments.  \n\nLVC environments today are used as the most cost effective and practical means to meet mission needs.  In support of the DoD T2 initiative, USAF M&S program thrust areas develop and modernize models and simulations that are the constructive backbone of Air Force and joint training and rehearsal.  Once these models and simulations are developed, they are integrated across training LVC environments for use by Major and Combatant Commands.  This development and integration is imperative to ensure that air, space, and cyberspace training and mission rehearsal activities are supported with realistic, interoperable, and readily available tools, data, and services.  These, in turn, enable joint, coalition, and interagency training required to prepare forces for combat by generating the air and space picture for the Air and Space Operations Center (AOC), Joint Force Air Component Commander (JFACC), and Joint Force Commander in combat exercises; training over 100,000 personnel per year in exercises (e.g., Ulchi Freedom Guardian, Red & Blue Flags, Unified Endeavor, etc).  These programs also provide the current foundational environment that enables warfighters to interact with high-fidelity tactical cockpit simulators, which replicate high demand\/low density platforms that are often unavailable for training due to real-world operations; while simultaneously linking it to warfighters using their current command and control systems 1,000 miles away and the constructive simulations being run from key operational wargaming and simulation centers worldwide. \n\nUSAF M&S is integral to inter-agency Homeland Defense (HLD) exercises chartered to train combat units tasked to protect the Homeland, including the National Capital Region (exercise Amalgam Arrow); this generates equipment and manpower efficiencies by using simulations which reduce fuel consumption, aircraft wear and tear, and manpower costs.  In support of the DoD drive to improve the effectiveness and efficiency of its enterprise-wide acquisition business processes, the USAF M&S Program Element develops and supports enhancements to models, simulations, tools, and the LVC infrastructure to provide for system-of-systems M&S capabilities across the lifecycle, reduce developmental costs, and minimize risks.  These capabilities support the acquisition process from concept development through test and evaluation.  Activities also include studies and analysis to support both current program planning and execution and future program planning. \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.734"
                },
                "CurrentYear": {
                    "val": "16.723"
                },
                "BudgetYearOne": {
                    "val": "25.161"
                },
                "BudgetYearOneBase": {
                    "val": "25.161"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.439"
                },
                "CurrentYear": {
                    "val": "12.034"
                },
                "BudgetYearOne": {
                    "val": "24.994"
                },
                "BudgetYearOneBase": {
                    "val": "24.994"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.295"
                },
                "CurrentYear": {
                    "val": "-4.689"
                },
                "BudgetYearOne": {
                    "val": "-0.167"
                },
                "BudgetYearOneBase": {
                    "val": "-0.167"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.089"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-4.600"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.295"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.167"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.167"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Congressional Directed Reductions of $4.6M due to an Unjustified Increase - Air Constructive Environment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674567"
                    },
                    "ProjectTitle": {
                        "val": "M&S Foundations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.202"
                        },
                        "CurrentYear": {
                            "val": "5.003"
                        },
                        "BudgetYearOne": {
                            "val": "13.662"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.662"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.712"
                        },
                        "BudgetYearThree": {
                            "val": "11.936"
                        },
                        "BudgetYearFour": {
                            "val": "12.162"
                        },
                        "BudgetYearFive": {
                            "val": "12.379"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2016, Project Number 674567, M&S Foundations includes new start efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "Modeling and Simulation Foundations (MSF) focuses on integrating foundational capabilities needed to improve the usefulness, productivity, scalability and efficiency of Modeling and Simulation (M&S) capabilities derived from the Warfighter Readiness (WR) thrust.  MSF are the  standards, policies, procedures, architectures, and tools that enable the rapid and efficient composition of distributed environments to support both the warfighter needs and the US Air Force's (USAF) functional communities of acquisition, training, planning, analysis, testing, education, experimentation, and requirements. The efforts supporting the MSF thrust include both concept exploration and development.  \n\nMSF provides the capability to rapidly and efficiently create realistic and accurate synthetic operational battlespaces to support the full spectrum of activities associated with concept development to acquisition and testing through composite training and mission rehearsal.  This is done by providing appropriate authoritative data and component representations.  With the capability generated via MSF, users will readily access available repositories of reusable, validated, and integrated synthetic components.  Synthetic components include representations of operational battlespace entities (such as friendly and enemy assets) and representations of the natural environment that include the terrain, atmospheric and space weather effects given the proper data sets, and energy and signal propagation effects.  The rapid composition is based on a durable common architecture framework, policies, and common standards.  MSF capability also supports efficient, cost-effective verification, validation, and accreditation activity across all of the M&S functional and organizational communities.   \n\nThe Air Constructive Environment-Information Operations Suite (ACE-IOS) provides the authoritative representation of Air Force information operations.  ACE-IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and COCOM battle staffs during Joint and Service exercises and experimentations.  \n\nSimulation and Analysis Facility (SIMAF) focuses on fostering M&S tools, data, and infrastructure to enable high confidence acquisition of capabilities to support the joint warfighter.  This includes Live-Virtual-Constructive (LVC) infrastructure, tools and processes supporting LVC events, and models, tools, data, simulations\/stimulation to support requirements definition, systems engineering and test activities.  Activities include M&S support for studies and analysis to support both current program planning and execution and future program planning.  These efforts will enable more efficient delivery of effective capabilities to the warfighter while reducing the time and resources required for design, development, test and evaluation, maintainability and sustainment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Constructive Environment - Information Operations Suite (ACE-IOS)"
                                    },
                                    "Description": {
                                        "val": "ACE-IOS provides the authoritative representation of Air Force information operations.  IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and COCOM battle staffs during Joint and Service exercises and experimentations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.202"
                                            },
                                            "Text": {
                                                "val": "Version 5.0.15.0 provided the authoritative representation of Air Force information operations.  ACE-IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and COCOM battle staffs during Joint and Service exercises and experimentations.  Specific accomplishments were the development of a New Joint Intelligence Messaging Management System (JIMMS) database applications and upgraded integration with the Air force Modeling and Simulation Training Toolkit (AFMSTT)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.003"
                                            },
                                            "Text": {
                                                "val": "Version 5.0.16.0 continues to provide the authoritative representation of Air Force information operations.  ACE-IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and COCOM battle staffs during joint and service exercises and experimentations.  Continues the development of:  terrain and line of sight modeling, processing of Abstract Intent Orders and production of communication traffic\/intelligence, critical modernization of Identification Friend or Foe\/Selective Identification Feature (IFF\/SIF) Mode 5 and S, Coalition Cross Domain Solution rule set additions, increased Theater Missile Operations\/Theater Missile Defense (TMO\/TMD) fidelity, and compliance with additional Battle Lab Collaborative Simulation Environment (BLCSE\/MATREX) federation Object Model interfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.695"
                                            },
                                            "Text": {
                                                "val": "Version 5.0.17.0 will continue to provide the authoritative representation of Air Force information operations.  ACE-IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and Combatant Command (COCOM) battle staffs during joint and service exercises and experimentations.  Will continue the modernization and Joint interface changes to include the re-engineering of ACE-IOS to modern service-oriented architecture principles, service data translator modules, and interface compliance with new Joint Live Virtual Constructive (JLVC) 2020 cloud based service architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulation and Anaylsis Facility (SIMAF)"
                                    },
                                    "Description": {
                                        "val": "Develop, enhance and verify models, tools, data, simulations\/stimulation environments for systems engineering and test activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.967"
                                            },
                                            "Text": {
                                                "val": "Will support activities that include studies and analysis of current program planning\/execution and future program planning. These efforts will enable more efficient delivery of effective capabilities to the warfighter while reducing the time and resources required for design, development, test and evaluation, maintainability and sustainment. SIMAF efforts will also support the development and maturation of collaborative processes and capabilities to support systems-of-systems assessments (e.g. airborne network assessments, air-ground layer interaction, etc.)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Air Force Life Cycle Management Center (AFLCMC) at Hanscom AFB, MA and the Simulation and Anaylsis Facility, Wright-Patterson AFB, OH manage the acquisition and incremental development process of the project's M&S activities.  All major contracts are awarded using full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Air Constructive Environment - Information Operations Suite (ACE-IOS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "90th IOS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lackland AFB, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.202"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.941"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.633"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.633"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Simulation and Analysis Facility (SIMAF)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SIMAF"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wright Patterson AFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.967"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.967"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.062"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Air Contstructive Envitronment-Information Operations Suite (ACE-IOS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS  - v5.0.15.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.16.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.17.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.18.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.19.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.20.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.21.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Simulation and Analysis Facility (SIMAF)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675135"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Readiness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.237"
                        },
                        "CurrentYear": {
                            "val": "7.031"
                        },
                        "BudgetYearOne": {
                            "val": "11.332"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.332"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.100"
                        },
                        "BudgetYearThree": {
                            "val": "10.244"
                        },
                        "BudgetYearFour": {
                            "val": "10.437"
                        },
                        "BudgetYearFive": {
                            "val": "10.623"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Modeling and Simulation support to our Warfighter's Readiness is a United States Air Force (USAF) corporate imperative to ensure air, space, cyberspace training, and mission rehearsal activities are supported with realistic, interoperable, and readily available, tools, data, services and environments.  Warfighter readiness supports Department of Defense (DoD) Training Transformation (T2) and Joint National Training Capability (JNTC) along with the USAF priorities and core functions.  Activities also include studies and analysis to support both current program planning, execution, and future program planning.  \n\nIt includes several complimentary programs, initiatives and areas for investment:  Warfighter and Joint Training Integration supports the Chief of Staff of the Air Force (CSAF) directed Live, Virtual, and Constructive (LVC) integration efforts and is a critical piece to the USAF's implementation of the Strategic Plan for Transforming DoD Training.  The goal of LVC training and mission rehearsal is to prepare our warfighters for the full range of military operations and maintain the combat readiness levels required by the Combatant Commands (COCOMs).  This can only be accomplished by training and rehearsing in realistic operational environments.  These environments include live training ranges and virtual simulators enhanced with constructive entities.  Specific training and mission rehearsal events can include some or all of these simultaneously; making the ability to integrate LVC capabilities a necessity.  \n\nThe Air, Space, and Cyberspace Constructive Environment (ASCCE) is the USAF's authoritative federation of constructive training models and tools realistically representing the tactical and operational capabilities the USAF brings to the joint fight.  It includes the Air Force Modeling and Simulation Training Toolkit (AFMSTT), which provides the authoritative representation of AF and joint theater-level air and space power and is used to train Air and Space Operations Center (AOC) personnel and Combat Commanders (COCOM) battle staffs.  The primary model in the AFMSTT is the Air Warfare Simulation (AWSIM)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air, Space, and Cyberspace Constructive Environment (ASCCE)"
                                    },
                                    "Description": {
                                        "val": "Air Force Modeling & Simulation Training Toolkit (AFMSTT)\/Air Warfare Simulation (AWSIM)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.237"
                                            },
                                            "Text": {
                                                "val": "Version 5.7 continued the development of the Air, Space, and Cyberspace Constructive Environment (ASCCE) via the Air Force Modeling & Simulation Training Toolkit (AFMSTT) and the Air Constructive Environment-Information Operations Suite (ACE-IOS).  Continued developing long term modernization process to better address warfighter requirements while providing engineering support to the demanding AF AOC and COCOM battle staff, mission and C2 tactics rehearsal schedules and system interface changes.  Developed the modernization architecture, data framework and interface data bus to address constantly changing M&S and C2 external interfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.031"
                                            },
                                            "Text": {
                                                "val": "Version 5.9 continues the development of the Air, Space, and Cyberspace Constructive Environment (ASCCE) via the Air Force Modeling & Simulation Training Toolkit (AFMSTT) and the Air Constructive Environment-Information Operations Suite (ACE-IOS).  Continues the modernization and validation test of FY14 software modules; addresses the start of a modern unified controller and modern user interface; early engineering for modernization of the million lines of legacy Government owned software.  Continues the engineering development efforts to accurately model changing real world environments to ensure accurate M&S models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.332"
                                            },
                                            "Text": {
                                                "val": "Version 6.1 will continue the development of the Air, Space, and Cyberspace Constructive Environment (ASCCE) via the Air Force Modeling & Simulation Training Toolkit (AFMSTT) and the Air Constructive Environment-Information Operations Suite (ACE-IOS).  Will address the major shortfalls in the AFMSTT core software simulation modules through modernization and depreciation of legacy software.  Core software changes will be required to address new models associated with Anti-Access\/Area Denial (A2\/AD) employments, Tactics, Techniques, and Procedures (TTPs), and systems changes while maintaining engineering integration, validation, and support to worldwide M&S and C2 community requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Air Force Life Cycle Management Center (AFLCMC) at Hanscom AFB, MA manages the acquisition and incremental development process for all M&S activities. All major contracts will be awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AFMSTT\/(Air Warfare Simulation (AWSIM))"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.153"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.938"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.064"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.064"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.093"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.268"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.268"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Air, Space, and Cyber Constructive Environment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.7"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.9"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.7"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.9"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}