{
    "id": "0251be57143a200dfef47bb1b2c5f0f9cc2d6c81",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Technology"
        },
        "R1LineItemNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.917"
            },
            "CurrentYear": {
                "val": "20.328"
            },
            "BudgetYearOne": {
                "val": "20.615"
            },
            "BudgetYearOneBase": {
                "val": "20.615"
            },
            "BudgetYearTwo": {
                "val": "20.840"
            },
            "BudgetYearThree": {
                "val": "21.914"
            },
            "BudgetYearFour": {
                "val": "22.499"
            },
            "BudgetYearFive": {
                "val": "22.909"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program addresses applied research associated with improving the lethality, reliability, safety and survivability of munitions and weapon systems.  The goal is to develop and demonstrate joint enabling technologies that can be used by Program Managers as they develop their specific weapon programs.  The program invests in and demonstrates technologies from a Joint Service perspective, thus insuring the development of technology with the broadest applicability while avoiding duplication of efforts.\n\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) have been established for each munition and capability area and are tasked with 1) coordinating, establishing, and maintaining five, ten, and fifteen year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate Program Executive Officers (PEOs) for insertion in their Insensitive Munitions (IM) Strategic Plans \/ Fuze Technology Development Plan, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate.  The Joint Insensitive Munitions Technology Program (JIMTP) and Joint Fuze Technology Program (JFTP) will utilize a Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy laboratory representatives and senior Munitions PEO representatives) to provide program oversight, policy, direction and priorities during its annual meeting.\n\nThe IM effort will demonstrate enabling technologies needed to develop weapons in compliance with requirements established in United States Code, Title 10, Chapter 141, Section 2389 and DoD Instruction 5000.1.  This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on priority munitions identified in the PEO IM Strategic Plans.  Mature demonstrated IM technology can be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other non-compliant munitions within their portfolios.\n\nUnder the JIMTP, investments are focused on five Munition Areas:  High Performance Rocket Propulsion, Minimum Signature Rocket Propulsion, Blast and Fragmentation Warheads (BFW), Anti-Armor Warheads (AAW), and Large Caliber Gun Propulsion (LCGP).  MATGs, under tri-service leadership, have developed technology roadmaps for each Munition Area, that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  These IM technologies, alone or in combination, will be incorporated in hardware, simulating real-world munitions, to demonstrate their utility and feasibility as part of Technology Transition Agreements with PEOs.\n\nThe Enabling Fuze Technology effort will also demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on priority capabilities and technology needs identified and validated by the PEOs and the Heads of the Service Science and Technology (S&T) communities.  In this way, promising multi-point initiation architectures, high reliability fuze architectures, survivable components, modular fuze packaging, and components produced based on ease of manufacturing can be integrated into a munition configuration and its ability to address required capability needs can be validated.  Mature fuze technology can be transitioned, thereby decreasing program costs and schedule risk and facilitating their spin-off into other munitions within their portfolios.\n\nUnder the Joint Fuze Technology Program, investments are focused on specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and will be validated by the PEOs and the Heads of the Service S&T communities. These four capability areas are: 1) Hard Target Survivable Fuzing, 2) Tailorable Effects Weapon Fuzing, 3) High Reliability Fuzing, 4) and Enabling Fuze Technologies and Common Architecture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.448"
                },
                "CurrentYear": {
                    "val": "21.592"
                },
                "BudgetYearOne": {
                    "val": "20.267"
                },
                "BudgetYearOneBase": {
                    "val": "20.267"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.917"
                },
                "CurrentYear": {
                    "val": "20.328"
                },
                "BudgetYearOne": {
                    "val": "20.615"
                },
                "BudgetYearOneBase": {
                    "val": "20.615"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.531"
                },
                "CurrentYear": {
                    "val": "-1.264"
                },
                "BudgetYearOne": {
                    "val": "0.348"
                },
                "BudgetYearOneBase": {
                    "val": "0.348"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.146"
                    },
                    "CurrentYear": {
                        "val": "-0.127"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.206"
                                },
                                "BudgetYearOne": {
                                    "val": "0.348"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.348"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.075"
                                },
                                "CurrentYear": {
                                    "val": "-0.137"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.104"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.000"
                                },
                                "CurrentYear": {
                                    "val": "-1.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P000"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.177"
                        },
                        "CurrentYear": {
                            "val": "14.495"
                        },
                        "BudgetYearOne": {
                            "val": "14.216"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.216"
                        },
                        "BudgetYearTwo": {
                            "val": "14.449"
                        },
                        "BudgetYearThree": {
                            "val": "14.858"
                        },
                        "BudgetYearFour": {
                            "val": "15.263"
                        },
                        "BudgetYearFive": {
                            "val": "15.472"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Insensitive Munitions (IM) Technology Program (JIMTP) is aimed at developing the enabling technologies needed to build weapons in compliance with requirements established in statute  (United States Code, Title 10, Chapter 141, Section 2389) and regulation (DoDI 5000.1 and CJCSI 3170.01F).  Using technology available today, the Department has incrementally improved the IM response of our current munitions.  New munitions which have fully implemented current IM technology and design practices have been able to achieve IM compliance.  However, these have been the most easily solved problems.  Without new technology, future variants of current weapon systems will have the same, or worse, response to IM stimuli.  New weapon developments will face similar challenges. \n\nThe JIMTP, investments are focused on five Munition Areas:  High Performance Rocket Propulsion, Minimum Signature Rocket Propulsion, Blast and Fragmentation Warheads, Anti-Armor Warheads, and Large Caliber Gun Propulsion.  Munition Area Technology Groups (MATGs), under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  The program is structured around these five areas with clear cross-cutting tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Performance Rocket Propulsion"
                                    },
                                    "Description": {
                                        "val": "High Performance Rocket Propulsion is focused on the development and demonstration of technologies to improve the IM response of High Performance Propulsion (HPP) systems (rocket motors with Ammonium Perchlorate and with or without a metal fuel) for rockets and missiles launched from air, ground and sea platforms.  These technologies, when applied to rocket motors, improve IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Operating conditions may be controlled or widely varying in both temperature and vibration.  Technologies include, but are not limited to, rocket propellant ingredients (including synthesis, characterization and scale-up), reduced smoke or smokey propellants (including formulation, characterization and scale-up), rocket motor case design, materials for active and passive thermal mitigation, shock mitigation materials and techniques, passive and active coatings, active and passive venting techniques for motor cases or containers, ignition systems, sensors and thrust mitigation techniques.  The five, ten, or fifteen year goals of the HPP MATG are concentrated on solving the IM response of missile propulsions systems due to Fragment Impacts and Slow Cookoff for the majority of HPP rocket motors, and solving the Fast Cookoff response of very large HPP motors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.580"
                                            },
                                            "Text": {
                                                "val": "•  Completed small scale IM tests, demonstrated scale up of extinguishable high performance rocket propellants to one gallon size batches, and determined low temperature mechanical properties.\n•  Conducted sub-scale fast cook-off testing to demonstrate mitigation methodology.\n•  Completed sensor network design, conducted fast cook-off testing and selected sensor network technologies for BA 6.3 demonstration.\n•  Scaled up reduced smoke propellant to the one and five gallon scale with acceptable processing, safety, mechanical properties to enable small-scale motor testing and IM tests.\n•  Formulated and refined the processing of impregnated fibers in composite cases. Began conducting safety and environmental testing.\n•  Completed scale up of high performance rocket propellants to one pint size batches and conduct mechanical and ballistic properties testing.\n•  Scaled up formulation to produce five pounds of material and started safety and mechanical properties testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.880"
                                            },
                                            "Text": {
                                                "val": "•  Scale up reduced smoke propellant to the five gallon scale with acceptable processing, conduct small-scale motor and impact testing, develop liner, and conduct slow cook-off IM test.   \n•  Complete reduced smoke propellant evaluation, small-scale motor testing, accelerated aging and IM tests.  Conduct propellant formulation efforts to produce burn or no-reaction response for fragment impact, bullet impact, slow cook-off and fast cook-off events.\n•  Determine the thermal and mechanical response and the mechanical strength of the fabricated composite cases impregnated with additives with continued safety and environmental testing.\n•  Complete scale up of high performance rocket propellants to one gallon size batches, refine processing procedures and conduct sensitivity and safety testing.\n•  Design, analyze and build small-scale motors and conduct safety and environmental tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.656"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.656"
                                            },
                                            "Text": {
                                                "val": "•  Study thermal and mechanical responses of composite cases to slow cook-off and aerodynamic heating. \n•  Complete scale up of high performance rocket propellants to five gallon size batches, refine processing procedures and conduct sensitivity and safety testing.\n•  Complete final assembly and conduct slow and fast cook-off IM tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minimum Signature Rocket Propulsion"
                                    },
                                    "Description": {
                                        "val": "Minimum Signature Rocket Propulsion is focused on the development and demonstration of technologies to improve the IM response of Minimum Signature Rocket Propulsion Technologies.  The development and demonstration of minimum signature (MS) rocket technologies, that when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance. Topics include but are not limited to MS rocket propellant formulations, ingredients for MS propellant formulations (including synthesis, characterization and scale-up), case and packaging design, active and passive venting techniques, rocket motor case design, ignition systems and thrust mitigation techniques. Of particular interest are technologies toward higher burning rate MS propellants with state-of-the-art energy and reduced shock sensitivity.  The five, ten, and fifteen year goals of the MSP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impact, Slow Cook-Off, and Shaped Charge Jet (SCJ) threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.525"
                                            },
                                            "Text": {
                                                "val": "•  Conducted small scale IM tests and compared against prior baseline and candidate results to provide down-selected formulations for further study.  The resultant down-selected propellant formulations will then be optimized and subjected to various tests.\n•  Demonstrated passive venting design for slow cook-off IM test. \n•  Completed binder system alternatives assessment and down-selected formulation for scale up to one gallon size mix.\n•  Scaled-up to gallon mix batches and evaluated bonding agents in impact and shock tests to determine effectiveness.  \n•  Scaled up novel ingredients to pint scale mixes and conducted mechanical, aging and thermal testing to determine propellant characteristics.  \n•  Synthesized and characterized new propellant to 100 gram scale to support initial IM evaluation testing.\n•  Synthesized and produced material to five gram quantity batches to conduct thermal stability studies.  Produced material to 25 gram quantity batches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.978"
                                            },
                                            "Text": {
                                                "val": "•  Optimized propellant candidates will be scaled-up to further characterize their initial ballistic performance and sensitivity properties.  Conduct sub-scale motor performance test via seven inches baseline motor configuration, strand burner ballistics test, thermal cook-off and impact IM tests.\n•  Complete binder system alternatives full scale testing using one gallon size mixes for transition to BA 6.3 project. \n•  Conduct additional impact and shock testing on alternative composite minimum signature propellant.  Manufacture analogue motors and select best candidate for transition to BA 6.3.\n•  Scale-up to one pint mixes novel propellant and conduct impact and cook-off testing to determine IM responses of formulation.\n•  Scale up unique propellant and synthesize to 25, 50, 100 gram and pint scale, and conduct small-scale IM tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.598"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.598"
                                            },
                                            "Text": {
                                                "val": "•  Complete ballistics, shock sensitivity, beyond visual range impact, failure diameter, and run-distance detonation tests.  Conduct larger scale IM tests with final formula down-selection and transition to BA 6.3 demonstration.\n•  Manufacture five gallon mixes to support IM analogue motor loading and testing.\n•  Scale up to one gallon scale, load analog motors, and conduct full-scale IM tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast and Fragmentation Warheads (BFW)"
                                    },
                                    "Description": {
                                        "val": "Blast and Fragmentation Warheads is focused on the development and demonstration of technologies to improve the IM response of Blast \/ Fragmentation munitions.  The development and demonstration of explosive ingredients and explosives and warhead and fuze technologies that, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and at minimum maintain munition performance, are of particular interest.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability and reliability may be critically important depending on the intended munition application.  Applications vary but include high performance warhead fills, booster explosives, bulk demolition charges, and bulk fills for blast and\/or fragmentation charges.  Technologies include but are not limited to new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection or packaging materials and systems, shock mitigation liners, initiation devices, techniques, and technologies.  The five, ten, and fifteen year goals of the BFW MATG are concentrated on solving the IM response of blast fragment warheads to the Sympathetic Detonation, Fast Cookoff and SCJ threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.798"
                                            },
                                            "Text": {
                                                "val": "•  Completed initiation studies in preparation to transition to BA 6.3 project.\n•  Scaled up novel ingredient formulation to 150 gram batches and conducted safety and sensitivity testing.  Completed sub-scale IM testing on optimized formulation using novel ingredient.  \n•  Scaled up specially coated materials to 100 gram production capability in order to characterize material and conducted various tests to determine responses.  \n•  Conducted characterization and IM testing to validate improvements in reactions to stimuli. \n•  Concluded first generation proof of concept experiments, began modeling and simulation of novel explosive material manufacturing studies, and began weaponization study and demonstration of IM characteristics of unique warhead explosive.\n•  Designed and fabricated a unique sensitization method application fixture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.984"
                                            },
                                            "Text": {
                                                "val": "•  Down-select novel ingredient material formulation, complete sub-scale testing, and begin transition to BA 6.3 project. \n•  Conclude second generation proof of concept experiments and start weaponization study of unique warhead explosive material.\n•  Begin down-selecting materials and the sensitization process in order to conduct device scale testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.758"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "•  Conclude manufacturing studies and weaponization study for Compounded HE Composites and prepare to demonstrate IM characteristics of unique warhead explosive material.\n•  Conclude down-selecting materials and the sensitization process in order to conduct device scale testing to validate the process and transition to BA 6.3 project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Armor Warheads (AAW)"
                                    },
                                    "Description": {
                                        "val": "Anti-Armor Warheads is focused on the development and demonstration of explosive ingredients, explosives, warhead and fuze technologies for improving IM of Anti-Armor Warhead munitions.  The development of explosive ingredients, explosives and warhead and fuze technologies that, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and at minimum maintain munition performance.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application.  Applications vary but include high performance warhead fills, booster explosives, and all other technology to mitigate the violent response of Anti-Armor Warhead munitions to IM threats.  Technologies include but are not limited to new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection \/packaging materials and systems, shock mitigation liners, and initiation devices, techniques, and technologies.  The five, ten, and fifteen year goals of the AAW MATG are concentrated on solving the IM response of anti-armor warheads to the Fragment Impact and Slow Cookoff threats and a five year goal of solving Sympathetic Detonation threats, with a ten and fifteen year goal of resolving the IM response to the Shaped Charge Jet threat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.278"
                                            },
                                            "Text": {
                                                "val": "•  Optimized processing procedure and completed characterization studies for cast cured explosives.  Conducted accelerated aging study and various safety and IM tests to ensure acceptable aging properties of explosive material.  \n•  Completed fragment impact screening test analysis and prepared for BA 6.3 transition. \n•  Completed characterization testing for formulation candidates, down-select, scale-up formulations, and complete IM\/performance tests for two candidates. \n•  Continued IM tests for novel coating technique evaluation for explosive materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.136"
                                            },
                                            "Text": {
                                                "val": "•  Conduct IM technology studies in the areas of initiation\/booster technology, explosive formulations, and warhead venting to develop warheads capable of producing deflagration and explosive type reactions for shaped charge jet and fragment impact threats.\n•  Scale up the baseline configuration to ten gallon, the spray coated melt-case to one and ten gallon, and the pressed formulations with spray coated high melting explosive."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.912"
                                            },
                                            "Text": {
                                                "val": "•  Conduct critical diameter and slow cook-off IM tests of down-selected formulations.\n•  Conduct formulation and initial screening of explosive material to determine physical and performance characteristics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Large Caliber Gun Propulsion (LCGP)"
                                    },
                                    "Description": {
                                        "val": "Large Caliber Gun Propulsion is focused on the development and demonstration of technologies in the area of Gun Propulsion Technologies.  The development and demonstration of gun propulsion technologies, that when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Topics include but are not limited to gun propellant formulations, ingredients for gun propellant formulations (including synthesis, characterization and scale-up), cartridge case and packaging design, active and passive venting techniques, reduced sensitivity primer propellant and primer systems and robust primers for insensitive propellants.  Applications vary, but include both large and medium caliber munitions.  Operating requirements vary, and other factors such as barrel life and operation over varying environmental conditions may be critically important depending on the intended munition application.  The five, ten, or fifteen year goals of the LCGP MATG are concentrated on solving the IM response of gun propulsion munitions to Fragment Impact, Shaped Charge Jet, and Slow Cookoff threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.996"
                                            },
                                            "Text": {
                                                "val": "•  Conducted small-scale testing and characterization efforts, as well as formulation down-selection effort.  \n•  Conducted instrumented ballistic simulator tests and completed modification of required modeling and simulation tools for slow cook-off studies.\n•  Synthesized and scaled-up energetic salts to 500 gram quantity and conducted characterization testing to support formulation and go\/no-go decision."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.517"
                                            },
                                            "Text": {
                                                "val": "•  Manufacture large-scale quantities and complete full-scale IM tests of down-selected propellant formulation mixes of novel propellant binder.  Conduct sub-scale ballistic and IM testing.\n•  Conduct instrumented ballistic simulator tests, fabricate hardware and finalize venting solution for fragment impact and slow cook off. \n•  Continue formulation development to produce optimum IM properties and scale-up to manufacture three kilogram batches.  Conduct various tests to validate IM properties and suitability for gun propellant."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.292"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.292"
                                            },
                                            "Text": {
                                                "val": "•  Establish design of experiments test matrix and complete subsequent modeling effort.  Conduct IM and mechanical tests on containers and compare results with the models’ predictions.\n•  Optimize formulation and conduct IM tests to determine viability of down-select candidate for gun propellants."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P002"
                                    },
                                    "Title": {
                                        "val": "BA 3 Insensitive Munitions Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.302"
                                        },
                                        "CurrentYear": {
                                            "val": "14.529"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.819"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.819"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.808"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.521"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.147"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.437"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented using DoD\/NASA Technical Readiness Level (TRL) scale. \n2) Munition Area Technology Group Technology Roadmaps are prepared, evaluated, and analyzed by Joint Insensitive Muntions Technology Program management and technical staff. \n3) Chairman's Annual Assessments for each MATG are critically reviewed by the Technical Advisory Committee to determine progress, transition plans, and relevance of each project.  \n4) Project progress toward goals and milestones is assessed at each MATG meeting.  \n5) Annual technical reports and papers are tracked and documented for the Program. \n6) External Peer Review of Projects conducted as part of Joint Army\/Navy\/NASA\/Air Force meetings."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P204"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.740"
                        },
                        "CurrentYear": {
                            "val": "5.833"
                        },
                        "BudgetYearOne": {
                            "val": "6.399"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.399"
                        },
                        "BudgetYearTwo": {
                            "val": "6.391"
                        },
                        "BudgetYearThree": {
                            "val": "7.056"
                        },
                        "BudgetYearFour": {
                            "val": "7.236"
                        },
                        "BudgetYearFive": {
                            "val": "7.437"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This RDT&E effort will demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop enabling technologies at the laboratory scale and transition them into 6.3 demonstration programs for weapons where priority capabilities and technology needs have been identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service S&T communities.  Mature 6.2 fuze technologies will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios.\nUnder the Joint Fuze Technology Program (JFTP), investments are focused on specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and validated by the PEOs and Heads of the Service S&T communities.  These four capability areas are: 1) Hard Target Survivable Fuzing, 2) Tailorable Effects (TE) Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hard Target Fuzing"
                                    },
                                    "Description": {
                                        "val": "The Hard Target Fuzing challenges are grouped into three Technology Areas. Improved Modeling and Simulation Capabilities provide the validated computational tools necessary for hard target applications.  Basic Phenomenology & Understanding of the Fuze Environment is the science-based endeavor of providing the test equipment, instrumentation, and analysis techniques for experimentation and data gathering necessary for Hardware Development - Next Generation Fuzing.\nThis technology area aims to increase the effectiveness of facility denial munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of legacy and future fuzes.  Development of these technologies will enable next generation boosted and hypersonic penetrators to execute missions against hardened and deeply buried targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.494"
                                            },
                                            "Text": {
                                                "val": "-  Continued projects on the hard target penetration weapon systems based modeling and simulation tool to determine fuze response to the weapon dynamics.\n-  Continued solid mechanics modeling and simulation technology projects to provide accurate material properties.\n-  Created a series of experimental and modeling capabilities that will form the basis of a high speed fuze survivability protocol for testing fuzes in the boosted and high speed penetration regimes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.645"
                                            },
                                            "Text": {
                                                "val": "-  Develop underlying technologies and testing methods to define the high-speed penetration environment.\n-  Begin verification of hydrocode\/EPIC 22 modeling and simulation tools via hard target weapon instrumented testing.\n-  The hard target weapon community plans to integrate the testing protocol in future boosted and high speed penetrator development programs.\n-  Develop survivable modular fuze technology for multi-role common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.661"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.661"
                                            },
                                            "Text": {
                                                "val": "-  Develop and validate modeling and simulation code using high fidelity, multi-scale simulation techniques.\n-  Adapt and transition Joint Fuze Technology Program developed testing protocol in boosted and high speed penetrator development programs.\n-  Develop survivable modular fuze technology for multi-common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tailorable Effects Fuzing"
                                    },
                                    "Description": {
                                        "val": "This area focuses on developing fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (directed blast, fragmentation); developing initiation and multi-point technologies to include electronic safe and arm based multi-point initiators for tunable output – scalable yield warheads; MicroElectro-Mechanical Systems (MEMS) based multi-point initiators for tunable output\/scalable yield warheads; and smart fuzing for tailorable effects weapons.  These technologies will enable weapons that can effectively defeat a variety of targets while minimizing unintentional collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.578"
                                            },
                                            "Text": {
                                                "val": "-  Continued development of tailorable initiation technologies including a) multi-point plug-n-play, b) lower energy detonators\/initiators, c) miniaturized explosive trains, and d) multi-point initiation using energetic tracks, traces or deposition.\n-  Developed low-voltage command\/arm system for distributed fuzing systems to enable tailorable initiation control for warhead detonation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.696"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and transition miniature fire-set components for 6.3 tailorable effects initiation warhead systems.\n-  Begin development of controllable explosive sensitivity technologies that provide the ability to selectively vary the sensitivity of energetic materials.\n-  Apply initiation architecture and control technologies for development of candidate effects and yield candidate warheads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.712"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.712"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and transition into 6.3 advanced technology development of detonator, initiation and fireset technologies.\n-  Begin to develop Tailorable Effects modeling and simulation using hydrocode.\n-  Develop harden, Tailorable Effects firing systems for missile and projectile warheads to survive the high-g shock environments associated with impact with Military Operations in Urban Terrain (MOUT) targets"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Reliability Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop high reliability fuzing architectures, fuzing components, and Unexploded Ordance (UXO) reduction features.  These technologies will enable the next generation of cluster munitions to achieve the required greater than 99 percent reliability goal. Evolving DoD emphasis on increased weapon system reliability is driving the need to consider new and novel approaches for achieving increased fuze reliability while maintaining or enhancing fuze design safety.  DoD policy, higher weapon reliability expectations and harsher weapon system operational requirements are dictating the need for higher fuze reliability than available using current technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.398"
                                            },
                                            "Text": {
                                                "val": "-  Developed and analyzed concepts for high reliability fuze architecture for Service cluster munitions applications.\n-  Continued development of a target detection sensor and safety and arming device that would provide an increase in the overall fuze reliability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.516"
                                            },
                                            "Text": {
                                                "val": "-  Research and develop novel technologies for UXO reduction features including fuze mechanisms and initiation energetic to eliminate any unexploded ordnance.\n-  Build high reliability fuze architecture technology components that satisfy reliability while maintaining safety by eliminating singlepoint and common-mode failures.\n-  Downselect cluster munition fuze design and architecture.  Fabricate and evaluate brassboard submunition fuzes and conduct explosive train tests, static expulsion tests and engineering tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.574"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate high reliability fuze architecture concepts that satisfy reliability while maintaining safety by eliminating single-point and common-mode failures.\n-  Apply next generation cluster munition fuze design and architecture, fabricate component technology prototypes, and conduct performance and reliability tests in ballistic and harsh environment testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop common \/ modular fuze architecture; innovative fuze component technologies; sensors; next generation fuze setting capability, tools and modeling; and fuzing power sources. These fuzing technologies will provide smaller, more cost effective solutions while meeting or exceeding the performance of existing technologies.  Development of these technologies will enable future weapon applications to be more mission adaptive and smaller along with improved target detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.270"
                                            },
                                            "Text": {
                                                "val": "-  Continued development for proximity fuze sensors and electronics for detecting targets, impact, voids, and media which are highly resistant to exploitation.\n-  Continued thin film\/conformal thermal battery development for fuzing, which will result in cheaper, conformal, smaller, cooler thermal batteries with higher energy or power densities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.976"
                                            },
                                            "Text": {
                                                "val": "-  Develop and build exploitation resistant proximity fuze sensors and electronics technology hardware for detecting targets, impact, voids, and media.\n-  Develop fuze power source technology and concepts that include functionality that precludes the inadvertent release of \"stored energy\" such as Micro power sources and energy harvesting components.\n-  Conduct assessments of common fuze architecture technologies: safety components, modular electronics, sensors, interfaces, and packaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.452"
                                            },
                                            "Text": {
                                                "val": "-  The establishment of a modular, open fuze architecture is a technology enabling product that would establish a defined system interface architecture between various fuze subsystems.\n-  Evaluate proximity fuze sensor, electronics and algorithm technologies in performance and functional testing in air-gun and ballistic environments.\n-  Transition to 6.3 development of exploitation resistant proximity fuze sensors and electronics technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P301"
                                    },
                                    "Title": {
                                        "val": "BA 3 Enabling Fuze Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.041"
                                        },
                                        "CurrentYear": {
                                            "val": "1.077"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.792"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.792"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.487"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.979"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.196"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.497"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented using DoD\/NASA Technical Readiness Level (TRL) scale.\n2) Fuze Area Technology Group (FATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Fuze Technology Program management and technical staff.\n3) Chairman's Annual Assessments for each FATG are critically reviewed by the Technology Advisory Committee to determine progress, transition plans, and relevance of each project.\n4) Project progress toward goals and milestones is assessed at each FATG meeting.\n5) Annual technical reports and papers are tracked and documented for the Program.\n6) Technology Transition Agreements in place with Munitions programs."
                        }
                    }
                }
            ]
        }
    }
}