{
    "id": "055a1b3ada9013652d4f81a148e02cbc182d88ca",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0807708D8Z"
        },
        "ProgramElementTitle": {
            "val": "Wounded, Ill and Injured Program"
        },
        "R1LineItemNumber": {
            "val": "134"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.531"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.590"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.531"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.059"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.045"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Departmental Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.014"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Department approved a technical correction that transferred DW, RDTE to DW, Procurement to procure equipment that facilitates interchange of Service member’s Verification of Military Education and Training and DD Form 214 data between the DoD and the Departments of Labor and Veterans Affairs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "877"
                    },
                    "ProjectTitle": {
                        "val": "Wounded, Ill and Injured Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.531"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Care Management, Disability Evaluation, and Transition Systems IM\/IT.  Funding includes development of  web-based tools for use in overseeing the Service member recovery and facilitating resolution of disability and transition processing issues.  In FY 2008, the Departments of Defense and VA made significant progress leveraging the Veterans Tracking Application with access to existing Department of Defense Care Management (CM) tools and resources. The work continued through FY 2009 with a prototype dashboard that leverages existing case management tools and resources in a single sign on construct, and continued in FY 2010 to include further enhancements of the prototype and integration of care management models.  The Department of Defense’s request includes funding for development of content management systems.  \nJustification:  Non-medical Care Managers are responsible for provide oversight of welfare and quality of life issues.  They assist the service member and family in resolving problems involving financial, administrative, personnel, and other non-medical issues that may occur during the recovery, rehabilitation and reintegration phases across the continuum of care.  Full funding will provide the capability for DoD Case Managers to view non-clinical data on a Wounded Warriors from one location.  FY 2009 funding began the implementation of the July 2007 Dole-Shalala Recommendations and initial development of the 2008 NDAA required comprehensive policy.  During FY 2010, the Recovery Care Plan systems solution was developed and underwent Government Acceptance Testing.  RCP-SS systems deployments began in 3Q FY 2010 to selected field locations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Care Management, Disability Evaluation, and Transition Systems IM\/IT - Wounded, Ill, and Injured"
                                    },
                                    "Description": {
                                        "val": "Funding facilitates the discovery, analysis, and integration of existing DoD and VA web-based tools, and the development of a single application that will be used across the agencies to oversee the Service member recovery and facilitating resolution of transition and disability processing issues.   Non-Clinical Case Management Recovery Care Plan and Benefits Portal Development.  Funding facilitates the research, analysis, and integration of existing DoD and VA web-based tools, and the development of a single application that will be used across the agencies to oversee the Service member recovery and facilitating resolution of transition process issues.   This initiative provides public and secure web access to benefits and services supporting Wounded Warriors through a secure\/interactive Web-based portal tailored to the needs of the Wounded Warrior, identifying both VA\/DoD benefits and services important to a Wounded Warrior’s recovery plan.  The Portal customizes benefits information based upon user profiles to include display of benefits to support stage recovery and leverages existing VA\/DoD business services\/systems to create “One Pathway” for the Wounded Warrior so that they may more actively participate in their clinical recovery plan, and interfaces with their Individual Recovery Plan. In FY 2008 the Department of Defense and Veteran Affairs (DoD\/VA) established a Portal presence with links to MyHealthe-Vet, eLearning LMS, and pre-negotiated access for all members with the establishment of secure, single sign-on infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.531"
                                            },
                                            "Text": {
                                                "val": "The Federal Voting Assistance Office contracted a study on absentee voting that supports Wounded Warriors, disabled military members, military members,\ntheir dependents and overseas civilian voters. Wounded Warriors reported low electoral participation due to a lack of motivation as they focused on medical issues, a lack of awareness of voting assistance resources available to them, and the need for additional assistance when completing registration forms and absentee ballots. This observation is not surprising as most Wounded Warriors who were interviewed were in the 18-24 year age-group--an age group that has historically exhibited low participation rates.\n\nIn its research and analysis, the Federal Voting Assistance Program Office reviewed business processes and procedures, data sources for voter demographics and voting behavior information, and statutory, regulatory, and policy requirements for voting related information with the intent of developing a Federal Voting enterprise architecture to support revisions to the automated Federal Write-In Absentee Ballot (FWAB) and Federal Post Card Application (FPCA) for Wounded Warriors.\n\nThe Federal Voting Assistance Program Office conducted a mock election where Wounded Warriors were observed and interviewed after voting on six\ncommercial electronic voting systems.  The goal of this research was to evaluate the usability, accessibility and privacy provided by the electronic voting systems.  Wounded Warriors, in general, provided positive feedback regarding their experience in using the electronic voting systems.  Some Wounded Warriors reported difficulties related to usability and accessibility issues.  This feedback is available to electronic voting system manufactures for future improvements assisting Wounded Warriors and other challenged citizens."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "During the Program Review for Fiscal Years 2011-2015, DoD Transition Assistance Program (TAP) requirements were definitized and documented to reflect senior leadership's strategic intent to meet provisions of 10 USC § 1142, Pre-separation Counseling, with increased emphasis on delivery of services to the Reserve Components.   As such, the Department approved a technical correction that transferred DW, RDTE to DW, Procurement to procure equipment that facilitates interchange of Service member’s Verification of Military Education and Training and DD Form 214 data between the DoD and the Departments of Labor and Veterans Affairs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0807708D8Z"
                                    },
                                    "Title": {
                                        "val": "Major Equip Procurement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.087"
                                        },
                                        "CurrentYear": {
                                            "val": "5.062"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.405"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.405"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.942"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.995"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.794"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.829"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0902198D8Z"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "79.412"
                                        },
                                        "CurrentYear": {
                                            "val": "74.902"
                                        },
                                        "BudgetYearOne": {
                                            "val": "75.819"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "75.819"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.894"
                                        },
                                        "BudgetYearThree": {
                                            "val": "76.513"
                                        },
                                        "BudgetYearFour": {
                                            "val": "73.745"
                                        },
                                        "BudgetYearFive": {
                                            "val": "74.741"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}