{
    "id": "0587cdc5e04ba69c16fcdb7a4e68fee1c5ba7050",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0702239N"
        },
        "ProgramElementTitle": {
            "val": "Avionics Component Improvement Program"
        },
        "R1LineItemNumber": {
            "val": "228"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.177"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "3.177"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project 3170 - The Avionics Component Improvement Program (AvCIP) develops, demonstrates, integrates, tests and evaluates solutions to address critical readiness and reliability deficiencies, obsolescence, loss of sustainability, and top repair cost drivers in Navy in-service avionics systems. Project candidates are collected from across all platforms, reviewed, competed and selected in the year prior to funding allocation.\n\nBeginning in FY 2012, Project Unit 3170 transfers to Standards Development, PE 0604215N, Project Unit 0572."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.250"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.177"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.073"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.056"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.017"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3170"
                    },
                    "ProjectTitle": {
                        "val": "Avionics Component Improvement Program(AVCIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.177"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.177"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Avionics Component Improvement Program (AvCIP) provides design, development, demonstration, test and evaluation, and integration support to resolve critical readiness and reliability deficiencies, obsolescence, loss of sustainability and top repair cost drivers of in-service Navy avionics systems.  Funds are competitively allocated across multi-platform commodity and platform-specific projects with the objective of maintaining Avionics systems effectiveness at levels required to ensure mission success.  AvCIP has been endorsed by the OSD Business Initiatives Council as a cooperative tri-service program that adopts the better business practices and proven resourcing models of the Engine Component Improvement Program. Resources are directed just prior to the execution year, allowing funds to address the most current fleet issues and accelerate solution fielding.  Lack of out-year deliverable specificity is mitigated through definition of Avionics capability evolution in the Core Avionics Master Plan.  Although Avionics association to digital technology brings challenges to keep pace with Moore's Law and stay ahead of obsolescence, it also affords significant opportunity to reap benefits of emerging advancements. Conversion of legacy systems from analog to digital components has consistently resulted in reliability gains that significantly reduce maintenance\/repair activity\/costs, save weight and space, and increase operational availability.  Modern open system architecture technology insertion improves system upgradeability, by reducing integration time and cost.  Avionics systems are the vehicles that enable platform connectivity and interoperability.  AvCIP will help platforms integrate the modern technology that will allow them to keep pace with the rapid evolution of transformational network centric operations development.  AvCIP also provides a vehicle to address unanticipated performance issues or critical changes in threat, tactics or operational demands revealed during deployment without disrupting program budget profiles designed for other purposes.  AvCIP is designed to support manned and unmanned, common and unique, fixed and rotary wing aircraft electronic systems, including communications, navigation, surveillance, sensors, combat identification, civil interoperability, safety, mission data processing and display, and network connectivity equipment.  Initiative selection is based upon analysis of operational priority, performance improvement, capability benefit, scope of applicability across fleet platform or weapon system inventory, technical risk, delivery time, cost and life cycle return on investment. \n\nBeginning in FY 2012, Project Unit 3170 transfers to Standards Development, PE 0604215N, Project Unit 0572."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AvCIP"
                                    },
                                    "Description": {
                                        "val": "Investigate High Value Return on Investment Candidates, addressing avionics critical readiness and reliability deficiencies, obsolescence, loss of sustainability and top repair cost drivers.  Prioritize critical avionics performance, capability and obsolescence problems that require immediate attention.  Pursue solutions to these problems based upon urgency, warfighting contribution and return on investment.  Develop and test system solutions based on priority.  Resources will cover design and development, prototypes, platform integration, engineering, developmental\/operational testing, program management, contracting and logistics efforts.  Logistics will include efforts such as technical data, support equipment, provisioning, and training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.177"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "AvCIP NRE completed on the following projects: Second phase of E-2C APS-145 Radar Radio Frequency Amplifier. Qualification and flight test of FA-18 E\/F Lot 26-29 MAGR2K GPS Receiver 24 Channel Card. E-2C Overhead Cockpit White Light modification. E-2C, C-2 Emergency Escape Hatch Light modification.  P-3C UYQ-76A Maintenance Data Processing System upgrade. AN\/APN-171 SRA DMSMS Sustainment and EP-3 Digital Autopilot upgrade."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN\/0577"
                                    },
                                    "Title": {
                                        "val": "Common Avionics"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.996"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "7.959"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AvCIP will annually compete candidate solutions according to criticality of operational contribution, technical risk, return on investment, and breadth of application.  OPNAV N88 and N43, NAVAIR, NAVICP and the Fleet will participate in project selection for execution year allocation.  The AvCIP Integrated Program Team will monitor project execution and track return on investment using Fleet supply and component performance tracking systems (i.e., Snapshot, Naval Aviation Logistics Command\/Management Information System, Naval Aviation Logistics Data Analysis, Logistics Management Data System, Visibility and Management of Operation and Support Cost).  Demonstrated Fleet operation\/sustainment cost avoidances will be coordinated with N43 Flying Hour Program.  Modification solutions include modular hardware, software and material upgrades.  Resources will cover design and development, prototypes, platform integration, engineering, developmental\/operational testing, program management, contracting and logistics efforts.  Logistics will include efforts such as technical data, support equipment, provisioning, and training."
                        },
                        "PerformanceMetrics": {
                            "val": "The AvCIP program goal is successful establishment of AvCIP projects, execution and benefits tracking mechanisms."
                        }
                    }
                }
            ]
        }
    }
}