{
    "id": "090725942b2f116ca1d3b096e0c0a3a495eb4d04",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604710A"
        },
        "ProgramElementTitle": {
            "val": "Night Vision Systems - Eng Dev"
        },
        "R1LineItemNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "44.513"
            },
            "CurrentYear": {
                "val": "59.195"
            },
            "BudgetYearOne": {
                "val": "32.621"
            },
            "BudgetYearOneBase": {
                "val": "32.621"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "42.965"
            },
            "BudgetYearThree": {
                "val": "21.112"
            },
            "BudgetYearFour": {
                "val": "17.287"
            },
            "BudgetYearFive": {
                "val": "14.540"
            }
        },
        "ProgramElementNote": {
            "val": "Program Change Summary Explanation:\n\nFiscal Year 2011:  Program Decrease - $6.197 million reprogrammed from project L67 to Program Element 633710, Project K70 Advanced Weapon Sight Technology (AWST) and Focal Plane Array (FPA) High Definition Long Wave Infrared (HDLWIR) technology efforts.\n\nFiscal Year 2013:  Program Decrease - $18.979 million realigned from Project L67 to higher priority requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides night vision\/reconnaissance, surveillance and target acquisition technologies required for U. S. defense forces to engage enemy forces twenty-four hours a day under conditions of degraded visibility due to darkness, adverse weather, battlefield obscurants, foliage and man-made structures.  These developments and improvements to high performance night vision electro-optics, radar, laser, and thermal systems and integration of related multi-sensor suites will enable near to long range target acquisition, identification and engagement to include significant fratricide reduction, which will improve battlefield command and control in \"around-the-clock\" combat operations.  \n\nProject L67 focuses on night vision electro-optical, laser, and other target identification and location equipment for a variety of Future Combat System of Systems (FCS) Units of Action\/Employment and Future Force soldiers.  This project includes the enhanced night vision goggle, modular Horizontal Technology Insertion (HTI) multi-function laser activities, and thermal upgrades to include an uncooled medium thermal weapon sight. \n\nProject L70 focuses on night vision, reconnaissance, surveillance and target acquisition (RSTA) sensor and suites of sensors to provide well-defined surveillance and targeting capabilities for a variety of Current, Modular, and Future Force platforms.  This project includes: System Development and Demonstration of the Thermal Imaging Engine (transitioned from an Advanced Technology Objective); night vision sensor acquisition support of Unattended Ground Sensors and ASTAMIDS; development of a Standard Ground Station for Persistent Surveillance Sensors (RAID and PTDS), development for the Next Generation FLIR (NGF) B-kit  and improvements and enhancements to Persistent Surveillance System (PSS)and Pre Planned Product Improvements (P3I) software related to meeting network interoperability requirements and improving the soldier - machine interface of the POR.\n\nProject L75 focuses on development of Profiler Block enhanced capabilities for meteorological measurement sensors and data.  Improvements have reduced the footprint (less soldiers\/vehicles) and complexity of the system, improved performance (accuracy), improved survivability, connectivity, no balloon sensor, multiple initialization data, and terrain visualization. The improved MET message data will increase lethality by enabling artillery a greater probability of first round hit with indirect fire systems.  Profiler Block III will provide a networked laptop configuration while further reducing the system's logistics footprint with the elimination of the High Mobility Multi-purpose Wheeled Vehicle (HMMWV) mounted shelter and trailer.  The Block III configuration consist of one computer with a common operating system co-located within the Tactical Operation Center (TOC) with a direct interface to the TOC Local Area Network (LAN).  The system will be able to provide Gridded MET along with autonomously generate MET messages upon request from AFATDS eliminating the need for a dedicated MET section crew.  The Army will realize a significant cost avoidance with the improved configuration.\n\nProject L76 focuses on the engineering development of technologies for insertion into Laser Target Locators and Laser Designators to improve overall performance of those systems and reduce weight.  Technologies developed under this project will benefit the Lightweight Laser Designator Rangefinder (LLDR, AN\/PED-1), various Laser Target Locators, and future precision targeting programs based on emerging Army requirements.  In addition, this line will support improved accuracy (reduced target location error) in support of coordinate seeking weapons, such as Joint Direct Attack Munition (JDAM) and Excalibur.\n\nProject L79 focuses on development of the Joint Effects Targeting System (JETS).  The goal is to develop a lightweight set of mission equipment for the dismounted forward observers and controller (including Joint Tactical Air Controllers - JTAC) that will provide means to call for fire and control delivery of air, ground and naval surface fire support using precision\/near-precision\/non-precision munitions and effects (lethal and non-lethal).  JETS consist of two subsystems, the Target Location Designation System (TLDS) and the Target Effects Coordination System (TECS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "52.549"
                },
                "CurrentYear": {
                    "val": "59.265"
                },
                "BudgetYearOne": {
                    "val": "51.417"
                },
                "BudgetYearOneBase": {
                    "val": "51.417"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.513"
                },
                "CurrentYear": {
                    "val": "59.195"
                },
                "BudgetYearOne": {
                    "val": "32.621"
                },
                "BudgetYearOneBase": {
                    "val": "32.621"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.036"
                },
                "CurrentYear": {
                    "val": "-0.070"
                },
                "BudgetYearOne": {
                    "val": "-18.796"
                },
                "BudgetYearOneBase": {
                    "val": "-18.796"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-6.197"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.504"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.335"
                                },
                                "CurrentYear": {
                                    "val": "-0.070"
                                },
                                "BudgetYearOne": {
                                    "val": "0.183"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.183"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Overseas Contingency Operations (OCO)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-18.979"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-18.979"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L67"
                    },
                    "ProjectTitle": {
                        "val": "SOLDIER NIGHT VISION DEVICES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.021"
                        },
                        "CurrentYear": {
                            "val": "23.946"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.775"
                        },
                        "BudgetYearThree": {
                            "val": "15.011"
                        },
                        "BudgetYearFour": {
                            "val": "12.603"
                        },
                        "BudgetYearFive": {
                            "val": "12.889"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops, improves and miniaturizes high performance night vision electro-optics, thermal and laser systems.  It also provides for systems integration of related multi-sensor suites to enable near to long-range target acquisition and engagement as well as improved battlefield command and control in around-the-clock combat operations.  It focuses on adapting demonstrated technologies that bring improvements to the dismounted Soldiers' equipment.  This project develops or enhances equipment that provides the individual Soldier's day\/night situational awareness and individual targeting capability, sniper fire detection and location capability, and integrates improved target location and self-location capability to eliminate friendly fire incidents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhanced Night Vision Goggle"
                                    },
                                    "Description": {
                                        "val": "The AN\/PSQ-20 ENVG is a helmet-mounted passive device for the individual Soldier that fuses image intensification and long wave infrared imagery into a single, integrated image."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.186"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated Product Qualification Test (PQT) for multiple sources for the AN\/PSQ-20 (Enhanced Night Vision Goggle)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete PQT for multiple sources of AN\/PSQ-20 (Enhanced Night Vision Goggle)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Green Laser Interdiction System (GLIS)"
                                    },
                                    "Description": {
                                        "val": "The Green Laser Interdiction System (GLIS) is a rifle-mounted laser that allows the Soldier to interdict hostile actions through non-lethal effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.448"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the development of lightweight multi-purpose lasers to be used as a nonlethal method of warning a vehicle operator or gaining their attention beyond 75 meters and to identify whether friend or foe."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sense Through The Wall (STTW)"
                                    },
                                    "Description": {
                                        "val": "The STTW is a handheld sensor that provides dismounted Soldiers with the capability to detect and locate personnel targets through walls from a standoff distance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.901"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed developmental and performed operational test activities for STTW representative test articles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.859"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete software modifications to enhance sensors performance and complete operational test activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Family of Weapons Sights (FWS)"
                                    },
                                    "Description": {
                                        "val": "FWS is a family of weapon sights that utilize advances in thermal and image intensified technologies to produce Individual, Crew-Served, and Sniper weapon sights operable in-line with a day optic or in a stand-alone mode.  FWS includes fused multi-band imagery and rapid target acquisition with ballistic equations, providing the Soldier with improved capabilities during day and night operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.301"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated the development of the Family Weapon Sight (FWS) program, that includes Individual, Crew-Served and Sniper variants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the Family of Weapon Sights (FWS) systems, which includes clip-on and fused weapon sights, with a focus on the Individual variant to provide a clip-on, rapid target acquisition capability, and continued development of decreased (12 micron) uncooled long-wave infrared focal plane arrays in multiple large format sizes.  These arrays will improve sensitivity, clarity, and range, while simultaneously reducing the SWaP consumption when integrated into the Crew-Served and Sniper variants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Tactical Optical Rifle Mounted"
                                    },
                                    "Description": {
                                        "val": "The AN\/PSQ-23 Small Tactical Optical Rifle Mounted (STORM) Micro-Laser Range Finder (MLRF) is a weapon-mounted multi-function laser system.  It provides an eye safe laser range finder, digital compass, Infrared (IR) and visible aiming lights, and an IR illuminator for far target location with continuous range, accuracy, weight and power performance enhanced capabilities.  It also has an embedded training system, Multiple Integrated Laser Engagement System (MILES)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.185"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed laser system testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.440"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete production qualification testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "603774A VT7"
                                    },
                                    "Title": {
                                        "val": "603774A - Night Vision Systems Advanced Development (VT7)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "10.715"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.715"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.208"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.260"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.193"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Helmet Mounted Enhanced Vision Devi"
                                    },
                                    "Title": {
                                        "val": "Helmet Mounted Enhanced Vision Devices (HMEVD) (SSN K36400)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.098"
                                        },
                                        "CurrentYear": {
                                            "val": "117.442"
                                        },
                                        "BudgetYearOne": {
                                            "val": "125.917"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "125.917"
                                        },
                                        "BudgetYearThree": {
                                            "val": "174.861"
                                        },
                                        "BudgetYearFour": {
                                            "val": "222.725"
                                        },
                                        "BudgetYearFive": {
                                            "val": "226.581"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Thermal Weapon Sight (TWS)"
                                    },
                                    "Title": {
                                        "val": "Thermal Weapon Sight (TWS) (SSN K22900)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "249.001"
                                        },
                                        "CurrentYear": {
                                            "val": "186.859"
                                        },
                                        "BudgetYearOne": {
                                            "val": "82.162"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "82.162"
                                        },
                                        "BudgetYearThree": {
                                            "val": "95.920"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1441.121"
                                        },
                                        "BudgetYearFive": {
                                            "val": "143.565"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Sniper Night Sight (SNS)"
                                    },
                                    "Title": {
                                        "val": "Sniper Night Sight (SNS) (SSN K41500)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.091"
                                        },
                                        "CurrentYear": {
                                            "val": "4.892"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.660"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.660"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.049"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.240"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Multi-Function Aiming Light (MFAL)"
                                    },
                                    "Title": {
                                        "val": "Multi-Function Aiming Light (MFAL) (SSN K35000)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.434"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "21.434"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Sense Through The Wall (STTW)"
                                    },
                                    "Title": {
                                        "val": "Sense Through The Wall (STTW) (SSN KA2300)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.799"
                                        },
                                        "CurrentYear": {
                                            "val": "57.498"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.212"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.212"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.015"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "103.666"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Small Tactical Optical Rifle Mounte"
                                    },
                                    "Title": {
                                        "val": "Small Tactical Optical Rifle Mounted (STORM) (SSN K35110)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.472"
                                        },
                                        "CurrentYear": {
                                            "val": "10.227"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.717"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.717"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.319"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.305"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.025"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Green Laser Interdiction System (GL"
                                    },
                                    "Title": {
                                        "val": "Green Laser Interdiction System (GLIS) (SSN AD5311)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "25.356"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.014"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.014"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "27.385"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The various developmental programs in this project continue to exercise competitively awarded contracts using best value source selection procedures."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Sense Through The Wall (STTW)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.963"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sense Through The Wall (STTW)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 CyTerra"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ACC APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.522"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.522"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Laser Detection\/Laser Warning Device"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Fibertek"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "HERNDON, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.428"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sense Through The Wall (STTW)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ACC APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.209"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.209"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Family of Weapon Sights (FWS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM ACQ CENTER"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ALEXANDRIA, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.939"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.923"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Focal Plane Arrays (FPA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DOI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT HUACHUCA, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.543"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sniper Fire Detection and Location Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Fibertek"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "HERNDON, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.790"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Advanced Weapon Sight Technologies (AWST)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.297"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.297"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.363"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.610"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.789"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.150"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Test Support Activity"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Activities"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.782"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.546"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ENHANCED NIGHT VISION GOGGLES (ENVG)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ENVG Development\/ Operational Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SENSE THRU THE WALL (STTW)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "STTW  MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FAMILY OF WEAPON SIGHTS (FWS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS MS A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Improved Focal Plane Array (FPA) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMALL TACTICAL OPTICAL RIFLE MOUNTED (STORM) - Production Qual. Test (PQT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IED Detection Development (IDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Optical Augmentation (OA) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L70"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION DEV ED"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.000"
                        },
                        "CurrentYear": {
                            "val": "12.289"
                        },
                        "BudgetYearOne": {
                            "val": "11.116"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.116"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project performs Engineering and Manufacturing Development (EMD) on high performance night vision, Reconnaissance, Surveillance, and Target Acquisition (RSTA) systems and other related systems that allow forces to locate and track enemy units in day, night, and all battlefield conditions, and through natural and man-made structures and obscurants.  It also develops and integrates suites of these sensors to provide well-defined surveillance and targeting capabilities, as well as architectures for these sensors to communicate automatically.  The focus is on meeting the requisite night vision and RSTA capabilities required for evolving Current Force, Modular Force, and Future Force systems.\n\nThe project transitions Advanced Thermal Imaging Technology from an Advanced Technology Objective to the development of a thermal engine intended to be common among all US Army FLIR sensor systems.  This program will initiate and continue the development and qualification of the thermal Engine to meet requirements of Next Gen FLIR Army Combat and reconnaissance systems.  The thermal imaging engine provides Mid Wave Infrared and Long Wave Infrared digital video. This technology enhances the war-fighters' survivability and lethality through increased identification range performance when integrated in current sensor packages, while enabling the detection of difficult or obscured targets and faster threat detection through automated processes.  The thermal imaging engine can also be used to enhance mobility by maintaining current range performance in significantly smaller and lighter sensor packages.\n\nThe funds allocated to Gunshot Detection supported a System Characterization study and Technology Readiness Level (TRL) determination for potential technical capabilities.  The system characterization study will ascertain the performance of industry systems and will enhance Government knowledge of the benefits of various technology types and modalities in determining incoming gunshots.  The study will aid the Government in writing the Performance Work Statement (PWS), Performance Specification and the Interface Control Document (ICD) and will enable schedule acceleration.\n\nThis project provided Program Office technical support of the FCS Unattended Ground Sensors (UGS) hardware and software development, demonstration and test for a family of UGS systems for Intelligence, Surveillance and Reconnaissance (ISR).  This provided FCS and the Army a networked Unattended Ground Sensor capability for ISR and physical security. \n\nThis project develops the Standard Ground Station (SGS) for PM NV\/RSTA sensor systems. Leveraging the success in theater of the Persistent Surveillance and Dissemination System of Systems (PSDS2) Quick Response Capability (QRC), this effort takes the 3D visualization capability from PSDS2 and applies it to the Operator's station for RAID tower systems, aerostats and other RSTA Sensor systems.  This effort was prioritized and performed on an accelerated schedule to support fielding in October 2008 as part of the RAID tower systems in response to the Base Expeditionary Target and Surveillance Systems - Combined (BETSS-C) JUONS. This SGS improves the effectiveness of RSTA systems by combining sensor videos, sensor cues and Battle Command information into a geo-registered 3D visualization of the terrain. FY 2010 Congressional add is for development of SGS enhancements.\n\nThis project also supports development efforts for the Advanced Thermal Imaging Engine, to include development of the Ground Platform Thermal Imaging Engine leading to the fabrication of multiple prototypes with Block II Electro Oprical Counter-Counter Measures (EOCCM) improvements incorporated, and support future second source development activities.  In addition, this project also supports the development of the Pre Planned Product Improvements (P3I) software, including meeting the network interoperability requirements and improving the soldier - machine interface for the Persistent Surveillance System (PSS) Program of Record (POR).\n\nFY 2013 funding supports initiation of development efforts for the Next Generation FLIR (NGF) B-kit to include the Next Generation FLIR (NGF) B-Kit specification development and NGF B-Kit MSB preparation activities. This effort leverages activities associated with the Advanced Thermal Imaging Engine. Additionally, FY 2013 funding supports continued activities associated with the Persistent Surveillance System (PSS) Pre Planned Product Improvements (P3I) software related to meeting network interoperability requirements and improving the soldier - machine interface of the POR."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Thermal Imaging Engine"
                                    },
                                    "Description": {
                                        "val": "Engineering and Manufacturing Development (EMD) of Thermal Imaging Engine.  MS B approval in FY08 initiated EMD effort.  EMD program develops the Thermal Imaging Engine for the Next Gen FLIR Army Combat and reconnaissance systems to include fabrication and qualification of 15 prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.789"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding supported Qualification Testing, system-level test activities, completion of production preparation activities, and competition stimulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.976"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin development of the Ground Platforms Thermal Imaging Engine leading to the fabrication of multiple prototypes that will incorporate Block II EOCCM improvements to realize a common protected FLIR.  To promote competitive pricing and strengthen the industrial base, the ground platforms development effort will be competed; with award of up to two vendors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation FLIR B-Kit"
                                    },
                                    "Description": {
                                        "val": "Development of the Next Generation FLIR B-Kit.  NGF B-Kit will represent the B-Kit materiel solution in accordance with the I-FLIR CDD, resulting in a common sensor component for both Ground and Airborne host platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.909"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.909"
                                            },
                                            "Text": {
                                                "val": "Following FY 2012 approval of the I-FLIR CDD and Platform ECP\/Sensor Upgrade programs, funding supports Next Generation FLIR (NGF) B-Kit specification development and NGF B-Kit MS B preparation activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gunshot Detection Systems (GDS)"
                                    },
                                    "Description": {
                                        "val": "The system uses passive acoustic detection, computer-based signal processing, and both aural and visual indications to help troops locate a hostile shooter by reporting relative shooter azimuth, range, and elevation from incoming small arms fire."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2011 funds supported a system characterization study and Technology Readiness Level (TRL) determination for potential capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pre Planned Product Improvements (P3I) software for the Persistent Surveillance System (PSS) Program of \nRecord (POR)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.313"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop Pre Planned Product Improvements (P3I) software for the Persistent Surveillance System (PSS) Program of Record (POR) to include meeting the network interoperability requirement and improving the soldier - machine interface of the POR.  Resultant improvements would be implemented through maintenance upgrades to fielded systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.207"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.207"
                                            },
                                            "Text": {
                                                "val": "Continued development of the Pre Planned Product Improvements (P3I) software for the Persistent Surveillance System (PSS) Program of Record (POR), to include meeting the network interoperability requirement and improving the soldier - machine interface of the POR.  Resultant improvements would be implemented through maintenance upgrades to fielded systems.  This effort establishes the Army Sensor Computing Environment (CE) effort in support of the Common Operating Environment (COE) vision."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "LRAS3 (K38300)"
                                    },
                                    "Title": {
                                        "val": "Long Range Advanced Scout Surveillance System (LRAS3) (K38300) OPA2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "255.641"
                                        },
                                        "CurrentYear": {
                                            "val": "102.334"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "357.975"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PM ABRAMS (PE 273735 D330)"
                                    },
                                    "Title": {
                                        "val": "Abrams Upgrade Program (PE 273735 D330)"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "187.401"
                                        },
                                        "BudgetYearFour": {
                                            "val": "166.891"
                                        },
                                        "BudgetYearFive": {
                                            "val": "137.874"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "GCV (PE 0605625A FC8)"
                                    },
                                    "Title": {
                                        "val": "Ground Combat Vehicle (PE 0605625A FC8)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "934.366"
                                        },
                                        "CurrentYear": {
                                            "val": "884.387"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1963.178"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1963.178"
                                        },
                                        "BudgetYearThree": {
                                            "val": "732.849"
                                        },
                                        "BudgetYearFour": {
                                            "val": "380.600"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The development programs in this project are currently based on competitive awards and under cost reimbursement type contracts.  FY 2013 funding supports NGF B-Kit Spec Development and MSB activities following FY 2012 approval of the I-FLIR CDD and Platform ECP\/Sensor Upgrade programs.  Additionally, FY 2013 funding supports continued development of the Persistent Surveillance System (PSS) Pre Planned Product Improvements (P3I) software."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM, NV\/RSTA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA & Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.239"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.599"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.616"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.616"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.454"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9.454"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SGS\/RAID"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sarnoff"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Princeton, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.913"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.913"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.913"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2009 - FY 2011:   Thermal Imaging - Design and Demonstration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.478"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.478"
                                                    },
                                                    "TargetValue": {
                                                        "val": "13.478"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2010-FY 2011:  Thermal Imaging - Source Risk Reduction"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.361"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.361"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.361"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2012-FY 2013: Develop, Fab, and Qual of a common Ground Platform Engine with Block II EOCCM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.617"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.918"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.918"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.535"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.535"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Gunshot Detection Systems"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds (APG)"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.211"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.211"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.211"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PSS P3I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.313"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.591"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.591"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.904"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.904"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Standoff Suicide Bomber Detection System (SSBDS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lorton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FOB S2S (Forward Operating Base Sensor to Shooter)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lorton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Remotely Operated HMDS (Husky Mounted Detection System)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EOIR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fredricksburg VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.244"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.760"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.991"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.991"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.995"
                                                    },
                                                    "TargetValue": {
                                                        "val": "27.995"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "*  Includes PSDS2, UGS, STTW, 3GF, PSDS2, FCS UGS and other sensor test and evaluation activities."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Test Support*"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.850"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.850"
                                                    },
                                                    "TargetValue": {
                                                        "val": "15.850"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Thermal Imaging - Develop, Fab and Qual of Ground Platform Engine with BII EOCCM"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Persistent Surveillance System (PSS) Pre Planned Product Improvement (P3I)effort"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FOB S2S (Forward Operating Base Sensor to Shooter)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remotely Operated HMDS (Husky Mounted Detection System)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Standoff Suicide Bomber Detection System (SSBDS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L75"
                    },
                    "ProjectTitle": {
                        "val": "Profiler"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.799"
                        },
                        "CurrentYear": {
                            "val": "2.593"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "The AN\/TMQ-52 Meteorological Measuring Set-Profiler (MMS-P) uses a ground tactical meteorological (TACMET) sensor and Meteorological (MET) data from communication satellites along with an advanced weather model to provide highly accurate MET data covering an operational area of 500 kilometers with a tested range of 60 kilometers.  Profiler provides MET information such as wind speed, wind direction, temperature, pressure, humidity, rate of precipitation, visibility, cloud height and cloud ceiling.  All of these are required for precise targeting and terminal guidance.  Profiler uses this information to build a four-dimensional MET model (height, width, depth and time) that includes terrain effects. By providing more accurate MET messages, Profiler will enable the artillery to have a greater probability of a first round hit with indirect fire systems.  The new capabilities will increase the lethality of field artillery systems such as Multiple Launch Rocket Systems (MLRS), Paladin, and self-propelled or towed howitzers.  When analysis determined that Block I Profiler already satisfied the requirements of Block II, the decision was made to proceed directly to Block III as the next evolution of the Profiler capability.  Block III will provide a networked laptop configuration that will enhance system efficiencies while further reducing the system's operational and logistical footprint with the elimination of the High Mobility Multi-purpose Wheeled Vehicle (HMMWV) mounted shelter and trailer.  The Block III configuration consists of one computer with a common operating system co-located within the Tactical Operation Center (TOC) with a direct interface to the TOC Local Area Network (LAN).  The system will be able to autonomously generate MET messages upon request from Advanced Field Artillery Tactical Data Systems (AFATDS) eliminating the need for a dedicated MET section crew.  The Army will realize a significant Operations and Support cost avoidance with the improved configuration.\n\nThere is no FY13 funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Block III backup sensor effort."
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.245"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Block III backup sensor effort"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "software porting to laptop."
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.986"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete effort for software porting to laptop"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production Representative Prototype Systems (PRPS)."
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.568"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue reduction of physical configuration, build and test eight Production Representative Prototype Systems (PRPS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block III Limited User Testing and Austere Testing."
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.593"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Block III Limited User Testing and Austere Testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Profiler OPA SSN K27900"
                                    },
                                    "Title": {
                                        "val": "Profiler"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.384"
                                        },
                                        "CurrentYear": {
                                            "val": "5.312"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.482"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.482"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.203"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.039"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "35.248"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Profiler Block III acquisition strategy decision brief to the Milestone Decision Authority (MDA) was presented in January 2010.  The Acquisition Decision Memorandum (ADM) authorizing initiation of Profiler Block III was signed by the MDA on 23 February 2010.  A limited competitive Firm-Fixed Price (FFP)\/Cost Plus Fixed Fee (CPFF) contract was awarded via the Strategic Services Sourcing (S3) contract to build, test and deliver eight (8) Profiler Block III Production Representative Prototype Systems (PRPS).  The Block III program is on schedule to enter production beginning in FY13."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Nav Sys\/JTCI-G"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.150"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.473"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Award efforts for s\/w porting to laptop"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mantech"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Red Bank, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.495"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Initiate backup sensor effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.191"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.516"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.499"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sys Engr\/Technical Assistance"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.246"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.752"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OGA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WSMR, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.089"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.178"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Planning and Preparation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC, Various, CECOM, PRD Dir,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.557"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Limited User Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.352"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Conduct Block III Austere Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL, ATEC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen  Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Conduct  Block III Development Testing (DT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct Block III Limited User Test (OT)\/Austere Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Austere Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L76"
                    },
                    "ProjectTitle": {
                        "val": "Dismounted Fire Support Laser Targeting Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.693"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Continuing efforts to support Joint Effects Targeting System (JETS) have been transitioned to Program Element 0604710A project L79 beginning in FY 2012.\n\nThis project matures technologies and capabilities which benefit, and may be inserted into, the Lightweight Laser Designator Rangefinder (LLDR, AN\/PED-1) and the Joint Effects Targeting System (JETS). The LLDR and JETS are targeting devices used by dismounted Soldiers to locate, identify, and target enemy assets. This project focuses on reducing weight, improving imaging performance, and increasing targeting accuracy. Development also focuses on affordable, non-magnetic, high accuracy, Azimuth and Vertical Angle Measurement (AVAM) devices with reduced size, weight and power characteristics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Azimuth and Vertical Angle Measurement (AVAM) devices"
                                    },
                                    "Description": {
                                        "val": "AVAM is a non-magnetic based inertial navigation materiel solution for targeting devices. The AVAM effort improves azimuth accuracy leading to reduced collateral damage and improved engagement efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.240"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development and evaluation of AVAM devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS) Target Location Designation System (TLDS)"
                                    },
                                    "Description": {
                                        "val": "JETS TLDS is a lightweight mission equipment set for the dismounted forward observers and Joint Tactical Air Controllers (JTAC).  JETS provides observers and controllers the means to call for fire and control delivery of air, ground and naval surface fire support, using precision munitions and effects (both lethal and non-lethal)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Target Locator improvements to support use of Precision Guided Weapons by dismounted Soldiers and reduce Soldier load. Developed and built Technology Development (TD) prototypes to support JETS TLDS Milestone B decision."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "LLDR (SSN K31100)"
                                    },
                                    "Title": {
                                        "val": "Lightweight Laser Designator Rangefinder (LLDR) (SSN K31100)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "87.971"
                                        },
                                        "CurrentYear": {
                                            "val": "58.042"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "146.013"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "LLDR Mod-of-In-Service (SSN KA3100)"
                                    },
                                    "Title": {
                                        "val": "Lightweight Laser Designator Rangefinder (LLDR) MOD-of-In-Service (SSN KA3100)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "22.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.403"
                                        },
                                        "BudgetYearThree": {
                                            "val": "48.163"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "96.603"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "JETS (SSN K32101)"
                                    },
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS) (SSN K32101)"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "115.894"
                                        },
                                        "BudgetYearFour": {
                                            "val": "91.695"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.443"
                                        },
                                        "CostToComplete": {
                                            "val": "827.812"
                                        },
                                        "TotalCost": {
                                            "val": "1102.844"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 654710\/DL79"
                                    },
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS) (PE 654710 Project DL79)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "20.367"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.505"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.505"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.101"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.684"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.651"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "82.498"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS Technology Development prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop-Gruman Laser Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Apopka, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.208"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.208"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS Technology Development prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Nashua, NH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.099"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.099"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Azimuth and Vertical Angle Measurement (AVAM)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins Applied Physics Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Laurel, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.870"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.870"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Handheld Precision Targeting Demo"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Battelle Memorial Institute"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Columbus, Ohio"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.025"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.025"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Multi Function\/Laser Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "All Native Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Winnebago, NE"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.772"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.772"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TLDS ATO"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Vectronix, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Leesburg, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.700"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TLDS ATO"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TOYON Research Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Goleta, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.800"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.800"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TLDS ATO"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "A-Tech Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.750"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.750"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TLM Phase 1 upgrade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.711"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.711"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Precision  Azimuth Verticle Angle (PAVAM) Module Technical Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI Technologies, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.490"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.490"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Functional Support Agreement (FSA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.022"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.022"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Functional Support Agreement (FSA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Lab (ARL)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.022"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.022"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Functional Support Agreement (FSA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock Island, IL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.043"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.043"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel in support of program"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various locations"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.058"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.058"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JHU\/APL Support Costs"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins University\nApplied Physics Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Laurel, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing for LLDR 2H"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "White Sands Missile Range (WSMR)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "White Sands, New Mexico"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.332"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.332"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel in support of testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various locations"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.022"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.022"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TLDS Sustainment\/Reliability Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMSAA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.017"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.017"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L79"
                    },
                    "ProjectTitle": {
                        "val": "JOINT EFFECTS TARGETING SYSTEMS (JETS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "20.367"
                        },
                        "BudgetYearOne": {
                            "val": "21.505"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.505"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.190"
                        },
                        "BudgetYearThree": {
                            "val": "6.101"
                        },
                        "BudgetYearFour": {
                            "val": "4.684"
                        },
                        "BudgetYearFive": {
                            "val": "1.651"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Effects Targeting System (JETS) is an Army program with joint interest (Air Force and Marine Corps). JETS provides dismounted forward observers and Joint Terminal Attack Controllers ( JTAC) the means to call for fire and control delivery of air, ground and naval surface fire support using precision munitions and effects (both lethal and non-lethal). The primary component of JETS is the Target Location Designation System (TLDS). The TLDS provides the observers and controllers the ability to conduct surveillance, acquire and accurately locate targets, designate targets for attack by laser seeking munitions, mark targets for aviation and ground-based targeting systems, and transmit targeting data to existing Forward Entry Systems for each service.  The future Forward Entry System capability is achieved through product improvements to existing service Forward Entry Systems. These improvements are funded by the respective service Forward Entry System program management offices and will not be further discussed in this document.\n\nJETS TLDS achieved MS-A (4Q FY 2010). An Army Cost Position (ACP) was approved as part of MS A. Starting in FY 2012, the ACP aligns JETS TLDS funding under this project in lieu of 0604710A L76 (Dismounted Fire Support Targeting System)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS) TLDS"
                                    },
                                    "Description": {
                                        "val": "JETS TLDS is a lightweight mission equipment set for the dismounted forward observers and Joint Terminal Attack Controllers (JTAC).  JETS provides observers and controllers the means to call for fire and control delivery of air, ground and naval surface fire support, including using precision munitions and effects (both lethal and non-lethal)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.367"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test Prototype Systems and Azimuth and Vertical Angle Measurement (AVAM) devices, conduct developmental and early user testing, initiate source selection preparation \/ process for the Engineering and Manufacturing Development (EMD) phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.505"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.505"
                                            },
                                            "Text": {
                                                "val": "Complete EMD source selection, and begin design of EMD prototype systems from two vendors.  The prototypes will be integrated with qualified AVAM solution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Fire Support Laser Targeting Sys"
                                    },
                                    "Title": {
                                        "val": "Dismounted Fire Support Laser Targeting Systems (PE 654710 \/ DL76)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.693"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "18.693"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Joint Effects Targeting System"
                                    },
                                    "Title": {
                                        "val": "Joint Effects Targeting System (SSN K32101)"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "115.894"
                                        },
                                        "BudgetYearFour": {
                                            "val": "91.695"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.443"
                                        },
                                        "CostToComplete": {
                                            "val": "827.812"
                                        },
                                        "TotalCost": {
                                            "val": "1102.844"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project continues to exercise competitively awarded contracts using best value source selection procedures."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS prototype development, integration, and test - Contractor 1 year 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NGLS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Apopka, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.495"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.495"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS prototype development, integration, and test - Contractor 2 year 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Nashua, NH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.495"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.495"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AVAM Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.584"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.584"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS prototype development, integration, and test - Contractor 1 year 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.122"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.122"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.122"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS prototype development, integration, and test - Contractor 2 year 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.122"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.122"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.122"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS prototype technical maturation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.476"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.476"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Functional Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Night Vision Electronics Sensors Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.920"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.837"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.837"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Science and Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins Applied Physics Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Laurel, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.572"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.652"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.652"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.925"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.985"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.985"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "All RDTE Testing and Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.900"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.787"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.787"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JOINT EFFECTS TARGETING SYSTEMS (JETS) TARGET LOCATION DESINGATION SYSTEM (TLDS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Technical maturation for JETS TLDS prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JETS TLDS prototype production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development tests"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Early user assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Technology Readiness Assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JETS TLDS MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Engineering & Manufacturing Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JETS TLDS MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FMR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FRP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}