{
    "id": "09a1c442e4df5ff65864cc319b3baebcf49d2147",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602720A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology"
        },
        "R1LineItemNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.704"
            },
            "CurrentYear": {
                "val": "20.804"
            },
            "BudgetYearOne": {
                "val": "20.095"
            },
            "BudgetYearOneBase": {
                "val": "20.095"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "20.216"
            },
            "BudgetYearThree": {
                "val": "20.516"
            },
            "BudgetYearFour": {
                "val": "22.066"
            },
            "BudgetYearFive": {
                "val": "22.268"
            }
        },
        "ProgramElementNote": {
            "val": "FY11 funding increase for high priority effort"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and evaluates enabling tools and methodologies that support the long-term sustainment of Army training and testing activities.  Project 048 improves the Army's ability to comply with requirements mandated by federal, state and local environmental\/health laws and reducing the cost of this compliance. Project 835 develops enabling technologies to decontaminate or neutralize Army-unique hazardous and toxic wastes at sites containing waste ammunition, explosives, heavy metals, propellants, smokes, chemical munitions, and other organic contaminants, as well as technology to avoid the potential for future hazardous waste problems.  Project 895 focuses on reducing hazardous waste generation through process modification and control, materials recycling and substitution  as well as developing technologies to predict and mitigate range and maneuver constraints associated with current and emerging weapon systems, doctrine, and regulations.  Project 896 investigates technologies for ecosystem vulnerability assessment, and ecosystem analysis, monitoring, modeling and mitigation to support sustainable use of Army facilities, lands and airspace to reduce or eliminate environmental constraints to military missions.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nTechnologies developed in this PE are transitioned to PE 0603728A (Environmental Quality Technology Demonstrations).  \n\nWork in this PE is performed by the US Army Engineer Research and Development Center, Vicksburg, MS, and the US Army Research, Development and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.364"
                },
                "CurrentYear": {
                    "val": "20.837"
                },
                "BudgetYearOne": {
                    "val": "20.834"
                },
                "BudgetYearOneBase": {
                    "val": "20.834"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.704"
                },
                "CurrentYear": {
                    "val": "20.804"
                },
                "BudgetYearOne": {
                    "val": "20.095"
                },
                "BudgetYearOneBase": {
                    "val": "20.095"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.340"
                },
                "CurrentYear": {
                    "val": "-0.033"
                },
                "BudgetYearOne": {
                    "val": "-0.739"
                },
                "BudgetYearOneBase": {
                    "val": "-0.739"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.413"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.739"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.739"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "3.753"
                                },
                                "CurrentYear": {
                                    "val": "-0.033"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "048"
                    },
                    "ProjectTitle": {
                        "val": "IND OPER POLL CTRL TEC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.111"
                        },
                        "CurrentYear": {
                            "val": "2.649"
                        },
                        "BudgetYearOne": {
                            "val": "2.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.173"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.124"
                        },
                        "BudgetYearThree": {
                            "val": "2.219"
                        },
                        "BudgetYearFour": {
                            "val": "3.080"
                        },
                        "BudgetYearFive": {
                            "val": "3.050"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad.  These technologies reduce the impact of legal and regulatory environmental restrictions on installation facilities, training and testing lands and ranges, as well as provide a means to avoid fines and facility shutdowns within the United States and reduce environmental impacts to the Warfighter abroad.  New and innovative technologies are essential for the effective control and reduction of military unique hazardous and non-hazardous wastes on military installations and associated with contingency operations bases worldwide.  Efforts focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond.  This project focuses on developing sustainable environmental protection technologies that help the Army maintain environmental compliance for sources of industrial pollution such as production facilities, facility contamination and other waste streams.  Efforts abroad include a focus on designing and developing technologies for deployed forces with environmentally safe, operationally enhanced and cost effective technologies and\/or processes to achieve maximum diversion of, minimization of, or volume reduction of base camp and field waste.  Additional work is focused on ecosystem vulnerability assessment, and ecosystem analysis, modeling, mitigation and monitoring technologies for installations associated with air quality and endangered species management.\n\nThe work in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands (Previously Titled \"Sustainable Ranges and Lands Research and Development\")"
                                    },
                                    "Description": {
                                        "val": "This effort supports management of operations on ranges and training lands with the intent to reduce constraints and restrictions resulting from environmental regulations. Technologies are targeted both toward solutions for environmental compliance and associated requirements, as well as solutions that will enhance training and testing operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.111"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development of an archetype chip device for acute toxicity measurement for compounds of military interest and began development of air emission factors associated with wildfire and prescribed-fire burns on range and training lands; investigated ecosystem response to naturally occurring fires and adjusted prescribed fire regimes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop models to project vegetation response to wild and prescribed fire regimes for best land management practices; design and develop methods to integrate simulation capability for efficient and effective management of base camp infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.173"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.173"
                                            },
                                            "Text": {
                                                "val": "Will continue effort to assess, predict, and mitigate the consequences of altered fire regimes on concurrent management of threatened and endangered species (TES) and air quality at installations; complete mechanistic models of the role of multiple stressors in governing plant physiological responses to fire; begin integration of vegetation response models with prescribed-fire emission and management models to provide foundation for integrated installation air quality and endangered species management."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "835"
                    },
                    "ProjectTitle": {
                        "val": "MIL MED ENVIRON CRIT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.639"
                        },
                        "CurrentYear": {
                            "val": "6.165"
                        },
                        "BudgetYearOne": {
                            "val": "6.160"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.160"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.228"
                        },
                        "BudgetYearThree": {
                            "val": "6.309"
                        },
                        "BudgetYearFour": {
                            "val": "6.839"
                        },
                        "BudgetYearFive": {
                            "val": "6.953"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates a quantitative means to determine the environmental and human health effects resulting from exposure to explosives, propellants, smokes and products containing nanomaterials and new and emerging compounds and materials produced or used in Army industrial, field and battlefield operations or disposed of through past activities. This research provides the basis for tools and methods to maintain sustainable lands and ranges and to protect the health of the Soldier and the extended Army community. The specific end results of this research include: determination of acceptable contaminant concentration levels for residual munitions constituents (MCs) and munitions and explosives of concern that minimize adverse effects on the environment and human health and the development of methods that guide the design of nanomaterials and other new and emerging materials such that adverse effects on human health or the environment are minimized in their designed state and when they enter the environment where they may break down.  Performing research in genomics analysis, nanomaterial technologies, computational\/molecular modeling tools for toxicity and exposure assessment; impacts of climate change on chemical and biological processes; and attributes of sustainable energy production further reduces the uncertainty associated with both the probability of exposure and the ultimate effect if exposed.  Results of this research will be integrated into the life cycle analysis process. Interim products are US Environmental Protection Agency approved health advisories and criteria documents to be used in risk assessment procedures.  The Army uses these criteria during negotiations with regulatory officials to set scientifically and economically appropriate cleanup and discharge limits at Army installations.\n\nWork in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military Materials in the Environment (Previously Titled \"Military Materials in the Environment Research and Development\")"
                                    },
                                    "Description": {
                                        "val": "This effort provides a quantitative means to determine the environmental and human health effects resulting from exposure to existing and emerging compounds and materials produced in Army industrial, field and battlefield operations or disposed of through past activities. Results of this research will be integrated into the life cycle analysis process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed a computational biology model for predictive toxicology of MCs; devised computational chemistry methods relating chemical mechanisms to toxicity in soils; completed beta version testing and release of the Training Range Environmental Evaluation and Characterization System for quantitative risk assessments of MC migration from ranges; began developmental methods to incorporate environmental fate and effects into the design of nanomaterials; began analysis of environmental modeling of environmental toxicology and chemistry for composite nanomaterials used in base sustainment and blast and ballistic protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Construct a comprehensive data set for the binding properties of MCs and emerging contaminants in biological\/physiological networks to predict impacts to ecological receptors. The effort in this program associated with computational chemistry of contaminant behavior in the environment will move to 0602720A Project 896 in FY12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.647"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.647"
                                            },
                                            "Text": {
                                                "val": "Will begin to assess the impact of climate change on Army relevant contaminants and develop a screening level vulnerability assessment for the planning and life cycle analyses processes for Army lands."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nanotechnology-Environmental Effects"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army's ability to field advanced nano-based technologies by appropriate identification and assessment of the environmental impacts of nanomaterials.  The end result of this research is the development of tools that guide the design of nanomaterials based on such factors as adverse effects on human health or the environment. The goal of the tools is to influence the design of nanomaterials in such a way that when the nanomaterials enter the environment the impact will be minimalized."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.416"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated developmental methods to incorporate fate and effects into the design of nanomaterials from the nano-scale or micro-scale to the macro-scale; began analysis of fate and effects in soil and water for composite nanonmaterials supporting base sustainment and blast and ballistic protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop quantitative relationships to characterize role of surface chemistry in the fate and transport of nanoaluminum and nanosilver with environmental media to allow for development of predictive algorithms for potential extrapolation to environmental fate and effects of other nanomaterials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.473"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.473"
                                            },
                                            "Text": {
                                                "val": "Will complete quantitative models for fate and uptake of select military relevant nanomaterials to predict impacts and inform decision analysis techniques; begin environmental assessment of products containing nanomaterials as fielded in Army relevant items (textiles, machinery, vehicles, etc) to inform the development of regulations and life cycle analysis for nanomaterials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Green Remediation Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army to understand the fate and transport of contaminates (e.g., depleted uranium, explosives, propellants) which improves the capability to control, remediate, and detect.  This effort also enables reductions in the volume of waste while minimizing energy usage."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.978"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate novel methods to control and remediate Army relevant contaminants while minimizing energy usage, transpiration requirements and volume of waste; research new methods for detection and remediation of depleted uranium on Army lands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.040"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.040"
                                            },
                                            "Text": {
                                                "val": "Will investigate technologies\/methods for the cost effective & environmentally protective stabilization, containment and management of depleted Uranium and residues on test and training ranges; develop scenarios exploiting fate and transport knowledge of range contaminants in order to control and remediate in a continuous process allowing for remediation activities while avoiding an impact to training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "895"
                    },
                    "ProjectTitle": {
                        "val": "POLLUTION PREVENTION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.746"
                        },
                        "CurrentYear": {
                            "val": "3.949"
                        },
                        "BudgetYearOne": {
                            "val": "4.070"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.070"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.144"
                        },
                        "BudgetYearThree": {
                            "val": "4.207"
                        },
                        "BudgetYearFour": {
                            "val": "4.265"
                        },
                        "BudgetYearFive": {
                            "val": "4.338"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "The project develops pollution prevention technologies required to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems. This project researches and develops revolutionary technologies to eliminate or significantly reduce the environmental impacts that threaten the sustainment of production and maintenance facilities, training ranges and operational areas. The project supports the transformation of the Army by ensuring that advanced energetic materials required for high-performance munitions (gun, rocket, missile propulsion systems, and warhead explosives) are devised to meet weapons lethality\/survivability stretch goals in parallel with, and in compliance to, foreseeable sustainment requirements. Specific technology thrusts include environmentally-benign explosives developed with computer modeling using Department of Defense high-performance computing resources; novel energetics that capitalize on the unique behavior of nano-scale structures; chemically engineered explosive and propellant formulations produced with minimal environmental waste, long-storage lifetime, rapid\/benign environmental degradation properties, and efficient extraction and reuse; and fuses, pyrotechnics, and initiators that are free from toxic chemicals. Other focus areas include base camp energy reduction initiatives, elimination of waste streams in contingency operations and toxic metal reductions from surface finishing processes. \n\nWork in this project supports the Army S&T Enduring Portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.\n\nTechnologies developed in this project are fully coordinated and complementary to PE 0603728A, Project 025. \n\nWork in this project is performed by the Research, Development and Engineering Command Army Research Laboratory, Aberdeen Proving Ground, MD, the Armaments Research, Development, and Engineering Center, Picatinny Arsenal, NJ, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, the Natick Soldier Research, Development and Engineering Center, Natick, MA, and the Tank Automotive Research, Development and Engineering Center, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops pollution prevention technologies to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.746"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Rocket and Missile Propellants: simulated performance of next generation of environmentally benign propellant compositions; Conventional Ammunition: synthesized gram quantities of novel explosive compositions and conducted screening tests to determine most effective compositions; Pyrotechnics: transitioned sustainable flare, delay and signal formulations to advanced technology development; Heavy Metal Reduction: matured new processes for demonstration on gun barrels and fasteners; Zero Footprint Camp: refined water recycling technologies for demonstration in relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.949"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conventional Ammunition: scale up novel explosive compositions to kilogram quantities and conduct limited performance evaluation;  Pyrotechnics: evaluate feasibility of using novel, environmentally benign high-nitrogen molecules in next generation pyrotechnic compositions; Heavy Metal Reduction: mature hexavalent chromium-free stripping agents and surface activation technologies for demonstration on aircraft components and assemblies; Zero Footprint Camp: investigate feasibility of novel water vapor reclamation concepts for use in overseas contingency operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.070"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.070"
                                            },
                                            "Text": {
                                                "val": "Conventional Ammunition: will develop model for binder interaction and performance in energetic formulations; Pyrotechnics: will conduct limited performance evaluation of environmentally sustainable white smoke; Toxic Metal Reduction: will evaluate hexavalent chromium-free pretreatments in a laboratory environment for use on mixed metal substrates; Zero Footprint Camp: will evaluate promising approaches to reducing water demand and wastewater generation in contingency bases, including demand reduction options, wastewater reuse options and wastewater treatment options."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "896"
                    },
                    "ProjectTitle": {
                        "val": "BASE FAC ENVIRON QUAL"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.350"
                        },
                        "CurrentYear": {
                            "val": "8.041"
                        },
                        "BudgetYearOne": {
                            "val": "7.692"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.692"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.720"
                        },
                        "BudgetYearThree": {
                            "val": "7.781"
                        },
                        "BudgetYearFour": {
                            "val": "7.882"
                        },
                        "BudgetYearFive": {
                            "val": "7.927"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops tools and identification and assesment methodologies for ecosystem vulnerability assessment, analysis, monitoring, modeling and mitigation to support sustainable use of Army facilities, training lands, firing ranges and airspace to reduce or eliminate environmental constraints to military missions.  This project provides the Army the technical capability to manage, protect and improve the biophysical characteristics of training and testing areas needed for realistic ranges and training lands.  Technologies within this project enable users to match mission events and training schedules with the resource capabilities of specific land areas and understand how the use of those resources effect mission support and environmental compliance.  The project investigates, designs, and develops novel methods and technologies to restore lands damaged during training activities and allow sustained use of installation facilities and training land resources.  The project supports readiness and full use of training lands through development of threatened and endangered species monitoring technology and management technologies for species at risk.  The project also designs and develops tools and technologies to avoid training restrictions and reduce constraints on training lands associated with invasive species and potential impacts from climate change. \n\nWork in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands (Previously Titled \"Predictive Risk Assessment and Management for Army Ranges and Lands\")"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment, analysis, monitoring, modeling and mitigation technologies to support sustainable use of Army facilities, training lands, firing ranges, and airspace to reduce or eliminate environmental constraints to military missions. This effort targets integrated military land appropriate management and control technologies for selected high priority Army land management issues including Threatened and Endangered Species (TES), Species at Risk (SAR), and invasive species. This effort enables effective management of training lands by understanding the cumulative impacts of training and non-training land use activities on critical natural resources under current and potential future climate conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed a spatially explicit, multi-objective decision support model for management optimization of multiple invasive species accounting for ecological, economic, and training impacts; quantified synergistic and antagonistic interactions between training\/non-military land uses to develop quantitative methods for comparative impact analysis of training and alternative land uses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.247"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine impact of different training regimes on natural resources in terms of frequency, duration, and intensity of land use across multiple landscape scales, this information will lead to more informed and accurate predictive capabilities for impacts of training and land use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.969"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.969"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate optimal allocation of land for training and non-training uses for rapid analysis and quantification of impacts of natural resources; transition technologies through Army's Integrated Training Area Management (ITAM) and the Army Training and Testing Area Carrying Capacity (ATTACC) programs; complete development of a preliminary network model for analysis of potential ecological response to changing weather intensity and climate. Network model will incorporate high priority Army land management issues including Threatened and Endangered Species (TES), Species at Risk (SAR), and invasive species."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Materials in the Environment (Previously Titled \"Computational Contaminant Assessment\")"
                                    },
                                    "Description": {
                                        "val": "This effort develops models to predict chemical behavior in simple and complex environmental media (e.g. soils, water).  These models will allow for improved understanding of how compounds and materials will move, bind and degrade when introduced into the environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate Army relevant chemical interactions with simple surfaces, silicon and carbon, to include prediction and measurement of adsorption properties and kinetics of adsorption, partition and diffusion coefficients and trans-cellular transport in order to better understand and more accurately predict chemical behavior in variable environmental settings. This effort was formerly under PE 0602720A Project 835."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.723"
                                            },
                                            "Text": {
                                                "val": "Will complete predictive models of chemical behavior with information on how military relevant contaminants interact with basic soil components with emphasis on the new insensitive munitions compounds; begin expansion of predictive models for complex surfaces such as typical mineral and soil particles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EM5"
                    },
                    "ProjectTitle": {
                        "val": "ENVIRONMENTAL QUALITY APPLIED RSCH - AMC (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.858"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Environmental Quality applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Research, Development and Engineering Command"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional interest item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.858"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research, Development and Engineering Command"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}