{
    "id": "0a4b8c5e275ba676deea500eb3ab012c571be5e7",
    "meta": {
        "filename": "dod-2013_RDTE_2013_SOCOM_JustificationBook_United_States_Special_Operations_Command_PB_2013.zzz_unzipped_JustificationBook_United_States_Special_Operations_Command_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160401BB"
        },
        "ProgramElementTitle": {
            "val": "Special Operations Technology Development"
        },
        "R1LineItemNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "36.300"
            },
            "CurrentYear": {
                "val": "41.591"
            },
            "BudgetYearOne": {
                "val": "28.739"
            },
            "BudgetYearOneBase": {
                "val": "28.739"
            },
            "BudgetYearTwo": {
                "val": "29.246"
            },
            "BudgetYearThree": {
                "val": "29.774"
            },
            "BudgetYearFour": {
                "val": "28.936"
            },
            "BudgetYearFive": {
                "val": "29.427"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element enables USSOCOM to conduct studies and develop laboratory prototypes for applied research and advanced technology development, as well as leverage other organizations' technology projects that may not otherwise be affordable within MFP-11.  Applying small incremental amounts of investments to DoD, other government agencies, and commercial organizations allows USSOCOM to influence the direction of technology development or the schedule against which it is being pursued, and to acquire emerging technologies for Special Operations Forces.  This project provides an investment strategy for USSOCOM to link technology opportunities with capability deficiencies, capability objectives, technology thrust areas, human endurance and sensory performance, and technology development objectives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.545"
                },
                "CurrentYear": {
                    "val": "26.591"
                },
                "BudgetYearOne": {
                    "val": "28.411"
                },
                "BudgetYearOneBase": {
                    "val": "28.411"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.300"
                },
                "CurrentYear": {
                    "val": "41.591"
                },
                "BudgetYearOne": {
                    "val": "28.739"
                },
                "BudgetYearOneBase": {
                    "val": "28.739"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.755"
                },
                "CurrentYear": {
                    "val": "15.000"
                },
                "BudgetYearOne": {
                    "val": "0.328"
                },
                "BudgetYearOneBase": {
                    "val": "0.328"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.467"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.912"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "10.200"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.328"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.328"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  \n\nFY 2011 Net increase of $9.755 million is due to an increase of a Congressional add ($15.200 million), a Congressional reduction for unexecutable growth (-$5.000 million), a economic assumption reduction (- $0.187 million), a reprogramming to support SORBIS ($0.365 million), a reprogramming to support Rotary Wing Aviation ($0.289 million) and a transfer of funds to Small Business Innovation Research (-$0.912 million).\n\nFY 2012 Program increase due to a congressional add titled \"Program Increase - Unfunded Requirement\" ($15.000 million).\n\nFY 2013 Increase of $0.328 million is due an economic assumption increase. \n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S100"
                    },
                    "ProjectTitle": {
                        "val": "SO Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.300"
                        },
                        "CurrentYear": {
                            "val": "41.591"
                        },
                        "BudgetYearOne": {
                            "val": "28.739"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.739"
                        },
                        "BudgetYearTwo": {
                            "val": "29.246"
                        },
                        "BudgetYearThree": {
                            "val": "29.774"
                        },
                        "BudgetYearFour": {
                            "val": "28.936"
                        },
                        "BudgetYearFive": {
                            "val": "29.427"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.  Small incremental co-investments with DoD, other government agencies, and commercial organizations allows USSOCOM to influence the schedule and direction of technology developments, emerging technologies, and capabilities for Special Operations Forces (SOF), with significant economies of investment.  This USSOCOM investment strategy is used to link technology opportunities with USSOCOM capability deficiencies, capability objectives; technology thrust areas, and technology objectives.  Requirements in these areas may be advertised to industry and government research and development agencies via broad area announcements and calls for white papers.  Sub-projects within the Special Operations Technology Demonstration effort include:  \n\n     •  Rapid Exploitation of Innovative Technologies (REITS).  Beginning in FY 2012, funds were moved to PE 1160402BB, Special Operations Advanced Technology Development, to more accurately reflect the correct budget activity for projects in this subproject.  REITS provides USSOCOM the ability to identify, assess and exploit emerging innovative technologies for SOF capability deficiencies and expedite technology transitions from the laboratory to operational use.  These technologies provide new transformational capabilities and immediate operational impacts, while providing a compass for the direction of future SOF procurement.  \n\n    •  REITS C4, ISR, and Sensors Capability Area.  Develop technologies that provide SOF with improved situational awareness and communications and computer resources in all environments. Develop and discover technologies offering significant improvements in areas such as: enhanced sensors; enhanced command and control architectures and solutions; information consolidation, dissemination, and coordination; improved man-machine interface; covert secure communications; and effective antenna solutions.          \n\n     •  REITS Mobility, Power and Energy Capability Area.  Exploit and develop technologies to improve the performance and survivability, and reduce the detectability of SOF mobility assets.  Develop and discover technologies offering significant improvements in ground, sea, and air mobility areas such as: increased range\/operational environment; improved durability; power\/propulsion systems including new fuel sources, and reduced signature.\n\n    •  REITS Warrior Systems and Bio-Medical Capability Area.  Exploit and develop technologies to increase the SOF warrior's survivability and performance.  Develop and discover technologies offering significant improvements in areas such as:  improved target identification and engagement, human identification, electro-optical vision systems, sensor fusion, human endurance, SOF medical equipment, operator safety, and improved weapons and accessories.\n\n    •  Special Operations Technology Development Sub-Project:  This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.\n\n                 •  Tagging, Tracking, and Locating (TTL) Sub-Project:  TTL technologies are a key element in the ability of SOF to find, fix, and finish targets in overseas contingency operations (OCO).  This sub-project invests in critical science and technology efforts to improve operational capabilities for TTL high value individuals and objects in support of the OCO.  \n\n       •  Classified Sub-Project (provided under separate cover).   \n\n       •  The following technology activity was added by congress in FY 2011:  \n\n       •  Congressional add:  Unfunded Requirement - Increased development of multi-spectral optics which will address night vision capability gaps; concentrated on power requirements for SOF mobility platforms; and initiated efforts to address biometric and non-lethal engagement needs.   Classified unfunded requirement details are provided under separate cover."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Unfunded Requirement"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.121"
                                        },
                                        "Text": {
                                            "val": "Increased development of multi-spectral optics which will address night vision capability gaps; concentrated on power requirements for SOF mobility platforms; and initiated efforts to address biometric and non-lethal engagement needs.   Classified unfunded requirement details are provided under separate cover."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Expand and enhance current Unclassified Test Bed (UTB) capabilities such as evaluating, developing, prototyping and fabricating quick reaction prototypes.  Included in this effort, is a classified area that will provide SOF the ability to quickly transition candidate technologies with multiple levels of classification.  Continue integration of Multi-Spectral optics which will address night vision capability gaps and signature management improvements; develop power solutions for SOF mobility platforms; and continued efforts to address non-lethal engagement needs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "REITS C4, ISR, and Sensors Capability Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.008"
                                            },
                                            "Text": {
                                                "val": "Developed advanced sensors, multi-spectral optics, high bandwith technologies and multi-level security systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "REITS Mobility, Power and Energy Capability Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Pursued low observable and counter low observable technologies to develop advanced lightweight armor and materials.  Investigated multi-domain mobility platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "REITS SOF Warrior Systems and Bio-Medical Capability Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "Developed far-forward Tactical Combat Casualty Care kits.  Pursued rapid assays\/diagnostics, reduced operator load, and provided advanced protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Operations Technology Development"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.944"
                                            },
                                            "Text": {
                                                "val": "Pursue reduced signature technologies; develop advanced lightweight armor and materials; and begin development of multi-domain mobility platforms, long duration small form factor power supplies, alternative fuel power systems and \"green\" energy devices.  Continue to advance technologies for combat medical equipment and tactics.  Continue pursuit of methods to reduce operator load and provide advanced protection.  Develop technologies for improved Man-Machine Interface and functionality of Target Engagement Systems and investigate technologies that can be applied to increase human performance and endurance; pursue enhancements to technologies that can aid in detection of enemy intentions and movement.  Continue further development of Multi-Spectral Optics, Digital Night Vision, Digital Fusion, Short-Wave Infrared Radar Characterization, Power Systems and Advanced Optics transition mature technology into programs of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.226"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.226"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing technology development sub-projects in areas such as, but not limited to:  reduced signature technologies; advanced lightweight armor and materials; multi-domain mobility platforms; long duration small form factor power supplies; alternative fuel power systems and eco-friendly energy devices.  Advance technologies for combat medical equipment and tactics; sensor and processing improvements; improve interfaces and displays; and secure communications.  Continue pursuit of methods to reduce operator load and provide advanced protection.  Develop technologies for improved and widened window of target engagement (escalation of force); pursue enhancements to technologies that can aid in detection of enemy intentions and movement; and continue development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.630"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continued projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiated and continued projects linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the Joint Chiefs of Staff (JCS)\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.567"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continue projects to exploit nanotechnology, biotechnology and chemistry for application to TTL systems.  Initiate projects linked to the USSOCOM\/DoD TTL Roadmap.  Support the JCS TTL Quick Look Capability Assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.371"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.371"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continues projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiates projects linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.941"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.080"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.142"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.142"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}