{
    "id": "0a84640738f6ae2462721699514e825130264e23",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603122D8Z"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism Technology Support"
        },
        "R1LineItemNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "90.211"
            },
            "CurrentYear": {
                "val": "74.586"
            },
            "BudgetYearOne": {
                "val": "77.144"
            },
            "BudgetYearOneBase": {
                "val": "77.144"
            },
            "BudgetYearTwo": {
                "val": "78.291"
            },
            "BudgetYearThree": {
                "val": "79.831"
            },
            "BudgetYearFour": {
                "val": "82.298"
            },
            "BudgetYearFive": {
                "val": "83.793"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Combating Terrorism Technical Support (CTTS) program develops and delivers capabilities that address needs and requirements with direct operational application in the national effort to combat terrorism.  Projects are distributed among 10 mission categories: Advanced Analytic Capabilities; Chemical, Biological, Radiological, and Nuclear Countermeasures; Explosives Detection; Improvised Device Defeat; Investigative Support and Forensics; Personnel Protection; Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; and Training Technology Development.  This program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility or effectiveness of technology when applied to combating terrorism requirements.  It includes technology capability development, proof-of-principle demonstrations in field applications, and coordination to transition from development to operational use."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "82.486"
                },
                "CurrentYear": {
                    "val": "77.019"
                },
                "BudgetYearOne": {
                    "val": "89.298"
                },
                "BudgetYearOneBase": {
                    "val": "89.298"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "90.211"
                },
                "CurrentYear": {
                    "val": "74.586"
                },
                "BudgetYearOne": {
                    "val": "77.144"
                },
                "BudgetYearOneBase": {
                    "val": "77.144"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.725"
                },
                "CurrentYear": {
                    "val": "-2.433"
                },
                "BudgetYearOne": {
                    "val": "-12.154"
                },
                "BudgetYearOneBase": {
                    "val": "-12.154"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "7.725"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-1.919"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.514"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.154"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.154"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Adds"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2013 baseline budget was reduced due to fiscal constraints and higher priorities within the Department."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "484"
                    },
                    "ProjectTitle": {
                        "val": "Combating Terrorism Technology Support (CTTS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "90.211"
                        },
                        "CurrentYear": {
                            "val": "74.586"
                        },
                        "BudgetYearOne": {
                            "val": "77.144"
                        },
                        "BudgetYearOneBase": {
                            "val": "77.144"
                        },
                        "BudgetYearTwo": {
                            "val": "78.291"
                        },
                        "BudgetYearThree": {
                            "val": "79.831"
                        },
                        "BudgetYearFour": {
                            "val": "82.298"
                        },
                        "BudgetYearFive": {
                            "val": "83.793"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Combating Terrorism Technical Support (CTTS) program develops and delivers capabilities that address needs and requirements with direct operational application in the national effort to combat terrorism.  Projects are distributed among 10 mission categories: Advanced Analytics and Capabilities, Chemical, Biological, Radiological, and Nuclear Countermeasures; Explosives Detection; Improvised Device Defeat; Investigative Support and Forensics; Personnel Protection, Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; and Training Technology Development.  This program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility or effectiveness of technology when applied to combating terrorism requirements.  It includes technology capability development, proof-of-principle demonstrations in field applications, and coordination to transition from development to operational use."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Analytic Capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.723"
                                            },
                                            "Text": {
                                                "val": "Deployed and evaluated an integrated fusion and analysis platform that enables analysts and operators to store, organize, access, retrieve and analyze massive amounts of intelligence information from disparate data sets. Incorporated geospatial data extraction and viewing capabilities to the CANVAS knowledge discovery tool that will enable analysts to search and filter geographically as well as contextually.  Integrated a model-predictive controller into an existing course of action development and analysis work station that enabled analysis of parameter sensitivities and the identification of equilibria solutions.  Developed an advanced secure industrial control system with features to include whitelisting, authentication server and encryption of data from the remote terminal units and on the server."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.660"
                                            },
                                            "Text": {
                                                "val": "Deliver the results of an independent capability assessment of an operational integrated fusion and analysis platform that enables analysts and operators to store, organize, access, retrieve and analyze massive amounts of intelligence information from disparate data sets. Integrate a knowledge discovery tool with geospatial data extraction and viewing capabilities into operational platforms to support intelligence analysis and operational decision making.  Continue spiral development of integrated analytic platforms to enhance analysis of diverse and disparate data sources to support near real-time decision making for specific operational applications.  Independently test and verify the advanced secure industrial control system.  Develop an advanced audit tool to determine over network or serial communications the security configuration settings on field devices in industrial control systems.  Begin development of a multi-intelligence data fusion and analysis capability for automated behavior and activity identification and exploitation.  Develop proof of concept data and network analysis workbench for rapid analysis and understanding of collections of intelligence reports and real-time generation of alarms and warnings for suspicious activity based on incoming streams of surveillance and intelligence data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.785"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate a knowledge discovery tool with geospatial data extraction and viewing capabilities into operational platforms to support intelligence analysis and operational decision making.  Deliver an advanced audit tool to determine over network or serial communications the security configuration settings on field devices in industrial control systems.  Deliver an initial version of prototype software that enables fusion of imagery and text-based data for patterns of life analysis.  Independently test and verify a proof of concept data and network analysis workbench for rapid analysis and understanding of collections of intelligence reports and real-time generation of alarms and warnings for suspicious activity based on incoming streams of surveillance and intelligence data.  Adapt and enhance an integrated analytic platform that enable analysis of diverse and disparate data sources to support near real-time decision making to support new operational applications and geographic locations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CHEMICAL, BIOLOGICAL, RADIOLOGICAL, AND NUCLEAR COUNTERMEASURES"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.239"
                                            },
                                            "Text": {
                                                "val": "Developed a new design for protective garments that provide percutaneous protection against evolving threats. Performed heat stress studies on a combination of Chemical, Biological, Radiological, and Nuclear (CBRN) and Explosive Ordnance Disposal (EOD) protective ensembles. Developed new materials for targeted removal of toxic industrial chemicals for use in collective protection filters. Developed a design for a hose system to allow users to switch between supplied air and air purifying respiratory protection modes of operation without requiring doffing and donning of a separate mask. Developed noise cancelling technology that enhances communication for a person wearing a self contained breathing apparatus in a CBRN environment. Evaluated a pocket-size, low-profile escape respirator for operational needs and tested using certification requirements for Respiratory Protective Devices for Self-Rescue and U.S. NIOSH CBRN air purifying escape respiratory protection requirements for specific high threat agents.  Developed a desalination filter for rendering estuary waters potable that has silent operations and requires no external pumping or power sources.  Developed a person portable mass spectrometer with gas chromatograph inlet for the rapid detection and identification of target chemicals. Developed two handheld orthogonal detection systems for detecting trace levels of toxic industrial chemical challenges.  One system targets gas and vapor phase materials while the other targets liquids and solids. Tested and evaluated a detection kit for homemade explosive precursor materials.  Developed a risk-based decision support model for skin decontamination following dermal exposures.  Fielded a best practices guidebook for mail screening and handling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.960"
                                            },
                                            "Text": {
                                                "val": "Develop new materials for collective protection.  Develop a flexible powered air purifying respirator system for CBRN environments.  Develop enhanced testing procedures that are used to evaluate protective ensembles.  Perform heat stress studies on new CBRN protective ensembles.  Test and evaluate inconspicuous protective garments against evolving threats.  Develop, test, and field protective ensembles that will provide enhanced CBRN protection in tactical environments.  Continue development and operationally test and evaluate a water desalination filter for military field survival situations.  Develop and evaluate tools for the decontamination of infrastructure, personnel, and equipment.   Test and evaluate new materials for field decontamination methods with reduced logistical burden.  Field a prototype and conduct limited user evaluations on an orthogonal system for the detection and identification of trace levels of toxic industrial chemicals.  Test and evaluate a person portable mass spectrometer with gas chromatograph inlet for the rapid detection and identification of target chemicals.  Develop methods for determining the origin of CBRN materials.  Evaluate potential methods of production of threat materials, and identify key indicators and warnings for response personnel."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.199"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.199"
                                            },
                                            "Text": {
                                                "val": "Evaluate next generation systems for respiratory and collective protection.  Evaluate enhanced testing procedures for the evaluation of protective ensembles.  Develop, test, and field protective ensembles providing enhanced CBRN protection in tactical environments.  Develop tools for the standoff detection of chemical, biological, and radiological materials.  Evaluate tools for the decontamination of infrastructure, personnel, and equipment. Continue development of methods for determining the origin of CBRN materials.  Evaluate potential methods of production of threat materials, and identify key indicators and warnings for response personnel. Develop methods for the evaluation of CBRN contaminated evidence.  Develop decision support tools to provide science-based risk analysis for emergency personnel in the selection of appropriate protective equipment, decontamination techniques, evacuation zones and other data-driven decisions.  Develop training tools for CBRN operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPLOSIVES DETECTION"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.684"
                                            },
                                            "Text": {
                                                "val": "Incorporated fusion and detection algorithms, synchronized electronics, and demonstrated the feasibility of an active illumination upgrade to an imaging and anomaly detection system. Developed a breadboard sub-millimeter wave imaging and anomaly detection system.  Collected spectra of explosive signatures for later incorporation into existing databases.  Developed and assessed prototype expeditionary wet chemical kits for explosives precursor detection.  Developed and tested a walkthrough explosives detection portal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.714"
                                            },
                                            "Text": {
                                                "val": "Continue development with the incorporation of unique explosive spectra into a prototype detection system. Fabricate the prototype of an orthogonal sensor standoff system.  Continue development of systems for sub-millimeter wave imaging of personnel for explosive detection. Continue development with the fabrication and assessment of prototype expeditionary wet chemical kits for explosives precursor detection. Assess feasibility of explosives detection technology for monitoring cargo containers. Develop training packages for deployed personnel that use explosive detection equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.944"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.944"
                                            },
                                            "Text": {
                                                "val": "Continue development by testing a prototype of an orthogonal sensor standoff system.  Fabricate and test sub-millimeter wave imaging of personnel for explosive detection. Continue assessment of prototype expeditionary wet chemical kits for homemade explosives detection. Develop a portable system to quickly screen personnel for explosive threats at temporary venues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMPROVISED DEVICE DEFEAT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.036"
                                            },
                                            "Text": {
                                                "val": "Developed threat documents and requirements for next generation Electronic Counter Measures (ECM)-related equipment to counter radio controlled improvised explosive devices (RCIED).  Incorporated final modifications and delivered the robotically employed Single-Sided X-ray Imaging System (SSIS). Developed and delivered initial prototypes of enhanced manual entry, capability for access, and diagnostics of terrorist devices.  Developed advanced detection and diagnostic tools for support of mass transit incidents involving acts of terrorism.  Field-tested and evaluated ECM tools and equipment to counter emerging remote controlled improvised explosive device (RCIED) threats.  Developed, delivered and commercialized a VBIED Precision Identification, X-ray Targeting and Disruption Tool Kit.  Developed tools and methods to neutralize homemade explosives.  Field-tested and evaluated the robotically deployed VBIED access tool kit. Delivered, evaluated, and commercialized the camera blinding system.  Delivered the Body Bomb Tool Kit for evaluation. Delivered and evaluated affordable robust mid-sized unmanned ground vehicles (UGV) for defense and homeland security applications. Developed the Multi-Purpose Tele-Scoping Hotstick to conduct remote Explosive Ordnance Disposal (EOD) procedures. Tested and received safety approval for the Carbon 10 Light Disruptor for dismounted EOD operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.252"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate a tool caddy for the Body Bomb Tool Kit.  Develop a Bomb Technician Wikipedia (WIKI). Develop a video enhancement module for robot cameras.  Complete development and commercialize the Scalable Improvised Device Disruptor to counter Vehicle-Borne Improvised Explosive Device (VBIED).  Develop an Improvised Explosive Device (IED) Instant Notification System application.  Test common disruptors against homemade explosives (HME). Develop robotically employed forensic collection tools for explosives and other hazardous materials. Evaluate modular disruptors for dismounted operations. Deliver improved end effectors for remote controlled vehicles. Deliver advanced diver display systems. Deliver DIDSON-DH diver mask-mounted display systems for underwater MCM operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.398"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.398"
                                            },
                                            "Text": {
                                                "val": "Complete development and commercialize the robotically employed Body Bomb Tool Kit.  Deliver the Bomb Technician WIKI.  Continue development with the evaluation of the video enhancement module for robot cameras.  Continue development with the characterization of the Scalable Improvised Device Disruptor and the Dilute Explosive Blast Innovative Tool to counter VBIED. Develop Robotic End Effectors for the Bob Cat to access and counter Vehicle-Borne Improvised Explosive Device (VBIED). Commercialize the VBIED Tool Kit. Develop a robot radio repeating system. Test and evaluate the forensic collection tools for explosives and other hazardous materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INVESTIGATIVE SUPPORT AND FORENSICS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.325"
                                            },
                                            "Text": {
                                                "val": "Completed development and distributed a trace explosive materials reference and pocket guide.  Completed development and deployed a remote viewer for evidence manipulation and comparison for use between theatre and U.S. based labs.  Completed development and distributed soil location identification techniques.  Completed development of advanced forensic methods that provide forensic bomb render safe procedures to protect potential evidence.  Produced a forensic document analysis evaluation to aid criminal prosecutions.  Distributed advanced computer forensic technologies.  Completed development and fielded a combating terrorism and reliability software assessment tool.  Developed advanced techniques for efficient direct interpersonal credibility assessments through thermal imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.575"
                                            },
                                            "Text": {
                                                "val": "Establish an online accessible forensic video player examination reference system. Evaluate the efficiency and accuracy of facial expression credibility systems.  Initiate the development of an advanced facial expression recognition system for credibility assessment.  Continue development by fielding a thermal analysis of physiology technology for detection of deception.  Establish a new procedure for detection and verification of altered and tampered terrorist related audio recordings. Continue development of an automated system to examine and evaluate shoeprints. Complete development of a combating terrorism analysis reporting technology for the individual and group level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.732"
                                            },
                                            "Text": {
                                                "val": "Complete development and field an automated digital communication analysis system to determine insider threats.  Initiate development of an advanced separation method for complex DNA mixtures for forensic identification.  Complete development and field a technology to extract latent images from printer ribbons.  Initiate development of an advanced technology to decrypt computer passwords.  Complete development and field a system for rapid extraction and storage of data from optical media. Initiate development of advanced computer forensics capabilities.  Complete development and field an improved credibility assessment technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERSONNEL PROTECTION"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.688"
                                            },
                                            "Text": {
                                                "val": "Deployed the high-risk personnel tracking and locating device for domestic and overseas use. Deployed the protective services portal training system at federal law enforcement training centers and deployed the standalone protective services portal.  Provided the Personnel Security Decision Aid tool for use by government protective details.  Tested and certified the canine armor system for use by military working dogs.  Developed a total body deformation tool to provide analysis in the development of protective solutions for vehicles, ships, and buildings.  Tested and validated the emergency response capabilities of alternative fuel vehicles. Developed a novel multi-threat concealable body armor system. Installed the window tinting system in an armored passenger vehicle and assessed improvements in information security and reduction in focused attack accuracy.  Developed a new test device that determines the behind armor blunt trauma of body armor systems.  Developed a new limit for the backface signature limit to reduce behind armor blunt trauma injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.457"
                                            },
                                            "Text": {
                                                "val": "Test and certify the canine armor system for use by military working dogs. Deploy the protective services portal training system at federal law enforcement training centers, and deploy the stand-alone protective services portal.  Incorporate the total body deformation tool and analysis for the development of protective solutions for vehicles, ships, and buildings. Develop systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts.  Test and validate the performance of multi-threat concealable body armor.  Develop a system for vehicle protection in crowds.  Complete and incorporate the results of the backface signature limit research to a new injury standard for the evaluation of body armor.  Develop a mobile surveillance platform that captures, records, encrypts, and streams multi-channel video and audio with associated GPS position information. Test and validate the performance of a novel material to collect fragmentation during a blast event."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.747"
                                            },
                                            "Text": {
                                                "val": "Deploy the mobile surveillance platform to gain situational awareness from moving platforms and man-portable assets.  Deliver an optimized multi-threat concealable armor for operational deployment.  Test and validate a system for vehicle protection in crowds.  Deploy the canine armor system for use by military working dogs.  Deliver a new test fixture for the validation of the performance of body armor. Deploy systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Deliver a blast resistant material to be used as a tent liner for enhanced protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PHYSICAL SECURITY"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.320"
                                            },
                                            "Text": {
                                                "val": "Coordinated test program results to determine best solutions for temporary, semi-permanent, or permanent facilities and deployed decision aids to assist with pre-event, preventative planning. Provided test data and results for pipeline blast mitigation and internal hazards due to an external blast.  Coordinated design standards with appropriate government agencies for increased force protection.  Continued development of an ongoing test program in an urban environment to include novel explosives. Completed the development and deployed tactical and integrated security system concepts.  Completed and deployed a comprehensive homemade explosives database with multiple levels of access.  Developed and deployed capabilities to detect, locate, survey, and disrupt subterranean operations.    Demonstrated and delivered a system that provides enhanced night vision capabilities to austere outposts. Provided advanced physical security technologies for operational assessments, field training, and operational support that satisfy urgent requirements in support of deployed forces. Developed and delivered a portable seismic\/acoustic sensor for use in multiple environments.  Continued development by upgrading the underwater remotely operated vehicle capabilities for use in ship hull and harbor searches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.676"
                                            },
                                            "Text": {
                                                "val": "Continue development of a test program in an urban environment using modular configurations to represent urban environments to better understand the impact of fixed urban structures on blast wave propagation for conventional explosives and enhanced novel explosive mixtures. Demonstrate a fast running computational tool to assist DoD and first responder personnel in predictive blast analysis in an urban environment. Field test enhanced video assessment and tracking techniques. Operationally test and evaluate a next generation Short Wave Infrared (SWIR) capability for use in tactical environments. Complete construction of an integrated test facility for technology demonstrations and pre-operational testing.  Develop and field test a portable persistent surveillance system for covert emplacement and enhanced tracking of potential illegal activity. Complete development and transition a security system that contains a camera observation system and a sensor alarm system coupled in an integrated package for concealable installation.  Develop and deliver a system to clear a path in a compromised area during dismounted operations.  Demonstrate an integrated, mobile screening capability for explosives detection.  Support site security implementation and execution for austere military installations, high profile CONUS sites, and large scale events hosted by our international partners. Continue development of a rocket detection system that provides warning time sufficient to find cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.042"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.042"
                                            },
                                            "Text": {
                                                "val": "Complete testing in an urban environment and provide data\/test results.  Complete development of novel explosive characterization and provide test results.  Complete development and deliver a prototype rocket detection system that provides enough warning time to find cover.  Complete development and deliver a prototype for on-the-move, standoff IED detection.  Complete development and deliver a prototype for standoff underground void and tunnel detection.  Develop capabilities in the areas of Border Protection, Countering Offensive Tunnel Tactics, Video Analytics, Intelligent Sensor Fusion, Simplified Integrated Interface, Securing Green Initiatives, and supporting the security of large scale public events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE, COLLECTION AND OPERATIONS SUPPORT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.796"
                                            },
                                            "Text": {
                                                "val": "Adapted and integrated existing foreign language applications, practices, and tools into a tactical site exploitation capability.  Improved the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theatre-wide exploitation of tactical intelligence.  Enhanced the capability to identify targets through biometric modalities.   Streamlined the processes of data collection, sharing, identity management, mobile identification, and detection of targets of interest.  Developed enhanced capabilities, force structures, and training programs to leverage Information Operations capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.457"
                                            },
                                            "Text": {
                                                "val": "Develop and deliver field technical surveillance capabilities. Develop and improve operational tactics, techniques, and procedures used by military working dog teams.  Complete the development and deploy expeditious foreign language analytical tools in support of tactical exploitation. Continue development and enhance research and technology to assist analysts with biometric intelligence and reporting. Develop advanced Information Operations applications, practices, and tools. Evaluate methods of improving intelligence, surveillance, and reconnaissance technologies in Unmanned Aerial Systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.953"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.953"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and enhance technical surveillance capabilities.  Continue to improve military working dog scent kits for training and operational tactics, techniques, and procedures.  Develop a method to integrate foreign language analytical tools into agile workflow platforms and media monitoring systems.  Develop capabilities, force structure, and training programs to leverage information operations and technical site exploitation efforts.  Utilize Unmanned Aerial Vehicles platforms as novel communication relay nodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL OPERATIONS SUPPORT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.523"
                                            },
                                            "Text": {
                                                "val": "Initiated and completed development of an ultra-mobile tactical computer for use by ground forces. Initiated and completed development of a personnel, equipment, and vehicle visual and thermal signature reduction material that is scalable, lightweight, compact, and low cost.  Initiated and completed development of low-cost systems for the exploitation of commercial electronics, communications, and computing for special reconnaissance.  Completed development of an organic fixed-site mortar targeting system with an integrated Fire Control System that provides rapid and accurate indirect fire solutions and translates that to auto-laying of either a 120mm or 81mm mortar using legacy U.S. standard mortars and ammunition.  Completed development of a small, affordable imaging device capable of extracting object depth information along with a video stream of scenes. Completed development of an integrated, handheld device that combines a commercial off the shelf (COTS) Global Positioning System (GPS) receiver, a standard military Blue Force Tracker and Combat Survivor\/Evader Locator radio for use during evasion of enemy forces or contingency operations.  Completed development of a system that provides a self-healing, ad hoc air-to-ground mesh network for the transmission of real-time communications (voice and data).  Completed development of a time-activated restraint and release system to temporarily restrain potential threat individuals for a predetermined period of time.  Completed development of a low-signature, backlit wrist worn compass that allows the operator to easily view cardinal directions whether in a well-lit or dark environment.  Completed development of a program of instruction and provided new equipment for special operations forces to enhance advanced marksmanship at ranges up to 1,800 meters.  Completed development of a lightweight, compact system that combines motion-sensing alert with an IR illuminator to provide broader early-warning security for deployed teams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.985"
                                            },
                                            "Text": {
                                                "val": "Develop a handheld intelligence, surveillance, target acquisition, reconnaissance system.  Develop a single man-portable, collapsible-wing tactical micro unmanned aerial system with a secure mobile ad-hoc network data-link that is capable of being hand-launched from a man-portable canister. Develop an upper receiver group that provides significant suppression of both sound and flash from the current U.S. standard M4 carbine rifle. Develop a communication system that allows Tactical Operations Centers to send and receive large amounts of data to and from front-line operators in real time.  Develop and deliver a lightweight, compact personal IR emitter capability for emplacement on an operator’s helmet or outermost garment.  Develop a spray-on antenna capability to provide increased communications for military tactical operators. Deliver a small, affordable imaging device capable of extracting object depth information along with a video stream of scenes.  Deliver a small, affordable imaging device capable of extracting depth information and displaying it within a robotic platform's video display.  Deliver an ultra-lightweight UAS payload with cooled IR, color CCD, laser pointer and laser designator for UAS applications.  Deliver a persistent real-time surveillance system that will have an integrated power supply (72 hrs live streaming) and SATCOM\/Cellular data-link connection.  Deliver a fully integrated helmet for law enforcement using advanced materials that are capable of withstanding NIJ Level IIIA body armor ballistic threats as well as bodily damage against blast, fragmentation, and blunt force trauma.  Deliver a comprehensive reference source to summarize the performance characteristics of the available and proven breaching methods, tools, and tactics as they apply in a maritime environment. Deliver mobile mortar targeting systems with an integrated Fire Control System that provides rapid and accurate indirect fire solutions and translates that to auto-laying of either a 120mm (HMMMV) or 81mm (non-standard vehicle) using legacy U.S. standard mortars and ammunition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.327"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.327"
                                            },
                                            "Text": {
                                                "val": "Deliver a handheld intelligence, surveillance, target acquisition, reconnaissance system.  Deliver a single man-portable, collapsible-wing tactical micro unmanned aerial system with a secure mobile ad-hoc network data-link that is capable of being hand-launched from a man-portable canister. Deliver an upper receiver group that provides significant suppression of both sound and flash from the current U.S. standard M4 carbine. Deliver a communication system that allows Tactical Operations Centers to send and receive large amounts of data to and from front-line operators in real time.  Deliver a system that will alert the commander as to the status of his deployed sniper teams. Deliver an organic cell phone network that will provide voice and data services to at least 15 users simultaneously.  Develop a specialized application for smart phones to provide a rapid mass alert tool that receives or reports the geo-rectified data (pictures\/text) of incidents for U.S. Border Patrol agents.  Deliver a spray-on antenna capability to provide increased communications for military tactical operators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGY DEVELOPMENT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.877"
                                            },
                                            "Text": {
                                                "val": "Developed a training package that included instructor-led training and supporting publications for the squad leader\/observer and the squad to access Close Air Support (CAS). Developed post-blast training in a distributed-learning format that enhanced the ability of Explosive Ordnance Disposal (EOD) personnel to investigate and characterize the aftermath of explosive-related incidents in a combat zone. Analyzed mobile learning architectures and Web 2.0 technologies and developed job aids, content resources, and training courses for use within the military.  Developed an advanced distributed learning training program for civilian and military law enforcement personnel on the topic of Advanced Improvised Explosive Device (IED) Awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.850"
                                            },
                                            "Text": {
                                                "val": "Design and develop a weapon training aid to improve trigger control. Conduct an assessment study of existing homemade explosives (HME) training courses.  Develop best practices for the military community on the implementation of the Shareable Content Object Reference Model.  Design and develop training on the topic of counter tunnel investigations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.017"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.017"
                                            },
                                            "Text": {
                                                "val": "Design and develop a training package for site exploitation in Afghanistan. Design and develop training and resources for the Raven small Unmanned Arial System (sUAS).  Develop a program of instruction for conducting unconventional warfare initiatives in hostile environments. Develop a simulated training environment for embassy security.  Design and develop a program of instruction for advanced undercover operations training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}