{
    "id": "0d2b4eb91547a4128705615a1e14111dcc39bb6d",
    "meta": {
        "filename": "dod-2013_RDTE_2013_MDA_MasterJustificationBook_Missile_Defense_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Missile_Defense_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603902C"
        },
        "ProgramElementTitle": {
            "val": "Next Generation Aegis Missile (Standard Missile-3 Block IIB (SM-3 IIB))"
        },
        "R1LineItemNumber": {
            "val": "65"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "13.443"
            },
            "BudgetYearOne": {
                "val": "224.077"
            },
            "BudgetYearOneBase": {
                "val": "224.077"
            },
            "BudgetYearTwo": {
                "val": "295.248"
            },
            "BudgetYearThree": {
                "val": "455.373"
            },
            "BudgetYearFour": {
                "val": "508.356"
            },
            "BudgetYearFive": {
                "val": "430.239"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Standard Missile-3 Block IIB (SM-3 IIB) is the key element to expanding the battle space by adding an additional layer to our homeland defense against Intercontinental Ballistic Missiles (ICBM). The goals of the program are to develop an operational, hit-to-kill missile fielded in the 2020 timeframe to counter first generation ICBMs targeted at the US homeland early in their flight. It will serve as the first tier of the layered defense of the U.S. Homeland. The SM-3 Block IIB missile will also provide a large defended area against regional, intermediate range ballistic missiles. Early intercept capability provides the benefit of forcing an adversary to release countermeasures earlier than optimum directly affecting their ability to initiate the deployment of penetration aids or submunitions.\nThe SM-3 Block IIB will be integrated into the Aegis BMD 5.1 Weapon System using Engage on Remote, leveraging the BMD distributed Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) network. Another goal is to reduce technical and programmatic risk by developing and testing key component technologies that increase the speed of the missile and provide flexible energy management to engage targeted ballistic missiles early in their trajectory. MDA will also conduct a competition to select the industry team that will execute the product development in FY 2014. \n\nContributions to Combatant Commanders Prioritized Capabilities List include: \nEngage a threat Intercontinental Ballistic Missile (ICBM) \nEngage a threat Intermediate Range Ballistic Missile (IRBM) \nEngage a threat Medium Range Ballistic Missile (MRBM) \n\nMD40 consists of Program-Wide Support (PWS) non-headquarters management costs in support of MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "123.456"
                },
                "BudgetYearOne": {
                    "val": "433.106"
                },
                "BudgetYearOneBase": {
                    "val": "433.106"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "13.443"
                },
                "BudgetYearOne": {
                    "val": "224.077"
                },
                "BudgetYearOneBase": {
                    "val": "224.077"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-110.013"
                },
                "BudgetYearOne": {
                    "val": "-209.029"
                },
                "BudgetYearOneBase": {
                    "val": "-209.029"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.013"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-30.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-80.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-209.029"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-209.029"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012 decrease reflects a total congressional reduction (Consolidated Appropriation Act of FY 2012 (Public Law 112-74)) of -$110.013M which includes a congressional general reduction of -$0.013M; a congressional directed reduction of -$30.000M; and a congressional directed transfer of -$80.000M. ($30M to the Aegis BMD Program Element (0603892C) for SM-3 Block IB production improvements and $50M to the Aegis SM-3 Block IIA Co-Development Program Element (0604881C) for risk reduction and program adjustments. \n\nFY 2013 decrease reflects an adjustment to the start of product development from the beginning of FY 2013 to FY 2014. The FY 2013 reduction of -$209.039 reflects a realignment of Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD70"
                    },
                    "ProjectTitle": {
                        "val": "Standard Missile-3 Block IIB (SM-3 IIB)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "8.876"
                        },
                        "BudgetYearOne": {
                            "val": "212.704"
                        },
                        "BudgetYearOneBase": {
                            "val": "212.704"
                        },
                        "BudgetYearTwo": {
                            "val": "280.367"
                        },
                        "BudgetYearThree": {
                            "val": "433.177"
                        },
                        "BudgetYearFour": {
                            "val": "483.324"
                        },
                        "BudgetYearFive": {
                            "val": "408.451"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2011, a total of $86.661 million was executed in various Program Elements, $40 million of the High Performance Interceptor work, was appropriated to the BMD Aegis, 0603892C, Program Element. An additional $14.972 million was executed from the BMD Technology, 0603175C, and $31.689 million from the Enabling Technology, 0603890C, Project MD29. All FY 2011 accomplishments for SM-3 Block IIB work are captured in this Program Element description."
                        },
                        "ProjectMissionDescription": {
                            "val": "During the technology development phase, MDA is executing a two-pronged strategy to reduce the technical risk and plan for the product development phase. The Standard Missile-3 Block IIB (SM-3 Block IIB) program is pursuing technology development with component vendors to mature key enabling technologies in preparation for product development. For example, investments in lighter weight structures and materials to reduce inert mass will increase missile velocity, and investments to improve the producibility of advanced focal plane arrays will reduce the cost of high performance seekers that improve containment of threat missiles. In parallel, MDA competitively awarded three Concept Definition and Program Planning contracts to explore viable and affordable missile configurations and define an executable development plan. In these contracts, MDA is assessing alternative missile architectures and technologies to define the trade space across cost, risk, and missile performance to establish missile requirements for product development that are feasible and affordable. The engineering trade space includes larger-diameter boosters with improved rocket propellants, lightweight missile structures, and control mechanisms in modified MK 41 Vertical Launch Systems able to achieve higher burnout velocities; missile communication concepts to enable communication with multiple sensors over several frequencies; design attributes for missile reliability and producibility, including production tolerances and minimizing single point failure; and innovative kill vehicle seekers and divert and attitude control systems. This comprehensive strategy of technology investments to reduce risk, exploit technology opportunities, and engage industry early provides the foundation for executable plans for the product development phase. The SM-3 Block IIB program enters the product development phase in FY 2014 to support deployment in the 2020 timeframe."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SM-3 Block IIB"
                                    },
                                    "Description": {
                                        "val": "See Description Below"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Began concept definition and program planning with three industry teams to explore viable and affordable missile configurations and define an executable development plan for the SM-3 Block IIB. MDA is assessing alternative missile architectures and technologies to define the trade space across cost, risk, and missile performance to establish missile requirements that are feasible and affordable. \n-Completed technology risk reduction trade studies for divert and attitude control system and third stage rocket motor components. These efforts examined the technological maturity of component technologies in actuators, valves, high temperature materials, structural insulators, propellants, and supporting items to identify opportunities for investments to reduce risk and improve SM-3 Block IIB performance. \n-Began technology risk reduction design and development for third stage rocket motor component technology demonstrations including high temperature composite casing, an innovative solid propellant attitude control system, and higher energy solid rocket motor propellants applicable to near-term missile system development.\n-Began technology risk reduction design and development for two liquid propellant divert and attitude control system demonstrations including composite divert thrusters, integrated attitude control thrusters, propellant storage and delivery systems, fast-actuating valves and advance lightweight structural concepts applicable to near-term missile system development.\n-Fabricated and analyzed initial test lots for analog large format (512 by 512 pixel count), two color (long-wave infrared and short-long-wave infrared) focal plane arrays. Results of analyses on detector performance (signal to noise), operability (percent of pixels performing to specification), and clusters (grouping of non-operable pixels) are being incorporated into process and fabrication improvements to increase overall yield and decrease SM-3 Block IIB kill vehicle seeker cost and schedule risk. \n-Began development of digital large format (512 by 512 pixel count), two color (long-wave infrared and short-long-wave infrared) focal plane arrays. On-detector conversion of focal plane array image to digital data allows for increased frame rate, faster image summing to improve signal to noise ratio, and decreased weight and power requirements. \n-Completed integration of prototype components to support testing of a monolithic ring laser gyro Common Inertial Measuring Unit (CIMU). This CIMU mitigates potential obsolescence issues, and promises improved reliability and producibility. The reduced cost, size, weight, and power requirements as well as improved accuracy reduce the risk associated with a kill vehicle operating over longer duration missions in support of SM-3 Block IIB performance goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.876"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct technical oversight for lightweight structural component design verification testing to demonstrate the ability to produce and incorporate lightweight components into the SM-3 Block IIB missile. \n-Continue interceptor system engineering trades and industry concept definition to support product development to refine achievable performance within risk, cost and schedule goals. \n-Continue to develop missile digital models and simulations to support comprehensive missile and system trades and definition of SM-3 Block IIB performance requirements. \n-Begin development of Request for Proposal (RFP) package for competition for Product Development Phase that will begin in FY 2014. \n\n-Conduct technical oversight for continuing fabrication improvements on analog large format, two color focal plane arrays to increase overall yield and decrease SM-3 Block IIB (and other Standard Missile variants) kill vehicle seeker cost and schedule risk.\n-Conduct technical oversight for continuing component development for technical risk reduction areas such as divert and attitude control systems, and third stage rocket motor that are common to the SM-3 IIA and IIB programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "212.704"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "212.704"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue development of Request for Proposal (RFP) package and begin source selection for competition for SM-3 Block IIB Product Development Phase that will begin in FY 2014. \n-Continue improvements to analog focal plane array producibility which also benefits other Standard Missile variants.\n-Continue development and demonstration of enabling components for divert and attitude control system concepts and for third stage rocket motor technologies, including an innovative solid propellant attitude control system.\n-Continue concept definition and program planning activities with three industry teams (Boeing, Lockheed Martin and Raytheon). The industry teams will each select a single design for detailed analysis, modeling, and program planning activities that will continue through the remainder of the year. \n-Initiate activities for Aegis Weapon System, canister, and Vertical Launch System modifications necessary to support the SM-3 Block IIB interceptor."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603175C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "92.617"
                                        },
                                        "CurrentYear": {
                                            "val": "74.920"
                                        },
                                        "BudgetYearOne": {
                                            "val": "79.975"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "79.975"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "81.388"
                                        },
                                        "BudgetYearThree": {
                                            "val": "115.427"
                                        },
                                        "BudgetYearFour": {
                                            "val": "133.742"
                                        },
                                        "BudgetYearFive": {
                                            "val": "136.654"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "401.113"
                                        },
                                        "CurrentYear": {
                                            "val": "415.048"
                                        },
                                        "BudgetYearOne": {
                                            "val": "362.711"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "362.711"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "339.197"
                                        },
                                        "BudgetYearThree": {
                                            "val": "373.346"
                                        },
                                        "BudgetYearFour": {
                                            "val": "395.350"
                                        },
                                        "BudgetYearFive": {
                                            "val": "394.085"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603892C"
                                    },
                                    "Title": {
                                        "val": "AEGIS BMD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1530.767"
                                        },
                                        "CurrentYear": {
                                            "val": "988.928"
                                        },
                                        "BudgetYearOne": {
                                            "val": "992.407"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "992.407"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "960.870"
                                        },
                                        "BudgetYearThree": {
                                            "val": "950.097"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1030.201"
                                        },
                                        "BudgetYearFive": {
                                            "val": "958.680"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604880C"
                                    },
                                    "Title": {
                                        "val": "Land Based SM-3 (LBSM3)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "286.142"
                                        },
                                        "CurrentYear": {
                                            "val": "306.185"
                                        },
                                        "BudgetYearOne": {
                                            "val": "276.338"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "276.338"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "127.235"
                                        },
                                        "BudgetYearThree": {
                                            "val": "113.677"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.718"
                                        },
                                        "BudgetYearFive": {
                                            "val": "56.193"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MDA`s fiscal year 2013 budget submission reflects an emphasis on early intercept research and development. The acquisition strategy to conduct this technology development effort consists of three focus areas. First, leverage the technical expertise of Federally Funded Research and Development Centers, University Applied Research Centers, and Universities and government laboratories. Second, continue component technology risk reduction initiatives, under Advanced Technology Initiative Broad Agency Announcement and competitive procurements. Third, complete three Concept Definition and Program Planning contracts with missile integration prime contractors and conduct a competition for product development."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.567"
                        },
                        "BudgetYearOne": {
                            "val": "11.373"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.373"
                        },
                        "BudgetYearTwo": {
                            "val": "14.881"
                        },
                        "BudgetYearThree": {
                            "val": "22.196"
                        },
                        "BudgetYearFour": {
                            "val": "25.032"
                        },
                        "BudgetYearFive": {
                            "val": "21.788"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "FY 2013, Program Wide Support reflects a proportional increase as a result of increases to the Standard Missile-3 Block IIB (SM-3-IIB)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of MDA functions and activities across the entire Ballistic Missile Defense System (BMDS). Includes Government Civilians, Advisory and Assistance Services, and Federally Funded Research and Development contracts (FFRDC) providing integrity and oversight of the BMDS as well as, supporting MDA in enabling the development and evaluation of technologies that will respond to the changing threat. In addition, includes Global Deployment personnel and support performing deployment site preparation and activation. Other costs included provide facility capabilities for MDA Executing Agent locations (with the exception of Federal Office Building 2 after FY 2011), such as physical and technical security, legal services, travel and agency training, office and equipment leases, rents and utilities, data and unified communications support, supplies and maintenance, logistics and central property management of equipment, and similar operating expenses. Also includes legal settlements, and foreign currency fluctuations on a limited number of foreign contracts. \nIn keeping with congressional intent, PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the total MDA budget."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Salaries and Support"
                                    },
                                    "Description": {
                                        "val": "See Description Below"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The budget project in this Program Element did not exist in program wide support in FY 2011."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.567"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A, Mission Description and Budget Item Justification"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A, Mission Description and Budget Item Justification."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}