{
    "id": "0de92cde839a20255324150a52e13c3ea28fbd5c",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603286E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED AEROSPACE SYSTEMS"
        },
        "R1LineItemNumber": {
            "val": "34"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "234.389"
            },
            "CurrentYear": {
                "val": "98.878"
            },
            "BudgetYearOne": {
                "val": "174.316"
            },
            "BudgetYearOneBase": {
                "val": "174.316"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "124.530"
            },
            "BudgetYearThree": {
                "val": "104.474"
            },
            "BudgetYearFour": {
                "val": "106.474"
            },
            "BudgetYearFive": {
                "val": "129.352"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "303.078"
                },
                "CurrentYear": {
                    "val": "98.878"
                },
                "BudgetYearOne": {
                    "val": "116.716"
                },
                "BudgetYearOneBase": {
                    "val": "116.716"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "234.389"
                },
                "CurrentYear": {
                    "val": "98.878"
                },
                "BudgetYearOne": {
                    "val": "174.316"
                },
                "BudgetYearOneBase": {
                    "val": "174.316"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-68.689"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "57.600"
                },
                "BudgetYearOneBase": {
                    "val": "57.600"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-1.227"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-61.700"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-2.050"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.212"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "57.600"
                                },
                                "BudgetYearOneBase": {
                                    "val": "57.600"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Decrease reflects reductions for the Section 8117 Economic Adjustment, reductions to ongoing programs such as Arclight, ISIS, MoTr, Vulture, rescissions and the SBIR\/STTR transfer offset by internal below threshold reprogrammings. \nFY 2013: Increase reflects further research for hypersonic technologies and continuation of the Long Range Anti-Ship Missile Demonstration Program (LRASM)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AIR-01"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED AEROSPACE SYSTEMS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "234.389"
                        },
                        "CurrentYear": {
                            "val": "98.878"
                        },
                        "BudgetYearOne": {
                            "val": "174.316"
                        },
                        "BudgetYearOneBase": {
                            "val": "174.316"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "124.530"
                        },
                        "BudgetYearThree": {
                            "val": "104.474"
                        },
                        "BudgetYearFour": {
                            "val": "106.474"
                        },
                        "BudgetYearFive": {
                            "val": "129.352"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vulture"
                                    },
                                    "Description": {
                                        "val": "The objective of the Vulture program is to develop and demonstrate the technology to enable an airborne payload to remain persistently on-station, uninterrupted and unreplenished, for over five years performing strategic and tactical communications, position\/navigation\/timing (PNT) and intelligence, surveillance, and reconnaissance missions over an area of interest.  Vulture technology enables a re-taskable, persistent pseudo-satellite capability, in an aircraft package.  The technology combines the key benefits of an aircraft (flexibility & responsiveness, sensor resolution, reduced transmit\/receive power, affordability) with the benefits of space assets (on-station persistence, no logistics tail, energy independence, fleet size, absence of in-country footprint).  The system has potential in numerous roles: operation as a single platform, as a formation of multiple aircraft, or as a constellation providing infrastructure augmentation or recovery.  The technology challenges include structural integrity of very lightly-loaded airframe structure, efficient and reliable energy collection, storage\/retrieval and management, and reliability technologies capable of allowing the aircraft to operate continuously for five years.  The Vulture program will conduct subscale and full-scale technology maturation and demonstration activities to prove out critical technologies.  The anticipated transition partners are the Air Force and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted system requirements review.\n-  Initiated preliminary design of the flight demonstrator aircraft.\n-  Demonstrated component performance and reliability including energy storage, propulsion, and flight management\/control systems.\n-  Performed cantilever wing, 2-D and 3-D wind tunnel test.\n-  Continued subsystem and risk reduction testing.\n-  Fabricated and structurally tested critical wing sections.\n-  Initiated energy collection system fabrication and testing.\n-  Initiated 1 KW energy storage system fabrication and pressure test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system preliminary design review.\n-  Conduct airframe\/propulsion critical design review.\n-  Initiate fabrication and assembly of flight demonstrator (FD).\n-  Test permeation and pressure of center spar.\n-  Deliver tailplane assembly.\n-  Complete propeller qualification testing.\n-  Conduct long endurance testing of propeller motor\/controller.\n-  Complete detailed airframe certification\/stress report.\n-  Validate flight demonstrator (FD) solar array energy collection performance.\n-  Achieve energy storage system technology measurement of solid oxide fuel cell (SOFC) power density of 250 Watts per Kilogram (250 W\/kg).\n-  Verify energy storage system capabilities at degradation of 12mv\/1k hours in fuel cell\/electrolyzer mode)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system critical design review.\n-  Accomplish energy storage system technology measurement of SOFC power density of 380 W\/kg and degradation of 6mv\/1000 hours.\n-  Complete first wing section.\n-  Complete solar array build, test and installation.\n-  Validate FD motors\/propellers, solar array, energy storage system, and ground control system delivery.\n-  Complete airframe build.\n-  Complete system integration and rollout of air vehicle.\n-  Conduct FD system assembly, integration, checkout, and ground testing.\n-  Test ground control system with hardware-in-loop.\n-  Prepare final system safety hazard analysis report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Close Air Support (PCAS)"
                                    },
                                    "Description": {
                                        "val": "The Persistent Close Air Support (PCAS) program will significantly increase close air support (CAS) capabilities by developing a system to allow continuous CAS availability and lethality to the supported ground commander.  The enabling technologies are: manned\/unmanned attack platforms, next generation graphical user interfaces (GUI), data links, digital guidance and control, and advanced munitions.  PCAS will demonstrate the ability to digitally task a CAS platform from the ground to attack multiple\/simultaneous targets.  PCAS will allow the Joint Tactical Air Controller (JTAC) the ability to rapidly engage multiple moving targets simultaneously within the area of operation.  PCAS's ability to digitally task a CAS platform to attack multiple\/simultaneous targets would improve U.S. ground forces operations and speed of attack.  The system will be designed to reduce collateral damage and potential fratricide to friendly forces.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.600"
                                            },
                                            "Text": {
                                                "val": "-  Conducted trade studies for an integrated PCAS system.\n-  Completed conceptual design reviews of the unmanned A-10 demonstration aircraft and JTAC kit.\n-  Created an initial technology maturation plan and conducted program risk reduction activities to ensure a successful live-fire demonstration of the PCAS system.\n-  Initiated subcomponent developer critical enabling technology designs that will complement the system integrator A-10 and JTAC Kit designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system requirements reviews of the unmanned A-10 demonstration aircraft and prototype JTAC kit.\n-  Conduct preliminary design reviews to encapsulate trade studies, technology maturation plan, and program risk reduction activities to begin integration of PCAS A-10 and JTAC kit components.\n-  Complete government furnished equipment transfer of A-10 aircraft, LITENING Targeting pods, and targeting software.\n-  Secure munitions acquisitions and test range support for demonstration planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.216"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.216"
                                            },
                                            "Text": {
                                                "val": "-  Integrate subcomponent developer critical enabling technology components into system integrator A-10 and JTAC kit designs.\n-  Perform initial field testing of Government furnished JTAC targeting software with Service partner.  \n-  Perform initial modifications to unmanned A-10 demonstration aircraft and conduct software and hardware ground testing.\n-  Complete initial designs of next generation JTAC kit and perform hardware and software breadboard testing.\n-  Continue modifications to the unmanned A-10 demonstration aircraft based on software and hardware ground testing results.\n-  Begin initial flight tests of unmanned A-10 aircraft for preliminary safety evaluations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace System Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program examine and evaluate emerging aerospace technologies and system concepts for applicability to military use.  This includes the degree and scope of potential impact\/improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging aerospace threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include: methods of defeating enemy anti-aircraft attacks; munition technologies to increase precision, range, endurance, and lethality of weapons for a variety of mission sets; novel launch systems; air vehicle control, power, propulsion, materials, and architectures; and payload and cargo handling systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed studies of candidate technologies and developed system concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct modeling and simulation of system architectures and scenarios.\n-  Perform feasibility experiments of candidate technologies and system concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform trade studies and modeling and simulation for novel technologies.\n-  Conduct enabling technology and sub-system feasibility experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Sensor is Structure (ISIS)"
                                    },
                                    "Description": {
                                        "val": "The joint DARPA\/Air Force Integrated Sensor is Structure (ISIS) program is developing a sensor of unprecedented proportions that is fully integrated into a stratospheric airship that will address the nation's need for persistent wide-area surveillance, tracking, and engagement for hundreds of time-critical air and ground targets in urban and rural environments.  ISIS is achieving radical sensor improvements by melding the next-generation technologies for enormous lightweight antenna apertures and high-energy density components into a highly integrated lightweight multi-purpose airship structure - completely erasing the distinction between payload and platform.  The ISIS concept includes ninety-nine percent on-station 24\/7\/365 availability for simultaneous Airborne Moving Target Indicator (AMTI) (600 kilometers) and Ground-Based Moving Target Indicator (GMTI) (300 kilometers) operation; ten years of autonomous, unmanned flight; hundreds of wideband in-theater concealed communications links; responsive reconstitution of capabilities lost by any failed space assets; plus CONUS-based sensor analysis and operation.  An MOA has been signed by DARPA and the Air Force to pursue the program objectives through to transition.  The ISIS technology demonstration system transitions to the Air Force in 2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.700"
                                            },
                                            "Text": {
                                                "val": "-  Conducted critical design review of demonstration system.\n-  Conducted simulations to validate subsystem detailed designs.\n-  Conducted risk reduction testing and demonstrations of integrated subsystems.\n-  Manufactured initial delivery of airship envelope.\n-  Manufactured and chamber tested portions of dual-band RF apertures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete radar panel manufacturing process validation.\n-  Assemble radar panels and initiate radar\/aperture rooftop testing.\n-  Assemble and initiate power system long-term bench testing.\n-  Assemble and test radar subsystem components.\n-  Complete envelope material seaming and testing.\n-  Complete environmental assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete radar software operational mode development.\n-  Complete and test radar metrology system.\n-  Complete Ground Station development.\n-  Complete airship subsystem testing and integration.\n-  Assemble radar panels to pill structure and perform radar\/aperture testing.\n-  Integrate airship hull and radar aperture structures.\n-  Install and pre-flight test power, propulsion, and ballast systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Triple Target Terminator (T3)"
                                    },
                                    "Description": {
                                        "val": "The Triple Target Terminator (T3) program will develop a high speed, long-range missile that can engage air, cruise missile, and air defense targets.  T3 would be carried internally on stealth aircraft or externally on fighters, bombers, and UAVs.  The enabling technologies are: propulsion, data links, and digital guidance and control.  T3 would allow any aircraft to rapidly switch between air-to-air and air-to-surface capabilities.  T3's speed, maneuverability, and network-centric capabilities would significantly improve U.S. aircraft survivability and increase the number and variety of targets that could be destroyed on each sortie.  The program is jointly funded with, and will transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.891"
                                            },
                                            "Text": {
                                                "val": "-  Conducted preliminary design review of T3 concepts.\n-  Initiated T3 critical design activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.820"
                                            },
                                            "Text": {
                                                "val": "-  Conduct hardware-in-the-loop integrated subsystem testing.\n-  Conduct propulsion system ground testing.\n-  Fabricate and ground test demonstration vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct captive carry test of flight test article.\n-  Conduct ground launch of test article.\n-  Conduct airborne launch of test articles against three target types."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Anti-Ship Missile Demonstration (LRASM)"
                                    },
                                    "Description": {
                                        "val": "In response to emerging threats, DARPA is building on recent technology advances to develop and demonstrate standoff anti-ship strike technologies to reverse the significant and growing U.S. naval surface strike capability deficit.  The Long Range Anti-Ship Missile (LRASM) program is investing in advanced component and integrated system technologies capable of providing a dramatic leap ahead in U.S. surface warfare capability focusing on organic wide area target discrimination in a network denied environment, innovative terminal survivability in the face of advanced defensive systems, and high assurance target lethality approaches.  Specific technology development areas will include: robust precision guidance, navigation and control with GPS denial, multi-modal sensors for high probability target identification in dense shipping environments, and precision aimpoint targeting for maximum lethality.  Component technologies are being developed, demonstrated, and integrated into a complete weapon system.  The program will result in a high fidelity demonstration to support military utility assessment.  LRASM is a joint DARPA\/Navy effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "67.560"
                                            },
                                            "Text": {
                                                "val": "-  Initiated system detailed design activity.\n-  Developed high fidelity simulation tools and initiated system performance studies.\n-  Completed subsystem designs and developmental testing including wind tunnel tests and propulsion direct connect tests.\n-  Conducted system developmental tests.\n-  Initiated long-lead procurements for flight demonstrations.\n-  Commenced range planning activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.490"
                                            },
                                            "Text": {
                                                "val": "-  Develop integrated hardware-in-the-loop platforms.\n-  Complete missile seeker captive carry testing against surrogate targets.\n-  Complete integrated system detail designs and hold critical design reviews.\n-  Conduct high fidelity independent government performance assessment of detailed designs against key performance criteria.\n-  Update supporting documentation including concepts of operations, flight test and safety plans, lifecycle cost estimates, and transition plans.\n-  Commence fabrication, assembly, integration, and checkout of flight test vehicles for initial incremental test events.\n-  Complete controlled test vehicle flights.\n-  Complete final integration and checkout of guided test vehicles in preparation for flight testing.\n-  Complete end-to-end system flight demonstrations.\n-  Validate demonstrated system performance.\n-  Transition program developed designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.000"
                                            },
                                            "Text": {
                                                "val": "-  Modify booster adapter structure which mates standard Mk-114 booster clamp to missile body aft end.\n-  Investigate new hybrid canister design with solid-wall section on forward end and corrugated side panels on aft end.\n-  Analyze shock and fly-out requirements.\n-  Perform minor airframe design modifications for canister fit and internal structure\/composite skin strengthened to react to vertical launch loads.\n-  Transition follow-on vertical launch system activities to the Navy leading up to two canister expulsion and booster separation test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Hypersonic Research (CHR)"
                                    },
                                    "Description": {
                                        "val": "The Collaborative Hypersonic Research (CHR) program will design, build, and demonstrate a tactical sized boost-glide hypersonic vehicle which will show direct traceability to a tactical long range strike weapon system capable of being launched from any 21 inch or larger booster system.  The program will be flight experiment intensive and will leverage current activities in HTV-2 and the Air Force\/Australia HiFire program to develop a robust national modeling and simulation (M&S) framework.  CHR flight experiments will establish a deeper foundation of data while proving out aero\/thermal and guidance, navigation and control challenges.  By incrementally tackling key technology areas while constantly updating the M&S capabilities, CHR will provide key information to the tactical, conventional prompt global strike (CPGS), and hypersonic communities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop baseline designs to demonstrate necessary technologies traceable to a tactical system.\n-  Evaluate baseline designs using M&S and some minimal ground testing.\n-  Perform Military Utility Analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VTOL (Vertical Take-Off and Landing) X-Plane"
                                    },
                                    "Description": {
                                        "val": "The VTOL (Vertical Take-Off and Landing) X-Plane program will demonstrate revolutionary VTOL systems development through a series of component and system ground and flight tests, at subscale and full scale, leading to full scale flight demonstration of key technologies.  Program goals include flight speeds of greater than 250 knots, enhanced high\/hot hover performance, improved edgewise rotor cruise performance, prop-rotor cruise efficiencies approaching propellers, hover-power loading at a minimum of 11 pounds thrust per horsepower, and a 20% improvement in empty weight fraction.  Technologies will be pursued in four distinct research thrusts:  performance, safety and survivability, supportability and availability, and collaboration and autonomy.  The successful VTOL X-Plane would demonstrate the potential and mission utility of new technologies, and be a significant step toward closing current capability gaps in this class of air vehicles.  Transition partners will include the branches of DoD operating vertical flight systems, including the Army, Navy, Marine Corps, Air Force and Special Forces."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.600"
                                            },
                                            "Text": {
                                                "val": "-  Develop technology maturation plans.\n-  Perform technology area specific value assessments and capability gaps analyses.\n-  Initiate concept definition and preliminary design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Technologies"
                                    },
                                    "Description": {
                                        "val": "The goals of the Hypersonic Technologies program are to develop and demonstrate enabling technologies for prompt global reach missions.  The technologies include high lift-to-drag techniques, high temperature materials, precision navigation, guidance and control, communications through plasma, and an autonomous flight safety system.  The program will improve understanding of long-range hypersonic flight through innovative ground-based testing, flight demonstrations, and modeling and simulation.  Additionally, the program will demonstrate enabling technologies for future long-range hypersonic operational systems through rocket-boosted hypersonic flights with sufficient cross-range and downrange performance to evaluate thermal protection systems, aerodynamic shapes, maneuverability, and long-range communication for high speed cruise and re-entry vehicle applications. All efforts will be closely coordinated with the Office of Secretary of Defense Conventional Prompt Global Strike (CPGS) program office.  Hypersonic Technology program results are planned for transition to the Air Force and the CPGS office."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement improvements in highly coupled hypersonic toolsets incorporating assessed uncertainties of key technologies from recent CPGS testing activities.\n-  Refine hypersonic boost glide designs & technology applications including related ground and flight experiments based on recent test derived knowledge base improvements in aerodynamics, aerothermodynamics, and controls.\n-  Improve high temperature materials base for hypersonic flight and re-entry vehicles applications through improved manufacturing, modeling, and ground and flight based testing.\n-  Improve flight test range asset coordination including options for large scale space based telemetry collection.\n-  Analyze alternative launch systems for enhanced long range hypersonic flight.\n-  Refine and implement flight test regime for next generation long range hypersonic boost glide technology demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous High Altitude Long Endurance (HALE) Refueling (AHR)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous High Altitude Long Endurance (HALE) Refueling (AHR) program will demonstrate high altitude refueling between unmanned aircraft in an operational environment.  The program uses NASA RQ-4 Global Hawk unmanned aircraft as surrogate platforms to inform the development of next generation HALE aircraft built around aerial refueling, which has proven so vital to manned military aviation.  Specific challenges include precise control of limited flight performance aircraft under high-altitude conditions, redundant safe separation, and complex unmanned flight operations.  The program will also promote the application of autonomy for better effectiveness, efficiency, and safety in challenging environments.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.900"
                                            },
                                            "Text": {
                                                "val": "-  Completed wind-tunnel evaluation of high-altitude drogue performance.\n-  Validated end-to-end system design through hardware in the loop ground testing.\n-  Completed component fabrication and aircraft structural modifications.\n-  Completed in-flight characterization of wake flow fields."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.068"
                                            },
                                            "Text": {
                                                "val": "-  Complete aircraft component installation and software validation.\n-  Conduct flight tests and demonstrate repeatable refueling performance.\n-  Conduct operationally stressing refueling demonstration.\n-  Complete data analysis and document feasibility of fully autonomous aerial refueling in challenging conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulcan"
                                    },
                                    "Description": {
                                        "val": "The goal of the Vulcan program is to design, build, and ground test a pressure gain combustion (PGC) technology system that demonstrates a 20% reduction in specific fuel consumption for  power generation turbine engines.  PGC technology has been under development for more than a decade and considerable progress has been made in key enabling technology areas.  The technology is believed mature enough to permit a dramatic new system capability.  PGC, when combined with turbine engines, offers the ability to design a new class of hybrid turbine power generation engines and Mach 4+ air breathing propulsion systems.  The Vulcan system consists of a full scale PGC, a compressor, and a turbine, and would have direct application to ship power generation and propulsion turbine engines, aviation turbine engines, high-mach air breathing engines, as well as commercial turbine engines of the same variety.  This program is funded from PE 0602715E, Project MBT-03, Tactical and Strategic Energy Technology in FY 2012.  Anticipated Service users include the Air Force and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted simulations to validate subsystem detailed designs.\n-  Conducted risk reduction testing and demonstrations of key PGC component technologies and subsystems.\n-  Matured and validated critical PGC enabling technologies and analytical tools.\n-  Designed, procured and began assembly and instrumentation of a PGC module test rig."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DiscRotor Compound Helicopter"
                                    },
                                    "Description": {
                                        "val": "The goal of the DiscRotor program was to design and demonstrate the enabling technologies required to develop a new type of compound helicopter capable of high-efficiency hover and high-efficiency, high-speed flight, with stable, continuous and reversible transition between these flight states.  The aircraft concept featured a mid-fuselage disc with extendable rotor blades, and an aft swept wing.  With the rotor blades extended and the disc rotating, the aircraft would operate like a helicopter with vertical take-off, efficient hover, controllable low speed flight and vertical landing.  With the blades retracted, the aircraft would be capable of efficient wing-borne cruise at speeds exceeding any existing rotorcraft, 2-3 times that of a conventional helicopter.  Specific objectives of the DiscRotor program included: demonstrating the feasibility of safely and repeatedly retracting\/extending the blades into the disc in forward flight, characterizing the flowfield environment created by a disc-rotor, demonstrating disc-rotor enabling technologies, and correlating performance and loads and dynamics between high fidelity physics-based analytical predictions and wind tunnel testing  to confirm capability to adequately design advanced rotorcraft configurations.  Interested partners include the Army, Navy, Marines, Air Force, Coast Guard, and SOCOM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.210"
                                            },
                                            "Text": {
                                                "val": "-  Conducted testing of a subscale rotor and fuselage in a hover test rig.\n-  Continued refinement of operational air vehicle configuration.\n-  Completed critical design of 12 foot diameter large-scale extendable\/retractable rotor model.\n-  Validated DiscRotor conceptual approach, risk assessment, and definition of demonstrator requirements.\n-  Validated high fidelity physics-based analytical capability to predict performance and loads and dynamics of advanced rotorcraft configurations.\n-  Conducted wind tunnel testing of DiscRotor model.\n-  Correlated analytical tools with wind tunnel results."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mode Transition (MoTr) Demonstration"
                                    },
                                    "Description": {
                                        "val": "The Mode Transition (MoTr) Demonstration program aimed to ground test a turbine-based combined-cycle (TBCC) engine using hydrocarbon fuel.  The MoTr program objective was to demonstrate transition from turbojet to ramjet\/scramjet cycle to enable reusable, air-breathing, hypersonic flight.  MoTr leveraged previous and on-going advances in air-breathing propulsion technology, including the Falcon Combined-cycle Engine Technology (FaCET) and the Air Force\/DARPA High Speed Turbine Engine Technology Demonstration (HiSTED) program.  The transition partner was to have been the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.528"
                                            },
                                            "Text": {
                                                "val": "-   Completed design analysis of a TBCC engine model.\n-   Completed critical design of primary testing modifications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Integrated Sensor is Structure"
                                    },
                                    "Title": {
                                        "val": "Air Force PE 0305205F Project 675372F"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "52.425"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.907"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.907"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.963"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Integrated Sensor is Structure-"
                                    },
                                    "Title": {
                                        "val": "Air Force PE 0603203F Project 665A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.100"
                                        },
                                        "CurrentYear": {
                                            "val": "2.800"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.400"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.400"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "LRASM"
                                    },
                                    "Title": {
                                        "val": "Navy"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "67.560"
                                        },
                                        "CurrentYear": {
                                            "val": "24.510"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Triple Target Terminator (T3)"
                                    },
                                    "Title": {
                                        "val": "Air Force"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.930"
                                        },
                                        "CurrentYear": {
                                            "val": "27.050"
                                        },
                                        "BudgetYearOne": {
                                            "val": "41.730"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "41.730"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}