{
    "id": "0eaddc48386d7b57551aea611237f9b6f6aad95b",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604798A"
        },
        "ProgramElementTitle": {
            "val": "Brigade Analysis, Integration and Evaluation"
        },
        "R1LineItemNumber": {
            "val": "108"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "214.270"
            },
            "BudgetYearOneBase": {
                "val": "214.270"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "45.903"
            },
            "BudgetYearThree": {
                "val": "45.431"
            },
            "BudgetYearFour": {
                "val": "45.786"
            },
            "BudgetYearFive": {
                "val": "45.218"
            }
        },
        "ProgramElementNote": {
            "val": "Based upon Congressional language in the FY2012 Department of Defense Appropriation Act, this project was created to support the Army's Brigade Analysis, Integration and Evaluation mission.  The FY13 funds and beyond for Project DV1 were realigned from PE 0604561A, Project FC2 (FY13-FY17), and the funds for Projects DU8 and DU9 were realigned from the PE 0604818A, Project C34."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element is comprised of three projects; System Under Evaluation Analysis and Integration (Project DU8), Brigade Combat Team (BCT) Equipment Integration and Experimentation (Project DV1), and System of Systems Engineering (Project DU9). Project DU8; Systems Under Evaluation Analysis and Integration, provides funding for the Industry and government programs that meet or exceed known technological gaps and funds their platform and network integration into the Army's Network Integration Evaluation (NIE) Events. Project DV1; BCT Equipment Integration and Experimentation, provides funds for development of the NIE architecture, systems integration engineering, A-Kit development, coordination of the events, risk reduction activities, and troubleshooting and fixing integration and network problems in support of the Network Integration Evaluation events. Project DU9; System of Systems Engineering, provides for development of the Army's standards and validation and verification of systems against these standards. The software will result in a common operating environment and the total architecture will support the NIE by becoming the framework for the detail analysis for NIE. The FY13 funding supports all of the efforts to plan and execute NIE 13.2 and 14.1. The specific evaluation requirements for these NIEs will be derived from the gaps identified by the users in the Afghanistan Theater and the lessons learned from NIEs 12.2 and 13.1\n\nIn FY11 the Army initiated the new paradigm for SoS Engineering and Brigade and Network Integration, called the Agile Process. To support this paradigm, the Army stood down PEO I on 1 October 2011 and established System of Systems Integration Directorate (SoSI), which is ASAALT's lead for all aspects of the Army Agile Network Integration process.  The SoSI coordinates, synchronizes, and integrates existing and emerging technologies into the tactical network at Ft Bliss, TX and tests this new integrated brigade capability at White Sands Missile Range, NM. Operational test requirements for unique systems \/ programs are included within the brigade testing to minimize the cost of a formal operational test for each system, thus eliminating duplicative infrastructure and test costs. As part of the Agile process, the Army has also formed the Brigade Modernization Command (BMC) at Ft Bliss, with a unit dedicated solely to testing and evaluating Capability Packages and the associated integrated Network. The Army has also created a TRIAD consisting of the SoSI, BMC, and Army Test & Evaluation Command (ATEC) to manage the Agile process.\n\nThe Agile Process consists of the following phases which are coordinated and executed by SoSI, BMC and ATEC. In Phase 0 Training and Doctrine Command (TRADOC) will define near-term gaps in current operational capabilities using existing Operational Needs Statements and relevant assessments from ongoing and past analyses. This analysis will be the basis for requirement sets for future Capability Packages. Network test and evaluation will focus on improving and integrating emerging and existing technologies to minimize existing operational gaps. During Phase I the Director, SoS Integration, solicits for potential solutions from existing Army programs, tech base programs, and industry. Also during this phase ASAALT, working through the SoSI team, obtains buy-in from stakeholders, funding and support, establishes initial objectives, solidifies architecture objectives, and establishes the viable candidate list for Network Integration Evaluation (NIE). During Phase II, ASAALT, through the SoSI team, compiles the list of potential solutions that could meet the identified gaps and begins to develop the integration and testing concepts for the next capability package. Phase III includes the coordinated efforts between BMC, ATEC and SoSI to finalize the brigade architecture, integration and test plans, training materials and combat mission evaluations. Phase III also includes the initial integration phase where industry and DOD hardware and software are integrated and initially evaluated for follow-on consideration at a government integration and test facility (executed at Aberdeen Proving Ground (APG)). The results of this initial evaluation will determine which industry and DOD System Under Evaluation (SUE) will continue in the NIE process. During Phase IV, SoSI develops detailed plans and executes the integration of all hardware and software into the brigade network. The integration is validated and verified through the NIE process. And in Phase V, SoSI executes the in-depth NIE. The results of the NIE will address and answer senior Army leadership's questions about force makeup and effectiveness and provides Army leadership recommendations for improving operational requirements and enhancing technical specifications.  As a result of Phase V, during Phase VI, the Army will determine which systems to procure and field to improve the Army's Network.\n  \nFY13 w"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "214.270"
                },
                "BudgetYearOneBase": {
                    "val": "214.270"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "214.270"
                },
                "BudgetYearOneBase": {
                    "val": "214.270"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "214.270"
                                },
                                "BudgetYearOneBase": {
                                    "val": "214.270"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DU8"
                    },
                    "ProjectTitle": {
                        "val": "SYSTEMS UNDER EVALUATION (SUE) ANALYSIS AND INTEG"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "45.489"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.489"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project was created to support the Army's Brigade Analysis, Integration and Evaluation mission."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the integration of both industry and DOD emerging and existing technologies into the current Army force structure.  It includes all integration and test efforts for the Network Integration Evaluation (NIE)s 13.2 and 14.1 events, which includes the Network Integration, Software loading exercises and checkout (LOADEX), comprehensive communication exercises (COMMEX) and  network setup and initial trials (PILOT), culminating in the Army's NIE.  The specific evaluation requirements for these NIEs will be derived from the gaps identified by the users in the Afghanistan Theater and the lessons learned from NIEs 12.2 and 13.1.  Risk reduction testing is conducted at Aberdeen Proving Grounds (APG) to identify potential system deficiencies prior to NIE entry.\n\nIn FY 2013, the Network Integration Evaluation Event continues to integrate and mature the Army's tactical network and is a key element of the Army's emerging Network Strategy.  The Agile Process is designed to reduce the acquisition timeline by testing and evaluating both industry and DOD existing and emerging technologies during the NIEs.  Each NIE is specifically designed to test and evaluate products that have the potential to fill one or more of Army's current gaps. Each of the systems that participate in a NIE event is identified as either a Systems Under Evaluation (SUE) or a System Under Test (SUT). A SUE is defined as a System that has gone through the Agile Process Candidate Evaluation Process and been approved by a GOSC, G-3\/5\/7, and BMC to participate in the NIE and receive a Doctrine, Organization, Training, Material, Leadership, Personnel, & Facilities (DOTMLPF) assessment.  The system must meet all delivery, integration, and training requirements to participate in the event; where as a SUT is a system that has been approved by the Test Schedule and Review Committee (TSARC) to undergo a formal operational test during the Network Integration Evaluation.  The system will be fully instrumented to collect test data for this operational test.  The system must meet all delivery, integration, and training requirements to participate in the event. One of the many objectives of the NIE is to conduct parallel user tests and experiments to minimize costs by sharing test assets and people. \n  \nFor industry SUEs, this project will integrate the industry SUE into the Network and onto a platform if required. It will also purchase any additional hardware and support above and beyond the contractors proposed support.  For Government SUEs, this project funds integration support that consists of FSRs to support integration and the test. If the NIE program requires additional prototypes above and beyond the program of record it will also purchase this equipment.  This project also funds keeping the Network baseline up to date so that integration is always into the baseline network.\n\nFY 2013 will continue the NIE gaps and evaluation process. For example, during NIE 12.2 there were 3 SUTs and 41 SUEs to be evaluated against one of the Army's five NIE 12.2 gaps. The NIE 12.2 gaps are: (1) Multichannel Radio, (2) Low-Cost-Low-SWaP Tactical Cross Domain Solution, (3) Small Form Factor, Modular Transit Case Based Company Command Post, (4) Improved Operational Energy, and (5) Tactical Router. The number of systems to be evaluated during NIE 13.1 is estimated to be between 40 and 50 systems. These systems will be evaluated against one of the Army's nine gaps identified for NIE 13.1. The NIE 13.1 gaps are: (1) Multi-Channel Tactical Radio, (2) Mission Command on the Move (MCOTM), (3) Low-Cost-Low-SWaP Tactical Cross Domain Solution, (4)Joint Participation Capability (US & Allies), (5) Aviation Extension, (6) Small Form Factor, Modular Transit Case SATCOM Terminal and Baseband, (7) Mission Command In-Garrison Training, (8)-Improved Operational Energy, and (9) Integrate Capability Set configuration items into heavy platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Under Evaluation (SUE) Integrations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort: To support integration of both industry and DOD emerging and existing technologies into the current Army force structure. This includes all integration support and test support for 13.2 and 14.1 SUEs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.489"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.489"
                                            },
                                            "Text": {
                                                "val": "Provides funding to support integration and evaluation, twice a year, of approximately 40 - 50 industry and government technologies which are being selected as Systems Under Evaluation (SUE) for participation into the Army's Network Integration Evaluation (NIE). These funds cover the NIE participant_s (Emerging and existing technologies, PMs and contractors) costs for travel, and shipment of equipment, Contractor Field Service Representatives (CFSRs) and Government Subject Matter Experts (GSMEs) required to support integration activities, integration A-kit development, and the purchase of additional prototypes when needed to effectively complete detailed evaluations of the complete network architecture. Includes costs for development and fabrication of integration hardware and software. The participating units then deploy to the tactical training\/evaluation area, White Sands Missile Range (WSMR) to complete a comprehensive rehearsal (4 weeks) in preparation for the detailed Network Integration Evaluation (2 weeks) event."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "During the planning of NIE 11.1 through NIE 13.1 the government will focus on identifying and evaluating systems against the Army's known gaps and will utilize a Sources Sought solicitation to invite industry's participation in each NIE, which results in industry's participation at No Cost to the government.  Beginning with NIE 13.2 the government will continue to focus on identifying and evaluating against the Army's identified gaps.  For FY 2013 and out the government will use one of two acquisition strategies.  First the government will issue a sources sought request to fill the known gaps. The government will then use either an existing government contract or an Request for Proposal (RFP) as the means of solicitation for industry's participation in the NIE, and will also include the participant's production options."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SYSTEMS UNDER EVALUATION (SIE) INTEGRATION"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SUTS \/ SUEs FTB \/ WSMR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "SUTS \/ SUEs FTB \/ WSMR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "45.489"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "45.489"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "45.489"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Industry Day"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Decision Point 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Decision Point 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Lab Integration \/ Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Candidate Solution Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 LoadEx \/ ValEx"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 CommEx (1 week)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Pilot (5 days)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Event"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Event Analysis & Summary"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Industry Day"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Decision Point 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Decision Point 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Lab Integration \/ Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Candidate Solution Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 LoadEx \/ ValEx"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 CommEx (1 week)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Pilot (1 week)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Event"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DU9"
                    },
                    "ProjectTitle": {
                        "val": "SYSTEM OF SYSTEMS ENGINEERING"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.109"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.109"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY 2013 funding provides for technical support to oversee the execution of the COE Implementation plan, COE Orchestration, Governance, Cross-Cutting Capabilities Definition, Implementation Plan Updates, Software Build (SWB)\/COE Configuration Control Board (CCB) and Test Support transition, Integrated Master Schedule, Government oversight of the Army's Strategic Software Improvement Program (ASSIP), Coordination with Army Staff, Technical Reference Model, Metrics for assessing compliance, Technical Advisory Board (TAB), Chief Engineer (CE) compliance, COE assessment criteria, Assess systems during the System Under Evaluation (SUE) Technical Interface Meeting (TIM), System software configuration baseline data collection, System software configuration baseline updates, Control Point\/Interface Definition and Agreements, Tactical Network, Ops\/Intel Convergence, Transport Convergence, Network Synchronization Working Group, Joint Interoperability & Mission Thread Architecture Office of Secretary Defense (OSD) Director Defense Research and Engineering ( DDR&E), Integrated Base Defense, Basing and Basing Computing\/Communications Analysis, Host Based Security System (HBSS), GNEC Implementation Plan, Radio Procurement Requests, SoS Engineering Construct for the Network, Organizing the SoS Engineering trade space for Platforms, Standards for the Platforms (VICTORY & FACE), Size Weight and Power (SWAP) working group, Software Blocking (SW), NIE Gaps, Candidate Assessment for Upcoming NIE, and Technologies assessment, Systems Engineering Plan (SEP) policy, Program Protection Plan (PPP) reviews, Reliability policy technical support, Standards & Speciation adoption across ASA(ALT), (OSD\/Joint), Development Planning model, IBD, Basing Pilot).  It also provides for the development and execution of COE integration policies and procedures, the development and implementation of backwards capability testing, integration checklists and their verification, test hardware development and implementation support.  The development and effective utilization of emulator and integration tools.  Provides for COE\/CE architecture validation, design baseline validation, and the verification of COE reference architecture compliance. The verification of COE critical enabler implementation, conducting risk assessments and analysis, accreditation and certification process refinement, and verification of technical test harness and tool development.  Provides for the accreditation, certification and refinement of test plans and events."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Systems Engineering & (COE) Development\/Validation to Provide Technical Support for the Execution of the Army System Engineering and Architecture in COE Implementation"
                                    },
                                    "Description": {
                                        "val": "To provide technical support for the execution of the Army's Systems Engineer Architecture for COE."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.109"
                                            },
                                            "Text": {
                                                "val": "The funds provide: Technical support to oversee the execution of the COE Implementation plan, COE Orchestration, Governance, Cross-Cutting Capabilities Definition, Implementation Plan Updates, Software Build (SWB)\/COE Configuration Control Board (CCB) and Test Support transition, Integrated Master Schedule, Government oversight of the Army's Strategic Software Improvement Program (ASSIP), Coordination with Army Staff, Technical Reference Model, Metrics for assessing compliance, Technical Advisory Board (TAB), Chief Engineer (CE) compliance, COE assessment criteria, Assess systems during the System Under Evaluation (SUE) Technical Interface Meeting (TIM), System software configuration baseline data collection, System software configuration baseline updates, Control Point\/Interface Definition and Agreements, Afghan Mission Network, Ops\/Intel Convergence , Transport Convergence, Network Synchronization Working Group , Joint Interoperability & Mission Thread Architecture Office of Secretary Defense (OSD) Director Defense Research and Engineering ( DDR&E), Integrated Base Defense, Basing and Basing Computing\/Communications Analysis, Host Based Security System (HBSS), GNEC Implementation Plan, Radio Procurement Requests, Organizing & Synchronizing of the Architecture space, Establish Technical foundation for Army Network Architecture, Network Architecture Analysis for BCT formations, SoS Engineering Construct for the Network, Organizing the SoS Engineering trade space for Platforms, Standards for the Platforms (VICTORY & FACE), Size Weight and Power (SWAP) working group, Software Blocking (SW), NIE Gaps, Candidate Assessment for Upcoming NIE, and Technologies assessment, Systems Engineering Plan (SEP) policy, Program Protection Plan (PPP) reviews, Reliability policy technical support, Standards & Speciation adoption across ASA(ALT), (OSD\/Joint), Development Planning model, IBD, Basing Pilot).  It also provides for the development and execution of COE integration policies and procedures, the development and implementation of backwards capability testing, integration checklists and their verification, test hardware development and implementation support.  The development and effective utilization of emulator and integration tools.  Provides for COE\/CE architecture validation, design baseline validation, and the verification of COE reference architecture compliance. The verification of COE critical enabler implementation, conducting risk assessments and analysis, accreditation and certification process refinement, and verification of technical test harness and tool development.  Provides for the accreditation, certification and refinement of test plans and events."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FC2"
                                    },
                                    "Title": {
                                        "val": "FCS System of Systems Eng & Program FC2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "471.559"
                                        },
                                        "CurrentYear": {
                                            "val": "298.589"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "770.148"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV1"
                                    },
                                    "Title": {
                                        "val": "BCT Equipping Integration and Exper DV1"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "157.672"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "157.672"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.431"
                                        },
                                        "BudgetYearFour": {
                                            "val": "45.786"
                                        },
                                        "BudgetYearFive": {
                                            "val": "45.218"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "340.010"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DU8"
                                    },
                                    "Title": {
                                        "val": "SUE Analysis and Integration DU8"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "45.489"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.489"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "45.489"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering COE Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASA(ALT) , various Distributed Locations"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.109"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.109"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.109"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Execution of the COE Mission"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Execution of COE Implementation Plan"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding of COE Version 1.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DV1"
                    },
                    "ProjectTitle": {
                        "val": "BCT EQUIPPING INTEGRATION AND EXPERIMENTATION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "158.672"
                        },
                        "BudgetYearOneBase": {
                            "val": "158.672"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.903"
                        },
                        "BudgetYearThree": {
                            "val": "45.431"
                        },
                        "BudgetYearFour": {
                            "val": "45.786"
                        },
                        "BudgetYearFive": {
                            "val": "45.218"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project (DV1) was created to support the Army's Brigade Analysis, Integration and Evaluation mission."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project includes government and contractor efforts to integrate and validate that the Army is fielding platforms, components and software that are integrated together to provide increased capabilities for the soldier that are supportable and trainable.  This project includes efforts associated with designing the Army's integrated network and associated architecture, developing the infrastructure and test plans, conducting the integration and risk reduction activities, evaluating the potential solutions, and determining the final solution set for the next Capability Package.  It includes all integration and test efforts for the Network Integration Evaluation (NIE)s 13.2 and 14.1 events, which include Network Integration , Software loading exercises and checkout (LOADEX), comprehensive communication exercises (COMMEX), network setup and initial trails (PILOT), culminating in the Army's and Network Integration Evaluation (NIE).  The specific evaluation requirements for these NIEs will be derived from the gaps identified by the users in the Afghanistan theater and the lessons learned from NIEs 12.2 and 13.1.\n \nThe Agile Process consists of the following phases which are coordinated and executed by the System of Systems Integration Directorate (SoSI), BMC and ATEC.  In Phase 0 Training and Doctrine Command (TRADOC) will define near-term gaps in current operational capabilities using existing Operational Needs Statements and relevant assessments from ongoing and past analyses.  This analysis will be the bases for requirement sets for future Capability Package.   Network test and evaluation will focus on improving and integrating emerging and existing technologies to minimize existing operational gaps. During Phase I the System of System Integration Directorate solicits potential solutions from existing Army programs, tech base programs, and industry.  Also during this phase ASAALT, through the SoSI, obtains buy-in from stakeholders, funding and support, establishes initial objectives, solidifies architecture objectives, and establishes the viable candidate list for Network Integration Evaluation.  During Phase II, ASAALT through the SoSI compiles the list of potential solutions that could meet the identified gaps and begins to develop the integration and testing concepts for the next capability package.  Phase III includes the coordinated efforts between BMC, ATEC and SoSI to finalize the brigade architecture, integration and test plans, training materials and combat mission evaluations.   Phase III also includes the initial integration phase where industry and DOD hardware and software are integrated and initially evaluated for follow-on consideration at a government integration and test facility (currently planned for Aberdeen Proving Ground (APG)).  The results of this initial evaluation will determine which industry and DOD SUEs will continue in the NIE process. During Phase IV, SoSI details plans and executes the integration of all hardware and software into the brigade network.  The integration is validated and verified through the NIE process. And in Phase V, SoSI executes the in-depth Network Integration Evaluation (NIE). The results of the NIE will address and answer senior Army leadership s questions about force makeup and effectiveness and provides Army leadership recommendations for improving operational requirements and enhancing technical specifications.  As a result of Phase V, during Phase VI , the Army will determine which systems to procure and field to improve the Army?s Network.  \n\nThis project includes the following government efforts: System of system architecture and design standards for the NIE, BCT Integration to support the NIE (hardware and software), A Kit development and fabrication to support Network Integration on to platforms, integration of program of record, and non-program of record equipment and systems (both hardware and software) into a single synchronized network, BCT simulation to determine solution sets to potentially fill gaps, BCT experimentation and testing to validate and verify the increased capability for the soldier, BCT Synchronized fielding (logistics and training).  Based on feedback from integration and testing, provides input and changes to both operational requirements and technical specification for improved operational capabilities.  This project includes support to other DOD agencies for joint programs and collaboration efforts with SoSI and Capability Package portfolio integration.  The government effort includes cost for salaries, travel, overtime, training, supplies, facilities, and IT support.\n\t\nFY 2013 will continue the NIE gaps and evaluation process. For example, during NIE 12.2 there are 3 SUTs and 41 SUEs scheduled to be evaluated against one of the Army's five NIE 12.2 gaps. The NIE 12.2 gaps are: (1) Multichannel Radio, (2) Low-Cost-Low-SWaP Tactical Cross Domain Solution, (3) Small Form Factor, Modular Transit Case Based Company Command Post, (4) Improved Operational Energy, and (5) Tactical Router. The number of systems to be evaluated during NIE 13.1 is estimated to be between 40 and 50 systems. These systems will be evaluated against one of the Army's nine gaps identified for NIE 13.1. The NIE 31.1 gaps are: (1) Multi-Channel Tactical Radio, (2) Mission Command on the Move (MCOTM), (3) Low-Cost-Low-SWaP Tactical Cross Domain Solution, (4)Joint Participation Capability (US & Allies), (5) Aviation Extension, (6) Small Form Factor, Modular Transit Case SATCOM Terminal and Baseband, (7) Mission Command In-Garrison Training, (8)Improved Operational Energy, and (9) Integrate Capability Set configuration items into heavy platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Test Experimentation"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort:"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "58.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "58.885"
                                            },
                                            "Text": {
                                                "val": "Plan and conduct detailed experiments, tests and evaluations of potential Network, Software and Hardware systems for procurement and integration into the Army's Warfighter system.\nComplete test planning, coordination of requirements, assets planning, range planning and soldier planning. Conduct test planning and management which includes, conduct coordination of requirements with Army Evaluation Command (AEC), Operational Test Center (OTC), and Developmental Test Command (DTC). This coordination includes; development and procurement of modeling and simulation tools, instrumentation for data collection, facilities required to store and maintain equipment, facilities required to integrate capabilities, other test equipment, REDFORCE systems. Conduct experimentation, tests, and evaluation by coordinating and procuring range resources to include range time, range personnel, test engineering support, operators and subject matter experts on systems under evaluation.   Includes costs of management of the test\/experiment and support all demonstrations experiments and tests. Includes costs for distributed networking capability (i.e. DREN, I\/O Range, circuits, etc) and other electronic infrastructure data transfer medias between APG, EPG, FT Bliss and White Sands Missile Range. Conduct coordination with AEC on the development of System Evaluation Plans (SEP) and Operational Milestone Assessment Reports (OMAR) and maintain all data bases of evaluation analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integration Efforts:  System of Systems Integraton Directorate (SoSI)"
                                    },
                                    "Description": {
                                        "val": "Provides for SoSI staff and facilities that supports the following three main operations: Capability Package Future: planning for future NIE events. Capability Package Current: planning and execution of current NIE events. Headquarters management and oversight of the complete Agile process."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "66.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "66.223"
                                            },
                                            "Text": {
                                                "val": "Conduct planning with government and contract personnel to develop the overarching plans for Network Integration Evaluation (NIE). Complete Capability Package (CP) development which includes; defining what is affordable and defining what can be realistically accomplished within the Network Integration Evaluation (NIE) window. Conduct requirements traces across the NIE portfolio by conducting current requirements analysis, identifying gaps and overlaps, and identifying solution sets. Conduct Network Analysis for NIE by completing initial and high level fidelity reviews. In support of the NIE; conduct sources sought procedures, Request for Proposal (RFP), complete evaluation of submissions, plan vignettes, complete architecture analysis, develop and publish what systems will participate in NIE as either a System Under Test (SUT) or a System Under Evaluation (SUE) and define what the Tech Base capabilities will be will also be included in the evaluation. Conduct data and configuration management. Conduct vehicle integration and Size, Weight, and Power (SWaP) analysis in support of NIE. Complete development of standardization of hardware and software to optimize integration and interoperability. Develop Network Operations (NETOPS) by defining communications settings, interfaces, and configuration which includes; Traffic Engineering (Shared Networks) for Software Services & Communications in order to maximize the use of bandwidth. Develop and manage an Integrated Master Schedule (IMS). Develop budget and manage budget execution. Develop Knowledge Management plans and procedures in to the NIE. Conduct security planning and technology services. Conduct logistics development and planning in support of the NIE. Coordinate with ASAALT as they assign PMs to be Non-Program of Record (POR) SUE sponsors and as they determine which POR\/SUEs are in each NIE. Conduct daily operations and the execution of the NIE plan by; maintaining a daily battle rhythm, synchronized calendar, conducting operational meetings, developing and submitting reports, tracking and maintaining accountability of all assets and the operational scheduling of assets and personnel. Develop brigade level architecture from the top level plan provided by CP Future which includes; the development of detailed network designs for the Systems Under Test and Systems Under Evaluation  which are assigned to the maneuver brigades during the Network Integration Evaluation, conduct detailed planning and development of the architecture and vignettes, and information assurance. Establish metrics and measures across the SUTs\/SUEs, and identify and implement tools, data points and data collection measures for the NIE. Complete analysis and assessment of integrated experimental systems to determine optimal brigade configuration and best solutions to fill the known requirements gaps.  Conduct Information Assurance (IA) which includes; plan\/execute C4ISR\/vehicle\/platform integration, system checkout, and the coordination of system support between training and logistics assets. Coordinate Contractor Field Support Representatives (CFSRs) and Government Subject Matter Experts (GSME), to integrate hardware and software in support of the NIE events. Conducted infrastructure and facilities management which includes; establish\/maintain & track communications during NIE within a 7,600 square mile footprint, maintain IT and equipment support within buildings disbursed over 7,600 square miles. Setup and maintain security access for over an estimated 7,000 soldiers, government, contracted and industry personnel during the NIE. Conduct international, integration and interoperability procedures.  Conduct Information Assurance (AI), accreditation and certification which includes; test but verify, coordinating for DAA approvals, and all technology services.  Conduct After Action Review (AAR) to provide Army leadership recommendation for improving operational requirements and enhancing technical specifications.  Conduct command and control and staff support for the complete agile process to include: Program Management, Administrative, Tech Services, IT, Graphics, Defense Travel System (DTS) support, Facilities Execution, Knowledge Management Execution, Security Execution, Business Management, and Acquisition Management. Develop and support budget submittals and all program inquiries. Conduct personnel management support for the SoSI. Coordinate all higher headquarters, congressional, and media inquiries, questions and audits."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Architecture Development and System Engineering"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort: Provides government and contractor support staff to System of Systems Integration Director (SoSI) to support their technological specialty in completing the Agile Process, NIE Architecture, NIE System Engineering, and NIE Systems Integration."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.604"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.604"
                                            },
                                            "Text": {
                                                "val": "Subject Matter Expertise from other Army PEOs and PMs that support SoSI in conducting the following: Assists in developing and defining what is affordable and can be realistically accomplished within the integration and test NIE window to support future Capability Sets. Conduct requirements traces across the various Brigade Combat Team (BCT) portfolios by conducting current requirements analysis, identifying gaps and overlaps, and identifying solution sets. In support of the Agile processes, participate in sources sought procedures, completing evaluation of submissions, planning vignettes, and completing architecture analysis. Assists in the development of the Network Operations (NETOPS) by defining communications settings, interfaces, and configuration which includes; Traffic Engineering (Shared Networks) for Software Services & Communications in order to maximize the use of bandwidth. Support Information Assurance (IA) coordination. Participates in System Under Test\/System Under Evaluation (SUT\/SUE) network integration assessments and analysis for NIE. Support the development of the brigade level network architecture for the NIE events. Support the detailed planning of the architecture and vignettes, and information assurance plan. Support the establishment of metrics and measures across the SUTs\/SUEs, and identify and implement tools, data points and data collection measures for the NIE. Assist in integrating hardware and software from different systems into existing platforms. Support the development of test tools and instrumentation to support data analysis, Army force structure and recommendations. Support Information Assurance which includes; plan\/execute,Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance, (C4ISR)\/vehicle\/platform integration, system checkout, and the coordination of system support between training and logistics assets. Coordinate Contractor Field Support Representatives (CFSRs) and Government Subject Matter Experts (GSME), to integrate hardware and software in support of the NIE events. Conduct Information Assurance accreditation and certification which includes; test but verify, coordinating for Designated Approving Authority (DAA) approvals, and all technology services. Apply lessons learned from the previous test cycle to improve tools, processes and procedures, while informing the Requirements, Budgeting and Acquisition processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infastructure"
                                    },
                                    "Description": {
                                        "val": "Provides for Infrastructure, (facilities, Information Technology (IT) support, computers, Black Berries, program IA, etc.) at all SOSI locations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.960"
                                            },
                                            "Text": {
                                                "val": "Provides for setup, utilities, furniture, equipment and maintenance, of all facilities at Fort Bliss TX, (FTBX), White Sands Missile Range NM (WSMR) , Warren MI, Aberdeen Proving Ground, MD (APG), and Washington Capital Region. Includes lease and support maintenance of Government Service Administration (GSA)\/Government Furnished Equipment (GFX) vehicles that support the \/NIE mission at FTBX\/WSMR Purchase or lease, integrate, and maintain telecommunications, routers, network management software, blackberries and PDAs, computers, Antennas, display screens, radios, and associated mounting hardware and cables to support NIE mission. Purchases and integrates computer software to support scheduling, Agile Request For Information (RFI) selection and evaluation process, budget process, integration analysis, modeling and simulation, network analysis, data collection, and analyzing test results.  Includes costs of facilities required to store\/maintain\/integrate capabilities on to military platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FC2"
                                    },
                                    "Title": {
                                        "val": "FCS System of System Engineering & Program Management FC2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "471.559"
                                        },
                                        "CurrentYear": {
                                            "val": "298.589"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "770.148"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DU8"
                                    },
                                    "Title": {
                                        "val": "Systems Under Evaluation (SUE) Analysis, and Integration DU8"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "45.489"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.489"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "45.489"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DU9"
                                    },
                                    "Title": {
                                        "val": "System of Systems Engineering DU9"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "10.109"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.109"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "10.109"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "During the planning of NIE 11.1 through NIE 13.1 the government will focus on identifying and evaluating systems against the Army's known gaps and will utilize a Sources Sought solicitation to invite industry's participation in each NIE, which results in industry's participation at No Cost to the government. Beginning with NIE 13.2 the government will continue to focus on identifying and evaluating against the Army's identified gaps.  For FY13 and out the government will use one of two acquisition strategies.  First the government will issue a sources sought request to fill the known gaps. The government will then use either an existing government contract or an Request for Proposal (RFP) as the means of solicitation for industry's participation in the NIE, and will also include the participant's production options."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Integration - Dir SoS Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SOSI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Bliss, TX: WSMR, NM: and SOSI Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "66.223"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "66.223"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "66.223"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integration - Non Dir of SoS Integration, PEOs and PMs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Subject Matter Experts various PEOs, PMs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.604"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.604"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.604"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Infrastructure Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SOSI, FTBx, WSMR, APG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.960"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.960"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.960"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government System Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SOSI efforts at Bliss and WSMR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Bliss TX and WSMR, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "58.885"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "58.885"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "58.885"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Industry Day"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Decision Point 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Decision Point 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Lab Integration \/ Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Candidate Solution Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 LoadEx \/ ValEx"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 CommEx (1 week)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Pilot (5 days)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Event"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 Event Analysis & Summary"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Industry Day"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Decision Point 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Decision Point 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Lab Integration \/ Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Candidate Solution Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 LoadEx \/ ValEx"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 CommEx (1 week)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Pilot (1 week)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 14.1 Event"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}