{
    "id": "11a5ceb889cc38c96f3716b3baed88383e5733e6",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602785A"
        },
        "ProgramElementTitle": {
            "val": "Manpower\/Personnel\/Training Technology"
        },
        "R1LineItemNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.982"
            },
            "CurrentYear": {
                "val": "18.917"
            },
            "BudgetYearOne": {
                "val": "17.781"
            },
            "BudgetYearOneBase": {
                "val": "17.781"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "18.007"
            },
            "BudgetYearThree": {
                "val": "17.801"
            },
            "BudgetYearFour": {
                "val": "18.019"
            },
            "BudgetYearFive": {
                "val": "18.144"
            }
        },
        "ProgramElementNote": {
            "val": "FY11 funding decrease for higher priority effort."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE)conducts applied  behavioral and social science research that provides non-materiel solutions to ensure that Soldiers can adapt and excel and improve the Army's capability to fully leverage advances in networks, systems, and technologies as they evolve.  This research provides the scientific basis to recruit, select, assign, promote, educate, train, and retain Soldiers and leaders that comprise a ready and relevant Landpower capability.  The human science applied research conducted in this program element provides knowledge-products, methods, techniques, and tools that will enable the Army to: select Soldiers who are predicted to perform well in future jobs; assign Soldiers to Military Occupational Specialties (MOS) and jobs that better match their skills and abilities; retain an effective career force through improved strategies and behavioral incentives to influence Soldiers to stay in the Army for longer periods of time; accelerate the development of leader critical thinking and interpersonal skills through virtual practice so that junior leaders are more adaptable and prepared for uncertain, rapidly changing missions; develop innovative training strategies for complex battle command skills in network-enabled environments; and design training tools for dismounted squad leadership and team maneuver with ground Soldier systems technologies.  Additional research is focused on training techniques and procedures that make it easier for trainers and training developers to rapidly respond to changes in mission or operational requirements and provide a more synergistic training and education process (e.g., automated and improved diagnostics, coaching and mentoring, performance measures, and feedback methods.\n\nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.\n\nThis project is managed by the U.S. Army Research Institute for the Behavioral and Social Sciences (ARI), Arlington, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.198"
                },
                "CurrentYear": {
                    "val": "18.946"
                },
                "BudgetYearOne": {
                    "val": "19.258"
                },
                "BudgetYearOneBase": {
                    "val": "19.258"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.982"
                },
                "CurrentYear": {
                    "val": "18.917"
                },
                "BudgetYearOne": {
                    "val": "17.781"
                },
                "BudgetYearOneBase": {
                    "val": "17.781"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.216"
                },
                "CurrentYear": {
                    "val": "-0.029"
                },
                "BudgetYearOne": {
                    "val": "-1.477"
                },
                "BudgetYearOneBase": {
                    "val": "-1.477"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.340"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.477"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.477"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.876"
                                },
                                "CurrentYear": {
                                    "val": "-0.029"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "790"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.982"
                        },
                        "CurrentYear": {
                            "val": "18.917"
                        },
                        "BudgetYearOne": {
                            "val": "17.781"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.781"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "18.007"
                        },
                        "BudgetYearThree": {
                            "val": "17.801"
                        },
                        "BudgetYearFour": {
                            "val": "18.019"
                        },
                        "BudgetYearFive": {
                            "val": "18.144"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program element (PE)conducts applied behavioral and social science research that provides non-materiel solutions to ensure that Soldiers can adapt and excel and improve the Army's capability to fully leverage advances in networks, systems, and technologies as they evolve.  This research provides the scientific basis to recruit, select, assign, promote, educate, train, and retain Soldiers and leaders that comprise a ready and relevant Landpower capability.  The human science applied research conducted in this program element provides knowledge-products, methods, techniques, and tools that will enable the Army to: select Soldiers who are predicted to perform well in future jobs; assign Soldiers to Military Occupational Specialties (MOS) and jobs that better match their skills and abilities; retain an effective career force through improved strategies and behavioral incentives to influence Soldiers to stay in the Army for longer periods of time; accelerate the development of leader critical thinking and interpersonal skills through virtual practice so that junior leaders are more adaptable and prepared for uncertain, rapidly changing missions; develop innovative training strategies for complex mission command skills; and design training tools for dismounted squad leadership and team maneuver with ground Soldier systems technologies.  Additional research is focused on training techniques and procedures that make it easier for trainers and training developers to rapidly respond to changes in mission or operational requirements and provide a more synergistic training and education process (e.g., automated and improved diagnostics, coaching and mentoring, performance measures, and feedback methods.\n\nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.\n\nThis project is managed by the U.S. Army Research Institute for the Behavioral and Social Sciences (ARI), Arlington, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that will enable the Army to select Soldiers and officers who are predicted to perform well in future assignments that better match their skills and abilities as well as maintain an effective career force through improved retention strategies and behavioral incentives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted longitudinal (i.e., multiyear) research to validate non-cognitive measures and the extent to which they predict a Soldier's on-going job performance and continued success in the Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.372"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developing non-cognitive measures to identify potential successful Officers (e.g., awarding ROTC scholarships)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.415"
                                            },
                                            "Text": {
                                                "val": "Will continue longitudinal research that validates the predictive quality of non-cognitive measures that can be used to improve selection efficiency; Identify and validate predictors of junior officer performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop training methods and tools based on the science of learning; develop innovative training strategies for complex battle skills; and design innovative training tools and methods to improve Soldiers training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched innovative training methods and technology based on learning sciences; refined tools\/methods for rapid training development to increase relevancy and timeliness of training;  designed and developed methods of diagnostic evaluation of individual and unit performance; and developed cost-effective concepts to integrate live and simulated training in emerging large-scale distributed environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.293"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developing training performance measurement techniques for large scale-distributed training environments and for units training at home station; and identifying strategies to create training tailored to the individual Soldier needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.045"
                                            },
                                            "Text": {
                                                "val": "Will create  training that adapts to the needs of the trainee;  tools that effectively deliver and assess training within technology enabled learning environments;  training approaches and tools (e.g., diagnostic tools, collective training groups, pedagogical interventions) that improve units' ability to develop and manage training."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Leader Development"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop leader development tools and strategies which can accelerate the leader development process and better prepare leaders for uncertain, rapidly changing operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.066"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined techniques and strategies for developing the influence skills of leaders, with particular focus on military advisory training (i.e., training those who are training international partners);  developed and refined a model of multi-team system performance characteristics and effectiveness for joint, interagency, intergovernmental, and multinational (JIIM) teams; and developed measures of socio-cultural capabilities for operational environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developing innovative methods to train skills to operate across a variety of cultures; and identifying emerging battle command and staff skills for full spectrum operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.321"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.321"
                                            },
                                            "Text": {
                                                "val": "Will create methods and strategies to develop leader skills (e.g., cross-cultural competency, strategic thinking for mission command) needed in complex environments and design assessment and training tools for leader development skills."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}