{
    "id": "15b44ddd6e71cffe8ec7857c814321704e1581ef",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0303169D8Z"
        },
        "ProgramElementTitle": {
            "val": "IT Rapid Acquisition"
        },
        "R1LineItemNumber": {
            "val": "175"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.978"
            },
            "CurrentYear": {
                "val": "4.147"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department must rapidly transform its processes in order to better support the agile warfighter.  This PE is dedicated to Rapid Acquisition Incentives – Net Centricity (RAI-NC) which serve DoD by providing RDT&E proof-of-concept early implementation of key initiatives targeted at advancing and moving the Mission Areas of DoD towards Net Centricity.   For example, a coherent and timely transition across DoD Enterprise networks and infrastructure to the next generation of the Internet Protocol, ( IP) IP Version 6 (IPv6), is critical to leveraging the power of information by the business and warfighting mission areas through net-centric operations\/warfare. The PE permits accelerating domain support processes thru rapid proof of concept development and early implementation.  \n\nRAI-NC provides funding for Net Centric initiatives that directly support and facilitate the transformation of the DoD enterprise.   This effort is consistent with the Department’s strategic goals to: enable net-centric operations and warfare, reduce costs; improve efficiency; increase effectiveness by improving the efficiency and effectiveness of process redesign; business systems modernization; strategic sourcing; infrastructure reductions; and optimal-sized inventories.  The objective of RAI-NC is to accelerate DoD’s net centric transformation in support of the warfighter.  Fully achieving net-centricity requires the ubiquity, mobility, security and performance achievable through implementation of the value added features of IPv6.   The DoD IPv6 transition and implementation program has been incorporated into the DoD Unified Capabilities (UC) implementation program.  DoD UC is the integration of voice, video, and\/or data services delivered ubiquitously across an interoperable, secure, and highly available IP network infrastructure, independent of technology, to provide increased mission effectiveness to the warfighter.  DoD UC integrates standards-based communication and collaboration services including, but not limited to:  messaging; voice, video, and Web conferencing; and unified communication and collaboration applications or clients.  These standards-based UC services are integrated with available enterprise applications, both business and warfighting.  As stated earlier, DoD UC includes DoD IPv6 implementation.  The scope of Rapid Acquisition Incentives – Net Centricity encompasses defense policies, processes, people, technologies and systems that guide, perform or support aspects of warfighter support processes within the Department.  Each RAI-NC initiative provides proof of concept sustainability, as well as the scalability necessary for Domain enterprise wide implementation that will allow end-to- end accessibility to net-centric based decision-making information.  Successful implementation will result in more reliable, accurate and timely net- centric management information upon which managers can make more effective business decisions in a timely manner for the Department.  \n\nRAI-NC enables the acceleration of DoD efforts to implement network centric operational environments while providing a secure, flexible, reliable, affordable, integrated network to achieve high effectiveness in joint and combined operations.  This program employs RDT&E funds to plan, develop, prototype and oversee proof of concept initiatives.  Successful initiatives with supporting business cases demonstrating the achieved goals and outcomes and mission area support will be allowed to enter full deployment.  This program is funded under BA-6, Management Support because it includes studies and analyses in support of R&D efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.135"
                },
                "CurrentYear": {
                    "val": "4.288"
                },
                "BudgetYearOne": {
                    "val": "4.270"
                },
                "BudgetYearOneBase": {
                    "val": "4.270"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.978"
                },
                "CurrentYear": {
                    "val": "4.147"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.157"
                },
                "CurrentYear": {
                    "val": "-0.141"
                },
                "BudgetYearOne": {
                    "val": "-4.270"
                },
                "BudgetYearOneBase": {
                    "val": "-4.270"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.157"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.029"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "SBIR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.099"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "STTR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.013"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Efficiency Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.270"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.270"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011:  Includes Department withhold for Secretary of Defense Efficiencies (Studies Contract Efficiency -0.426 million, Service Support Contract Efficiency -0.130 million), Program adjustment -0.157 million.\nFY 2012:  FFRDC reduction -0.029 million, SBIR reduction -0.099 million, STTR reduction -0.013 million.\nFY 2013:  This program will terminate in FY2013 as part of the Secretary of Defense Efficiency reductions.\n\nStudies contract Efficiencies will be realized by reducing the number of studies that we participate in while still supporting enterprise-wide information technology goals critical to DoD Mission.\nService Support Contract efficiencies will be realized by reducing the reliance on DoD Service Support Contractors by utilizing in-house government support in a constrained personnel and resource environment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "169"
                    },
                    "ProjectTitle": {
                        "val": "IT Rapid Acquisition"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.978"
                        },
                        "CurrentYear": {
                            "val": "4.147"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department must rapidly transform its processes in order to better support the agile warfighter.  This PE is dedicated to Rapid Acquisition Incentives – Net Centricity (RAI-NC) which serve DoD by providing RDT&E proof-of-concept early implementation of key initiatives targeted at advancing and moving the Mission Areas of DoD towards Net Centricity.   For example, a coherent and timely transition across DoD Enterprise networks and infrastructure to the next generation of the Internet Protocol, IP version 6 (IPv6) is critical to leveraging the power of information by the business and warfighting mission areas through net-centric operations\/warfare. The PE permits accelerating domain support processes thru rapid proof of concept development and early implementation.  \n\nRAI-NC provides funding for Net Centric initiatives that directly support and facilitate the transformation of the DoD enterprise.   This effort is consistent with the Department’s strategic goals to: enable net-centric operations and warfare, reduce costs; improve efficiency; increase effectiveness by improving the efficiency and effectiveness of process redesign; business systems modernization; strategic sourcing; infrastructure reductions; and optimal-sized inventories.  The objective of RAI-NC is to accelerate DoD’s net centric transformation in support of the warfighter.  Fully achieving net-centricity requires the ubiquity, mobility, security and performance achievable through implementation of the value added features of IPv6.   The scope of Rapid Acquisition Incentives – Net Centricity encompasses defense policies, processes, people, technologies and systems that guide, perform or support aspects of warfighter support processes within the Department.  Each RAI-NC initiative provides proof of concept sustainability, as well as the scalability necessary for Domain enterprise wide implementation that will allow end-to end accessibility to net-centric based decision-making information.  Successful implementation will result in more reliable, accurate and timely net centric management information upon which managers can make more effective business decisions in a timely manner for the Department.  \n\nRAI-NC enables the acceleration of DoD efforts to implement network centric operational environments while providing a secure, flexible, reliable, affordable, integrated network to achieve high effectiveness in joint and combined operations.  This program employs RDT&E funds to plan, develop, prototype and oversee proof of concept initiatives.  Successful initiatives with supporting business cases demonstrating the achieved goals and outcomes and mission area support will be allowed to enter full deployment.  This program is funded under BA-6, Management Support because it includes studies and analyses in support of R&D efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "IT Rapid Acquisition  Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.978"
                                            },
                                            "Text": {
                                                "val": "• Provided oversight and guidance to DISA in developing and refining the NIPRNet\/SIPRNet infrastructures to achieve full IPv6 capability.\n• Continued development of the IT Infrastructure Reference Architecture. \n• Continued development of the Theater Synchronization Plans (TSP) that builds upon the Defense ITIL Catalog.  \n• Collaborated with the National Security Agency (NSA) and the Intelligence Community (IC) to obtain IPv6 Information Assurance (IA) and security guidance documents.\n• Monitored the DoD IPv6 Address Plan implementation to allocate IPv6 address space to DoD Components and the Director of National Intelligence (DNI).\n• Monitored DoD UC and IPv6 implementation funding options.\n• Facilitated IPv6 implementation collaboration efforts between the DoD and the DNI, and participated in IC-DoD IPv6 Collaboration Team and IC Network Integration Steering Group (NISG) meetings.\n•Collaborated with DoD and Federal agencies on IPv6 Test and Evaluation (T&E) and standards issues; and collaborated with the National Institute for Standards and Technology (NIST), reference DoD and NIST IPv6 test and certification processes.\n• Provided oversight for issuance of the DoD Unified Capabilities Requirements (UCR) 2008, Change 2 document.\n• Addressed the U.S. Government (USG) Office of Management and Budget (OMB) FY 2012 and FY 2014 requirements for all Federal agencies to expedite operational deployment and use of IPv6; submitted to OMB the IPv6 Transition Manager Checklist response and consolidated DoD inventory of public-facing web sites. \n• Governed DoD UC\/IPv6 implementation through DoD CIO Executive Board (EB) forums, UC Steering Group (UC SG), UC Industry Advisory Council (UC IAC), IPv6 Stakeholders Working Group (ISWG), and IC NISG.\n• Continued industry and government outreach efforts to facilitate development and implementation of DoD UC policy and processes.\n• Continue development of the IT Infrastructure Reference Architecture and align the ITI ORA with Defense ITIL V2.0 and with the DoD IT Consolidation Roadmap.\n• Expanded the development of the Theater Synchronization Plans (TSP) to support additional COCOMs.\n• Produced CUI category position in concert with USDI for inclusion in emerging Federal standards and policies.\n• Produced new techniques and tools to support implementation and use of CUI markings within the DoD Data Strategy for metadata marking and use in attribute based access control for Identity, Credential and Access Management. \n• Released Enhanced Information Support Plan (EISP) Enterprise Service Version (ESV).\n   o Allows automatic import of authoritative architecture data to increase accuracy of collected information.  \n   o Allows online collaboration between interrelated Program Offices to ensure better coordination in the development of interoperable systems.\n\n• Updated  process for I&S risk analysis within the EISP ESV, reducing burden on PMs by allowing for greater reuse of data\n• Integrated with DISA’s PM Portal to allow for streamlined online reviews via the Interoperability Assessment Module (IAM)\n• Began creation of DoD CIO analytic portal\n   o Developing DoD CIO program health assessment dashboard\n   o Developing user defined queries, visualizations, and reports\n• Extracted, transformed, and loaded  legacy I&S data into the EISP database to allow DoD CIO analysts the  ability to query current and legacy I&S risk and issue data to conduct trend analysis"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.147"
                                            },
                                            "Text": {
                                                "val": "• Continue to provide oversight and guidance to DISA in refining the NIPRNet\/SIPRNet infrastructures to achieve full IPv6 capability.\n• Collaborate with NSA and the IC to obtain IPv6 security device requirements and guidance.\n• Monitor the DoD IPv6 Address Plan implementation to allocate IPv6 address space to DoD Components and the DNI.\n• Monitor DoD UC and IPv6 implementation funding options.\n• Facilitate IPv6 implementation collaboration efforts between the DoD and the DNI.\n• Collaborate with DoD and Federal agencies on IPv6 T&E and standards issues, as well as DoD and NIST IPv6 certification processes.\n• Provide oversight for implementation of the DoD UCR 2008, Change 2 document by DoD Components and the vendor community, and collaborate with DISA on the draft DoD UCR 2008, Change 3 document.\n• Implement UC DoDI 8100.04 to instantiate UC policy, responsibilities, procedures, and processes throughout DoD.\n• Implement the DoD UC MP to establish UC planning guidelines for the DoD Components.\n• Continue to govern DoD UC\/IPv6 implementation through DoD CIO EB forums, UC SG, UC IAC, ISWG, and IC NISG.\n• Continue industry and government outreach efforts to facilitate development and implementation of DoD UC policy and processes.\n• Continue to oversee development of the IT Infrastructure Reference Architecture. \n• Collaborate with DISA and industry to define future UC requirements; and provide overarching guidance, direction, and oversight for DISA’s UCR 2012 document development to further refine UC functional, performance, and technical requirements.\n• Meet the USG OMB FY 2012 requirement to expedite operational deployment and use of IPv6, facilitate meetings of the DoD ISWG to discuss way-ahead for addressing the OMB FY 2014 requirement, and continue to provide oversight and guidance to DoD Components in completing their actions and milestones, as defined in the DoD IPv6 Implementation Guidance & Policy Memo (signed 7 March 2011 by DoD CIO), to address OMB IPv6 requirements.\n• Oversee the implementation of the ITIORA for the Joint bases and expand the IT Infrastructure Reference Architecture to support installations across DoD. \n• Continue to oversee the Theater Synchronization Plans (TSP) and provide support to additional COCOMs focusing in on PACOM.\n• Produce DoD CUI Transition Plan based upon NARA policy and emerging guidance. \n• Implement new techniques and tools to support implementation and use of CUI markings within the DoD Data Strategy for metadata marking and use in attribute- based access control for Identity, Credential, and Access Management. \n• Create web services to import architecture data  directly from Service Architecture repositories and the EISP ESV.\n• Create web services to exchange acquisition data with Joint Staff’s CDTM tool for JCIDS information.\n• Create an analytic portal that allows user-defined queries of authoritative data.\n   o Create DoD CIO analytic dashboards to visualize and evaluate programs and portfolios and to perform program and portfolio health assessments.\n   o Allow users to create visualizations of data, filtered by different criteria (e.g, I&S risks, program health data).\n   o Create user defined reports and outputs, focusing on data requirements of individual analysts (e.g. IPv6 compliance reports, Spectrum reports).\n• Create online, user-driven training on the use of EISP ESV.\n• Create SIPRNET version of EISP Enterprise Service Version (as desired)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Timely development and issuance of policy, guidance, processes, and technologies to build, populate, govern, operate, and protect the Network.\n- Development of plans and implementation activities for net centric data and IPv6 transformation capabilities."
                        }
                    }
                }
            ]
        }
    }
}