{
    "id": "15ffa4ccf0d9a40bbf243d07edb493e3cc463330",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603782N"
        },
        "ProgramElementTitle": {
            "val": "Mine and Expeditionary Warfare Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.206"
            },
            "CurrentYear": {
                "val": "6.048"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "27.254"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE primarily develops and demonstrates prototype Mine Countermeasures (MCM) and Expeditionary Warfare system components that support capabilities enabling Naval Forces to influence operations ashore.  Third-world nations have the capability to procure, stockpile and rapidly deploy all types of naval mines, including new generation mines having sophisticated performance characteristics, throughout the littoral battlespace.  Real world operations have demonstrated the requirement to quickly counter the mine threat.  Advanced technologies must rapidly detect and neutralize all mine types, from deep water to the inland objective.  This program supports the advanced development and integration of sensors, processing, warheads and delivery vehicles to demonstrate improved Naval Warfare capabilities.  It supports the MCM-related Future Naval Capabilities (FNC) Enabling Capabilities (ECs).  Within the Naval Transformation Roadmap, this investment will achieve one of three key transformational capabilities required by Sea Shield as well as technically enable the Ship To Objective Maneuver (STOM) key transformational capability within Sea Strike.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.941"
                },
                "CurrentYear": {
                    "val": "6.048"
                },
                "BudgetYearOne": {
                    "val": "11.864"
                },
                "BudgetYearOneBase": {
                    "val": "11.864"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.206"
                },
                "CurrentYear": {
                    "val": "6.048"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.735"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-11.864"
                },
                "BudgetYearOneBase": {
                    "val": "-11.864"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.623"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-11.864"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.864"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.112"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2917"
                    },
                    "ProjectTitle": {
                        "val": "Shallow Water MCM Demos"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.206"
                        },
                        "CurrentYear": {
                            "val": "6.048"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "27.254"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project primarily develops and demonstrates prototype MCM technologies that support a range of capabilities enabling Naval Forces to influence operations ashore.  Third-world nations have the capability to procure, stockpile and rapidly deploy all types of naval mines, including new generation mines having sophisticated performance characteristics.  Recent operations have demonstrated the requirement to counter the projected mine threat.  Advanced technologies are required to rapidly detect and neutralize all mine types, from deep water to the inland objective.  This project supports the advanced development and integration of sensors, processing, warheads and delivery vehicles.  It supports the MCM-related FNC ECs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MINE\/OBSTACLE DETECTION"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on developing and demonstrating technologies that support detection, classification, identification and multi-sensor data fusion of mine and obstacle data to speed tactical timelines and increase operator standoff.  Efforts include: electro-optic sensors\/systems to enable Unmanned Aerial Vehicle (UAV) rapid minefield reconnaissance and precise mineline location from Very Shallow Water (VSW) through the Beach Zone (BZ); sensors\/systems to enable cooperating Unmanned Underwater Vehicles (UUVs) to perform wide-area reconnaissance and assault lane reconnaissance\/preparation from shallow water through the Surf Zone (SZ); sensor development for detection and classification of buried mines; technologies for MCM Mission Modules for the new Littoral Combat Ships (LCS); and sensor data fusion to enable a theater mine warfare common operating picture and own ship protection.  This activity supports the development and transition of technologies for the MCM-related FNCs.\n\nThis S&T investment supports the Joint Requirements Oversight Council of the Joint Chiefs of Staff and Office of the Chief of Naval Operations (OPNAV) validated requirements for MCM.  This S&T investment of mine and obstacle detection provides critical S&T transitions to the Mine Warfare Mission package of the Navy's new LCS.  This investment in MCM S&T is reported as part of OPNAV's annual report to Congress in the MCM Certification Plan.  This plan is reviewed and approved by the Office of the Secretary of Defense, and any deviations in ONR's reported S&T funding for MCM throughout the Future Years Defense Plan must be reported and justified through Navy and OSD.  Further, the MCM S&T investment plan structure is reviewed and authorized by the Navy's Technology Oversight Group that approves ECs, their supporting products, and funding profiles.\n\nThe FY 2011 to FY 2012 funding decrease is due to the completion of Future Naval Capability (FNC) - SHD-07-01 - Buried Mine Sensor and Processing Development for Detection, Classification and Identification of Buried Sea Mines; MCM Data Fusion Techniques Using Multiple Unmanned Sensors and Systems; MCM Systems for Littoral Combat Ship, Advanced Flight, Mission Modules; and Undersea Cooperative Cueing and Intervention for MCM Operations.\n\nThe FY 2012 to FY 2013 funding decrease is due to the realignment of Future Naval Capabilities (FNCs) SHD-FY10-03 Integrated Forward Looking Sonar - Dual Frequency Synthetic Aperture Sonar (FLS-DFSAS), SHD-FY10-03 Long Range LFBB Sonar (AUV Platform Option), SHD-FY10-03 VSW Acoustic Color-Imaging Sonar, SHD-FY12-04 Compact Modular Sensor-Processing Suite (CMSS), and SHD-FY12-04 Mine Drift Prediction Tactical Decision Aid (TDA) to R2 Activity SEA SHIELD in PE 0603673N."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.788"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued advanced processing development for Low Frequency Broad Band to enable rapid detection, classification and identification of buried sea mines.\n- Continued development of iPUMA\/Synthetic Aperture Sonar system to provide the first non marine mammal based mine detection and classification capability for confined or highly obstructed areas.\n- Continued development of Small Acoustic Color\/Imaging Sonar system to provide the first non marine mammal detection, classification and identification capability for very shallow water (VSW) and reduce the false-alarm rate by x20 for all VSW mine threats.\n- Continued development of Long Range Low Frequency Broadband (LRLFBB) Sonar to significantly increase the minehunting area coverage rate.\n- Completed planning and demonstration for combined assault breaching systems exercise involving the mine detection systems. \n- Completed technology development for multiple UUV\/Unmanned Surface Vehicle (USV) Undersea Cooperative Cueing and Intervention in support of MCM operations. \n- Completed Phase 2 of Advanced Mission Module Technology Development with a final demonstration. \n- Completed development of multi-platform fusion of high-resolution mine hunting systems (e.g. AN\/AQS-20) for improved mine detection and avoidance. \n- Completed multiple unmanned system MCM data fusion techniques for reduction in false alarms and reduction in tactical timelines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all FY 2011 efforts, less those noted as completed above. \n- Initiate development of the compact Modular Sensor Suite for real time detection and classification of surface and near surface moored and drifting mines.\n- Initiate development of Mine Drift Prediction Tactical Decision Aid."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MINE\/OBSTACLE NEUTRALIZATION"
                                    },
                                    "Description": {
                                        "val": "Mine and Obstacle Neutralization activity is focused on improving the capability to neutralize mines and obstacles from deep water through the beach exit zone.  Efforts include the development of technologies for:  stand-off breaching of mines and obstacles in the SZ\/BZ; minesweeping and jamming of sea mines; and Autonomous Underwater Vehicle (AUV) neutralization of sea mines.  Stand-off breaching efforts demonstrate a mine and obstacle breaching capability that is enabled by precision weapon guidance and Intelligence, Surveillance, and Reconnaissance (ISR), and delivered by Naval Tactical Aircraft (TACAIR) and USAF Bombers.  Tactical performance of existing unitary bombs is being demonstrated.  Other efforts will demonstrate a tactical countermine dart and dispenser concept.  The minesweeping effort develops a mission package for deployment on Unmanned Surface Vehicles (USVs).  Also, efforts will focus on improving an existing breaching weapon fuze and developing a precision assault lane marking navigation capability.  This activity supports the development and transition of technologies for the MCM-related FNC ECs.\n\nThe FY 2011 to FY 2012 funding decrease is due to the completion of Future Naval Capability (FNC) - AUV Technology for Neutralization of Littoral Mines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed assault breaching systems exercise involving the unitary warheads, precision navigation and lane marking. \n- Completed development of AUV system\/technologies for neutralization of littoral sea mines. \n- Completed development of autonomous behaviors to improve neutralization efficiency of littoral sea mines. \n- Completed Phase 2 of Advanced Mission Module Technology Development with a final demonstration. \n- Initiated and completed demonstration of autonomous neutralization of littoral sea mines."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The overall metrics of this advanced technology program are the development of technologies supporting the Mine and Expeditionary Warfare challenges of reducing the MCM tactical timeline from months to days and eliminating the need for Navy divers and manned equipment to enter minefields.  Another important metric is the scheduled transition of 6.3 advanced technology projects from the FNCs program into Navy and Marine Corps acquisition programs at agreed upon Technology Readiness Levels.  Technology-specific metrics include: Mine warfare data fusion capabilities yielding a 10%-25% reduction in time and risk to mine hunting activities; Mine hunting sensors - Probability of Detection = 95%, Probability of Identification of Proud Mines = 90%, Probability of Classification of Buried Mines = 80%; Unmanned Systems for MCM sized for inclusion in the Littoral Combat Ship Mine Warfare Mission Package; MCM sensors sized, packaged and capable of 12 hour missions with a search rate greater than .05 square nautical mines per hour; Mine sweeping: Modular magnetic and acoustic influence sweeping systems packaged for deployment from Unmanned Surface Vehicles; Minesweeping single sortie coverage > 9.4 square nautical miles at 20 nautical miles per hour during a 4 hour mission up to Sea State 3; Surface-laid mine and obstacle breaching capability > 90% in the Beach Zone (BZ) using unitary warheads, and > 80% in the Surf Zone (SZ)."
                        }
                    }
                }
            ]
        }
    }
}