{
    "id": "17bb8160a89844ad59de28cd5af2facc57dfde07",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605151D8Z"
        },
        "ProgramElementTitle": {
            "val": "Studies and Analysis Support - OSD"
        },
        "R1LineItemNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "6.457"
            },
            "BudgetYearOneBase": {
                "val": "6.457"
            },
            "BudgetYearTwo": {
                "val": "6.460"
            },
            "BudgetYearThree": {
                "val": "6.566"
            },
            "BudgetYearFour": {
                "val": "6.568"
            },
            "BudgetYearFive": {
                "val": "6.568"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Service programs were established by the Secretary of Defense to improve the training and readiness of the Active and Reserve Components.  This project expedites the prototype development of new training and readiness technologies and Joint Service training and readiness systems, which improve the training and readiness effectiveness and enhance the performance of the military forces.  It also facilitates the sharing of training and readiness information, while allowing for the transfer of emerging and innovative technologies among the Services and private sector.  Efforts have included: development of mission essential tasks; design, development, and implementation of performance metrics, data, and methodologies for the Joint Assessment and Enabling Capability to guide Training Transformation and support the Department’s balanced scorecard and Defense Readiness Reporting System; identified and defined joint urban training requirements, identified methods to conduct effective joint training, and determined best means to develop simulations, military construction, and other urban training facilities that meet Service, joint, and fiscal demands and requirements; developed joint training regimen requirements and investments ranging from the joint strategic level down to the joint tactical level for joint asymmetric warfare; and developed a joint stability and support operations training roadmap and investment plan for operations other than war including peace enforcement, peacekeeping, and humanitarian assistance.\n\nIn addition, this project supports DHRA and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces.  Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs.  Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations.\n\nProgram transferred from the Defense Human Resources Activity starting FY 2013.  This program is not a new start."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.457"
                },
                "BudgetYearOneBase": {
                    "val": "6.457"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.457"
                },
                "BudgetYearOneBase": {
                    "val": "6.457"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer in from Defense Human Resource Activity"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.400"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.400"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.075"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.075"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "General Program Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.018"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Training & Readiness System Development Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.457"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.457"
                        },
                        "BudgetYearTwo": {
                            "val": "6.460"
                        },
                        "BudgetYearThree": {
                            "val": "6.566"
                        },
                        "BudgetYearFour": {
                            "val": "6.568"
                        },
                        "BudgetYearFive": {
                            "val": "6.568"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Service programs were established by the Secretary of Defense to improve the training and readiness of the Active and Reserve Components.  This project expedites the prototype development of new training and readiness technologies and Joint Service training and readiness systems, which improve the training and readiness effectiveness and enhance the performance of the military forces.  It also facilitates the sharing of training and readiness information, while allowing for the transfer of emerging and innovative technologies among the Services and private sector.  Efforts have included: development of mission essential tasks; design, development, and implementation of performance metrics, data, and methodologies for the Joint Assessment and Enabling Capability to guide Training Transformation and support the Department’s balanced scorecard and Defense Readiness Reporting System; identified and defined joint urban training requirements, identified methods to conduct effective joint training, and determined best means to develop simulations, military construction, and other urban training facilities that meet Service, joint, and fiscal demands and requirements; developed joint training regimen requirements and investments ranging from the joint strategic level down to the joint tactical level for joint asymmetric warfare; and developed a joint stability and support operations training roadmap and investment plan for operations other than war including peace enforcement, peacekeeping, and humanitarian assistance.\n\nIn addition, this project supports DHRA and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces.  Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs.  Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations.\n\nProgram transferred from the Defense Human Resources Activity starting FY 2013.  This program is not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Training & Readiness System Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "•  Provided analyses on technical and scientific issues needed to develop a Common Framework for making education, training, and performance\/decision aiding available on demand-anytime, anywhere-and tailored to the specific needs of individual learners, learning objectives, and environments.\n•  Provided support to the Joint Knowledge Development and Distribution Capability for ADL Prototype development in support of Joint Staff and Combatant Commanders.\n•  Provided analysis of current and emerging operational requirements of Combatant Commanders, Training Transformation Joint Management Office and other stake holders to identify major system improvement opportunities.\n•  Continue to develop mission essential tasks.\n•  Provided refinement of the DoD training strategy for the Services, combatant commands and Defense Agencies.\n•  Continued to assist in identifying and analyzing the specific benefits of early and effective incorporation of System Training (ST) details into acquisition programs, particularly those with significant human systems interface requirements.\n•  Continue to improve process model to assist in the integration of the Adaptive Planning process into JTS\n•  Provided review analysis of the changing DoD training posture and requirements and their implications for future training resources and capabilities in the Western Pacific.\n•  Identified the spectrum of requirements the Army will need to address over the coming decade by identifying potential initiatives to improve the match between force design and future employment needs, within expected affordability constraints.\n•  Provided study on “Stress on the Force” identifying specialized capabilities required for Irregular Warfare, Partnership Building, Asymmetric Warfare (e.g. cyber) and Civil Support. Established updated DoD training strategy drafts for Services, combatant commands and Defense Agencies\n•  Conducted several logistics and material readiness reviews\n•  Developed strategies to hedge the risk of the occurrence of a major combat operation\n•  Working with Joint Forces Command (Joint Warfighting Center and Joint Unmanned Aircraft Center of Excellence), the Military Departments and other appropriate organizations, developing a results oriented training concept that addresses the effects of competition and airspace restrictions on training, the opportunities that ground units and UAS personnel have to train together in a joint environment, the maximization of the use of available assets and the use of simulation capabilities to enhance training.\n•  Developing reserve component mobilization training strategies to increase personnel stability, particularly among unit leadership, during the last year before mobilization or entry into the availability pool.\n•  Assessed the effect of enlistment incentives, including educational benefits, on prior and non-prior service reserve component recruiting, training and retention.\n•  Assessment of language, regional, and cultural capabilities and their relationship to unit readiness\n•  Study the drivers that effect time-to-readiness, in particular, the bottlenecks in the readiness generating process and provide a roadmap on how best to incorporate information about how long it will take a unit to be ready\n•  Assess and analyze rates of victim satisfaction with the quality of care and response provided by respective military Services’ Sexual Assault Prevention and Response (SAPR) Program and to measure if the policies that DoD has in place to serve sexual assault victims has positively impact readiness and retention."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "•  Provide  options for reducing force structure;\n•  Provide an assessment and forecast of DoD logistics and material readiness in light of significant programmatic and operational impacts that have occurred and will occur over the next five to ten years.  \n•  Development of criteria for Cyberspace Operations Workforce\n•  Continue to assess the current state of logistics\/material readiness in the Department and track the performance of various logistical and material processes in DoD.\n•  Continue to support prototype development, assessment and application of DoD’s Knowledge Management Systems and Ports.\n•  Analyze estimated rates of personnel instability among unit leadership. \n•  Identify primary underlying causes of instability and assess potential effects of policies to mitigate instability\n•  Continue to develop Virtual Worlds (VW) technology to support Department of Defense (DoD) training.  Provide a VW Framework (VWF) which includes an overarching architecture encompassing a number of VW applications, as well as a VW Roadmap and Governance process to implement the VWF. \n•  Continue to develop strategies to combat “Stress on the Force”\n•  Continue to assess the ongoing requirement for Civil Affairs forces an compare the requirements to the planned future capability and offer recommendations on how to address potential training shortfalls.\n•  Provide options to lower or stop suicide rates\n•  Develop alternative approaches to Force Generation and Management\n•  Determine the feasibility of the Regional Integrated Training Environment (RITE) concept prior to moving forward with a formal strategic communications and education effort and determine best approach for concept implementation.  \n•  Directly informed the decision to continue the outreach and implementation efforts.\n•  Continue to examine how and why the management of war wounded has changed over time and the historic background how the federal government arrived at the current set of polices and possible changes for the future.\n•  Continue to develop reserve component readiness mobilization strategies.\n•  Analyze training requirements for DoD Counterinsurgency implementation plans\n•  Provide senior decision makers access to the readiness data for Non-Standard forces (Ad Hoc\/In-Lieu-Of) prior to their deployment by developing a roadmap and implementation plan to make certain that Non-Standard Forces are assessed in the Defense Readiness reporting System (DRRS) in compliance with Guidance for Employment of the Force (GEF).  \n•  Continue to evaluate and develop potential improvements in the Request for Forces (RFF) process as part of the Global Force Management (GFM) system and identify the Defenses Readiness Reporting System (DRRS) could inform the GFM process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.457"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.457"
                                            },
                                            "Text": {
                                                "val": "•  Continue to develop Virtual Worlds (VW) technology to support Department of Defense (DoD) training.  \n•  A VW Framework (VWF) which includes an overarching architecture encompassing a number of VW applications, as well as a VW Roadmap and Governance process to implement the VWF.  \n•  Continue to monitor and develop strategies to relieve stress on the force.\n•  Continue to analyze training requirement to support the new DoD Strategy for Operating in Cyberspace.\n•  Continue to identify and analyze the specific benefits of early and effective incorporation of system training details into acquisition programs, particularly those with significant human systems interface requirements.\n•  Provide SECDEF options for reducing force structure;\n•  Continue development of criteria for Cyberspace Operations Workforce\n•  Continue to provide options to lower or stop suicide rates\n•  Continue to develop alternative approaches to Force Generation and Management\n•  Continue to examine alternative Courses of Action (COA) for moving RITE from concept to operational capability \n•  Continue to develop and test multiple COAs to provide OASD (RA) leadership with the means to make an informed decision on how best to engage with Services to generate future operational force training and facility cost efficiencies and effectiveness.\n•  Continue to plan and assess training requirements for non-standard force requirements\n•  Assess the effects on readiness and retention on the addition of synthetic cannabinomimetics drugs to the DoD panel of random tested drugs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion. Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures."
                        }
                    }
                }
            ]
        }
    }
}