{
    "id": "1922ded4bb512806367688ef29a482483b7f73e5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603760E"
        },
        "ProgramElementTitle": {
            "val": "COMMAND, CONTROL AND COMMUNICATIONS SYSTEMS"
        },
        "R1LineItemNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "200.593"
            },
            "CurrentYear": {
                "val": "261.606"
            },
            "BudgetYearOne": {
                "val": "237.859"
            },
            "BudgetYearOneBase": {
                "val": "237.859"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "244.941"
            },
            "BudgetYearThree": {
                "val": "245.805"
            },
            "BudgetYearFour": {
                "val": "253.746"
            },
            "BudgetYearFive": {
                "val": "253.523"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Command, Control and Communications Systems program element is budgeted in the Advanced Technology Development Budget Activity because its purpose is to demonstrate and evaluate advanced information systems research and development concepts.\n\nThe goals of the Command and Control Information Systems project are to develop and test innovative, secure architectures and tools to enhance information processing, dissemination and presentation capabilities for the commander.  This will give the commander insight into the disposition of enemy and friendly forces, a joint situational awareness picture that will improve planning, decision-making and execution support capability and provide secure multimedia information interfaces and assured software to \"on the move\" users.  Integration of collection management, planning and battlefield awareness programs is an essential element for achieving battlefield dominance through assured information systems.\n\nThe goals of the Information Integration Systems project are to take diverse data inputs from a variety of sources, efficiently disseminate the information, and perform distributed and dynamic all-source correlation and fusion to produce an integrated, geo-spatially referenced, battlefield database and knowledge-base.  The principal element of this project is assured communications using standard and non-traditional means, on and off the battlefield.\n\nThe goals of the Secure Information and Network Systems project are to develop and test emerging computer, communications, and network systems where the impact of the systems and the vulnerabilities of the systems are not kinetically based.  Network Security technologies arising from other projects will be further identified, developed, integrated, and tested."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "219.809"
                },
                "CurrentYear": {
                    "val": "296.537"
                },
                "BudgetYearOne": {
                    "val": "266.783"
                },
                "BudgetYearOneBase": {
                    "val": "266.783"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "200.593"
                },
                "CurrentYear": {
                    "val": "261.606"
                },
                "BudgetYearOne": {
                    "val": "237.859"
                },
                "BudgetYearOneBase": {
                    "val": "237.859"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-19.216"
                },
                "CurrentYear": {
                    "val": "-34.931"
                },
                "BudgetYearOne": {
                    "val": "-28.924"
                },
                "BudgetYearOneBase": {
                    "val": "-28.924"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-1.117"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-34.931"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-10.442"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.657"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-28.924"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-28.924"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Decrease reflects reductions for the Section 8117 Economic Adjustment, internal below threshold reprogrammings, rescissions and the SBIR\/STTR transfer. \nFY 2012:  Decrease reflects  reductions for unsustained growth and reduction to new starts.\nFY 2013: Decrease reflects the completion of command and control programs such as Resilient C2 and Deep Green and decreases in the classified program area, offset by additional communications and cyber work."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCC-01"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND & CONTROL INFORMATION SYSTEMS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "56.914"
                        },
                        "CurrentYear": {
                            "val": "52.503"
                        },
                        "BudgetYearOne": {
                            "val": "16.487"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.487"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.237"
                        },
                        "BudgetYearThree": {
                            "val": "8.632"
                        },
                        "BudgetYearFour": {
                            "val": "8.632"
                        },
                        "BudgetYearFive": {
                            "val": "11.510"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Military operations since the end of the Cold War show theater-level command, control, communications, and intelligence\/information systems lack the ability to fully support operations in complex, time-critical environments.  Warfighters must be prepared for operations ranging from peacekeeping in urban centers to heavy battle actions in remote areas.  Current capabilities do not provide the commander with real-time, secure, situational awareness or the ability to orchestrate high-tempo planning, rehearsal, and execution.  The programs in this project are developing and testing innovative, secure architectures and tools to enhance information processing, dissemination, and presentation capabilities.  These will provide the commander with insight into the disposition of enemy and friendly forces, a joint situational awareness picture that will improve planning, decision-making, and execution, secure multimedia information interfaces, and software assurance to the warfighter \"on the move.\"  Integration of collection management, planning, and battlefield awareness are essential elements for achieving battlefield dominance through assured information systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ZETA"
                                    },
                                    "Description": {
                                        "val": "The ZETA program is exploring the aspects of novel physical devices, concepts, and techniques that leverage quantum physics for information technology.  Research in this area has the ultimate goal of demonstrating information technology components with radical improvements in power efficiency and\/or computational power relevant to military applications and opportunities.  The program will transition via industrial performers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Continued experimental and theoretical validation of key device physics and qubit assumptions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate improved performance of quantum devices.\n-  Detailed planning for small-scale demonstration of key physical devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.487"
                                            },
                                            "Text": {
                                                "val": "-  Perform small-scale demonstration of key physical devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Command and Control (RC2)"
                                    },
                                    "Description": {
                                        "val": "The Resilient Command and Control (RC2) program is developing a general framework and set of critical mission assurance capabilities to enable Commanders and their staffs to manage the array of C2 systems and architectures (sensor, communications, and information processing) used to conduct operations.  These adaptive, resilient C2 resource planning and re-planning capabilities will ensure mission success in the face of C2 system outages.  Specific technologies being developed under RC2 include advanced analysis, visualization, and planning tools to provide Commanders and their staffs with a dashboard that enables the following capabilities: (1) attain and maintain situation awareness of the C2 architectures; (2) understand mission impact of outages; and (3) realign the C2 systems to ensure the Commander's intent.  The tools and technologies that result from RC2 will enable operators to detect anomalous behavior via intuitive information displays; assess business function impact, including second- and third-order effects; and re-plan how the system can be used to achieve organizational goals and priorities.  Transition is planned to U.S. Pacific Fleet (PACFLT)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.760"
                                            },
                                            "Text": {
                                                "val": "-  Conducted experiments with users at PACFLT.\n-  Participated in an operational exercise (Terminal Fury 11) and demonstrated the collaborative workflow and content classification tools for chat and message traffic at a single node."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.503"
                                            },
                                            "Text": {
                                                "val": "-  Enhance collaborative workflow and content classification tools by adding visualization capabilities and domain specific knowledge to support the intel operational domain.\n-  Conduct experiments with users at PACFLT.\n-  Participate in an operational exercise (Terminal Fury 12) and demonstrate the enhanced collaborative workflow and content classification tools in two operational domains.\n-  Investigate early transition opportunities with Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Green"
                                    },
                                    "Description": {
                                        "val": "Deep Green is a next-generation, battle command and decision support technology that combines anticipatory planning with adaptive execution to help the commander think ahead, identify when a plan is going awry, and prepare options before they are needed.  Deep Green has radically reduced the time needed to plan and execute military operations and will reduce the number of staff officers needed in an operations center.  Deep Green automatically infers the commander's intent and produces a plan from the commander's hand-drawn sketches to facilitate rapid option creation, and plan recognition and understanding capabilities ensure the commander's intent is fully represented in the system.  Deep Green technologies transitioned to the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.631"
                                            },
                                            "Text": {
                                                "val": "-  Extended Deep Green to support multi-echelon operations, including Deep Green systems at brigade and battalion levels coordinating among themselves.\n-  Demonstrated fully-functional, multi-echelon, full-spectrum battle command technology.\n-  Extended the Deep Green system to support both mid-intensity conflict and counter-insurgency operations.\n-  Conducted virtual field exercises with Deep Green at military training facilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Leader Tactical Response, Awareness and Visualization (ULTRA-Vis)"
                                    },
                                    "Description": {
                                        "val": "The Urban Leader Tactical Response, Awareness and Visualization (ULTRA-Vis) program developed an integrated, soldier-worn situational awareness system that allows ground forces  to display iconic representations of blue force locations, tactically relevant targets, and coordinated actions and effects.  The icons are geo-registered on the battlefield and viewed from each warfighter's perspective using a see-through, head-mounted display.  The system enabled soldiers to conduct non-line-of-sight combat operations and maintain situational awareness while on the move.  Information management protocols support the dissemination of tactical information to enable a soldier to direct weapons platforms for real-time collaboration without overload.  ULTRA-Vis technologies allows soldiers to selectively receive and visualize critical combat information using existing, low-bandwidth soldier voice and data radios.  ULTRA-Vis has empowered ground forces with a clear tactical advantage through inter\/intra-squad collaboration, heightened situational awareness and the ability to take decisive action while on-the-move.  The ULTRA-Vis prototype units are under evaluation by the Air Force Special Operations Command (AFSOC), the Army, and the Marines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.523"
                                            },
                                            "Text": {
                                                "val": "-  Created Cursor on Target XML-formatted data displays and information management tools.\n-  Made improvements in function and performance of all sub-components.\n-  Refined the green optical waveguide design to reduce optical distortions and increase efficiency, reducing power consumption.\n-  Enhanced the head-tracking algorithms to support infrastructure-free head tracking using computer vision and Kalman filtering.\n-  Began integration of ULTRA-Vis testbeds to evaluate system functionality and capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-02"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION INTEGRATION SYSTEMS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "87.841"
                        },
                        "CurrentYear": {
                            "val": "88.476"
                        },
                        "BudgetYearOne": {
                            "val": "122.669"
                        },
                        "BudgetYearOneBase": {
                            "val": "122.669"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "121.083"
                        },
                        "BudgetYearThree": {
                            "val": "120.291"
                        },
                        "BudgetYearFour": {
                            "val": "130.291"
                        },
                        "BudgetYearFive": {
                            "val": "129.730"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies that increase network capacity and scaling, enhance spectrum efficiency in congested spectrum, tolerate network degradation, provide man-made and natural electromagnetic interference mitigation, defeat network reconnaissance and surveillance, counter denial of service and other threats, and autonomously move relevant information from the cloud to the edge."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military Networking Protocol (MNP)"
                                    },
                                    "Description": {
                                        "val": "The Military Networking Protocol (MNP) program will create architectures, protocols and network controllers to enhance security and operation of military networks.  MNP technologies will enforce military user authentication, manage military network traffic and automatically configure military networks.  By enforcing military user authentication, military network protocols will provide full attribution of every military device and track each device's network flows to provide full attribution down to the individual source of bad\/erroneous data or malicious activity.  MNP prioritization schemes will be controlled by the military commanders at various echelons to address changing mission requirements.  MNP technologies will transition to DISA and\/or the military Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.750"
                                            },
                                            "Text": {
                                                "val": "-  Initiated the detailed design of the selected MNP architecture and protocols and built prototype network controllers.\n-  Completed initial testing and down-select to a single MNP architecture, protocol and network controller design set.\n-  Coordinated with DISA and the Services to foster program participation and to develop a transition plan for MNP technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.268"
                                            },
                                            "Text": {
                                                "val": "-  Conduct an initial system test and verification of the MNP architecture and protocols.\n-  Continue the refinement and design of the selected MNP architecture, protocols and network controllers.\n-  Increase the scale of the MNP test-bed for the final test and demonstration.\n-  Coordinate with DISA and the Services to continue program participation and to finalize a transition plan and\/or memorandum of agreement for MNP technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.308"
                                            },
                                            "Text": {
                                                "val": "-  Conduct capstone demonstration for MNP system.\n-  Coordinate with Services for use in their information assurance\/computer network defense exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Network after Next (WNaN) and Advanced Wireless Networks for the Soldier (AWNS)"
                                    },
                                    "Description": {
                                        "val": "The Wireless Network after Next (WNaN) and Advanced Wireless Networks for the Soldier (AWNS) program goals are to develop and demonstrate technologies and system concepts that will enable densely deployed radio networks to compensate for limitations of the physical layer of a low-cost wireless node.  WNaN\/AWNS networks will manage node configurations and the topology of the network to reduce the demands on the physical and link layers of the network.  The technology created by the WNaN\/AWNS effort will provide reliable and available battlefield communications at low system cost.  This program will also improve the hardware, firmware, and software to allow the integration of the Joint Tactical Radio System (JTRS) Soldier Radio Waveform (SRW) for backward interoperability to legacy communication systems.  AWNS is also investigating the integration of Multi-User Detection (MUD) and Multiple-Input Multiple Output (MIMO) technology into the WNaN radio platform to position these technologies for transition into the WNaN radio node.  In addition, this effort will investigate Wireless Distributive Computing (WDC), Content Based Access (CBA), and smart antenna technology to enhance the network and node ability to understand the operating environment, mission concept of operations, and node responsibilities to assist in data processing, information dissemination, and accomplishment of military mission objectives.\n\nIn addition, this program will develop a low-cost handheld\/body wearable wireless node that can be used to form high-density adhoc networks and gateways to the Global Information Grid.  This program will also develop robust networking architecture(s) and network technologies\/processes that will exploit high-density node configurations.  AWNS technology is planned for transition to the U.S. Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.596"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated spectrum efficiency and utilization in experimentation and simulation.\n-  Demonstrated ability to integrate and install Type 2 security architecture in radio nodes.\n-  Completed simulations of mobile ad hoc wireless network performance in networks of 1,000 nodes.\n-  Integrated Mobile Networked MIMO (MNM), Multi-User Detection (MUD), and Soldier Radio Waveform (SRW - EW mode) prototypes into radio nodes.\n-  Participated in U.S. Army's Network Integrated Evaluation (NIE).\n-  Explored ability of radio node to perform multi-purpose applications and alternative platform applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.257"
                                            },
                                            "Text": {
                                                "val": "-  Integrate MUD and MIMO into the system so all waveform types are available for various communication conditions to improve network performance.\n-  Integrate Wireless Distributed Computing (WDC), Content Based Access (CBA), and associated networking functions to support transformative application functionality.\n-  Develop real-time network performance monitoring, remote agent control for WNAN for C4ISR applications, and advanced security gateway and guard micro chips and modular security architecture.\n-  Integrate smart antenna capabilities into radio nodes.\n-  Develop algorithms and performance capabilities to enable network scaling to > 1,000 nodes.  \n-  Perform experiments utilizing transformational applications within the WNaN node.\n-  Perform network integration evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.565"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.565"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate capability to integrate transformation applications in an integrated network environment.\n-  Complete development of radio nodes capable of MIMO, MUD, WDC, Dynamic Spectrum Awareness, and related technologies to improve network performance, and increase network scalability without increasing spectrum need.\n-  Demonstrate real-time network performance monitoring, enhanced network architecture to support networking amongst sensors, robots, soldiers, Unmanned Air Vehicles and Remotely Piloted Vehicles, and an advanced security gateway using modular security architecture.\n-  Demonstrate network scaling to support brigade-level utility > 1,000 nodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications Under Extreme RF Spectrum Conditions (CommEx)"
                                    },
                                    "Description": {
                                        "val": "The Communications Under Extreme RF Spectrum Conditions (CommEx) program will develop signal detection and reasoning technology that will allow radios to recognize interference and jamming attacks and then adapt to maintain communications, even in the presence of cognitive jammer attacks and dynamic interference of multiple cognitive network interactions.  The program will develop models of adversary, commercial, and friendly cognitive radios and implement those models in a \"reasoner\" that assesses, in real time, the current and future dynamics of the communications network.  Core technologies for operation in highly dynamic and\/or high jamming to signal environments will be developed to include: automated jamming waveform forensics; RF Environment assessment (time, space, frequency, polarization); technologies for addressing known attack strategies and interference properties; and antenna, RF, signal processing, modulation, and network optimization technology.  Based on predictions of the level of communication success compared to mission communication requirements, the \"reasoner\" within the cognitive radio will choose waveform selections\/configurations that best achieve mission objectives.  The \"reasoner\" will include the capability to analyze and select optimum frequency, waveform, and network configurations during all aspects of a mission, to include initial alert, ingress, mission, and exfiltration.  The design effort will lead to new radio communication architectures, more robust radio communication networking, and better understanding of selection amongst interference avoidance and interference suppression strategies.\n\nThis program also seeks to enable communication between dispersed and distributed emitters and receivers to provide a multiplier in capacity for both locating emitters and assessing effectiveness of an electronic attack.  The CommEx technology is planned for transition to the U.S. Army, Air Force, and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Developed algorithms to measure cognitive radio jammers and communication network behaviors that sufficiently characterize state space and behavior.\n-  Established baseline sensor performance requirements.\n-  Developed efficient model structures of communication links, interference networks, essential metrics, and transforms.\n-  Defined what resources are available to handheld, vehicular, airborne, or shipboard communication platforms and determined the level of performance able to be achieved for each platform.\n-  Developed efficient distributed algorithms and implemented hardware prototypes for carrier frequency offset and frame synchronization.\n-  Developed efficient algorithms for channel estimation, computation and distribution of network information; designed the associated protocols.\n-  Initiated development of smart antenna technology that can provide deep nulls for use against jammers.\n-  Initiated development of Government test-bed that will be used to evaluate approaches being developed by performers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate algorithms to measure cognitive radio jammers and communication network behaviors that sufficiently characterize state space and behavior.\n-  Integrate live hardware into the detailed experiments to assure that dynamic range, realistic multipath and clutter, and implementation-specific simulations are analyzed with sufficient rigor to assure performance in live hardware.\n-  Perform experiments and simulations that model legacy waveforms and interference sources not previously seen by the system.\n-  Develop hardware, firmware, and software using CommEx technologies, and corresponding application programming interfaces and drivers in the radio to understand and control system performance.\n-  Demonstrate ability of smart antenna technology to create deep nulls.\n-  Emulate hardware, firmware, and software using prototyping technologies, and develop corresponding application programming interfaces and drivers to understand and control system performance.\n-  Demonstrate distributed Multiple-Input Multiple-Output (MIMO) techniques for spatial beam control, interference mitigation, and communication range extension on testbeds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.265"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.265"
                                            },
                                            "Text": {
                                                "val": "-  Integrate CommEx technology into operational platforms for transition experimentation.\n-  Execute evaluations and demonstrations using actual systems in military environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational Leverage Against Surveillance Systems (CLASS)*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of the CommEx program.  \n\nCommercial Test and Measurement equipment has advanced greatly with the emergence of sophisticated cellular and wireless local area network technology and can be used to intercept, analyze and exploit our military communications signals.  Building upon technologies investigated under the COMMEX Program, the Computational Leverage Against Surveillance Systems (CLASS) program seeks new ways to protect our signals from increasingly sophisticated adversaries and to do so in a way that can be maintained as technology advances.  Three different techniques are being developed: 1) Waveform Complexity uses advanced communications waveforms that are difficult to recover without knowledge and understanding of the signals itself; 2) Spatial Diversity uses distributed communications devices and the communication environment to disguise and dynamically vary the apparent location of the signal;  3) Interference Exploitation makes use of the clutter in the signal environment to make it difficult for an adversary to isolate a particular signal.  The objective of the program is to make modular communications technology that is inexpensive to incorporate in existing and emerging radio systems (<$100 incremental cost) but pushes adversaries to need more than 1,000x our processing power - \"supercomputer\" level processing power.  Technologies from this program are planned to transfer to the U.S. Army's Communications - Electronics Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Began investigating spatial diversity technology approaches.\n-  Initiated design of the system architecture to combine novel waveforms, special diversity techniques and interference mitigation approaches to enable anti-geolocation.\n-  Initiated development of the CLASS technology test bed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of waveform complexity and interference exploitation technologies.\n-  Initiate the integrated circuit system integration process.\n-  Complete test bed development and evaluate the performance of candidate technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.200"
                                            },
                                            "Text": {
                                                "val": "-  Integrate hardware and firmware technology into volume integrated circuits.\n-  Develop test and application driver software for CLASS technology.\n-  Initiate development of modular CLASS products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Content-Based Mobile Edge Networking (CBMEN)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly known as Cloud to the Edge\n\nThe goal of this program is to provide tactical warfighters operating at the edge with interactive, on-demand access to relevant information and a greater ability for real-time sharing of new operational content.  This content can include images, video, maps, and databases.  Ubiquitous access to relevant situational awareness and command and control information throughout the battle space is a key objective.  Advances in key technologies are enabling high-capacity communications to the edge.  However, the current centralized or regional storage and dissemination of information presents security, reliability, and capacity challenges in identifying and distributing relevant information to users at the edge.  Commercial industry has developed approaches to the autonomous dissemination of high demand information by using distributed servers and advanced networking and information database technologies, combined with highly-reliable fixed networking infrastructure with embedded complex information exploitation tools.  This program will leverage commercial capabilities to develop and demonstrate the technologies and prototype systems in networking, servers, and information dissemination techniques to enable efficient, and robust content distribution using dynamic, mobile, ad hoc military networks.  Capabilities from this effort will transition to the DoD."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop base and objective metrics for scenarios and simulation development for program evaluation and analysis.\n-  Develop software architectures for distributed data dissemination and technologies for dynamic networks.\n-  Begin development of hardware and software integrated environments to demonstrate CBMEN technologies.\n-  Begin development of key enabling technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.831"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.831"
                                            },
                                            "Text": {
                                                "val": "-  Develop extended small unit scenarios for simulation and demonstration.\n-  Extend CBMEN software architecture for security and efficiency.\n-  Integrate hardware and software products to demonstrate CBMEN technologies in small unit scenario.\n-  Demonstrate limited content applications in a dynamic small unit mobile environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Hot Spots"
                                    },
                                    "Description": {
                                        "val": "Communications requirements are growing exponentially due to the proliferation of high-data rate sensors (video), UAVs, and the emergence of the Soldier\/Marine as both an operator and a sensor.  Available spectrum is static and this data growth has created a 100-1,000x mismatch of data needs and available network capacity.  Mobile Hot Spots will provide an analog to the commercial wired solution to exploding high bandwidth requirements that relies on a hierarchical approach using core networks, regional\/neighborhood distribution networks, and distributed access points.  This program will develop the high data rate mobile communications technologies that are required to close the capacity gap and create spectrally efficient, and secure wireless technologies by exploiting advances in high-frequency millimeter wave and optical communications technologies.  This effort will leverage commercial off the shelf short range, high speed communications access portals and scalable high data rate networking technologies.  Trade-offs between scaling capacity, high data rate, communications overhead, system overhead (size, weight, and power), and mobility will be addressed.  The Mobile Hot Spots program is targeted to transition to the Army and Marine Corps Expeditionary Forces."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop hardware and networking architectures for regional and local reliable, high capacity \/ high speed networks.\n-  Develop physical layer, data layer, and network layer security solutions.\n-  Initiate development of technologies for short range, high data rate networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.100"
                                            },
                                            "Text": {
                                                "val": "-  Explore hardware, software, and waveform options in a network topology to include unmanned aerial systems, soldiers, and mobile platforms.\n-  Develop methods to support spectrally efficient, high capacity activity in the communication networks.\n-  Develop Hot Spot service interfaces to high demand applications.\n-  Initiate security solution technology development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fixed Wireless at a Distance"
                                    },
                                    "Description": {
                                        "val": "Unlike commercial wireless communications, the military cannot count on a set of secure, fixed cell towers to establish wireless networks capable of receiving and distributing large amounts of data from distributed sources.  Rather, such communication must rely on approaches such as balloons and temporary communication towers that have a high logistical burden and are extremely vulnerable.  Building upon technologies investigated under other programs in this project, the Fixed Wireless at a Distance program will overcome these limitations by developing a re-locatable, long-range (10-100s of km) communication infrastructure that provides high-capacity (10s of Mbps) data links from within a protected space.  The key innovation in this program is the use of a large number of rapidly deployable, distributed, ground-based antenna arrays that can form a coherent aperture for directional transmission and reception of information to\/from tactical wireless networks.  Program challenges include the fundamental limits (power and extent) of transmitter gain as well as the rapid and practical deployment of the ground-based arrays.  When completed, the Fixed Wireless at a Distance program will extend the reach of tactical communication systems by 10X without the need for vulnerable and costly infrastructure.  This technology is planned to transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.100"
                                            },
                                            "Text": {
                                                "val": "-  Assess the fundamental limits of transmitter gain for a distributed ground-based wireless network.\n-  Initiate assessment of ground-based array to determine the required characteristics (number or antennas, spatial diversity, power) to enable 10X improvement in the range of tactical communication systems.\n-  Develop concepts for rapidly deploying and re-deploying antenna arrays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced RF Mapping"
                                    },
                                    "Description": {
                                        "val": "One of the key advantages on the battlefield is the ability to actively sense and manipulate the RF environment, enabling secure communications as well as effectively mapping and manipulating the adversary's communications in ways that defy their awareness, understanding, or response.  Current approaches for dealing with RF are emitter-based, with the signal processing techniques focused on array and time based processing for each emitter.  As the RF environment becomes more complex and cluttered, the number of strategic assets and commensurate signal processing inhibits effectiveness and sustainability to sense and manipulate at the precision (time, frequency, and space) required for effective action.  To address these shortfalls, the Advanced RF Mapping program will develop and demonstrate new concepts for sensing the RF environment based on distributed rather than emitter-based collection.  These concepts take advantage of the proliferation of RF devices (radios, cell phones) on the battlefield.  To use these devices effectively, the program will develop new algorithms that can map the RF environment with minimal communication load between sensors.  It will also develop approaches for exploiting our precise knowledge of the RF environment and the distributed proximity of the RF devices to provide secure communications for our warfighter as well as to infiltrate or negate our adversaries' communications networks.  For example, if synchronizing distributed elements to <10 picosecond is achievable, coherent RF power projection at UHF frequencies from distributed devices would be possible.  Building upon technologies investigated under other programs in this project, the Advanced RF Mapping program will enable both offensive and defensive operations in complex RF environments.  Advanced RF Mapping technology is planned to transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "-  Establish baseline capabilities for RF collection from distributed devices in complex RF environments. \n-  Initiate the development of algorithms for exploiting distributed RF collections into a full environmental map of frequency and space as a function of time.\n-  Begin assessment of feasibility of synchronization of distributed elements to provide precision RF effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Highly Networked Force"
                                    },
                                    "Description": {
                                        "val": "A highly networked and enabled force increases efficiency, effectiveness, and safety while reducing cost by making the right information available at the right time to every person and system that needs it.  Accomplishing this depends on providing reliable wireless communications to all U.S. forces, platforms, and devices in all phases of conflict.  The Highly Networked Force program seeks to overcome key limitations of current technology to realize the fully network-enabled force by addressing issues such as: lack of coverage due to operation in challenged locations or loss of relays or links; lack of capacity due to inefficient allocation of scarce spectral resources; lack of connectivity due to networks that cannot keep up with the high rate of change; and lack of expected service due to uncoordinated management of sub-networks and gateways.  Technologies developed under this program will be transitioned to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods to improve end user coverage through cooperation between overlapping heterogeneous networks or communication systems, and through new relay and physical layer designs.\n-  Investigate potential for sharing spectrum between radar and communication systems and develop architectures for spectrum sharing between multiple cooperating systems.\n-  Investigate new routing, naming, and networking mechanisms optimized for highly dynamic wireless environments.\n-  Develop and analyze architectures for coordinated enterprise-level management of networks and gateways."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical & RF Combined Link Experiment (ORCLE)"
                                    },
                                    "Description": {
                                        "val": "The Optical & RF Combined Link Experiment (ORCLE) program seeks to develop combined radio frequency (RF) and free space optical (FSO) communications as well as networking technologies that exploit the benefits of complementary path diversity.  This effort encompasses the extension of research into the FSO\/RF Internet Protocol-based Network system, called Optical RF Communications Adjunct (ORCA).  Using optical and RF communication techniques, ORCLE will demonstrate improved battlespace communications using a hybrid RF and FSO link in air-to-air-to-ground environments.  The central challenge is to enable optical communications bandwidth without giving up RF reliability, regardless of the weather.  ORCLE will develop RF and FSO propagation channel analysis, coding techniques, and modeling to include weather, atmospherics, and aero-optics to provide the joint force commander assured high-data rate communications.  The technical objective is to prototype and flight demonstrate hybrid FSO\/RF air-to-air-to-ground links that combine the best attributes of both technologies and simulate hybrid network performance.  The ORCLE technology is planned for transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.070"
                                            },
                                            "Text": {
                                                "val": "-  Improved and tested FSO communications terminals that use adaptive optics (AO) to increase the coupling efficiency of received laser light, while reducing overall received power variations.\n-  Developed and tested an optical modem and forward error correction (FEC) system that, combined with the Optical Automatic Gain Control (OAGC), demonstrated greatly improved receiver sensitivities.\n-  Completed build and began testing a high-speed multifunction hybrid router capable of delivering over 10 Gbps per channel while providing node discovery, Mobile Ad Hoc Network (MANET) formation, differentiation of services, and retransmission of lost packets.\n-  Began assembly and installation of prototype systems on three aircraft and two ground terminals for data distribution as well as battlefield command and control experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.951"
                                            },
                                            "Text": {
                                                "val": "-  Execute final testing of a 4 node network (3 air nodes and one ground node) to demonstrate hybrid high data rate FSO\/RF and advanced network capabilities that provide information data rates sufficient for current military needs and mission requirements.\n-  Validate the ability to provide the warfighter with low latency information for command and control as well as Intelligence, Surveillance, and Reconnaissance (ISR) requirements.\n-  Demonstrate network instantiation and user interfaces to allow high data rate command and control at multiple levels.\n-  Demonstrate the data exfiltration capability by transmitting data from the Blue Devil Block 2 Airship operating at an altitude of 25,000 feet to a ground node positioned at a distance greater than 50 km from the Airship. \n-  Complete transition of the technology to the Air Force\/Big Safari."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Enabled by WDM-Highly Integrated Photonics (NEW-HIP)"
                                    },
                                    "Description": {
                                        "val": "The Network Enabled by WDM-Highly Integrated Photonics (NEW-HIP) program facilitated building or upgrading military aircraft and other aerospace platforms with a wavelength division multiplexed (WDM) single-mode fiber-optic networking infrastructure.  NEW-HIP has many capabilities that are well beyond those of currently used copper- and multi-mode-fiber-based technologies.  Originally, the program focused on specific technologies for application on the Navy's EA-6B Prowler aircraft; however, the program was broadened to focus on technologies to provide advanced capabilities to a multitude of military aircraft.  The technologies developed under this program will be incorporated into military aircraft, including tactical aircraft, UAVs, wide-bodied aircraft, and rotorcraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.998"
                                            },
                                            "Text": {
                                                "val": "-  Continued development of the key optoelectronic digital and analog networking components with respect to performance, size, weight, power, and environmental requirements.\n-  Conducted packaging and environmental testing of the key optoelectronic digital networking components.\n-  Supported a Navy study to investigate the application of NEW-HIP technology to the surface and subsurface fleet.\n-  Investigated the application of NEW-HIP to other tactical platforms, such as the Navy H-60 Helicopter, the Air Force F-22, and the Army Apache Helicopter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analog Logic"
                                    },
                                    "Description": {
                                        "val": "The Analog Logic program developed and demonstrated architectures, designs, and development tools for implementing computational functions in analog circuitry to overcome performance limitations inherent in digital designs.  This program applied the technologies to signal processing functions typically performed in digital form, which experience design complexity, high power consumption, thermal loads, limits to computational speeds, loss in dynamic range, and susceptibility to manufacturing variances.  The Analog Logic program built and demonstrated an analog-only signal processing capability with no local oscillator, down-conversion, or analog-to-digital conversion.  The goal was to achieve a 10 times reduction in gate count, a 1024 Point Fast-Fourier Transform (FFT) with 8 bits equivalent dynamic range, and functional performance within 0.5dB of digital performance.  Further, the program investigated the system-level impact of Analog Logic on other embedded processing problems as well as the feasibility of creating programmable embedded processing solutions in this technology.  This program will transition to both Industry and NSA."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.650"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated 1024-point FFT integrated circuit with 10.6 bits of measured dynamic range and >50x reduction in power consumption over state-of-art FFT implementations.\n-  Demonstrated an FFT-based convolution engine with 10-bit programmable coefficient resolution, which is capable of realizing arbitrary filter transfer functions.\n-  Demonstrated analog memory cells with 6-bits of information storage capacity per cell."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Networked Multiple-Input\/Multiple-Output (MIMO) (MNM)"
                                    },
                                    "Description": {
                                        "val": "The Mobile Networked Multiple-Input\/Multiple-Output (MIMO) (MNM) program pursued MIMO communication systems, which have the potential to increase data rates by 10-50 times those of current systems.  MIMO uses multiple antennas to create parallel channels in the same frequency band, thereby increasing spectral efficiency.  This effort demonstrated the MNM capability under dynamic urban Non-Line-of-Sight multipath channel conditions where conventional techniques are degraded.  This effort also advanced MIMO technology development and performed field demonstrations of mobile ad hoc networks (MANETs), culminating in the development of a wideband form-factor system for use in tactical edge devices, such as troops, vehicles, and robotics.  The MNM technology is planned for transition to the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.483"
                                            },
                                            "Text": {
                                                "val": "-  Designed, built, tested, and demonstrated MIMO capabilities in a handheld, body-wearable, and other form-factors of multichannel radio that utilizes high volume, low cost commercial off-the-shelf RF circuits, narrowband tuning filters, and dual-core digital signal processors.\n-  Demonstrated MIMO capability in a wideband small form-factor system in urban, rural, airborne, and shipboard terrain.\n-  Performed network demonstration of MNM in handheld unit in a fieldable form-factor.\n-  Demonstrated range enhancement and RF power efficiencies due to MIMO."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Ad Hoc Interoperability Networking GATEway (MAINGATE)"
                                    },
                                    "Description": {
                                        "val": "Building upon gateway technology developed under the WNaN and Future Combat Systems (FCS) Communications program, the Mobile Ad hoc Interoperability Networking GATEway (MAINGATE) program developed the next generation Network Centric Radio System (NCRS) with additional capabilities.  MAINGATE enables heterogeneous groups of radios to be integrated into a heterogeneous network tolerant to high latency and packet loss.  The technologies developed for the program permit affordable, tactical, real-time, and high-fidelity video, data, and voice services for deployment in a networked environment to support tactical operations in maneuvering or dismounted operations for line-of-sight (LOS) and beyond-line-of-sight (BLOS) communications, both on the move (OTM) and at the halt (ATH).  The resulting MAINGATE system and capability is under evaluation for possible transition for the U.S. Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.294"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced the MAINGATE system units by expanding RF spectrum coverage, increasing user data rate, and improving link reliability.\n-  Conducted in-theater and CONUS field evaluations of units performing Intelligence, Surveillance, and Reconnaissance\/Command and Control (ISR\/C2) networking radio interoperability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NAVY PE 0603251N"
                                    },
                                    "Title": {
                                        "val": "2777:  Highly Integrated Photonics (HIP) Naval Networking"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-04"
                    },
                    "ProjectTitle": {
                        "val": "SECURE INFORMATION AND NETWORK SYSTEMS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.400"
                        },
                        "CurrentYear": {
                            "val": "32.030"
                        },
                        "BudgetYearOne": {
                            "val": "42.840"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.840"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "53.520"
                        },
                        "BudgetYearThree": {
                            "val": "54.210"
                        },
                        "BudgetYearFour": {
                            "val": "55.000"
                        },
                        "BudgetYearFive": {
                            "val": "55.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Computer, networking, and communication technologies have rapidly matured in the last decade and have had a profound effect on DoD weapons systems.  In many instances the combination of those technologies has become either the integral piece of many of the emerging traditional land, air, and sea based weapon platforms or have become a stand alone, non-platform based virtual weapon system.  In recognition of this fact, the Secure Information and Network Systems project will develop and test emerging computer, communications, and network systems where the impact of the systems and the vulnerabilities of the systems are not kinetically based.  The project will develop, integrate, and test prototypes of promising network security technologies generated in projects such as, but not limited to, those developed in DARPA's Information & Communications Program Element (PE 0602303E) and Cognitive Computing Systems Program Element (PE 0602304E)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Software Development using Binary Components (RAPID)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Software Development using Binary Components (RAPID) program will develop a system to identify and extract software components for reuse in new applications.  The DoD has critical applications that must be ported to future operating systems.  In many cases, the application source code is no longer available requiring these applications to continue to run on insecure and out-dated operating systems, impacting day-to-day operations.  RAPID technologies will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Text": {
                                                "val": "-  Conceptualized an approach to technology refresh for critical defense software based on new approaches in binary executable program analysis, in particular by identifying and automatically extracting program functional components. \n-  Identified multiple key legacy target applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.030"
                                            },
                                            "Text": {
                                                "val": "-  Identify a baseline intermediary representative language specification for the RAPID system. \n-  Design and prototype RAPID system architectures to enable functional identification and functional extraction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.340"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.340"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the proof-of-concept system, showing identification, extraction and combination of components.\n-  Complete an initial implementation of the user interface."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Insider Threat (CINDER)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Insider Threat (CINDER) program will develop technologies for identifying advanced cyber threat missions that may be currently ongoing within DoD and government interest systems and networks.  The program focuses on identifying ongoing adversary missions rather than a person, program, or particular piece of malware.  Current cyber defenses are primarily based on network and host intrusion detection and look for break-ins and abnormal behavior without context.  The CINDER program will build tools and techniques that apply mission templates of advanced cyber espionage onto seemingly normal internal system and network activity.  Through this CINDER will uncover ongoing advanced persistent cyber threats and espionage within our cyber environments.  Capabilities from this program will transition to DoD and\/or the defense industrial base."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify constraints for each class\/mission and demonstrate constraint detection methodologies.\n-  Quantify probability of detection and probability of false alarm as a function of adversary class and mission for each system.\n-  Design and build scalable prototype systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate adversary missions and observables on targeted systems.\n-  Demonstrate cyber espionage detection capability on Government data sets.\n-  Evaluate avoidance and obfuscation tactics against mission template detection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-CLS"
                    },
                    "ProjectTitle": {
                        "val": "CLASSIFIED"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.438"
                        },
                        "CurrentYear": {
                            "val": "88.597"
                        },
                        "BudgetYearOne": {
                            "val": "55.863"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.863"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "62.101"
                        },
                        "BudgetYearThree": {
                            "val": "62.672"
                        },
                        "BudgetYearFour": {
                            "val": "59.823"
                        },
                        "BudgetYearFive": {
                            "val": "57.283"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.438"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "88.597"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.863"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.863"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}