{
    "id": "1d11baf553f1c54a7eb13c28b853da286091d3b4",
    "meta": {
        "filename": "dod-2013_RDTE_2013_CBDP_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2013.zzz_unzipped_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (RDT&E MGT SUPPORT)"
        },
        "R1LineItemNumber": {
            "val": "152"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "118.931"
            },
            "CurrentYear": {
                "val": "92.806"
            },
            "BudgetYearOne": {
                "val": "92.849"
            },
            "BudgetYearOneBase": {
                "val": "92.849"
            },
            "BudgetYearTwo": {
                "val": "94.721"
            },
            "BudgetYearThree": {
                "val": "95.626"
            },
            "BudgetYearFour": {
                "val": "86.940"
            },
            "BudgetYearFive": {
                "val": "87.270"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Budget Activity includes research, development, testing and evaluation management support for the Department of Defense (DoD) Chemical and Biological Defense Program (CBDP) and includes the CBDP Small Business Innovative Research (SBIR) program.\n\nProgram Element 0605384BP supports Joint Doctrine and Training (Project DT6), sustains the technical test capability at West Desert Test Center (WDTC) (Project DW6); sustains the core Department of Defense (DoD) Science and Technology (S&T) laboratory infrastructure (Project LS6), provides for program management and financial management support (Project MS6), and supports the Joint Concept Development and Experimentation (JCDE) program (Project O49).   \n\nThe Joint Training and Doctrine Support (DT6) project funds development of Joint Doctrine and Tactics, Techniques, and Procedures (TTPs) for developing CB defense systems.  This project also funds CB modeling and simulation to support the Warfighter.\n\nThe Major Range and Test Facility Base (MRTFB) is a set of test installations, facilities, and ranges which are regarded as \"national assets\".  These assets are sized, operated, and maintained primarily for DoD test and evaluation missions.  However, the MRTFB facilities and ranges are also available to commercial and other users on a reimbursable basis.  WDTC is designated as the primary element of the MRTFB to primarily conduct CB Defense test and evaluation.  The DW6 Project provides operating funds to WDTC in accordance with the National Defense Authorization Act of 2003 (Public Law 107-314 - section 232) to ensure that DoD test customers are only charged direct costs of testing and that overhead expenses are centrally funded.  It finances the required institutional test operating costs.  Institutional test operating costs include institutional civilian and contractor labor; repair and maintenance of test instrumentation, equipment, and facilities; and replacement of test equipment.\n\nThe Laboratory Support (LS6) project funds laboratory infrastructure to maintain and enhance DoD infrastructure capabilities to counter an expanding threat space, exploit advances in technology; and develop and transition CB defense equipment and countermeasures to the Warfighter.\n\nThe management support (MS6) project, provides management support for the DoD CBDP to allow program overview and integration of overall medical and non-medical programs by the Assistant to the Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs (ATSD(NCB)), through the Deputy Assistant to the Secretary of Defense for Chemical Biological Defense and Chemical Demilitarization Programs (DATSD(CBD\/CD)); funds management by the Defense Threat Reduction Agency (DTRA); integration of Joint requirements, management of training and doctrine by the Joint Requirements Office (JRO); Joint RDA planning, input to the Annual Report to Congress and Program Objective Memorandum (POM) development by the Program Analysis and Integration Office (PA&IO); review of Joint plans and the consolidated CB Defense POM Strategy by Army in its Executive Agent role.  \n\nThe management support project also funds the Test and Evaluation (T&E) Executive mission to establish test infrastructure investment strategy and adequate testing for Developmental Testing (DT) and Operational Testing (OT) of Department of Defense (DoD) Chemical Biological Defense (CBD) systems and components throughout the systems' acquisition life cycle, as required in the RDA Plan under the JTIWG program.  The JTIWG program funds T&E Early Involvement, test threat planning, Fielded Equipment Assessments, T&E studies, and T&E Standards planning and development to support testing the CBD systems for all services to include radiological, nuclear, medical T&E efforts.  \n\nThe Joint Concept Development and Experimentation (O49) project funds the planning, conduct, evaluation, and reporting on Joint tests (for other than developmental hardware) and accomplishment of operational research assessments in response to requirements received from the Services and the Combatant Commanders for already fielded equipment and systems.\n\nThis Budget Activity also funds Program Element 0605502BP, which supports the Small Business Innovative Research (SBIR) program.  The overall objective of the Chemical and Biological Defense (CBD) SBIR program is to improve the transition or transfer of innovative CBD technologies between DoD components and the private sector for mutual benefit.  The CBD program includes those technology efforts that maximize a strong defensive posture in a CB environment using passive and active means as deterrents.  These technologies include CB detection; information assessment (identification, modeling, and intelligence); contamination avoidance; and protection of both individual soldiers and equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "120.995"
                },
                "CurrentYear": {
                    "val": "92.806"
                },
                "BudgetYearOne": {
                    "val": "104.018"
                },
                "BudgetYearOneBase": {
                    "val": "104.018"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "118.931"
                },
                "CurrentYear": {
                    "val": "92.806"
                },
                "BudgetYearOne": {
                    "val": "92.849"
                },
                "BudgetYearOneBase": {
                    "val": "92.849"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.064"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-11.169"
                },
                "BudgetYearOneBase": {
                    "val": "-11.169"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.449"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.615"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-11.169"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.169"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY13\n-$11,169M Other Adjustments (DT6 -$699K; DW6 -$2,211K; LS6 -$6,749K; MS6 -$1,202K; O49 -$308K).\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DT6"
                    },
                    "ProjectTitle": {
                        "val": "JOINT DOCTRINE AND TRAINING SUPPORT (RDT&E MGT SUPPORT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.285"
                        },
                        "CurrentYear": {
                            "val": "5.132"
                        },
                        "BudgetYearOne": {
                            "val": "4.314"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.314"
                        },
                        "BudgetYearTwo": {
                            "val": "4.459"
                        },
                        "BudgetYearThree": {
                            "val": "4.562"
                        },
                        "BudgetYearFour": {
                            "val": "4.659"
                        },
                        "BudgetYearFive": {
                            "val": "4.659"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The activities of this project directly support the Joint Service CB defense program; in particular, the development of Joint Chemical, Biological, Radiological, and Nuclear (CBRN) defense capability requirements and the improvement of CBRN defense related doctrine, education, training, and awareness at the Joint and Service levels.  This effort provides for: (1) Development, coordination, and integration of Joint CBRN defense capability requirements; (2) Development\/revision of medical and non-medical CBRN defense Multi-Service Tactics, Techniques, and Procedures (MTTP), Joint Doctrine and Tactics, Techniques, and Procedures (JTTP); (3) The CBDP Joint Senior Leader Course (JSLC); (4) Assistance in correcting training and doctrine deficiencies covered in the lessons learned process, combat operations, capability development studies and Department of Defense Inspector General (DODIG) and Government Accountability Office (GAO) reports; (5) Support of current and planned CBRN defense studies, analysis, training, exercises, and war games; determine overlaps, duplication, and shortfalls; and build and execute programs to correct shortfalls in all aspects of CBRN defense across all DoD mission areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO DT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.285"
                                            },
                                            "Text": {
                                                "val": "Continue to support the revision and development of CBRN defense medical and physical sciences MTTPs.  Continue to support the integration of CBRN defense considerations during the revision and development of selected Joint doctrine and JTTPs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.064"
                                            },
                                            "Text": {
                                                "val": "Continue to support the revision and development of CBRN defense medical and physical sciences MTTPs.  Continue to support the integration of CBRN defense considerations during the revision and development of selected Joint doctrine and JTTPs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.314"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.314"
                                            },
                                            "Text": {
                                                "val": "Continue to support the revision and development of CBRN defense medical and physical sciences MTTPs.  Continue to support the integration of CBRN defense considerations during the revision and development of selected Joint doctrine and JTTPs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.068"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW6"
                    },
                    "ProjectTitle": {
                        "val": "MAJOR RANGE AND TEST FACILITY BASE (MRTFB)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.247"
                        },
                        "CurrentYear": {
                            "val": "55.224"
                        },
                        "BudgetYearOne": {
                            "val": "57.648"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.648"
                        },
                        "BudgetYearTwo": {
                            "val": "57.852"
                        },
                        "BudgetYearThree": {
                            "val": "57.651"
                        },
                        "BudgetYearFour": {
                            "val": "47.903"
                        },
                        "BudgetYearFive": {
                            "val": "47.940"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project provides the technical capability for testing Department of Defense (DoD) Chemical and Biological (CB) defense materiel, equipment, and systems from concept through production at West Desert Test Center (WDTC), a Major Range and Test Facility Base (MRTFB) located at Dugway Proving Ground (DPG).  Funding reflects compliance with National Defense Authorization Act (NDAA) for FY 2003 (Public Law 107-314 - December 2002), Sec 232, requiring MRTFB to be fully funded so that DoD test customers are charged for direct costs only.  \n\nWDTC, a MRTFB, is the reliance center for all DoD CB defense testing and provides the United States' only combined range, chamber, toxic chemical lab, and bio-safety level three test facility.  Total institutional test operating costs are to be provided by the Service component IAW DoD 3200.11.\n\nWDTC uses state-of-the-art chemical and life sciences test facilities and test chambers to perform CB defense testing of protective gear, decontamination systems, detectors, and equipment while totally containing chemical agents and biological pathogens.  WDTC also provides a fully instrumented outdoor range capability for testing with simulants that can be correlated to the laboratory testing with live agents.  \n\nProjects programmed for testing at WDTC include, but are not limited to: Uniform Integrated Protective Ensemble (UIPE); Joint Expeditionary Collective Protection (JECP); Decon Family of Systems (DFOS); CBRN Dismounted Recon System (DR-SKO); Joint Chemical Agent Detector (JCAD); Joint Chem-Bio-Rad Agent Water Monitor (JCBRAWM); Joint Biological Point Detection System (JBPDS); Contaminated Human Remains Pouch (CHRP); Common Analytical Laboratory System (CALS); Next Generation Diagnostic System (NGDS); Joint Service Aircrew Mask (JSAM); Joint Service General Purpose Mask (JSGPM); Joint Biological Tactical Detection System (JBTDS); Next Generation Chemical Point Detection (NGCPD).  The MRTFB also houses the Critical Reagents Program (CRP) Antigen Repository in support of testing diagnostic identification systems and developing vaccines.  In addition, it is able to provide instrumentation in support of medical countermeasures efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.763"
                                            },
                                            "Text": {
                                                "val": "Maintained Dugway Proving Ground (DPG), a Major Range and Test Facility Base (MRTFB), sustaining the technical test capability of the West Desert Test Center (WDTC) and operations to include institutional civilian labor costs for Army Program Budget Guidance (PBG) authorizations and support Department of Defense (DoD) and Department of Homeland Security needs.  These civilian personnel ensured the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represented the civilian labor required to support operations, which cannot be directly tied to a single test and therefore, cannot be charged to that test.  The test customer pays all direct costs that are directly attributable to the use of a test facility or resource for testing of a particular program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.434"
                                            },
                                            "Text": {
                                                "val": "Maintains Dugway Proving Ground (DPG), a Major Range and Test Facility Base (MRTFB), sustaining the technical test capability of the West Desert Test Center (WDTC) and operations to include institutional civilian labor costs for Army Program Budget Guidance (PBG) authorizations and support Department of Defense (DoD) and Department of Homeland Security needs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor required to support operations, which cannot be directly tied to a single test and therefore, cannot be charged to that test.  The test customer pays all direct costs that are directly attributable to the use of a test facility or resource for testing of a particular program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.213"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.213"
                                            },
                                            "Text": {
                                                "val": "Maintains Dugway Proving Ground (DPG), a Major Range and Test Facility Base (MRTFB), sustaining the technical test capability of the West Desert Test Center (WDTC) and operations to include institutional civilian labor costs for Army Program Budget Guidance (PBG) authorizations and support Department of Defense (DoD) and Department of Homeland Security needs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor required to support operations, which cannot be directly tied to a single test and therefore, cannot be charged to that test.  The test customer pays all direct costs that are directly attributable to the use of a test facility or resource for testing of a particular program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.470"
                                            },
                                            "Text": {
                                                "val": "Provided for ongoing sustainment of existing instrumentation and equipment at WDTC, located at DPG, in support of their operations.  Supported annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.581"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing instrumentation and equipment at WDTC, located at DPG, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.580"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing instrumentation and equipment at WDTC, located at DPG, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration as well as, routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.035"
                                            },
                                            "Text": {
                                                "val": "Provided WDTC with a dedicated and specially trained, 24-hour, support staff who operated and maintained all critical control systems, such as highly complex Heating, Ventilation, and Air-Conditioning (HVAC) system, and decontamination systems within WDTC's Materiel Test Facility, Combined Chemical Test Facility, and the Life Science Test Facility complex."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.932"
                                            },
                                            "Text": {
                                                "val": "Provides WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as highly complex HVAC system, and decontamination systems within WDTC's Materiel Test Facility, Combined Chemical Test Facility, and the Life Science Test Facility complex."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "Provides WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as highly complex HVAC system, and decontamination systems within WDTC's Materiel Test Facility, Combined Chemical Test Facility, and the Life Science Test Facility complex."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.979"
                                            },
                                            "Text": {
                                                "val": "Supported the WDTC defense mission by funding contractor labor overhead costs.  This was the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.577"
                                            },
                                            "Text": {
                                                "val": "Supports the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.687"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.687"
                                            },
                                            "Text": {
                                                "val": "Supports the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) NTA TEST"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.971"
                                            },
                                            "Text": {
                                                "val": "Provides initial phase of upgrade of current test capabilities to establish initial NTA Developmental and Operational Test capability at West Desert Test Center (WDTC), located at Dugway Proving Ground (DPG), including tests to correlate agents to simulants performance, leveraging Science & Technology (S&T) capability at Edgewood Chemical and Biological Center (ECBC) for initial set of NTAs.  Includes initiating instrumentation and methodology modifications for field Operational Testing with NTA simulants and for chamber Developmental Testing with initial NTAs: developing design and integration approaches for individual test fixtures and equipment for containment levels and surety operations; modify field test capability and referee systems to measure NTA simulants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.984"
                                            },
                                            "Text": {
                                                "val": "Provides for the continued upgrade of current test capabilities to establish initial NTA Developmental and Operational Test capability at WDTC, located at DPG, including tests to correlate agents to simulants performance, leveraging S&T capability at ECBC for initial set of NTAs.  Includes continuing instrumentation and methodology modifications for field Operational Testing with NTA simulants and for chamber Developmental Testing with initial NTAs: continuing design and integration approaches for individual test fixtures and equipment for containment levels and surety operations; and continuing to modify field test capability and referee systems to measure NTA simulants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "LS6"
                    },
                    "ProjectTitle": {
                        "val": "LABORATORY SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.862"
                        },
                        "CurrentYear": {
                            "val": "0.702"
                        },
                        "BudgetYearOne": {
                            "val": "2.025"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.025"
                        },
                        "BudgetYearTwo": {
                            "val": "2.026"
                        },
                        "BudgetYearThree": {
                            "val": "2.027"
                        },
                        "BudgetYearFour": {
                            "val": "2.028"
                        },
                        "BudgetYearFive": {
                            "val": "2.028"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LS6) provides for the maintenance and enhancement of the DoD laboratory infrastructure capabilities to counter an expanding threat space, exploit advances in technology, and develop and transition chemical and biological (CB) defense equipment and countermeasures to the Warfighter.  This laboratory infrastructure project upgrades key systems to the current state-of-the-art capabilities.  Key systems include: gas filters, mechanical\/electrical, and structural systems.  Also provides for the initial equipment outfitting of new facilities.  This project will ensure that the necessary surety operations can be conducted effectively and safely in support of Chemical and Biological Defense Program (CBDP) RDTE programs.  As a force multiplier, this project will provide more robust capabilities to the CBDP and ensure continuity of operations and environmental compliance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) LABINF - ECBC Gas Filters"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.314"
                                            },
                                            "Text": {
                                                "val": "Continue to sustain modernized existing gas filters to include developing new filter designs with the capability of protecting against emerging threat agents.  Includes purchase, procurement, installing, monitoring, testing, certification, and disposal."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) LABINF - Control Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.896"
                                            },
                                            "Text": {
                                                "val": "Modernize mechanical and pneumatic control systems to full digital controls."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) LABINF - Emergency Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.920"
                                            },
                                            "Text": {
                                                "val": "Modernize emergency systems to increase reliability and safety."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) LABINF - ECBC Mechanical\/Electrical Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.254"
                                            },
                                            "Text": {
                                                "val": "Sustain and upgrade to key mechanical and electrical systems in surety buildings to ensure worker safety, environmental compliance, and continuity of operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) LABINF - ECBC Surety Facility Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment in key surety facilities.  Includes general safety, structural, exterior, interior, and utility sustainment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.025"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment in key surety facilities.  Includes general safety, structural, exterior, interior, and utility sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) LABINF - Initial Outfitting, Transition, and Equipment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Provided key chemical and biological defense effort upgrades, initial outfitting, and equipment for the USAMRIID and USAMRICD infrastructure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.693"
                                            },
                                            "Text": {
                                                "val": "Provides laboratory infrastructure project upgrades for key systems to the current state-of-the-art capabilities.  Key enabling activities to support the medical chemical and biological defense research and development infrastructure at USAMRIID and USAMRICD include: support for veterinary medicine; regulatory affairs and quality assurance compliance activities; chemical and biological surety costs; occupational health issues; maintenance of the vivarium; and maintenance of the neat (chemical) agent facility for medical countermeasure development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Provides laboratory infrastructure project upgrades for key systems to the current state-of-the-art capabilities.  Key enabling activities to support the medical chemical and biological defense research and development infrastructure at USAMRIID and USAMRICD include: support for veterinary medicine; regulatory affairs and quality assurance compliance activities; chemical and biological surety costs; occupational health issues; maintenance of the vivarium; and maintenance of the neat (chemical) agent facility for medical countermeasure development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) LABINF - DoD Laboratory Infrastructure"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.191"
                                            },
                                            "Text": {
                                                "val": "Provided support for facilities sustainment, restoration and modernization requirements directly related to the maintenance and enhancement of the DoD laboratory infrastructure capabilities.  Capabilities supported included efforts related to CBDP research, development, test, and evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) LABINF - Proteomics Capability Enhancement (ECBC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.387"
                                            },
                                            "Text": {
                                                "val": "Provided for an enhanced capability within ECBC laboratory infrastructure to centralize and consolidate proteomics efforts.  Provides for a responsive resource that can be directed to rapidly focus on novel and emerging threats.  Includes equipment enhancements for quantitation\/validation, screening, and pathways elucidations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.009"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS6"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E MGT SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.907"
                        },
                        "CurrentYear": {
                            "val": "29.438"
                        },
                        "BudgetYearOne": {
                            "val": "26.965"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.965"
                        },
                        "BudgetYearTwo": {
                            "val": "28.421"
                        },
                        "BudgetYearThree": {
                            "val": "29.379"
                        },
                        "BudgetYearFour": {
                            "val": "30.300"
                        },
                        "BudgetYearFive": {
                            "val": "30.593"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides management support for the DoD CBDP.  It includes program oversight and integration of overall medical and non-medical programs by the Assistant to the Secretary of Defense for Nuclear and Chemical and Biological Defense Programs (ATSD(NCB)) defense programs through the Deputy Assistant to the Secretary of Defense for Chemical and Biological Defense\/Chemical Demilitarization (ODATSD(CBD\/CD)).  Funds execution management is provided by DTRA. \n\nThe project also provides for the development, coordination and integration of Joint Chemical, Biological, Radiological and Nuclear (CBRN) defense capability requirements, including assistance and support to the Combatant Commanders and Services to improve CBRN defense related doctrine, education, training, and awareness by the Joint Requirements Office (JRO) Joint CBRN Defense Research, Development, and Acquisition (RDA) planning; and input to the CBD Annual Report to Congress, and program guidance development by the Program Analysis and Integration Office (PA&IO).\n\nThe project includes programming support for the Joint Service CB Information System (JSCBIS) which serves as a budgetary and informational database for the DoD CBDP.  Also included within the project is financial management services include fund distribution, execution reporting and fiscal financial statements.\n\nThis project also supports the Test and Evaluation (T&E) Executive, who is responsible for the planning, balancing, and oversight of test infrastructure and test technology requirements to support Developmental Testing (DT) and Operational Testing (OT) of DoD CBD systems, as outlined in the RDA Plan.  The T&E Executive guides JPEO planning and coordination with the Operational Test Activities to plan a series of methodology, instrumentation, and associated validation efforts that provide test infrastructure and technologies for testing RDA systems needed to support all Services, and to ensure the adequacy of testing for RDA systems in alignment with acquisition schedules and associated decision points.  The JTIWG program funds T&E Early Involvement, test threat planning, Fielded Equipment Assessments, T&E studies, and T&E Standards planning and development to support testing the CBD systems for all services to include radiological, nuclear, medical T&E efforts.  \n\nThe CBDP T&E Executive directly supports OSD T&E oversight acquisition programs and provides the mechanism for early T&E involvement in the acquisition process.  The CBDP T&E Executive provides the T&E infrastructure investment strategy and coordinates investment planning and T&E capabilities validation among the Joint Service Community to ensure that program needs are met.  The CBDP T&E Executive oversees T&E processes to include fielded equipment assessments to ensure end to end support to the war fighter.  The CBDP T&E Executive oversees T&E processes to include fielded equipment assessments to insure end-to-end support to the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.201"
                                            },
                                            "Text": {
                                                "val": "Represented the Services and Combatant Commanders in the development, coordination, and integration of CBRN defense operational capabilities across all DoD mission areas.  Planned, coordinated and executed the development and review of: Joint CBRN defense capability requirements; DoD CBDP program guidance; Joint CBRN Defense Modernization Plan; Integrated medical and physical sciences CBRN Defense Joint Priorities List (JPL); CBRN Defense Joint Future Operational Capabilities; Program Objective Memorandum; and the CBD Annual Report to Congress."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.023"
                                            },
                                            "Text": {
                                                "val": "Continue to represent the Services and Combatant Commanders in the development, coordination, and integration of CBRN defense operational capabilities across all DoD mission areas.  Continue to plan, coordinate and execute the development and review of: Joint CBRN defense capability requirements; DoD CBDP program guidance; Joint CBRN Defense Modernization Plan; Integrated medical and physical sciences CBRN Defense JPL; CBRN Defense Joint Future Operational Capabilities; Program Objective Memorandum; and the CBD Annual Report to Congress."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.421"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.421"
                                            },
                                            "Text": {
                                                "val": "Represent the Services and Combatant Commanders in the development, coordination, and integration of CBRN defense operational capabilities across all DoD mission areas.  Plan, coordinate and execute the development and review of: Joint CBRN defense capability requirements; DoD CBDP program guidance; Joint CBRN Defense Modernization Plan; Integrated medical and physical sciences CBRN Defense JPL; CBRN Defense Joint Future Operational Capabilities; Program Objective Memorandum; and the CBD Annual Report to Congress."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) JTIWG"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.775"
                                            },
                                            "Text": {
                                                "val": "Joint Test Infrastructure Working Group (JTIWG) - Continued Test and Evaluation (T&E) Executive mission support to ensure credible testing of Chemical Biological Defense Program (CBDP) systems and support to the Director for Operational Test and Evaluation (DOT&E) for OSD T&E Oversight.  Continued direct support to the Joint Program Executive Office for Chemical Biological Defense (JPEO-CBD) and the Joint Requirements Office (JRO) Integrated Process Teams (IPTs) and Integrated Concept Teams (ICTs) providing technical assistance to structure acquisition programs and test scopes.  Continued early involvement of the Operational Test Agencies (OTAs) and other T&E organizations in T&E infrastructure planning.  Continued development of threat test support documentation to support developmental and operational tests in which an operational threat must be realistically presented, including Joint Biological Standoff Detection System (JBSDS); Joint Biological Tactical Detection System (JBTDS); Joint Biological Point Detector System (JBPDS), Joint Biological Agent Identification and Diagnostic System (JBAIDS); Joint Warning and Reporting Network (JWARN); Joint Chemical Agent Detector (JCAD), Improved Point Detection System (IPDS); Next Generation Chemical Point Detection(NGCPD) and all detectors; Uniform Individual Protection Ensemble(UIPE); Joint Platform Interior Decontamination(JPID); Dismounted Reconnaissance Sets, Kits, and Outfits (DR-SKO), Monitor and Survey Sets, Kits, Outfits (MS-SKO); Joint Expeditionary Collective Protection (JECP); Decontamination Family of Systems (DFoS); Next Generation Diagnostic Systems (NGDS).  Continued support to JPEO-CBD and Joint Science and Technology Office (JSTO)-CB regarding specific test methodology and test technology needs, to include updates to the Technology Transition documents, participation in scientific review panels, and review of technology\/methodology and development plans.  Continued to provide guidance to improve the Test and Evaluation Master Plan (TEMP) for acquisition programs, threat support documentation development, and development of T&E Capabilities Needs Statements and to expedite Lead OTA assignment and overall coordination.  Continued to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US Memorandum of Understanding (MOU).  Provided T&E infrastructure input to the Program Objective Memorandum (POM) process and supported JRO, Program Analysis and Integration Office (PA&IO), and SA(CBD & CDP) in development and defense of POM and Budget submissions.  Provide subject matter expertise to assist community to implement T&E aspects of National and DoD guidance and policy: Chemical Biological Radiological Contamination Survivability (CBRCS), Homeland Security Presidential Directive(HSPD), and DOD 5000.  This project also supported T&E Early Involvement, test threat planning, Fielded Equipment Assessments, T&E Studies, and T&E Standards planning and development to support testing CBDP systems for all Services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.662"
                                            },
                                            "Text": {
                                                "val": "JTIWG - Continue T&E Executive mission support to ensure credible testing, T&E Early Involvement, Fielded Equipment Assessments, T&E Studies, evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the Assistant to the Secretary of Defense (NCB) in infrastructure planning, input to the Program Objective Memorandum (POM) process, and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continue direct support to the Joint Program Executive Office for Chemical Biological Radiological Nuclear Defense (JPEO-CBRND) and the JRO IPTs and ICTs providing technical assistance to structure acquisition programs, plan for Analysis of Alternatives (AoAs) and develop test scopes.  Continue early involvement of the OTAs and other T&E organizations in T&E infrastructure planning, development, and validation.  Continue development of threat test support documentation to support developmental and operational tests in which an operational threat must be realistically presented.  Programs supported include NTA detector; Joint Biological Tactical Detection System (JBTDS); Joint Biological Point Detector System (JBPDS); Joint Chemical Agent Detector (JCAD), Improved Point Detection System (IPDS); Next Generation Chemical Point Detection(NGCPD) and all detectors; Uniform Individual Protection Ensemble(UIPE); Dismounted Reconnaissance Sets, Kits, and Outfits (DR-SKO); Joint Expeditionary Collective Protection (JECP); Decontamination Family of Systems (DFoS); Next Generation Diagnostic Systems (NGDS).  Decon Family of Systems; JSGPM; JECP; NBCRV Sensor Suite Integration (SSI); JSAM; CALS; and WMD CSTs, Special Purpose Units - CB Equipment.  Continue support to JPEO-CBD and JSTO-CB regarding specific test methodology and test technology needs, technology transition planning, approval of T&E Strategies, and participation in scientific review panels.  Continue to provide guidance to improve the TEMP for acquisition programs, threat support documentation, and validation of T&E Capabilities and associated standards.  Continue to support OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  Continue to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US MOU.  Provide T&E infrastructure input to the POM process and support JRO, PA&IO, and SA(CBD & CDP) in development and defense of POM and Budget submissions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.589"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.589"
                                            },
                                            "Text": {
                                                "val": "Joint Test Infrastructure Working Group (JTIWG) - Continue Test and Evaluation (T&E) Executive mission support to ensure credible testing, Fielded Equipment Assessments, T&E Studies, evaluation and decision support for Chemical Biological Defense Program (CBDP) systems; support the Director for Operational Test and Evaluation (DOT&E) for OSD T&E Oversight; and support the Assistant to the Secretary of Defense (NCB) in infrastructure planning and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continue direct support to the Joint Program Executive Office for Chemical Biological Radiological Nuclear Defense (JPEO-CBRND) and the Joint Requirements Office (JRO) Integrated Process Teams (IPTs) and Integrated Concept Teams (ICTs) providing technical assistance to structure acquisition programs, plan for Analysis of Alternatives (AoAs) and develop test scopes.  Continue early involvement of the Operational Test Agencies (OTAs) and other T&E organizations in T&E infrastructure planning, development, and validation.  Continue development of threat test support documentation to support developmental and operational tests in which an operational threat must be realistically presented.  Programs supported include NTA detector, DR SKO, Decon Family of Systems, JECP, JBPDS, JSGPM, NGCPD, UIPE, JECP, NBCRV Sensor Suite Integration (SSI), JSAM, CALS, and WMD CSTs, Special Purpose Units - CB Equipment.  Continue support to JPEO-CBD and Joint Science and Technology Office (JSTO)-CB regarding specific test methodology and test technology needs, technology transition planning, approval of T&E Strategies, and participation in scientific review panels.  Continue to provide guidance to improve the Test and Evaluation Master Plan (TEMP)s for acquisition programs, threat support documentation, and validation of T&E Capabilities and associated standards.  Continue to support OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  Continue to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US Memorandum of Understanding (MOU).  Provide T&E infrastructure input to the Program Objective Memorandum (POM) process and support JRO, Program Analysis and Integration Office (PA&IO), and SA(CBD & CDP) in development and defense of POM and Budget submissions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) OSD MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.747"
                                            },
                                            "Text": {
                                                "val": "Performed program reviews\/assessments, provided programmatic PPBE oversight\/analysis, and provided congressional issue analysis and support.  Supported financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.108"
                                            },
                                            "Text": {
                                                "val": "Continue to perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Continue to support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.189"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.189"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) PAIO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.184"
                                            },
                                            "Text": {
                                                "val": "Developed assessments to support RDA Planning.  Provided analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Responded to specialized evaluation studies throughout the PPBE process.  Provided JSCBIS database management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.255"
                                            },
                                            "Text": {
                                                "val": "Continue to develop assessments to support RDA Planning.  Continue to provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Continue to respond to specialized evaluation studies throughout the PPBE process.  Continue to provide JSCBIS database management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.766"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.766"
                                            },
                                            "Text": {
                                                "val": "Develop assessments to support RDA Planning.  Provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Provide JSCBIS database management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.390"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "O49"
                    },
                    "ProjectTitle": {
                        "val": "JOINT CONCEPT DEVELOPMENT AND EXPERIMENTATION PROGRAM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.630"
                        },
                        "CurrentYear": {
                            "val": "2.310"
                        },
                        "BudgetYearOne": {
                            "val": "1.897"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.897"
                        },
                        "BudgetYearTwo": {
                            "val": "1.963"
                        },
                        "BudgetYearThree": {
                            "val": "2.007"
                        },
                        "BudgetYearFour": {
                            "val": "2.050"
                        },
                        "BudgetYearFive": {
                            "val": "2.050"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objectives of the Joint Concept Development and Experimentation (JCDE) program are to plan, conduct, evaluate, and report on joint tests and experiments (for other than developmental hardware) and accomplish capability development assessments.  This program will provide ongoing input to the Combatant Commanders and Services for development of doctrine, policy, training procedures, and feedback into the Joint Capabilities Integration and Development System (JCID) and acquisition processes."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JCDE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.630"
                                            },
                                            "Text": {
                                                "val": "Supported the Joint Combat Developer for Experimentation (JCDE) for CBRND in conducting workshops, studies, war games and limited objective experiments to explore, refine, and validate potential solutions and alternatives that will update and improve the Joint CBRND concept."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.279"
                                            },
                                            "Text": {
                                                "val": "Continue to support the Joint Combat Developer for Experimentation (JCDE) for CBRND in conducting workshops, studies, war games and limited objective experiments to explore, refine, and validate potential solutions and alternatives that will update and improve the Joint CBRND concept."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.897"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.897"
                                            },
                                            "Text": {
                                                "val": "Support the Joint Combat Developer for Experimentation (JCDE) for CBRND in conducting workshops, studies, war games and limited objective experiments to explore, refine, and validate potential solutions and alternatives that will update and improve the Joint CBRND concept."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.031"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}