{
    "id": "1eed7201dcb34a9105771633de91499ae367c481",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V1_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603112F"
        },
        "ProgramElementTitle": {
            "val": "Advanced Materials for Weapon Systems"
        },
        "R1LineItemNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.638"
            },
            "CurrentYear": {
                "val": "60.719"
            },
            "BudgetYearOne": {
                "val": "47.890"
            },
            "BudgetYearOneBase": {
                "val": "47.890"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "29.672"
            },
            "BudgetYearThree": {
                "val": "29.169"
            },
            "BudgetYearFour": {
                "val": "31.373"
            },
            "BudgetYearFive": {
                "val": "36.992"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates materials technology for transition into Air Force systems.  The program has five projects which develop:  (1) hardened materials technologies for the protection of aircrews and sensors; (2) non-destructive inspection and evaluation technologies; (3) transition data on structural and non-structural materials for aerospace applications; (4) airbase operations technologies including deployable base infrastructure, force protection, and fire fighting capabilities; and (5) advanced materials for space applications. Efforts in the program have been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 3, Advanced Technology Development, since it develops and demonstrates technologies for existing system upgrades and\/or new system developments that have military utility and address warfighter needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.414"
                },
                "CurrentYear": {
                    "val": "39.738"
                },
                "BudgetYearOne": {
                    "val": "41.699"
                },
                "BudgetYearOneBase": {
                    "val": "41.699"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.638"
                },
                "CurrentYear": {
                    "val": "60.719"
                },
                "BudgetYearOne": {
                    "val": "47.890"
                },
                "BudgetYearOneBase": {
                    "val": "47.890"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.224"
                },
                "CurrentYear": {
                    "val": "20.981"
                },
                "BudgetYearOne": {
                    "val": "6.191"
                },
                "BudgetYearOneBase": {
                    "val": "6.191"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.019"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "21.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.570"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "6.794"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "6.191"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.191"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Other Adjustments include -0.206 General Congressional Reductions, 8.000 Congressional Adds, and -1.000 Congressional Directed Transfers\n\nDecrease in FY13 is due to higher Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "632100"
                    },
                    "ProjectTitle": {
                        "val": "Laser Hardened Materials"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.426"
                        },
                        "CurrentYear": {
                            "val": "23.007"
                        },
                        "BudgetYearOne": {
                            "val": "11.564"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.564"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.050"
                        },
                        "BudgetYearThree": {
                            "val": "15.971"
                        },
                        "BudgetYearFour": {
                            "val": "15.894"
                        },
                        "BudgetYearFive": {
                            "val": "16.655"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced materials technologies that enhance protection for Air Force aircrews to ensure safety and to enable aircrews to perform required missions in threat environments.  Advanced materials technologies are also developed and demonstrated to enhance protection for Air Force sensor systems to ensure safety, survivability, and operability in threat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials technologies that enhance hardening for sensors, avionics, and components to increase survivability and mission effectiveness of aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.585"
                                            },
                                            "Text": {
                                                "val": "Evaluated hardening performance of current materials and technologies to threats.  Demonstrated detector hardening for next generation United States Air Force targeting platforms.  Developed new persistent surveillance detectors with increased survivability.  Designed more robust Visible\/Near Infrared (Vis\/NIR) detectors.  Incorporated materials in optical test bed configuration and test performance in relevant environments.  Demonstrated optimized nonlinear optical limiter materials for damage protection.  Demonstrated semiconductor optical limiter materials performance for damage protection.  Verified performance of hardening Short Wavelength Infrared (SWIR) sensor systems.  Evaluate materials survivability for relevant environments.  Developed advanced thin film concepts for enhanced fixed filter performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.920"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate and prioritize advanced rugate coatings and liquid crystal materials technologies as protection against laser and directed energy threats aimed at sensors and avionics. Transition most mature coatings and liquid crystal hardening technologies for next generation targeting platforms. Initiate demonstrations of promising and viable coating and liquid crystal technologies into next generation of persistent surveillance sensor designs as well as demonstrating strategies to mitigate directed energy damage for Vis\/NIR detectors and SWIR detectors that are critical for Intelligence, Surveillance, and Reconnaissance (ISR) sensors. Continue testing of damage limiting semiconductor materials in test bed configuration to determine viability for protection of tactical and strategic space sensors and for SWIR systems.  Assess vulnerability of current seekers\/munitions against emerging countermeasure threats. Develop and demonstrate personnel protection technologies, including tailored rugate coatings and liquid crystal materials technologies specific for visor applications, against visible and SWIR directed energy laser threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.996"
                                            },
                                            "Text": {
                                                "val": "Continue demonstrations of viable coating and liquid crystal technologies for future persistent surveillance sensor designs as well as continue demonstrating strategies to mitigate directed energy damage for Vis\/NIR detectors, SWIR and Mid Wave Infrared (MWIR) detectors critical to ISR sensors. Demonstrate damage-limiting semiconductor materials in a test bed configuration representing protection of strategic SWIR space sensors. Employ computation materials science to model materials characteristics to increase accuracy and shorten design cycle time of coatings and dyes for use in sensor hardening. Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials technologies that enhance protection for Air Force aircrews to ensure safety and to enable aircrew to perform required missions in a threat environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.841"
                                            },
                                            "Text": {
                                                "val": "Investigated susceptibility of candidate detectors for Head Mounted Display (HMD) systems.  Demonstrated enhanced photorefractive hybrid materials concepts for Air Force passive protection applications.  Identified personnel protection technologies for the visible and SWIR.  Evaluated performance of optical coatings within visor applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.087"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate personnel protection technologies for the visible and SWIR.  Continue to evaluate performance and initiate process development of optical coatings within visor applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.568"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.568"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of personnel protection technologies for the visible\/NIR and SWIR.  Fabricate and demonstrate  performance of agile and fixed optical coatings and dyes for use in visor applications.  Characterize eye protection technologies using computational materials science tools."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633153"
                    },
                    "ProjectTitle": {
                        "val": "Non-Destructive Inspection Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.208"
                        },
                        "CurrentYear": {
                            "val": "5.142"
                        },
                        "BudgetYearOne": {
                            "val": "8.413"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.413"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.766"
                        },
                        "BudgetYearThree": {
                            "val": "4.831"
                        },
                        "BudgetYearFour": {
                            "val": "4.870"
                        },
                        "BudgetYearFive": {
                            "val": "4.962"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced nondestructive inspection\/evaluation (NDI\/E) technologies to monitor performance integrity and to detect failure causing conditions in weapon systems components and materials.  NDI\/E capabilities greatly influence and\/or limit many design, manufacturing, and maintenance practices.  This project provides technology to satisfy Air Force requirements to extend the lifetime of current systems through increased reliability and cost-effectiveness at field and depot maintenance levels.  Equally important is assuring manufacturing quality, integrity, and safety requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced technologies to improve capabilities to inspect for cracks and other damage to extend the total safe life of turbine engines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.635"
                                            },
                                            "Text": {
                                                "val": "Transitioned NDI\/E approaches to extend the life of fracture-critical gas turbine engine components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.377"
                                            },
                                            "Text": {
                                                "val": "Investigate NDI\/E approaches to measure material properties to extend the life and increase durability of fracture-critical gas turbine engine components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.772"
                                            },
                                            "Text": {
                                                "val": "Develop NDI\/E approaches to nondestructively measure material properties, detect and characterize materials and damage state for the purpose of  extending the life and increasing durability of fracture critical gas turbine engine components"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced inspection technologies supporting low-observable (LO) systems to enhance affordability and ensure full performance and survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.343"
                                            },
                                            "Text": {
                                                "val": "Developed inspection methods and sensor technology for signature and material integrity of next generation LO material systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.421"
                                            },
                                            "Text": {
                                                "val": "Advance inspection methods and sensor technology for signature and material integrity of next generation LO material systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.541"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.541"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate inspection methods and sensor technology for signature and material integrity of existing and next generation LO material systems.  Develop, demonstrate, and validate inspection methods to identify damage and register positions that enable\/ensure signature assessment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced systems status monitoring technologies to provide on-board and embedded sensing to gain continuous awareness of the state of key subsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.230"
                                            },
                                            "Text": {
                                                "val": "Demonstrated optimal sensing approaches for real-time health monitoring of high-temperature protection and advanced material systems and characterize power scavenging and signal transmission issues.  Transitioned smart sensor technologies for wiring health analysis.  Transitioned field and depot-level inspection tools for assessing the structural health of airframes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.344"
                                            },
                                            "Text": {
                                                "val": "Continue to transition smart sensor technologies for wiring health analysis.  Continue to transition field and depot-level inspection tools for assessing the structural health of airframes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and transition augmented field and depot-level inspection technologies for assessing the structural integrity of airframes.  Integrate computational materials science tools with life prediction methods to increase accuracy of life prediction. Demonstrate and transition advanced turbine engine process\/status monitoring technologies to enable adaptive functions. Increase in FY13 due to higher Air Force priority in turbine engines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633946"
                    },
                    "ProjectTitle": {
                        "val": "Materials Transition"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.794"
                        },
                        "CurrentYear": {
                            "val": "30.214"
                        },
                        "BudgetYearOne": {
                            "val": "27.020"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.020"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.856"
                        },
                        "BudgetYearThree": {
                            "val": "8.367"
                        },
                        "BudgetYearFour": {
                            "val": "10.609"
                        },
                        "BudgetYearFive": {
                            "val": "15.375"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced materials and processing technologies for fielded and planned Air Force weapon, airframe, and propulsion applications.  Advanced materials and processes that have matured beyond applied research are characterized, critical data are collected, and critical evaluations in the proposed operating environment are performed.  This design and scale-up data improves the overall affordability of promising materials and processing technologies, providing needed initial incentives for their industrial development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Metals Affordability Initiative"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silicon Carbide Composites Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "12.500"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.500"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate Materials and Processes (M&P) technologies for air vehicle and subsystems to enhance lift, propulsion, LO performance, power generation management, and affordability of air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.139"
                                            },
                                            "Text": {
                                                "val": "Developed and transitioned production-level capable processes for producing large area, high-quality diamond windows for airborne high power microwave directed energy weapons.  Demonstrated and compared advantages of approaches for high energy density capacitors for pulsed power applications.  Initiated validation of processing methods and lifing tools for hybrid disk concepts.  Initiated validation of processing methods and lifing methodologies for advanced (Silicon Carbide) SiC\/SiC-based composites.  Developed and demonstrated methodology for process control and validation of next generation LO material systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.168"
                                            },
                                            "Text": {
                                                "val": "Demonstrate high rate production-capable processes for producing large area, high quality diamond windows for airborne high power microwave directed energy weapons.  Develop materials enabling critical components for next-generation airborne high energy lasers that are solid state, electrically-powered, and significantly higher efficiency.  Advance validation of processing methods and lifing tools for graded microstructure turbine engine disk concepts.  Advance validation of processing methods and lifing methodologies for advanced high temperature SiC\/SiC-based composites.  Develop and validate next generation NDE\/I sensor systems for advanced LO material systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.320"
                                            },
                                            "Text": {
                                                "val": "Transition high rate production-capable processes for producing large area, high quality diamond windows for airborne high power microwave directed energy weapons. Continue development of materials enabling critical components for next generation airborne high energy lasers that are solid state, electrically-powered, with significantly higher efficiency.  Transition validation of processing methods and lifing tools for graded microstructure turbine engine disk concepts, high temperature SiC\/SiC-based composites, and validate next generation NDE\/I sensor systems for advanced LO material systems.  Demonstrate 2700 SiC\/SiC composites for advanced high temperature components."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate M&P technologies to enhance the sustainability of aerospace systems by lowering Operations and Maintenence (O&M) costs to ensure the full operability and safety of systems and personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.692"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and transitioned innovative technologies for bare base utilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and transition innovative technologies for bare base utilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate affordable, novel high temperature materials\/structures and thermal management concepts to enable future defense capabilities for prompt global strike concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.963"
                                            },
                                            "Text": {
                                                "val": "Explored fabrication techniques for hot structure and thermal protection systems from advanced ceramics, ceramic matrix composites, hybrids, advanced metals, and intermetallics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.296"
                                            },
                                            "Text": {
                                                "val": "Advance multi-material structure to optimally address operational temperature zones for hot structure and thermal protection systems from advanced ceramics, ceramic matrix composites, hybrids, advanced metals, and intermetallics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue to advance multimaterial structure to optimally address operational temperature zones for hot structure and thermal protection systems made out of advanced ceramics, ceramic matrix composites, hybrids,\nadvanced metals, and intermetallics.  Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate M&P technologies to increase power and efficiency for adaptive turbine engine propulsion and subsystem integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.700"
                                            },
                                            "Text": {
                                                "val": "Transition production processes and materials to enable an adaptive turbine engine prototype.  Perform critical evaluations of technology in the operating environment. Increase in FY13 due to higher Air Force priority in turbine engines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634918"
                    },
                    "ProjectTitle": {
                        "val": "Deployed Air Base Demonstrations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.210"
                        },
                        "CurrentYear": {
                            "val": "2.356"
                        },
                        "BudgetYearOne": {
                            "val": "0.893"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.893"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced, rapidly deployable airbase technologies that enable agile combat support by reducing airbase manpower requirements, reducing airbase setup times and improving the protection and survivability of deployed Air Force Expeditionary (AFE) warfighters. Affordable, efficient technologies are developed and demonstrated  to provide deployable infrastructure, weapon system support, blast and munition force protection and firefighting capability for deployed AEF operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and transition deployable infrastructure airbase technologies, to reduce airlift and manpower requirements, setup time, and sustainment costs in support of AEF operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.049"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate and transition integrated, advanced power generation and distribution methods.  Demonstrated methods and technologies to evaluate operating surfaces for ability to sustain remote and autonomous aircraft operations.  Demonstrated and optimize rapid temporary and permanent high temperature operating surface repairs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.098"
                                            },
                                            "Text": {
                                                "val": "Characterize, demonstrate, and fabricate airbase alternative energy generation, power grid conditioning, and distribution methods.  Characterize and develop best practices for aircraft operating surface evaluation and repair technologies.  Characterize,  fabricate, and demonstrate aircraft operating surface  high operating temperature materials and technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and transition technologies to provide force protection and fire fighting capability for deployed AEF operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.161"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and transitioned agile, lightweight adaptive blast suppression materials in representative structures.  Demonstrated and optimized candidate fire fighter safety technologies against representative environments and threats.  Demonstrated and transitioned candidate ultrahigh pressure nozzles, and other technologies in fire safety systems.  Developed and demonstrated reactive and responsive materials for platforms, expeditionary structures, and personnel protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Text": {
                                                "val": "Characterize and maintain competency for fabrication and demonstration of technologies for airbase structural protection against blast and fragmentation.  Characterize and develop technologies for airbase fire fighting and composite materials combustion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.893"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.893"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities.  Remaining funds will provide for orderly transition and shutdown of facilities no longer needed in this research area."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}