{
    "id": "224eafc3d3dd84b5e8063f342367ef4618beea5e",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0203345D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Operations Security Initiative"
        },
        "R1LineItemNumber": {
            "val": "169"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "1.721"
            },
            "BudgetYearOne": {
                "val": "2.637"
            },
            "BudgetYearOneBase": {
                "val": "2.637"
            },
            "BudgetYearTwo": {
                "val": "5.340"
            },
            "BudgetYearThree": {
                "val": "7.167"
            },
            "BudgetYearFour": {
                "val": "8.736"
            },
            "BudgetYearFive": {
                "val": "8.910"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense Operations Security Initiative (DOSI) is a risk mitigation function that protects Joint and Coalition personnel, and aids in mission accomplishment.  The Under Secretary of Defense for Intelligence signed on June 7, 2010 the DOD Operations Security (OPSEC) Program Annual report stating, \" We must now focus on the application of OPSEC in support of missions and operations - moving beyond the checklists and incorporating OPSEC as a daily tool to enable operations.\"  Additional language within the Defense Planning and Programming Guidance for Fiscal Years 12-16; the 2010-2013 Chairman's Joint Training Guidance, 31 August 2009; the Universal Joint Task List (UJTL), 20 February 2009; and the Electronic Warfare Capability Based Assessment, dated June 2008, all endorse increasing OPSEC efforts across the information environment.  These documents support increasing non-kinetic efforts such as the Joint Operations Security Initiative (JOSI).\n\nWhile the security function of limiting access in OPSEC is established, the \"operational\" function of managing patterns and indicators is deficient.  Advances in technology and data aggregation continue to increase operation risk due to the adversary's ability to identify, analyze, and act in a timely manner.  The JOSI will identify OPSEC requirements and eliminate shortfalls across the operational environment which includes the land, air, maritime, space, and cyberspace domains.  The JOSI is in line with the Secretary of Defense's emphasis on efficiently moving assets from overhead to operational forces."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "1.777"
                },
                "BudgetYearOne": {
                    "val": "2.925"
                },
                "BudgetYearOneBase": {
                    "val": "2.925"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "1.721"
                },
                "BudgetYearOne": {
                    "val": "2.637"
                },
                "BudgetYearOneBase": {
                    "val": "2.637"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.056"
                },
                "BudgetYearOne": {
                    "val": "-0.288"
                },
                "BudgetYearOneBase": {
                    "val": "-0.288"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.012"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.044"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Department adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.288"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.288"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "345"
                    },
                    "ProjectTitle": {
                        "val": "Defense Operations Security Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.721"
                        },
                        "BudgetYearOne": {
                            "val": "2.637"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.637"
                        },
                        "BudgetYearTwo": {
                            "val": "5.340"
                        },
                        "BudgetYearThree": {
                            "val": "7.167"
                        },
                        "BudgetYearFour": {
                            "val": "8.736"
                        },
                        "BudgetYearFive": {
                            "val": "8.910"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Operations Security (OPSEC) Initiative enhancement consists of six components:\n\n1. Force Evaluation - will focus on billets, personnel identifications and tracking, allocation, and operational employment.\n2. Training and Education - will focus on exercise support and formal education curricula review and development.\n3. Intelligence Support - will establish governance processes and procedures for OPSEC intelligence integration that will focus on the integration of special intelligence requirements; intelligence and threat repository support; Open Source Intelligence, Human Intelligence, and Signals Intelligence support; and intelligence support to Military Deception in support of OPSEC.\n4. Technology and Tools Research, Testing, and Development - will identify emerging technologies and tools consisting of physical, technical, and administrative means.  \n5. Measures and Countermeasures Assessments - will focus on friendly and adversary assessments.  Assessment criteria will be based on observable actions, indicators, or information that will provide the bases for identifying control measures such as:  Action Controls, Countermeasures, and Counter Analysis.\n6. Governance - will consist of the development and oversight of infrastructure, policy, authorities, and warfighter advocacy across the Joint community and the Defense support agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Operations Security Initiative (DOSI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.721"
                                            },
                                            "Text": {
                                                "val": "-Initiate plans and research projects addressing DOSI's six components (i.e. Force Evaluation, Training and Education, Intelligence Support, Technology and Tools Research, Measures and Countermeasures Assessments, and Governance). \n-Develop a tailored DoD OPSEC training course focused on integrating OPSEC with warfighter operations.\n-Plan and develop strategy to refocus OPSEC as an operations function designed to reduce availability of critical information and indicators to adversary collection capabilities in order to enhance warfighter operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Text": {
                                                "val": "Continue research projects addressing DOSI's six components (i.e. Force Evaluation, Training and Education, Intelligence Support, Technology and Tools Research, Measures and Countermeasures Assessments, and Governance)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Defense Operations Security Initiative (DOSI) acquisition, management, and contracting strategy follows guidance outlined in DoD 5000 series directives, Federal Acquisition Regulation (FAR), and FAR supplement policies and procedures.  DOSI efforts will acquire and sustain capabilities, systems, tools, products, and services through an acquisition process that is responsive and responsible to internal and external stakeholders."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to, time, money, realism, and fidelity as defined below:\n\nTime - Enable the warfighter to speed up processes faster than current capabilities.\nMoney - Enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow.\nRealism - Enable the warfighter to create an evironment that is closer to the real world environment than current capabilities allow.\nFidelity - Ensure unity of efforts throughout the IO, Cyber, and IOI Communities."
                        }
                    }
                }
            ]
        }
    }
}