{
    "id": "262b72c2f853e864ff7df1c34c64ddbddfd5f36c",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineItemNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.731"
            },
            "CurrentYear": {
                "val": "19.651"
            },
            "BudgetYearOne": {
                "val": "20.032"
            },
            "BudgetYearOneBase": {
                "val": "20.032"
            },
            "BudgetYearTwo": {
                "val": "19.965"
            },
            "BudgetYearThree": {
                "val": "20.971"
            },
            "BudgetYearFour": {
                "val": "20.631"
            },
            "BudgetYearFive": {
                "val": "21.006"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds. Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.700"
                },
                "CurrentYear": {
                    "val": "20.372"
                },
                "BudgetYearOne": {
                    "val": "20.681"
                },
                "BudgetYearOneBase": {
                    "val": "20.681"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.731"
                },
                "CurrentYear": {
                    "val": "19.651"
                },
                "BudgetYearOne": {
                    "val": "20.032"
                },
                "BudgetYearOneBase": {
                    "val": "20.032"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.969"
                },
                "CurrentYear": {
                    "val": "-0.721"
                },
                "BudgetYearOne": {
                    "val": "-0.649"
                },
                "BudgetYearOneBase": {
                    "val": "-0.649"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.564"
                    },
                    "CurrentYear": {
                        "val": "-0.585"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.207"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.649"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.649"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.115"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.083"
                                },
                                "CurrentYear": {
                                    "val": "-0.136"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.731"
                        },
                        "CurrentYear": {
                            "val": "19.651"
                        },
                        "BudgetYearOne": {
                            "val": "20.032"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.032"
                        },
                        "BudgetYearTwo": {
                            "val": "19.965"
                        },
                        "BudgetYearThree": {
                            "val": "20.971"
                        },
                        "BudgetYearFour": {
                            "val": "20.631"
                        },
                        "BudgetYearFive": {
                            "val": "21.006"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds. Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop: improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability (for example:  design of insensitive munitions (IM)); novel experimental techniques and material property databases to support modeling and simulation; higher power and safer explosives and propellants; miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors; design tools to enable development of higher performance warheads and weapons—such as penetrators—that are hardened against high impact loads; and tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n– Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n– Reducing time and cost for acquisition of munitions.\n– Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n– Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n– Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n– Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n– Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCG conduct semi-annual technical peer reviews of JMP projects and plans. DoD Service laboratory technical experts lead each of the TCG to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n– The JMP is the primary provider of high performance structural mechanics computer codes used by DoD.  According to the FY 2010 High Performance Computing Modernization Program (HPCMP) Requirements Analysis Report, the DOE computer codes are used for over 70 percent of all (classified and unclassified) structural mechanics simulations and for virtually all of the classified calculations run by DoD on HPCMP platforms.  The Department expects this heavy reliance on DOE codes to grow for several reasons including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n– A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n– CHEETAH, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n– The Army Research & Engineering Development Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads. The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n– The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n– New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies are also the basis for a new GBU 129 weapon that is currently under rapid development to meet a Joint Urgent Operational Need requirement for a low-collateral Mk-82 class weapon.\n– The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including: compact synthetic aperture radar (SAR) systems for counter-IED efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n– An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n– A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n– Reliability analysis tools were used by Army Missile Command to assess RAM, AMRAAM, and TOW.\n– Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Warheads and Energetics Consortium (NWEC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors. In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the approximately 35 JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas: Computational Mechanics and Material Modeling; Energetic Materials; Initiators, Fuzes, and Sensors; Warhead and Penetration Technology; and Munitions Lifecycle Technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computational Mechanics and Material Modeling"
                                    },
                                    "Description": {
                                        "val": "Projects in this technical focus area develop computational tools, material models, and calibration and validation databases which support the design and development of weapon systems.  These capabilities are intended to predict the complex phenomena across significant length (meso to continuum) and time (microsecond to minute) scales.  The tools will provide coupled, multi-physics and chemistry modeling capabilities that are scalable to massively parallel architectures for solving very diverse problems across the weapons systems’ research and development and acquisition communities.  Numeric tools are the foundation that makes possible the integration of mechanics, materials science, physics, and chemistry.  This focus area also includes an extensive experimental component consisting of phenomenological or “discovery” experiments that drive model development; calibration experiments to compliment models; and experiments for model and code validation.\n\nThe specific projects in computational mechanics and material modeling are:\n\n– CTH, SIERRA shock physics code & model development, and experiments: impact initiation of high explosives; composite material modeling; mesoscale experiments, model development, & analysis; coupled physics code development; and models for localization and failure.\n– Arbitrary Lagrangian-Eulerian (ALE3D) code & model development.\n– Advanced Multi-Domain Coupling (AMC) (formerly DUNE) development.\n– Composite case technology and modeling.\n– Near-field lethality modeling.\n– Dynamic properties of materials.\n– Energetic materials and polymers under dynamic and thermal loading.\n– Fragment impact and response experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.803"
                                            },
                                            "Text": {
                                                "val": "– Coupled yield damage-surface with void effects and demonstrated with plasticity code in 3D.\n– Implemented composite structural plate\/shell model with cohesive zone element.\n– Developed dual domain material point method for use in CartaBlanca particle code.\n– Coupled viscoplastic self-consistent plasticity model with ALE3D using adaptive sampling techniques.\n– Completed mechanical characterization of rocket insulating material.\n– Completed Taylor impact testing of explosive PBX N9.\n– Released new version of ViscoSCRAM.\n– Applied ViscoSCRAM to high rate impact and penetration problems.\n– Completed study of rubbery damage in high performance rocket propellants (HPP).\n– Completed small-scale gap threshold experiments of low-density and thermally cycled PBX 9501.\n– Completed ball impact experiments to characterize debris cloud from inert rocket motor surrogates.\n– Released ALE3D version 4.14, which includes several new material models, enhancements to autocontact, and improved usability.\n– Implemented 2D fluid-solid interactions in Adaptive Multi-domain Coupling. \n– Completed cylinder testing to determine factors governing compression strength of composites.\n– CTH versions 10.0 and 10.1 released.\n– Conducted shockless dynamic compression of HE at low temperature.\n– Released beta version of thermal battery thermal model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.613"
                                            },
                                            "Text": {
                                                "val": "– Develop an advanced shell structural element for composite models.\n– Further develop the two-component shear localization model to address fragmentation problems.\n– Apply CartaBlanca to 3D fracture and fragmentation problems.\n– Complete next generation high explosive mechanical models.\n– Couple ViscoSCRAM micro-damage to Finite Element Model macro-damage.\n– Complete initial study of shock shear initiation of explosives.\n– Develop a coupled initiation-constitutive model for high explosives (HE).\n– Complete ball impact test series on covered PBXN-9 charges.\n– Complete preliminary tests to assess utility of extended Floret test to determine explosive initiation and performance data.\n– Next release of ALE3D with improvements in: 2D and 3D detonation shock dynamics (DSD); element erosion; smooth particle hydrodynamics (SPH); material property database; embedded grids; and finite void insertion.\n– Complete validation and verification of AMC 2D hydrodynamic-structure coupling and 2D hydrodynamic-light rigid body coupling.\n– Complete study of using nanoparticles to enhance strength of composite materials.\n– Complete thermal sensitivity study of carbon fiber\/epoxy composite – Release CTH versions 10.2 and 10.3 with: physics-based fracture; material interface improvements; and material property consolidation.\n– Demonstrate more accurate coupling of SIERRA and CTH for analysis of shock-loaded structures.\n– Demonstrate embedded beam\/spar elements for modeling composite structures such as reinforced concrete.\n– Implement new statistical models for shock analysis of reactive composite energetic materials.\n– Complete shock characterization of fiber composite materials.\n– Compare different experimental techniques for temperature measurement during dynamic deformation of materials.\n– Complete shockless dynamic compression of heated and cooled explosive materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.331"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.331"
                                            },
                                            "Text": {
                                                "val": "– 2D and 3D simulation using Tonks model and experimentally determine microstructure.\n– Incorporate interface particles into CartaBlanca.\n– Develop couple yield-damage surface model with shock effects.\n– Complete characterization of HTPB binder for rocket propellant.\n– Implement next generation HE mechanical model into ABAQUS and EPIC codes.\n– Develop polymer constitutive model with improved damage physics.\n– Complete tests to determine influence of temperature on impact response of pristine and damage energetic materials.\n– Next release of ALE3D with improvements in: implicit shells; embedded grids; material database; coupled element erosion with SPH; and DSD with corner turning.\n– Improved AMC with adaptive mesh refinement and implementation of 2D fluid-structure coupling into ALE3D.\n– Complete experimental and computational study to determine optimum performance of metal\/composite couplers.\n– Generalize and extend SIERRA XFEM capabilities to model pervasive failure mechanisms.\n– Improve large deformation modeling applied to progressive collapse of structures.\n– Release CTH versions 11.0 and 11.1 with: energy\/momentum discards; new tabular equation of state format; adaptive mesh refinement compatible with manual rezone; and a model for non-ideal explosive behavior.\n– Compete line VISAR measurements of HE to support heterogeneous material modeling and statistical analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new energetic materials (EM) and supporting technologies to satisfy the competing requirements for smaller, more lethal, and safer munitions.  Work is primarily focused on explosives, gun and rocket propellants, and, to a lesser extent, pyrotechnics.  The projects include development of: new EM, including new molecules in a range of particle size and morphologies; new EM formulations; a fundamental understanding of energetic properties and performance; and computational tools for analysis of performance and sensitivity.  New materials and formulations are developed with the recognition that cost must be feasible, chemical feed stocks reliable, and manufacturing processes suitable for scale-up to production levels.\n\nBoth federal statute and Department policy direct the development of safer, less sensitive munitions.  Making munitions less sensitive while maintaining explosive or propellant performance is a difficult challenge.  This goal is best attained through a combination of new EM development, EM characterization, and more sophisticated modeling and simulation tools.  It is cost-prohibitive to qualify weapons for compliance with insensitive munitions requirements through testing alone.  A better, in many cases the only means to qualify these weapons is with the combination of analysis based on validated computational tools and a few well-designed tests.\n\nThe Department requires munitions that provide selectable effects.  To achieve these effects, weapons designers need to thoroughly understand the performance of EM used in both the main weapon fill and the initiation systems.  Distributed fuzing systems can provide selectable effects as well as safer munitions, but such complex small-scale systems require more complete knowledge of EM detonation physics and in, some cases, new EM designed for this application.\n\nThe desire for smaller and lighter munitions is driven in large part by the increasing dependence on unmanned weapons platforms and to some extent by the need to reduce logistical burden, especially energy consumption.  New EM are needed to meet the munitions weight and size requirements while maintaining lethality and safety.\n\nThe Department is working to increase the range and velocity of weapons and to develop weapons against hardened targets.  These applications subject the EM to high accelerations and shock loads.  To support the development of these new systems, we need to improve our ability to model EM under impact loads and to characterize relevant properties to determine their ability to survive in these aggressive environments.  We may also need to develop new, more robust EM that survive impact loads while maintaining lethality and initiability.\n\nThe specific projects in the energetic materials technical focus area are:\n– Synthesis, properties, and scale-up of new energetic compounds\n– Insensitive munitions and surety\n– New energetic materials formulation and characterization\n– CHEETAH thermochemical code development and experiments\n– Micro- and nano-energetics synthesis and initiation\n– Hazards analysis of energetic materials\n– Reaction processes of energetic materials\n– Microfluidic reactor synthesis of sensitive explosives\n– Energetics chemistry and properties\n– Microstructural and kinetic effects on energetic materials behavior\n– Microwave sensitization and initiation of energetic materials"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.783"
                                            },
                                            "Text": {
                                                "val": "– Synthesized new oxidizer materials, including those based on trinitromethyl substituents on heterocyclic materials.\n– Scaled-up synthesis of high-nitrogen burn-rate modifiers TAGDNAT, TAGN4BIM, and TAGATF and sent products to DoD labs for evaluation.\n– Conducted next series of thermal cook-off experiments in the proton radiography facility.\n– Constructed and evaluated dynamic X-ray diagnostic for thermal kinetic studies of energetic materials.\n– Scaled up synthesis of LLM-172 and -191 explosives.\n– Demonstrated new synthesis route for insensitive HE LLM-105 at the 2 kg scale.\n– Characterized phase diagrams for three binary melt-cast explosives.\n– Characterized performance of low-melting point explosives using newly developed small-scale rate stick test.\n– Completed sound speed measurements on water and strong acid mixtures at highest pressures and temperatures ever achieved for such systems in order to calibrate Cheetah equation of state (EOS) predictions.\n– Completed first ever EOS measurement of boron-containing product to facilitate development of Cheetah boron chemistry predictions.\n– Completed study of relationship between porosity and deflagration rates in HMX-based explosives.\n– Completed shock initiation testing and developed ignition and growth model parameters for PBXN-112 and AFX-757.\n– Determined that DNTF exhibits the smallest critical thickness of any secondary explosive.\n– Conducted a series of experiments on RDX with the variable volume version of the Sandia Instrumented Thermal Ignition (SITI) apparatus and measured gas evolution prior to ignition in slow cook-off.\n– Demonstrated that quantum chemistry calculations do not capture key features of low- and moderate-temperature reaction pathways for heterogeneous energetic materials.\n– Demonstrated morphologically varied lead azide by controlling microfluidic reactor parameters and reaction precursor composition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.482"
                                            },
                                            "Text": {
                                                "val": "– Synthesize insensitive energetic materials NNQAT and NNQBT.\n– Implement full thermal kinetic model for HMX into ALE3D.\n– Establish relationships between internal pressure and convective and conductive burn rates in PBX 9501.\n– Lab-scale production, dielectric property characterization, and energetic performance testing of microwave-sensitive energetic materials.\n– Develop preliminary model for microwave sensitivity of filled IMX-101.\n– Construct CTH model of a hemispherical microwave-sensitized explosive system using a kinetics-based burn model and compare to a preliminary onionskin experiment.\n– Synthesize new oxadiazole-based explosives using tricyclic nitrofurazan derivatives.\n– Calibrate and validate new precision rate-stick design to extract reliable equation of state data.\n– Implement, calibrate, and test ionic equilibrium option in Cheetah for CHNO and halogenated explosives.\n– Expand liquids and solids EOS library in Cheetah for more accurate modeling of metal-loaded explosives.\n– High pressure and temperature EOS data for acid mixtures, oxides, and silicon compounds to support further development of Cheetah.\n– Implement multiphase convective burn model spiral two and HERMES spiral two model for impact response of energetic materials in latest release of ALE3D.\n– Complete shock initiation measurements of PBXN-112 and AFX-757 at different pressures to refine ignition and growth model parameters.\n– Deposit a large area of thin-film explosive with good uniformity.\n– Complete multi-point detonation transfer in the thin explosive films.\n– Develop cook-off pre-ignition models that incorporate pressure dependence and gas generation and validate the models for TATB explosives and AP propellants.\n– Determine the effect of confinement on ignition in fast cook-off.\n– Demonstrate use of Simultaneous Thermogravimetric Modulated Beam Mass Spectrometery and Chemical Imaging Precision Mass Analysis to ignition and initiation processes of energetic materials at low and moderate temperatures.\n– Prepare and characterize modified AP for IM propellants.\n– Complete preliminary microfluidic nitration reactor design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.479"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.479"
                                            },
                                            "Text": {
                                                "val": "– Complete synthesis and characterization of insensitive energetic materials for booster applications.\n– Design deflagration to detonation transition experiments for proton radiography.\n– Compare simulations with pop plot behavior and onionskin experiments for microwave-sensitized explosives.\n– Synthesize new tricyclic and quadricyclic oxadiazoles for insensitive and high-power high explosives.\n– Design an efficient prototype test for determining failure diameters.\n– Release Cheetah version seven, which will provide enhanced accuracy for a wide range of energetic formulations, including those containing fluorine, chlorine, bromine, boron, silicon, and tungsten.\n– Develop technique to characterize high-pressure deflagration.\n– Complete mesoscale simulations of energetic materials under stress and pressure\/confinement.\n– Scale thin-film deposition of explosives to gram scale.\n– Develop and validate models for thermally induced damage in TATB explosives and AP propellants.\n– Complete thermal decomposition study of propellant binder PNO with and without candidate stabilizers.\n– Determine low and moderate temperature reaction networks for pyrotechnic actuator materials TiHx and KClO4.\n– Complete initial microfluidic nitration reactor experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Initiators, Fuzes, and Sensors"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems. Initiators, fuzes, and sensors must work reliably together to prevent unintended detonation, to correctly detect intended targets, and to initiate detonation when required.  Projects in this focus area support the Department’s needs to miniaturize fuzing systems.  Smaller systems are required for several reasons including: compatibility with smaller and lighter weapons systems; trading volume in munitions for other components such as additional explosive, larger power sources, or guidance systems; increasing reliability through redundancy (use two or more smaller initiating systems); and upgrading existing sub-munitions with smarter and more reliable fuzing systems.  The miniaturization of fuzing systems requires new material and components, new power systems, new diagnostic techniques, and improved modeling tools for microdetonics.  The Department also needs weapons systems with selectable effects and these effects can be achieved with multi-point initiation systems.  Such systems are inherently more complex and require improved characterization of initiator materials and components as well as more sophisticated modeling and simulation tools.  To attain greater precision and to avoid unintended collateral effects when weapons are used in the complex environment of counter-insurgency or counter-terrorist operations, target sensors must be reliable and provide high-fidelity discrimination.  Two projects in this focus area are developing technologies to achieve this level of performance in compact packages.\nThe specific projects in the initiators, fuzes, and sensors technical focus area are:\n– Firing systems technology: FireMod firing set code model development and validation, 1.6 hazard classification detonator development, and initiation and detonation physics on the millimeter scale.\n– Safe, arm, fuze, and fire technologies: processing of miniature fuze components, miniature electronic safe and arm detonator designs, and novel fuzing systems.\n– Advanced initiation systems: diagnostics development, microdetonics, miniature initiation systems, and detonators for enhanced safety.\n– New materials, fabrication technologies, and modeling and simulation tools for thermal batteries. \n– MESASAR synthetic aperture radar (SAR) sensors.\n– Vertical cavity surface emitting laser (VCSEL) sensors for proximity fuzing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.682"
                                            },
                                            "Text": {
                                                "val": "– Evaluated the use of an electric gun for wedge tests and collected pop plot data for the RSI-007 detonator.\n– Developed a 2D hydrocode model for a slapper detonator that uses confinement to assist propagation.\n– Established small-scale production facility for advance thermal batteries and executed a CRADA for technology transfer to an industrial partner.\n– Released beta version of standalone thermal battery thermal modeling capability.\n– Determined ignition behavior of wet-deposited thin-film energetic materials.\n– Validated thin-pulse initiation model based on shock-pore interactions.\n– Fabricated flyback transformers with improved magnetic performance using new ferrite materials.\n– Completed acceptance testing and highly accelerated life testing of advanced multi-mode chip modules for miniaturized synthetic aperture radar systems.\n– Built and tested prototype Ku-Band transmit\/receive module for synthetic aperture radar active antenna array.\n– Demonstrated planar-integrated transmitter-receiver module for vertical cavity surface emitting laser."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.463"
                                            },
                                            "Text": {
                                                "val": "– Complete large-scale Schlieren diagnostic capability for initiation systems.\n– Complete study of detonation transfer across gaps.\n– Continue to collect and catalog Schlieren images of DoD detonators.\n– Measure RSI-007 detonator threshold parameters for electric gun-launched flyer plates.\n– Measure EDF-11 detonator threshold parameters and detonation velocity as a function of charge diameter.\n– Complete study of RSI-007 run-to-detonation distances.\n– Incorporate experimental data into reactive flow models for RSI-007 and EDF-11 detonators.\n– Final summary of novel heat source development and increased power capability for advanced thermal batteries.\n– Complete thermal battery electrochemical model for single cell battery.\n– Release thermal battery thermal modeling capability within SIERRA simulation suite of codes.\n– Develop thermal battery thermo-mechanical modeling for a single cell battery.\n– Measure ignition and growth in the thin-film energetic materials.\n– Evaluate deflagration to detonation (DDT) transition in polymer-bound thin-film explosives.\n– Complete performance testing as a function of morphology for HNS explosive.\n– Summarize EOS data for HNS based on density function theory molecular dynamics simulations and diamond anvil cell experiments.\n– Compare two processes for producing small particle size TATB.\n– Perform chip slapper initiation threshold testing of micronized TATB.\n– Develop and scale-up synthesis of tetragonal barium titanate nanoparticles.\n– Develop process for tape casting nanoparticle lead zirconate titanate into devices.\n– Complete simulations of different packaging methods to improve survivability of a single electronic component under harsh thermal and mechanical environments.\n– Complete a design for improved flux coupling in flyback transformers.\n– Build and test first prototype flyback transformer using new tape-cast materials.\n– Build and range-test a prototype Ku-Band active antenna array.\n– Mature technology and fabrication processes for low-temperature co-fired ceramic multi-chip modules for insertion into radar fuze systems.\n– Demonstrate Geiger mode detection operation of vertical cavity surface emitting laser detector arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.351"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.351"
                                            },
                                            "Text": {
                                                "val": "– Complete explosively driven Particle Imaging Velocimetry measurements.\n– Demonstrate ALE3D model of DoD slapper detonator.\n– Complete optimization of 3D chip slapper shape optimization.\n– Extend James model to account for area effects in detonators.\n– Validate thermal battery thermo-mechanical model for single cell battery.\n– Evaluate deflagration to detonation transition in lead-free, thin-film explosives.\n– Complete survivability simulations of a simple electronic board subject to thermal and dynamic mechanical loading.\n– Build and test second prototype flyback transformer using new tape-cast materials.\n– Develop and range-test a prototype Ka-Band active antenna array.\n– Develop a miniature transmit\/receive module using low-temperature co-fired ceramics and integrate into Ku-Band active antenna array.\n– Improve the power density of 980 nm vertical cavity surface laser emitter arrays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead and Penetration Technology"
                                    },
                                    "Description": {
                                        "val": "This focus area supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes. In recent years there have been very large increases in warhead performance directly attributed to our ability to understand and accurately model the physics and fine details of new warhead designs, and to advances in increasingly sophisticated material processing.  The Department’s requirement to achieve more precise weapon effects with minimum collateral damage is supported by work on controlled fragmentation, non-fragmenting warhead cases, and multiphase blast explosives (MBX). More recently, increases in performance and reductions in vulnerability (IM) are being achieved through improved warhead integration into munitions using a systems-oriented approach.\n\nThe goals for penetrator weapons are to investigate, develop, and transition advanced technologies for the design, development, and performance assessment of the next generation of high performance, precision strike weapons.  This effort directly supports national initiatives to defeat hard and deeply buried targets, which are proliferating worldwide, and to deny\/defeat weapons of mass destruction.  The work addresses high-velocity penetration into granular materials (sand and soil), penetration into advanced concrete, new penetrator materials and designs, and non-inertial onboard instrumentation.\n\nThe specific projects in the warhead and penetration technology focus area are:\n– Multiphase blast munitions (MBX) technology.\n– Erosive initiation technology.\n– Dynamic behavior of sand.\n– Integrated munitions modeling & experimentation.\n– Modeling of strategic structures.\n– Concrete perforation and penetration modeling & experiments.\n– High-g MEMS sensor development.\n– Structural dynamics and vibration effects.\n– Dynamic characterization of accelerometers.\n– High-speed pressure-shear experiments on granular materials.\n– Explosive\/metal interactions.\n– Structure, mechanical & shock-loading response, & modeling of materials.\n– Controlled effects warhead materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.134"
                                            },
                                            "Text": {
                                                "val": "– Completed initial study of HE-driven incipient spall in 1018 steel, Cu, and Ta\n– Completed shear localization studies of high-purity Fe as a function of stress state.\n– Completed an analysis of oblique shock using jump relationships to better resolve wave structure in both reflection and Mach reflection regimes.\n– Completed systematic code verification of the current multiphase blast explosive model in ALE3D.\n– Completed discovery experiments to test new diagnostics that can provide further insight into the key physics of multiphase explosive detonation.\n– Summarized all previous erosive initiator experiments and archived and stored all related data.\n– Performed thermal characterization of PAX-21 for erosive initiator applications.\n– Made operational the freeze-casting apparatus for controlled effects warhead materials (CEWM).\n– Completed simulations to determine pressure profile obtained with laser shock experiments to be used with CEWM.\n– Produced and characterized first batch of CEWM having dilute concentrations of low-melting phase.\n– Completed computational study to assess the effects of different physical parameters on the dynamic mechanical behavior of sand.\n– Completed analysis of the effects of fracture and fluid interaction on the dynamic behavior of sand.\n– Implemented a version of state-based peridynamics in the KRAKEN code for fracture and fragmentation.\n– Made several usability improvements to KRAKEN including: ability to read CUBIT output files, z-data file for output of fragmentation data, and a graphical user interface for input and output.\n– Implemented markers kinematics in CTH.\n– Completed high speed pressure-shear experiments on granular materials.\n– Developed a torsional Kolsky bar for dynamic friction experiments.\n– Completed dynamic characterization of advanced, high-g accelerometers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.871"
                                            },
                                            "Text": {
                                                "val": "– Complete quantification of oblique HE-driven shock hardening and damage in Cu, Ta, and Cu one percent Pb.\n– Complete study of shear localization in HF-1 steel and 6061 aluminum as a function of processing history, strain rate, and temperature.\n– Characterize microstructural changes due to shock obliquity and shear through 3D characterization of damage in Cu and Ta.\n– Improve analysis of oblique shock by adding the TEPLA plasticity model to better determine stress deviator response and adding a bifurcation analysis of metal stability in the shock wake.\n– Develop a multiphase explosive burn model guided by mesoscale simulations and experiments.\n– For erosive initiator technology:\n\t– Perform granular shaped-charge scaling study.\n\t– Validate insult coupling in simulations.\n\t– Validate thermal model for PAX-21.\n\t– Complete mesoscale modeling of granular jet impact.\n\t– Complete tube shot validations.\n\t– Perform reaction volume and target shape effect correlations.\n– Perform quasi-static and laser-driven shock experiments on first batch of CEWM and characterize materials aftershock experiments.\n– Produce and characterize first batch of freeze-cast alumina\/epoxy and W\/Bi CEWM.\n– Produce and characterize first batch of W-Fe-Ni alloy powders mixed with dilute amounts of low melting Bi-Sn powders for CEWM.\n– Complete simulations of Kolsky bar experiments with sand.\n– Complete first enhanced sand constitutive models for implementation in ALE3D.\n– Transition the standalone KRAKEN code to one of the larger DOE codes (ALE3D, CTH, or SIERRA).\n– Implement markers with deviatoric stress capability in CTH.\n– Perform dynamic friction experiments.\n– Perform perforation experiments through high-strength concrete.\n– Provide improved high-strength concrete model in UMAT format."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.758"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "– Identify key mechanisms in particle-target interaction in multiphase blast explosives.\n– Perform code verification and validation for multiphase blast explosives model.\n– Complete quasi-static and laser-driven shock experiments on controlled microstructure materials made from alloy mixture and from W\/Bi.\n– Apply enhanced sand model in impact simulations.\n– Perform KRAKEN simulations of spall, Taylor impact, cylinder expansion.\n– Initial release of KRAKEN fragmentation analysis system.\n– Implement first part of mixture theory in CTH.\n– Complete dynamic friction study."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Lifecycle Technologies"
                                    },
                                    "Description": {
                                        "val": "This focus area supports improving the Department’s ability to understand, measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems.  Current stockpile assessment methods typically focus on addressing materials aging and reliability problems after they occur, rather than anticipating and avoiding future problems or failure mechanisms.  The overall objective of this work is to develop a toolset of computational models that are able to quantitatively predict materials aging processes and ultimately improve the long-term reliability of weapons systems, sub-assemblies, and\/or components.  These objectives are achieved by: identifying aging mechanisms, quantifying the rates at which those aging mechanisms occur, developing predictive models, and using these models to predict the munitions stockpile reliability.  An additional objective of this work is to develop technologies and methodologies to enable munitions health management and condition-based maintenance.\n\nThe specific projects in the warhead and penetration technology focus area are:\n\n– Predictive materials aging including: solder interconnect reliability, corrosion of electronics, and adhesive degradation\n– MEMS reliability\n– Military use of commercial, off the shelf (COTS) electronics\n– Complex system health assessment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.329"
                                            },
                                            "Text": {
                                                "val": "– Demonstrated new science-based health assessment tool for single failure mode modeling using SNL long-term aging data and solder joint failure model for COTS electronics.\n– Developed population reliability methodology and Pareto front approach for the design of experiments to assess weapon system health.\n– Developed metric for determining adhesive degradation by water.\n– Completed Sn whisker validation experiments for lead-free solder dynamic recrystallization model.\n– Completed characterization and accelerated testing of Sn whisker mitigation techniques for lead-free solders.\n– Demonstrated collection of in-situ environmental data using engineered aging structures (EAS) integrated into a weapon system.\n– Validated long-term life prediction models against seven years of field storage data for COTS electronics.\n– Developed life prediction models for new COTS electronic materials and components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.222"
                                            },
                                            "Text": {
                                                "val": "– Develop methodology to identify best resource allocation using Pareto front approach to design of experiments for weapon system health assessment.\n– Develop methodology for optimizing weapon system usage pattern based on health assessment.\n– Complete evaluation of coated and uncoated fused Sn films as mitigators for whisker formation in lead-free solders.\n– Develop method to characterize adhesive degradation to due temperature and humidity changes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.113"
                                            },
                                            "Text": {
                                                "val": "– Couple environmental data to weapon system reliability in health assessment.\n– Determine tin layer thickness, barrier metal fusing temperature, and cooling rate to best mitigate Sn whiskers in lead-free solders subjected to highly accelerated stress testing and temperature cycling.\n– Validate predictions of adhesive to smooth stainless steel degradation in humid environments.\n– Publish best practices for trusted COTS process that include avoidance and detection of counterfeit and adversarial threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented. In FY 2010 there were more than 25 transitions to DoD.\n2) Attendance and technical interactions at the biannual meetings of the nine Technology Coordinating Groups (TCGs) are tracked and documented.\n3) Laboratory Five Year Plans are prepared, evaluated, and analyzed by management and technical staff.\n4) TCG Chairmen's Annual Assessments for each TCG are critically reviewed by the Technical Advisory Committee to determine progress, validate transition plans, and verify relevance of each project.\n5) Project progress toward goals and milestones is assessed at each biannual TCG meeting and critically reviewed annually by the Technical Advisory Committee.\n6) Annual technical reports and papers are tracked and documented."
                        }
                    }
                }
            ]
        }
    }
}