{
    "id": "2677f5978403845a92b2b47822f09b72883d1ef5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603941D8Z"
        },
        "ProgramElementTitle": {
            "val": "Test and Evaluation\/Science and Technology"
        },
        "R1LineItemNumber": {
            "val": "66"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "94.640"
            },
            "CurrentYear": {
                "val": "96.652"
            },
            "BudgetYearOne": {
                "val": "92.602"
            },
            "BudgetYearOneBase": {
                "val": "92.602"
            },
            "BudgetYearTwo": {
                "val": "94.041"
            },
            "BudgetYearThree": {
                "val": "95.825"
            },
            "BudgetYearFour": {
                "val": "98.431"
            },
            "BudgetYearFive": {
                "val": "100.214"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Test and Evaluation\/Science and Technology (T&E\/S&T) program seeks out and develops test technologies to stay in pace with evolving weapons technologies.  This program is critical to ensure that the Department of Defense (DoD) has the ability to adequately test the advanced systems that will be fielded in the future.  To meet this objective, the T&E\/S&T program performs the following activities:\n• Exploits new technologies and processes to meet important test and evaluation (T&E) requirements.\n• Expedites the transition of new technologies from the laboratory environment to the T&E community.\n• Leverages industry advances in equipment, modeling and simulation, and networking to support T&E.\nAdditionally, the T&E\/S&T program examines emerging T&E requirements resulting from Joint Service initiatives to identify T&E technology needs and to develop a long-range roadmap for technology insertion.  The program leverages and employs applicable applied research efforts from the highly developed technology base in DoD laboratories and test centers, other government agencies, industry, and academia to accelerate development of new test capabilities.  This program element also provides travel funds for T&E\/S&T program oversight, special studies, analyses, and strategic planning related to test capabilities and infrastructure.\n     The Secretary of Defense, in a memorandum dated April 19, 2011, established seven strategic science and technology (S&T) investment priorities for fiscal years 2013-2017, specifically 1) Data to Decisions, 2) Engineered Resilient Systems, 3) Cyber Science and Technology, 4) Electronic Warfare\/Electronic Protection, 5) Counter Weapons of Mass Destruction, 6) Autonomy, and 7) Human Systems.  The T&E\/S&T Program has been re-aligned and reprioritized to prepare the T&E community to test warfighting capabilities that emerge from these S&T priority investments.\n     The T&E\/S&T program is funded within the Advanced Technology Development Budget Activity because it develops and demonstrates high payoff technologies for current and future DoD test capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "97.642"
                },
                "CurrentYear": {
                    "val": "99.593"
                },
                "BudgetYearOne": {
                    "val": "102.218"
                },
                "BudgetYearOneBase": {
                    "val": "102.218"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.640"
                },
                "CurrentYear": {
                    "val": "96.652"
                },
                "BudgetYearOne": {
                    "val": "92.602"
                },
                "BudgetYearOneBase": {
                    "val": "92.602"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.002"
                },
                "CurrentYear": {
                    "val": "-2.941"
                },
                "BudgetYearOne": {
                    "val": "-9.616"
                },
                "BudgetYearOneBase": {
                    "val": "-9.616"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.113"
                    },
                    "CurrentYear": {
                        "val": "-2.276"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.889"
                                },
                                "CurrentYear": {
                                    "val": "-0.665"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.702"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.702"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Asssumption Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.086"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.086"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "High Speed Systems Test"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.198"
                        },
                        "CurrentYear": {
                            "val": "19.327"
                        },
                        "BudgetYearOne": {
                            "val": "20.611"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.611"
                        },
                        "BudgetYearTwo": {
                            "val": "25.131"
                        },
                        "BudgetYearThree": {
                            "val": "19.140"
                        },
                        "BudgetYearFour": {
                            "val": "14.729"
                        },
                        "BudgetYearFive": {
                            "val": "13.804"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "High-speed\/hypersonic weapons are being developed to ensure the continued military superiority and strike capability of the United States.  Current weapon system demonstrations and technology development programs include high-speed and hypersonic air-breathing missiles, maneuvering reentry and boost\/glide weapons, hypersonic gun-launched projectiles, and air-breathing space access vehicles.  These systems require development of high-speed turbine, ramjet, scramjet, and combined cycle engines; high temperature materials; thermal protection systems; and thermal management systems.  In addition, important advancements are underway in systems such as conventional turbine engines and high-speed (supercavitating) torpedoes.\n     In response to advances made in technologies to achieve prompt strike weapons, the Advanced Propulsion Test Technology project has been renamed to High Speed System Test (HSST) to address test technology needs beyond propulsion testing, including aerodynamic and aerothermal testing, so that the test community has the technology to support the required test scenarios for concepts under development in the science and technology (S&T) community.  Furthermore, the technology development efforts within the HSST project have been re-prioritized to align to Secretary of Defense guidance on S&T priority investments for FY2013-2017.  The HSST project is developing advanced test and evaluation (T&E) technologies for ground test (both advanced propulsion and aerodynamic\/aerothermal testing), for open-air range flight test, and for advanced computational tools, along with instrumentation and diagnostics systems that could be used both in ground tests and flight tests of high speed systems.\n     The HSST project develops technologies to enable robust, accurate, and timely T&E of these future weapon systems.  Department of Defense (DoD) acquisition regulations require weapon systems to undergo a thorough T&E process to detect deficiencies early and to ensure system suitability and survivability.  However, the extreme environments in which these weapons operate preclude accurate determination of their performance with today’s T&E assets.  Current national test capabilities have deficiencies in data accuracy, flight condition duplication and simulation, test methods, productivity, modeling and simulation (M&S) fidelity, and range safety.\n     The HSST mission is to provide test technologies that will enable high-speed and hypersonic weapon systems to be successfully developed through accurate, robust, and efficient T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed Systems Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.198"
                                            },
                                            "Text": {
                                                "val": "Significant advancements were made in ground test technologies for both air-breathing propulsion and boost\/glide weapons, development of new flight test capabilities, demonstration of new instrumentation for ground and flight test, and release of new M&S tools.\n   Analysis and reporting were completed on the results of a scramjet engine test program conducted in a specially designed ground test facility showing, for the first time, effects of using “vitiated air” (air contaminated with the products of combustion) on the performance of a hydrocarbon fueled scramjet engine.  Current production ground test facilities can only create the high temperature inlet conditions necessary for scramjet engine tests by burning fuel in the airflow prior to entering the engine.  The resulting “vitiated air” has different gas properties than clean air which significantly affects the engine’s performance and introduces artificiality in the test environment and errors in predicted flight performance.  These landmark reports will improve the understanding of results from existing vitiated T&E facilities, help explain flight test results, improve the accuracy of M&S, and guide investments in future T&E capabilities.\n   Tests were also completed comparing the performance of identical engines in impulse and blow down aero propulsion facilities in order to quantify the accuracy of the different test methods.  The tests revealed significant differences, providing the T&E community with important new information to guide future weapon system test plans.\n   Two new technology developments were initiated to develop the test techniques necessary to accurately test large scramjet engines in our existing national facilities which would otherwise be deemed too small a scale for accurate measurements.  One effort will evaluate a means of truncating the long inlet section of an engine while still accurately replicating its performance.  The other effort will quantify and improve the accuracy of direct connect and semi-free jet test techniques by comparing them to a benchmark free jet test.  Collectively, all of the aforementioned technology developments will allow weapons system developers to maximize the use of our existing infrastructure and better understand test results, thereby reducing flight test and acquisition risks.\n   The two key technologies necessary for revolutionary improvements to the accuracy and productivity of aero propulsion ground test are clean air heat addition (i.e. non-vitiated air) and variable Mach number test capability.  Component technologies for these desired capabilities were previously developed by the T&E\/S&T program and are now being incorporated into a small scale, clean air, variable Mach number, aero propulsion test facility.  Integrating these technologies into an operational facility will complete their development to Technology Readiness Level 6, provide an on-going test asset to the DoD, and provide risk reduction for construction of a full scale facility.  Significant progress was made this year with the completion of all Phase I design work, fabrication of the heater’s pressure vessel, and initiation of production of the yttria-stabilized-zirconia heat storage bricks and the modifications required for integration into an existing host facility.\n   Understanding ablation characteristics of thermal protection systems is critical for maneuvering reentry and boost\/glide vehicles.  A new electrode design that increases arc jet facilities’ maximum enthalpy (available energy to simulate flight conditions) and run time, was successfully demonstrated this year allowing for more realistic tests of leading edge materials.  Additionally, a new test technique was established utilizing low temperature ablators in existing wind tunnels which do not achieve true reentry temperatures to determine the affect of ablation on vehicles’ stability and control and to provide data for validating ablation computer models.  Final tests in this technology development were successfully conducted at Mach 8 and 14 with a boost-glide vehicle nose tip.\n   Advances in flight test technologies included advances in flight termination technology and flight maneuvers.  Hardware-in-the-loop testing and final design of a flight rated, autonomous flight termination system were completed.  The autonomous flight termination system is designed to assure destruction of an errant hypersonic vehicle if it leaves its designated safety corridor.  Advanced parameter identification maneuvers were designed, qualified, and programmed into the flight computer of the second X-51 flight.  These special maneuvers are designed to collect far more stability and control data per flight than possible using traditional methods thus reducing the number of flight tests and costs.\n   Progress was also made in advanced high speed systems test instrumentation.  Fabrication of a flight-weight, laser-based, non-intrusive measurement system was completed for an upcoming flight test.  A similar laser-based system for ground testing was transitioned and is being used in a hypersonic wind tunnel.  Further advancement of this technology is being made by utilizing newly available lasers operating in the mid-infrared spectrum to significantly lower measurement uncertainties.  Design and fabrication of a miniaturized, temperature compensated wind tunnel balance specifically addressing a T&E gap in supersonic store separation capabilities was completed.  Finally, testing of a fiber optic heat flux gauge was also successfully completed. \n   Investment in a state-of-the-art validated computational fluid dynamics tool culminated in release of an updated version to the hypersonic community that can simulate the complex flows within scramjet engines and includes physical modeling for turbulence, fuel-air combustion, and heat transfer.  The code was successfully used to model combustion phenomenon in a scramjet engine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.327"
                                            },
                                            "Text": {
                                                "val": "FY 2012 will see continued efforts to improve hypersonic ground test capabilities to levels required for acquisition programs including demonstration of new flight test techniques, improvements in instrumentation, and continued validation\/improvement of computational fluid dynamics codes.\n   Scramjet ground tests in free jet, semi-free jet, and direct connect test modes will be conducted to quantify their respective accuracies and identify optimal test methods for larger, next generation scramjet engines.  Further vitiation effects data will be collected to increase the community’s knowledge base. \n   Phase I work to integrate advanced ground test component technologies into a clean air variable Mach hypersonic aero propulsion facility will be completed with the clean air heater being demonstrated to Mach 8 temperature levels.  Phase II work will be initiated including design of the variable Mach number nozzle and fabrication of components to vary set conditions.\nTesting of improved arc jet facility electrodes will be completed enabling greatly improved T&E of maneuvering reentry and boost\/glide vehicles.  A technology for enabling propulsion testing beyond Mach 8 using magnetohydrodynamics to accelerate flow ionized by electron beams will be demonstrated.\n   Advanced flight parameter identification maneuvers will be demonstrated during an upcoming X-51 test.  A flight-weight, laser-based, non-intrusive combustion gas analysis system will be demonstrated on a HIFiRE flight and development of a more accurate, mid-IR laser based system will continue.  Construction and testing of a miniaturized, temperature compensated wind tunnel balance for supersonic store separation will be completed.\n   Validation and improvement of the computational fluid dynamics codes will continue, making use of the unique datasets obtained from the scramjet engines tests mentioned above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.611"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.611"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts in FY 2013 will be centered on completion of Phase II of the clean-air, variable Mach number development, including completion of the variable Mach number design and demonstration of clean air aero propulsion testing up to Mach 8.  This phase will culminate with demonstration of the technology to vary pressure, temperature, and enthalpy with fixed nozzles up to Mach 8 conditions.  Testing for vitiation, test methodology and scale effects will conclude and cumulatively provide the most extensive examination of hypersonic aero propulsion methods yet accomplished and will enable significant improvements in the quality of data provided to weapon system developers and computational fluid dynamics tool developers.  Work on a new mid-infrared non-intrusive flow measurement will conclude in FY 2013.\n   New test technology efforts will be initiated addressing:  test technologies, techniques, and methodologies to determine full-scale propulsion system performance and operability from subscale tests; technology for continuous flow, clean air heat addition up to Mach 6 to enable full-scale, combined cycle, propulsion system test; further development of M&S codes for accurate prediction of flow fields, boundary layer transition, and heat transfer in high-speed flow; new and more accurate instrumentation systems; and application of advanced test technologies to other needs such as gas turbine engines, electromagnetic rail guns, and supercavitating torpedoes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Spectrum Efficient Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.755"
                        },
                        "CurrentYear": {
                            "val": "9.608"
                        },
                        "BudgetYearOne": {
                            "val": "8.140"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.140"
                        },
                        "BudgetYearTwo": {
                            "val": "7.770"
                        },
                        "BudgetYearThree": {
                            "val": "10.401"
                        },
                        "BudgetYearFour": {
                            "val": "10.380"
                        },
                        "BudgetYearFive": {
                            "val": "11.425"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Weapon systems have become drastically more complex in recent years, resulting in the need for significantly more data to be passed among these systems, and between the systems and our test infrastructure.  A vast amount of data must be collected, transmitted, and analyzed, which requires a large amount of spectrum resources.  However, the amount of radio frequency spectrum designated to support test and evaluation (T&E) is decreasing, most notably due to reallocation for commercial use.  The combination of decreasing radio frequency spectrum and increasing data requirements results in an urgent need to create test technologies that maximize the use of spectrum resources for Department of Defense (DoD) T&E operations.\n   The L and S frequency bands are the traditional spectrum allotted for military use.  The explosive need for spectrum in the commercial sector has resulted in reallocation of portions of these bands to industry.  To compensate, DoD was authorized to use the C-Band spectrum which offers numerous benefits, including a three-fold increase in available bandwidth, but comes with technical challenges.  Most notably, our current test infrastructure for telemetry is not designed to accommodate C-Band.  Technologies are required to implement innovative techniques that efficiently extend our use of C-Band without a major overhaul to our national test infrastructure.  For instance, commercial telemetry transmitters operating in C-Band exist but do not have the form factor (size and weight) or packaging (not ruggedized) to survive airborne test applications.\n   Traditional telemetry applications employ streaming telemetry where data is moved one-way from the instrumented system under test to our test infrastructure.  Modern network based telemetry capabilities, like those being developed by the Central Test and Evaluation Investment Program (CTEIP), enable more robust\/efficient bidirectional transfer of data.  DoD’s strategy is to create technologies for streaming telemetry capability in C-Band, opening up legacy L- and S-Bands for networked telemetry usage.\n   The Spectrum Efficient Technology (SET) project is developing test technologies that enable more efficient use of legacy telemetry bands and expansion into non-traditional areas of the radio frequency and optical spectra at DoD test ranges.  These technology advancements will address both the growing data requirements of warfighting systems and the limited availability of spectrum to support testing.  The technology development efforts within the SET project have been re-prioritized to align to Secretary of Defense guidance on science and technology priority investments for FY2013-2017.  The SET project is structured to develop test technologies to advance range communications, networked telemetry capabilities, and enhanced management of spectrum at DoD test ranges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spectrum Efficient Technology"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.755"
                                            },
                                            "Text": {
                                                "val": "The SET project developed technologies to meet networked telemetry requirements and perform risk reduction for CTEIP.  Technology enabling the dynamic reconfiguration of transmitted test data over a telemetry network was further matured.  Policy-based (i.e., predefined technical rules for equipment configuration) management tools to optimize data throughput and increase spectrum utilization was matured.  Spectrum and network management technology continued, with a focus on capabilities that allow for dynamic distribution of spectrum resources amongst test participants.  The spectrum management technologies matured by SET provided risk reduction in support of spectrum management needs exacerbated by spectrum selloff activities.  The SET project matured and demonstrated the capability of a radio network to rapidly change operating frequencies based on policies in the presence of non-cooperative interference, thus maintaining connectivity with no perceivable impact on telemetry network performance.  Additionally, the SET project initiated the development of a three dimensional channel model tool for modeling and simulation of telemetry channels in various environments to provide higher fidelity simulations for use in researching the effects of terrain and other factors on telemetry channels.  The SET project also initiated efforts to address a CTEIP requirement for networked test articles to operate between various test ranges without losing data connectivity.\n   Development continued on advanced waveform technologies to increase radio frequency bandwidth efficiency.  A networked telemetry transceiver using an advanced waveform was developed and tested as a risk reduction effort for the CTEIP integrated Network Enhanced Telemetry (iNET) development.  The SET project initiated an effort to develop a networked data recorder to provide risk reduction in support of iNET development.  Efforts continued in developing forward error correction schemes for use in aeronautical telemetry to increase data reliability in dynamic test environments.  A Space Time Code implementation and associated hardware prototypes were demonstrated to show significant improvement in data reliability in highly dynamic multiple airborne antenna installations.\n   The SET project investigated techniques to expand telemetry operations into non-traditional spectrum bands by characterizing multipath effects in multiple range environments.  Development of a wideband power amplifier capable of efficiently operating with advanced waveforms within the traditional telemetry bands was matured to increase efficiency in spectrum utilization.  Additionally, SET initiated efforts to develop airborne phased array antenna technology that will enable flexible scheduling of the T&E spectrum by incorporating both the traditional and C-Band frequencies.  These technologies will reduce the technical risk associated with beam steering in the C-Band frequencies, reduce the amount of infrastructure modifications needed to implement a C-Band telemetry capability, and provide over-the-horizon data connectivity to test articles such as missiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.608"
                                            },
                                            "Text": {
                                                "val": "The SET project will further advance development of technologies required for network telemetry.  Efforts to develop policy-based network management tools will be completed, demonstrated, and transitioned to support CTEIP developments.  Spectrum and network management systems, including a suite of network protocols, will be demonstrated and transitioned to the test ranges.  Technologies to develop advanced waveforms designed to increase bandwidth efficiency will be matured.  The development of advanced waveforms will enable the telemetry network to support multiple high data rate test assets and increase efficiency and spectrum utilization.  Development of a networked data recorder in support of iNET continues.  Development of technology to enable inter-range data connectivity continues.  Technologies to develop a three dimensional channel model tool used in modeling and simulation of telemetry channels in various environments will be matured. Emphasis will be placed on development and maturation of technologies required to expand telemetry operations in other frequency ranges.\n   Phased array antenna technology utilizing both the traditional and C-Band frequencies will continue to be matured to enable flexible spectrum scheduling and alleviate technical risk associated with tracking and beam steering in the C-Band.  The SET project will initiate efforts to develop an airborne multiband transceiver to support networked telemetry, increase spectrum scheduling efficiency, and support two-way data transmission of the telemetry network in both traditional and C-bands.  Development of forward error correction schemes for use in aeronautical telemetry to increase data reliability will be completed and transitioned to ranges.  Additionally, SET will begin an effort to provide risk mitigation and transition to iNET in the area of optimizing transmission synchronization parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.140"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.140"
                                            },
                                            "Text": {
                                                "val": "The SET project will initiate development of radio technology that can utilize alternate spectrum in the upper frequency bands.  These efforts will determine the feasibility of some of the upper bands for use in telemetry.  Additional efforts on alternate data link technologies in the optical realm will be initiated.  If efforts in this area are successful, these technologies can provide augmentation to the existing telemetry bands.  The SET project will continue efforts to mature phased array technology for use on the ground as well as in airborne applications.  The high directionality of phased array antenna technologies on aircraft will enable the ability to leverage spectrum spatial reuse techniques for more effective spectrum scheduling.  The SET project will begin investigation and development into systems that will provide autonomous self forming telemetry networks to provide connectivity in flight line and other areas that currently suffer from limitations in communications coverage caused by buildings, terrain and multipath fading effects.  Work will be completed on forward error correction schemes for use in aeronautical telemetry to increase data reliability.  Efforts will complete the development of a three dimensional channel model tool used in modeling and simulation of telemetry channels in various environments.\n   Additionally, continued efforts will provide risk mitigation and transition to iNET in the area of optimizing transmission synchronization parameters for use with the iNET radio network.  Efforts will continue to facilitate mobility of test articles between iNET network instances.  The SET project will continue work on the development of a networked data recorder to provide risk reduction in support of iNET capability.  The SET project will complete work to mature technologies in optimization and management of the telemetry networks through spectrum management tools designed to optimize spectrum utilization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Test"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.419"
                        },
                        "CurrentYear": {
                            "val": "19.912"
                        },
                        "BudgetYearOne": {
                            "val": "18.206"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.206"
                        },
                        "BudgetYearTwo": {
                            "val": "13.542"
                        },
                        "BudgetYearThree": {
                            "val": "12.110"
                        },
                        "BudgetYearFour": {
                            "val": "15.905"
                        },
                        "BudgetYearFive": {
                            "val": "18.570"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Readily available, infrared (IR) seeking, man-portable air defense systems (MANPADS) are difficult to detect and pose an imminent and lethal threat to military aircraft of all types.  Our ability to counter such threats is essential to owning the airspace in theater.  Therefore, the ability to test missile warning systems (MWS), hostile fire indicators, infrared countermeasures (IRCM), and advanced sensors is critical to our national defense.  Additionally, a new generation of enemy radio frequency (RF) missile seekers is both currently fielded and in further development, requiring a correspondingly new generation of test technologies to test the latest countermeasures.  The test and evaluation (T&E) community is required to test IRCM and RF countermeasure systems in a repeatable manner with validated ground-truth data before and after integration into warfighting systems.  Without new test technologies, the Department of Defense (DoD) will be unable to perform adequate T&E of advanced countermeasure systems.\n     In response to Secretary of Defense guidance on science and technology priority investments for FY2013-2017, the T&E\/S&T program restructured and reprioritized on-going Multi-Spectral Test (MST)technology efforts to address emerging Electronic Warfare\/Electronic Protection test needs.  Accordingly, the MST project was renamed to the Electronic Warfare Test (EWT) project, to align with the Department’s priorities.  The EWT project is focusing on the test needs in both the electro-optic (EO) and the radio frequency domains, and by concentrating on the core test technology needs, technical advancements in this area have applicability to other EO and RF test requirements, such as in fire control systems, reconnaissance sensors, and missile seeker subsystems.\n     The EWT project develops test technologies to stimulate IRCM and RF system sensors through the high-fidelity simulation of scenes viewed by the sensors.  Stimulation can be as simple as testing to see if a system under test responds to an image or as complex as simulating battle phenomena to measure the response of a system under test in a more relevant, cluttered scenario.  Simulations and stimulations are used at open air ranges (OAR) and in installed system test facilities (ISTF), and in hardware-in-the-loop (HWIL) test beds."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.419"
                                            },
                                            "Text": {
                                                "val": "The EWT project has made progress developing the technology for the high-temperature scene emitter for the Central Test and Evaluation Investment Program (CTEIP) Joint Distributed IRCM Ground-Test System (JDIGS) development, which is improving the DoD test capabilities for directional infrared countermeasures (DIRCM) systems.  For example, the EWT project is in the final stages of testing a new superlattice light-emitting diode source that can provide two-color, high-temperature scenes with a frame rate fast enough to test new IRCM and missile warning systems.\n   The EWT project has made significant progress with read-in integrated circuit technology, which supplies electrical energy to emitters that generate images in ISTF and HWIL test facilities.  This technology is preparing for final testing before transition.  Most significantly, this read-in integrated circuit technology will make future DoD development of scene projectors more affordable since it is capable of supporting a variety of next generation of emitters, of which several are currently in development within the EWT portfolio.\n   The EWT project initiated an effort to develop a breadboard capability to produce high-fidelity electronic counter-countermeasures radar signal processing techniques that employs sophisticated waveforms with algorithms, such as adaptive filtering.  This technology development is to address a need identified by the Navy-led, CTEIP-sponsored Tri-Service Electronic Warfare Test Capabilities Study, to improve testing against modern surface-to-air missile threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.912"
                                            },
                                            "Text": {
                                                "val": "Risk reduction activities for the CTEIP in testing MWS in integrated ISTF and HWIL will continue.  The EWT project will concentrate on addressing new test technology needs identified in the update to the IRCM Test Resource Requirements Roadmap.  Furthermore, EWT technology developments will focus on stimulating synthetic aperture radars with radio frequency injection, including realistic background clutter, and research will be conducted for testing wide area emitters.\n   To address the testing of systems operating in the mid-wave infrared band, the EWT project will develop technologies to enable the full testing of mid-wave infrared sensor\/seekers by adding clutter models and scene generators to real-time stimulation.  Furthermore, efforts to develop technology to test against electronic counter-countermeasures techniques of modern surface-to-air missiles will continue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.206"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.206"
                                            },
                                            "Text": {
                                                "val": "The EWT project will add in new technologies related to improving the electronic warfare T&E infrastructure.  These new technologies will be identified by the Tri-Service EWT working group formed in FY 2011, and further address test needs identified in the IRCM Test Resource Requirements Roadmap and the Tri-Service Electronic Warfare Test Capabilities Study."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Instrumentation Systems Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.710"
                        },
                        "CurrentYear": {
                            "val": "10.618"
                        },
                        "BudgetYearOne": {
                            "val": "10.150"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.150"
                        },
                        "BudgetYearTwo": {
                            "val": "9.021"
                        },
                        "BudgetYearThree": {
                            "val": "11.072"
                        },
                        "BudgetYearFour": {
                            "val": "12.413"
                        },
                        "BudgetYearFive": {
                            "val": "12.049"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Instrumentation Systems Technology (AIST) project addresses the test technology gaps resulting from emerging weapon systems that need to be tested at Department of Defense (DoD) open air ranges, undersea ranges, installed systems test facilities, hardware-in-the-loop laboratories, and measurement test facilities.  Instrumentation requirements for systems under test are increasing exponentially for new weapons systems.  On-board and wearable instrumentation are required for sensing and collecting critical performance data; determining accurate time, space, position, and attitude information; interfacing with command and control data links; monitoring and reporting system-wide communications; recording human operator performance; and storing and transmitting data.  The technology development efforts within the AIST project have been re-prioritized to align to Secretary of Defense  guidance on science and technology (S&T) priority investments for FY2013-2017, particularly in support of human systems, engineered resilient systems, and counter weapons of mass destruction.  The AIST project has been concentrated to support technology developments for advanced Time Space Position Information (TSPI) instrumentation (especially with limited or no use of the Global Positioning System (GPS)), advanced sensors, advanced energy & power systems for instrumentation, non-intrusive instrumentation, mitigating range encroachment issues, and measuring warfighter cognitive performance.  \n     The AIST project addresses requirements driven by the need to enable technologies for miniaturized, non-intrusive instrumentation suites with increased survivability in harsh environments.  Minimal space is available to add instrumentation to new or existing weapon systems subsequent to their development; furthermore, additional weight and power draw can adversely affect weapon system signature and performance.  Instrumentation for humans-in-the-loop, such as dismounted soldiers, is required to not adversely affect soldier performance, induce artificiality in the test environment, nor create operational burden.  New technologies can be exploited to integrate small, non-intrusive instrumentation into emerging platforms during design and development, and, in some cases, into existing platforms.  This class of instrumentation can provide the data required for continuous assessment throughout a system’s lifecycle and can enable the collection of critical system performance data during test, training, and combat missions, thereby enabling a continual feedback loop between the developer, test personnel, and operators."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Instrumentation Systems Technology"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.710"
                                            },
                                            "Text": {
                                                "val": "The warfighter must be able to conduct military operations in a diverse array of locations, to include urban, mountainous, and densely forested environments.  Consequently, a continued major thrust for FY 2011 included the development of test technologies to support collection of TSPI data for soldier systems (manned or unmanned), particularly in GPS-denied or degraded situations, such as in urban areas and tunnels.  A wideband local positioning system was developed to locate soldiers and unmanned ground systems in GPS-denied\/impaired areas using radio frequency waveforms and techniques that penetrate structures found in urban environments.  Test results indicate that position accuracy less than one meter can be achieved with radio frequency signals going through up to four concrete block walls, which constitutes typical structural conditions encountered in urban operations.\n   To support testing high-acceleration systems, an ultra-high dynamics GPS receiver was developed that performs significantly better than existing test instrumentation.  In preliminary tests, the prototype ultra-high dynamics GPS receiver demonstrated the ability to acquire satellite signals at velocities up to 5.0 kilometers per second (km\/s) and during accelerations at 50-1100 times the force of gravity.  As a result, position solutions were obtained at velocities up to 10 km\/s with time-to-first-fix under 0.5 seconds, which is important for testing air-to-air missile systems launched from under the wing or from a weapons bay.\n   Other major development areas in FY 2011 included the development of advanced sensor instrumentation technologies (non-intrusiveness, miniaturization, and hardened for harsh environments).  A probe was developed for simultaneous analysis of turbine engine exhaust products (i.e., carbon, nitrogen, water vapor, and hydrocarbons) and will be used in ground testing of the C-17 engine.  Technology investments are also being applied to develop a fiber-optic instrumentation test suite capable of measuring electric and magnetic fields to support testing electromagnetically-propelled weapons.\n   Additional efforts to test systems that operate in a GPS-denied environment include a technology that enables networking of GPS-enabled systems within the test environment, and then using the network to integrate GPS and other positional information across the connected nodes by sharing raw observables from GPS and inter-node ranges to locate each network node with high reliability.  Simulation results indicate that this technology will deliver high accuracy tracking performance upon completion.  A related technological approach employs a layered system of navigation sensors leveraging collaborative navigation, existing radio frequency ranging technology, and a Doppler velocimeter to achieve more precise positional information.\n   Several new efforts were initiated in FY 2011.  A holographic optical memory system was designed for data recording and retrieval, extending the data storage capacity of current state-of-the-art holographic memory up to 16 terabytes.  An attachment technology initiated development with new adhesive formulations that employ an electrically releasing foil patch, for use in attaching sensors to non-conductive painted exterior surfaces of aircraft and other combat vehicles, significantly improving the turnaround time to return the system under test back to its operational configuration.  To improve testing at DoD undersea range complexes, algorithms and methodologies were investigated to automate detection and classification of marine mammal vocalizations from ocean floor range sensors.  This test technology will allow the Navy to conduct critical test and evaluation (T&E) events without jeopardizing marine mammal populations.  Boot-mounted sensors were investigated to track the geolocation of dismounted war fighters with sub-meter accuracy during testing.  Additionally, an effort has been initiated to leverage microsystems technology under development at universities, the Defense Advanced Research Projects Agency, and government laboratories that will be applicable to T&E of modern war fighting systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.618"
                                            },
                                            "Text": {
                                                "val": "Numerous systems now being brought to theater by rapid acquisitions involving operations in extreme conditions, over long distances, for long durations, and often with very small physical footprints (i.e. microsystems).  Furnishing adequate energy and power to instrument such systems for testing is a significant technological challenge.  Major thrusts for FY 2012 include continuing the FY 2011 efforts in advanced sensors, TSPI instrumentation, and advanced data acquisition and transformation along with the development of advanced power sources for test instrumentation.\n   The AIST project will develop hardware prototypes of GPS nodes with radio frequency inter-node ranging capabilities and ad hoc network connectivity for technology demonstrations in a GPS-degraded environment.  Magnetic field sensors will be tested with an air gun and developed to survive the harsh environment of an electromagnetic rail gun firing.\n   The AIST project will complete algorithm optimization development and the application specific integrated circuit architectures with high dynamic, multi-frequency, anti-jamming capability to provide TSPI in GPS-denied environments.  This test technology will support range safety, system analysis, T&E mission optimization, and end game scoring of highly dynamic objects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.150"
                                            },
                                            "Text": {
                                                "val": "The AIST project will initiate efforts to develop advanced TSPI technologies for non-intrusive applications using wireless systems and optical, infrared, and\/or acoustic techniques.  TSPI technologies will be developed to support data collection in GPS-denied environments, position data collection for projectiles, data collection for high dynamic systems, TSPI technologies uniquely suited to swimmers and divers, and TSPI data collection for non-cooperative undersea weapon systems.\n   Advanced sensor initiatives for non-intrusive applications will include multimodal transducers, and self-registering\/self-calibrating sensors.  Sensing applications include weapon system orientation, body armor blunt trauma evaluation, war fighter body posture and orientation, angle of incidence\/stores separation, and station keeping buoys.\n   Advanced power\/energy initiatives will develop technologies for non-intrusive application, particularly energy harvesting devices and load management devices.  This includes electromechanical fuels cells and support for wearable instrumentation, military vehicle instrumentation, embedded sensors, and weapons systems.\n   Advanced data transformation initiatives will develop technologies for adaptive computing, self-configuration, and self-calibration of instrumentation.  Additional goals include virtual\/synthetic instrumentation measurement capabilities, self-configuration data reduction, data compression, and wireless on-board data transport and massively dense data storage.  Other areas of interest include data management techniques, decrease size, weight, and power (SWaP), and micro-miniaturization of electronic components.  In addition, technology initiatives will be considered for reducing\/eliminating range environmental encroachment issues, and war fighter cognitive performance assessment and measurement."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Test"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.283"
                        },
                        "CurrentYear": {
                            "val": "13.819"
                        },
                        "BudgetYearOne": {
                            "val": "8.681"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.681"
                        },
                        "BudgetYearTwo": {
                            "val": "6.496"
                        },
                        "BudgetYearThree": {
                            "val": "6.779"
                        },
                        "BudgetYearFour": {
                            "val": "6.769"
                        },
                        "BudgetYearFive": {
                            "val": "6.581"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) is exploring the military utility, safety, and suitability of directed energy weapons.  A robust test capability to assess directed energy weapons is essential to understand their effectiveness and limitations, including determining their efficiency to perform counter improvised explosive device (C-IED) operations.  Such assessments will depend upon knowledge acquired through the test and evaluation (T&E) of the directed energy technologies and testing of operational concepts.  Directed energy weapon technologies, primarily consisting of high energy lasers (HEL) and high powered microwaves (HPM), are outpacing available test capabilities.  Traditional test techniques for evaluating conventional munitions (with flight times ranging from seconds to minutes) are not sufficient for the T&E of directed energy weapons that place energy on target instantaneously.  Consequently, new test technology solutions are needed to ensure that adequate developmental, live-fire, and operational test capabilities are available when directed energy programs are ready to test.\n     Directed energy system and component testing requires three principal assessments:  (1) energy or power on target; (2) the effects on the target; and (3) the propagation of the directed energy to the target through the atmosphere.  In addition, the vulnerability of DoD systems to HEL and HPM threats are required to be characterized in accordance with Military Standard (MIL-STD)-464C.  Current test capabilities do not provide the detailed data required to understand directed energy system performance and effects.\n      The Directed Energy Test (DET) project is developing the technologies necessary for quantitative assessment of HEL and HPM performance, as well as the vulnerability of DoD weapons system to directed energy threats.  The technology development efforts within the DET project have been re-prioritized to align to Secretary of Defense  guidance on science and technology priority investments for FY2013-2017."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.283"
                                            },
                                            "Text": {
                                                "val": "To assess HEL energy on target, sensor array designs have been developed to directly measure high irradiance across laser spots on target materials.  Additional developments have produced alternative sensor array designs to measure the temperature maps on the back surface on a HEL-irradiated target and alternative inverse heat conduction algorithms to estimate the temperature on the front (HEL-heated) surface.  In this same HEL area, a hyperspectral sensor system that remotely measures radiance from an HEL spot on the target and applies an algorithm to calculate the target front surface temperature has been designed and is under fabrication.\n   In the area of HEL effects on target, an adaptive optics system has been designed that will allow improved remote imaging of an HEL spot on a remote target.  A prototype is under fabrication and is designed to be readily adaptable to telescopes at various test facilities.\n   In the area of HEL atmospheric propagation, a multi-light detection and ranging system to measure important atmospheric profiles along a slant path adjacent to the HEL beam propagation path is being fabricated.  This one system measures profiles for three parameters: optical turbulence, water vapor content, and aerosol attenuation.\n   Addressing the HPM energy at the source,a flash X-ray characterization prototype provided the capability to successively image explosively generated HPM prime energy to understand why expected increases in capability with more energetic explosives was not being realized.  At least one of the issues with achieving explosive source expectations was revealed during the field testing of this prototype.\n   In the area of surrogate shooters to support the recently approved MIL-STD-464C requirements, a high frequency wideband prototype was delivered providing the required fields on target, while also being capable of achieving significantly greater power.  As a result, the transition partner has requests from several organizations to test concepts for advanced systems using the source.  Several prototypes were delivered to improve HPM test tempo in MIL-STD-464C test activities including rapid polarization changes and broad power variation.  The demonstrated test technologies have wide application to other HPM test sources.\n   A test technology supporting both HPM energy on target and effects on target was demonstrated.  This capability measures the electric field arriving at eight locations on the target and the temperature rise resulting from those fields.  A family of HPM sensors demonstrated test technologies for measuring energy inside larger targets during HPM engagements.  The sensor technology can be used singly or in combination to non-intrusively measure electric and magnetic field vectors at the same location.  After promising field tests, the National Institute of Standards and Technology is now characterizing the performance of these new sensors so they can be adopted by the test ranges as authoritative data collection devices.\n   Early testing of electric field sensors for support of electromagnetic rail gun testing identified a prime source for examined rail wear, a key issue for rail gun systems.  To better support C-IED testing, the test technology development to measure soil electrical properties built a brass board sensor with three interchangeable heads to cover the required frequencies.  The brass board has been used in proving the concept to measure the soil electrical properties for portions of the test site, with results showing measurements similar to those taken by legacy technologies.  An advantage of the new test technology is that it measured in 20 minutes what the legacy measurements systems could do in two months."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.819"
                                            },
                                            "Text": {
                                                "val": "Within the HEL area, efforts will focus on completing the technology developments for measuring energy on target and characterizing effects on target using onboard sensing.  The performance of these matured technologies will direct the focus of future investments to optimize HEL measurement capabilities.  New efforts will be initiated to address identified areas of technology shortfalls, including HEL test safety and HEL collateral effects.  In addition, test technologies will focus on the characterization of solid state laser effects on targets in support of weapons systems in development and demonstration by the Army, Navy, and Air Force.  Test technologies to support the measurement of laser lethality on rockets, artillery, mortars, and unmanned air vehicle targets will remain a key area of investment.  Furthermore, efforts to characterize beam propagation through the atmosphere will center on the maritime environment in support of emerging needs of the Navy.  Investment will be placed in laser safety software and hardware to allow testing at multiple test ranges without affecting aircraft and space sensors.  \n   In the area of HPM, the prototype to measure soil electrical properties will be matured to determine the soil depth to which the new technology can measure while adding the ability to determine if the magnetic properties of soil are interfering with the advanced technique.\n   The initiatives to achieve very small non-intrusive electric and magnetic field sensors will be completed to measure HPM effects inside a target and transitioned to at least two locations to demonstrate the flexibility of this technology.  The widely dispersed HPM data recording and wireless reporting effort will be completed supporting the CHAMP demonstration and then be transitioned to initially support rapid testing of C-IED systems and fratricide issues with other ground HPM systems.  A smaller less intrusive data acquisition device with a wide bandwidth to match that of the non-intrusive electric and magnetic field sensors will be investigated.\n   The capability to characterize the Terahertz beam quality in support of testing the proliferating number of Terahertz sensors and detectors for force protection and explosives or biological hazards determination will be transitioned.  A risk reduction effort will be performed to determine the best approach to construct a more durable pressurized – radio frequency transmitting dome that does not leak over time for a test capability that emulates wideband threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.681"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.681"
                                            },
                                            "Text": {
                                                "val": "Investments in HEL will assess and target the changes in HEL effects due to the shift of HELs to shorter wavelengths near 1 micron.  Such HELs include solid state, fiber, and free electron laser systems.  Test technologies to support the testing of HEL energy on target will continue to be advanced.  As development of electromagnetic rail guns and the free electron lasers advance, investments in test technologies supporting these weapon systems will be initiated.  Tunable over a wide range, free electron lasers present unique testing challenges for open air testing, including measuring laser energy on target, as well as characterizing the beam propagation and thermal blooming effects.  \n   In the HPM area, measuring the actual cause of HPM electronics effects will be addressed by electrical current measurements in the wires and chips of the electronic targets.  To better support weapon research and design, a method will be sought to determine the time out of action for targets, such that HPM effects on targets need not be permanent.  In weapons development testing, these sensors will indicate how much increase in HPM weapon output is required to make a weapon effective.  In survivability testing, these sensors will support assessment of susceptibility with lower power HPM sources.  Additionally, the DET project will address technology for small, powerful HPM sources to allow testing of the susceptibility of United States equipment in a chamber environment.  A new effort will be initiated to develop a technologically viable alternative to provide the neutron radiation required for nuclear survivability testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Netcentric Systems Test"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.465"
                        },
                        "CurrentYear": {
                            "val": "17.428"
                        },
                        "BudgetYearOne": {
                            "val": "17.255"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.255"
                        },
                        "BudgetYearTwo": {
                            "val": "16.724"
                        },
                        "BudgetYearThree": {
                            "val": "12.290"
                        },
                        "BudgetYearFour": {
                            "val": "12.270"
                        },
                        "BudgetYearFive": {
                            "val": "11.270"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Net-centric Systems Test (NST) project is pursuing test technologies to emulate multi-Service, Joint, and coalition net-centric operations in a system of systems test and evaluation environment and to analyze and evaluate the increasingly massive amounts of structured and unstructured data generated by complex net-centric tests. Information systems and weapon\/sensor platforms that support the kill chain in a Joint operation must provide an accurate transfer of timely data (e.g., target tracks, weapons allocation, mission tasking and situational assessment), as it passes among different systems, Service, and coalition participants.  The NST technologies advance test automation (test planning, test execution, test control, and analysis) that enable the virtual integration of Department of Defense (DoD) weapon laboratories and open air ranges.  Using models and simulations along with hardware-in-the-loop laboratories, the effectiveness of Joint missions can be assessed in terms of System-of-Systems interoperability and effectiveness in executing Joint mission operations, including testing of weapons and Command and Control systems accessing and providing information to the Global Information Grid.  The technology development efforts within the NST project have been re-prioritized to align to Secretary of Defense guidance on science and technology priority investments for FY2013-2017, particularly in measuring “Data to Decision” techniques and warfighting capabilities.  Ultimately, the NST portfolio enables the test community to “test like we fight” by replicating net-enabled, Joint mission operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Netcentric Systems Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.465"
                                            },
                                            "Text": {
                                                "val": "The NST project emphasized test technologies supporting the abilities to manage a net-centric test battlespace, including planning a complex, multi-player, mission-level net-centric test in a distributed live-virtual-constructive (LVC) environment and controlling test execution through management of the mission scenario.  The NST project developed test planning technologies to address test integrations and interoperability issues.  Ontologies were developed to formalize concepts pertaining to LVC test resources in a net-centric joint mission environment.  Knowledge bases were developed that capture subject matter expertise on setup and execution of a test event and characteristics of test resources.  Reasoning capabilities were extended and integrated to automate test planning tasks.  The NST project developed a planning\/visualization technology to support joint mission thread testing to better correlate test data to the effectiveness of mission operations.\n   The NST project advanced technologies to support the execution of distributed tests with active network control, enhanced the degree of dynamic management of the test infrastructure, and improved the integration of Service laboratories and test ranges by transitioning new technologies into the Test and Training Enabling Architecture (TENA).  \n   The NST project is investing in technologies to test military systems that employ Service-Oriented Architectures (SOA), including test technologies to help the tester understand what is happening inside of and between SOA services and resources during test events.  These test technologies will allow the tester to understand the environment, including but not limited to network hardware and software.  The NST project also developed technologies for the next generation of TENA middleware that support a broad range of networks, including wireless networks, and provide native support for handheld and embedded computing platforms.\n   The NST project transitioned test technologies to the Central Test and Evaluation Investment Program (CTEIP) Interoperability Test and Evaluation Capability (InterTEC) development that will provide the capability to automate testing of the Net-Ready Key Performance Parameters (KPP) solution architecture element.  In addition, this test technology will perform compliance assessments of architectures against governing standards and allow a tester to plan a test event based on authoritative Joint mission threads.  The test technology will also allow the tester to visualize the execution of mission threads by mapping the progress of the test to architecture views.  An additional FY2011 NST transition involved technologies that will ingest test plans and provide automated, rule-based control of the test infrastructure during a large-scale complex test event.\n   Finally, the NST project transferred two on-going cyberspace test technology developments to the new Cyberspace Test project, which would be better suited within that portfolio."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.428"
                                            },
                                            "Text": {
                                                "val": "The test technology for an enterprise tool will be developed that will enable simulation of a wide range of network and host-based information operations effects that can be centrally managed and controlled.  The NST project will also focus on test technologies to extend the TENA Meta-Model to address emerging security and trusted systems requirements, as well as extend TENA into embedded instrumentation and smart devices, including optimizing data structures to operate more efficiently over wireless networks.  Additionally, the NST project will continue the development of technologies to support the measurement and analysis of the net-centric test environment.  The analysis of joint mission threads in near real-time will be assisted by the development of a test technology that will allow effective characterization and replication of Joint mission threads.\n  The testing of SOA will be emphasized through the research and development of instrumentation and analysis tools utilizing embedded agent-based technologies.  Additional test technology development will be conducted in semantic interoperability and defining ontologies that formalize concepts pertaining to distributed test resources in a net-centric Joint Mission Environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.255"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.255"
                                            },
                                            "Text": {
                                                "val": "The NST project will focus predictive smart dead-reckoning technology to address the challenge to adequately synchronize the distributed test environment.  This effort will leverage the ultra-high-speed policy-enabled agent and the policy server to provide the necessary distributed intelligence to manage time space position information (TSPI) updates in the net-centric test battlespace with a distributed LVC architecture.  To accomplish this capability, the NST project will build upon previously developed technologies by NST and add additional capabilities to solve the test challenges of producing accurate TSPI predictions under all network conditions, to include both unpredictable network latency and missing information.  The predictive smart dead-reckoning technology will include capabilities, such as highly accurate clock synchronization, fast clock convergence under unreliable network conditions, and fast TSPI calibrations.  Since the predictive smart dead-reckoning technology will be built on top of the policy-enabled agent, it will be able to provide fast response under complex test event conditions.\n   NST project will continue developing technology that will automate the planning of test events, based on advanced semantic web technology.  Development will continue on technologies to support the use of TENA over a broad range of networks and to provide a common interoperability test architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned and Autonomous System Test"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.405"
                        },
                        "CurrentYear": {
                            "val": "3.296"
                        },
                        "BudgetYearOne": {
                            "val": "5.863"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.863"
                        },
                        "BudgetYearTwo": {
                            "val": "9.308"
                        },
                        "BudgetYearThree": {
                            "val": "13.369"
                        },
                        "BudgetYearFour": {
                            "val": "15.348"
                        },
                        "BudgetYearFive": {
                            "val": "14.883"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Unmanned and Autonomous Systems (UAS)support every domain of warfare, operating in space, in air, on land, on sea, undersea and in sub-terrain conditions to support a vast variety of missions.  UAS is experiencing exponential growth in technological capabilities and employment in current operations.  The emergence of robotics brings a host of revolutionary capabilities that will profoundly influence warfare.  The Unmanned and Autonomous Systems Test (UAST) project addresses current and emerging challenges associated with the test and evaluation (T&E) of these critical warfighting capabilities.  The UAST project is developing test technologies to simulate, stimulate, instrument, measure, and assess the capability of an autonomous system to perceive its environment, process information, adapt to dynamic conditions, make decisions, and effectively act on those decisions in the context of mission execution.  The technology development efforts within the UAST project have been re-prioritized to align to Secretary of Defense guidance on science and technology priority investments for FY2013-2017, particularly in assessing autonomy.\n     The UAST project will provide the test technologies to effectively measure performance and characterize risk, thereby increasing the warfighter’s trust in autonomous systems.  Current Department of Defense (DoD) test capabilities and methodologies are insufficient to address the testing of increasingly autonomous units and teams of unmanned systems operating in unstructured, dynamic battlespace environments.  Furthermore, advancements are being made in developing collaborating system-of-autonomous-systems, working in concert as a swarm or pack and in close proximity with humans.  New test technologies are needed to stress the collective set of autonomous systems under realistic conditions, predict emergent behavior of autonomous systems, emulate the complex environment, and assess mission performance of these highly coupled and intelligent systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Autonomous System Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.405"
                                            },
                                            "Text": {
                                                "val": "The UAST project focused on investments in predicting and assessing the autonomy functions of unmanned and autonomous systems through the initiation of a series of new technology developments.  The complexity of operational unmanned and autonomous systems, with all possible interactions occurring between sensing, perception, reasoning, mapping, decision making and action, results in an almost infinite set of potential interactions and correspondingly, an almost infinite set of test conditions.  An effort was initiated to employ evolutionary\/genetic algorithms in a software-in-the-loop environment to accurately predict the fault conditions of a complex, long-duration autonomous system.  Initially to be demonstrated on the Long Duration – Unmanned Underwater Vehicle, this test technology will improve the ability to predict fault conditions and thereby enable focused test strategies that dramatically improve the efficiency of testing.\n   An effort was initiated in the UAST project to develop test technologies that enable stress testing of UAS software at the interfaces of the core components without requiring source code, while being agnostic to the specific component interface.  This test technology will provide the tester with a perspective of system performance and an ability to predict behavior that is not currently available.\n   The UAST project has initiated a technology development to create a virtual UAS test bed that consumes environmental data from external sources (to include imagery from operational areas of interest) and injects that data into simulations of a given UAS to predict the behavior of the system in the operational environment.  This technology will facilitate efficient testing in an operationally representative environment and allow for safe operations at “edge of the envelope” performance parameters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.296"
                                            },
                                            "Text": {
                                                "val": "Efforts will focus on technology supporting the near term challenges identified in the 2011 – 2036 DoD Unmanned Systems Integrated Roadmap, such as, integrating DoD unmanned systems within the National Airspace and safely operating unmanned aerial systems within our national ranges.  The UAST project will additionally explore investments in the challenges of testing autonomy, leveraging advances made in the standardization of UAS architectures, functional components, and interfaces.\n   The test technology to adapt evolutionary algorithms to predict fault conditions will be expanded to address evaluation functions for multiple missions of a long duration UAS.  The effort to stress test UAS software will delve into technologies to integrate UAS models with software exceptions databases to allow for sharing of test data across multiple UAS platforms.  The effort to create a virtual UAS test bed will complete its architecture, complete the terrain modeling, develop perceptual boosting algorithms based on vehicle sensors, integrate all sensor modules and simulation modules into a complete virtual test bed, and validate the complete system through comparison of the outputs of the models inside the virtual proving ground with real data acquired during field tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.863"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.863"
                                            },
                                            "Text": {
                                                "val": "The UAST project will deliver the technologies developed by the three on-going efforts.  The UAST project will continue to invest in technology that addresses mid-term UAS test challenges (autonomy) and initiate efforts to explore the far term challenges of testing system intelligence.  This effort will include an examination of test technologies that measure the logical flow of sensing data, to perception, decisions, and action.  The UAST project will focus on enhancing the test environment to assess unmanned threat systems system mission capabilities, and to identify vulnerabilities.  The UAST project will develop instrumentation and analysis technologies to enable UAS testing that furnishes data to support the evaluation of mission performance.  Furthermore, the UAST project will invest in efforts to enable dynamic construction, control, measurement of complex systems-of-autonomous-systems and tactically meaningful counter-unmanned aerial systems analysis.  Test requirements will expand to integrate multi-UAS test beds that support a simulation-based methodology to seamlessly integrate constructive simulation, UAS-in-the loop simulation, and live UAS tests.  The UAST project will deliver complementary tools to predict UAS behavior by monitoring how autonomous systems process data in response to environmental changes.  Simulated systems will replicate multiple platforms for the evaluation of multi-platform behaviors, supporting repeatable events, and detailed system\/event logging.  Modeling and simulation techniques will be expanded to provide high fidelity representations of appropriate environmental complexity in order to stress the UAS and establish confidence in the safety and capabilities of future systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Test"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.405"
                        },
                        "CurrentYear": {
                            "val": "2.644"
                        },
                        "BudgetYearOne": {
                            "val": "3.696"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.696"
                        },
                        "BudgetYearTwo": {
                            "val": "6.049"
                        },
                        "BudgetYearThree": {
                            "val": "10.664"
                        },
                        "BudgetYearFour": {
                            "val": "10.617"
                        },
                        "BudgetYearFive": {
                            "val": "11.632"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In response to Secretary of Defense guidance on science and technology priority investments for FY2013-2017, the T&E\/S&T program restructured planning in Multi-Level Security test technologies to refocus on addressing emerging Cyberspace test needs.  Accordingly, the Multi-Level Security for test and evaluation (T&E) project was renamed to the Cyberspace Test project, to align with the Department’s priorities.  Furthermore, two technology developments, previously in the Net-Centric System Test (NST) portfolio, that were investigating creating representative cyberspace attack threat effects were re-aligned within the Cyberspace Test project.  The Cyberspace Test project will address all test technology shortfalls in cyberspace testing, including planning cyberspace tests, executing cyberspace tests, and creating representative cyberspace threats.  The Cyberspace Test project will develop high fidelity live-virtual-constructive (LVC) test environments to measure cyberspace attacks and countermeasures across all information technology stack layers, while leveraging cyberspace technologies being developed across the S&T community."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyberspace Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.405"
                                            },
                                            "Text": {
                                                "val": "The Cyberspace Test project focused on initial planning to develop a cyberspace test technology roadmap to identify cyberspace test shortfalls and to outline a long range test technology investment strategy.  Additionally, two technology developments, previous under the NST project, were moved to the Cyberspace Test project.  These two efforts are developing techniques and algorithms to stimulate a wide range of network and host based effects resulting from a cyberspace attack.  These two efforts developed test technologies to induce network internet protocol\/host degradation and the ability to store and manage effects profiles.  Furthermore, the Cyberspace Test project investigated strategies to provide the tester with the capability to measure the impact of cyber threats, such as, denial-of-service and virus\/worm vulnerabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.644"
                                            },
                                            "Text": {
                                                "val": "The Cyberspace Test project will continue focus on test technologies that will address the need to provide automated cyberspace test planning, set-up, and configuration; the need for a LVC test environment that will include cyberspace entities; and the need for real-time hardware-in-the-loop capabilities to simulate cyberspace threats.  The Cyberspace Test project will also investigate using integrated cross-domain solutions and gateways to create complex cyberspace tests at multiple levels of security classifications.  The Cyberspace Test project will also focus on threat cyberspace attack technologies required to assess information assurance and to improve the agility of cyberspace test capabilities.  Additional efforts will focus on addressing the shortfalls identified in the cyberspace test technology roadmap."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.696"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.696"
                                            },
                                            "Text": {
                                                "val": "The Cyberspace Test project will continue to focus on test technologies that will address the need to provide automated cyberspace test planning (design, plan, set-up, and configure), particularly in support of Defensive Cyber Operations testing. The Cyberspace Test project will also develop test technologies to federate a distributed cyberspace test environment to quickly integrate accredited cyberspace test tools.  Additional efforts will focus on addressing the shortfalls identified in the cyberspace test technology roadmap."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                }
            ]
        }
    }
}