{
    "id": "31591b6e3826b6be176afcbb14da4cb20c3222c6",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605142D8Z"
        },
        "ProgramElementTitle": {
            "val": "Systems Engineering"
        },
        "R1LineItemNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "38.375"
            },
            "CurrentYear": {
                "val": "40.438"
            },
            "BudgetYearOne": {
                "val": "43.195"
            },
            "BudgetYearOneBase": {
                "val": "43.195"
            },
            "BudgetYearTwo": {
                "val": "42.514"
            },
            "BudgetYearThree": {
                "val": "46.274"
            },
            "BudgetYearFour": {
                "val": "48.292"
            },
            "BudgetYearFive": {
                "val": "49.182"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) establishes the dedicated funding line to carry out the duties as described in Title 10 US Code, Section 139, the Weapons Systems Acquisition Reform Act of 2009.  The Deputy Assistant Secretary of Defense for Systems Engineering (DASD(SE)) is the principal advisor to the Secretary of Defense, the Under Secretary of Defense for Acquisition, Technology and Logistics (USD(AT&L)) and the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) on systems engineering, development planning, and related technical fields in the Department of Defense.  The DASD(SE) develops policies and guidance for (1) the use of systems engineering principles and best practices; (2) the use of systems and software engineering planning and contracting approaches to enhance reliability, availability, and maintainability on major defense acquisition programs (MDAPs); (3) the systems engineering plans (SEPs) for MDAPs including software, and systems engineering considerations in support of lifecycle management and sustainability; and (4) the inclusion of provisions relating to systems engineering and reliability in requests for proposals.  The DASD(SE) reviews and approves the SEP for each MDAP and monitors and reviews the systems engineering and development planning activities of MDAPs and other defense acquisition programs as directed by the Secretary of Defense or the USD(AT&L).  Based on the Director’s continuous program engagement, the DASD(SE) advises and makes recommendations to the Secretary of Defense and the USD(AT&L) regarding systems engineering, development planning and the execution of these activities.  As a member of the Defense Acquisition Board, the DASD(SE) provides independent assessments of defense acquisition program’s systems engineering, development planning, technical execution, and risk.  The DASD(SE) also provides input on the inclusion of systems engineering requirements as part of the Joint Requirements Oversight Council's process for joint military requirements, to include developing specific inputs relating to each capabilities development document.\n\nThe DASD(SE) issues guidance to, and consults with, the Services and Agencies with respect to systems engineering in the Department and provides advocacy, oversight, and guidance to elements of the acquisition workforce responsible for systems engineering, development planning, and lifecycle management and sustainability functions and developing policies and guidance for the integration of specialty engineering functions.  The DASD(SE) integrates systems engineering with Mission Assurance in the acquisition system.  The DASD(SE) periodically reviews the organizations and capabilities of the military departments with respect to systems engineering, development planning, and lifecycle management and sustainability, and identifies needed changes or improvements to such organizations and capabilities. \n\nThe DASD(SE) prepares and submits an annual report to Congress on systems engineering activities and effectiveness.\n\nThis PE includes effort by the office of the DASD(SE) in implementing the Department’s Cyber initiatives.  Specifically, the PE will develop and address the critical subdiscipline of systems engineering - system security engineering and Program Protection.  This includes study and maturation of discipline fundamentals such as best practices, tools, guidance, and policy, and will also pilot system security practices in defense acquisition as a fundamental element of systems engineering and technical reviews.  Efforts in this area are directly driven by cyber and malicious supply chain threats that the Department faces, and therefore, will include implementing Department directives and regulations to protect critical program information."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.824"
                },
                "CurrentYear": {
                    "val": "41.884"
                },
                "BudgetYearOne": {
                    "val": "45.188"
                },
                "BudgetYearOneBase": {
                    "val": "45.188"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.375"
                },
                "CurrentYear": {
                    "val": "40.438"
                },
                "BudgetYearOne": {
                    "val": "43.195"
                },
                "BudgetYearOneBase": {
                    "val": "43.195"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "8.551"
                },
                "CurrentYear": {
                    "val": "-1.446"
                },
                "BudgetYearOne": {
                    "val": "-1.993"
                },
                "BudgetYearOneBase": {
                    "val": "-1.993"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.928"
                    },
                    "CurrentYear": {
                        "val": "-1.166"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "2.603"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.993"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.993"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.188"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.136"
                                },
                                "CurrentYear": {
                                    "val": "-0.280"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "7.200"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P142"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.490"
                        },
                        "CurrentYear": {
                            "val": "35.829"
                        },
                        "BudgetYearOne": {
                            "val": "38.452"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.452"
                        },
                        "BudgetYearTwo": {
                            "val": "37.391"
                        },
                        "BudgetYearThree": {
                            "val": "40.522"
                        },
                        "BudgetYearFour": {
                            "val": "41.980"
                        },
                        "BudgetYearFive": {
                            "val": "42.415"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This (P142) program supports the execution of the missions of the Deputy Assistant Secretary of Defense for Systems Engineering (DASD(SE)) to: (1) provide flexible engineering policy, guidance, and workforce development requirements for the Department of Defense (DoD) acquisition workforce; (2) foster an acquisition environment of collaboration, teamwork, and joint ownership of program success through a proactive program oversight process, ensuring appropriate levels of systems engineering discipline are applied through all phases of the acquisition life cycle; and (3) engage all stakeholders across government, industry, and academia to collectively advance systems engineering practice and achieve acquisition excellence.  The outcome of this effort is to ensure systems engineering principles and disciplines are fully accepted and assimilated into the DoD acquisition workforce positioning the DoD for acquisition excellence leading to a stronger national defense.\n\nActivities include the following--\n\nProgram Support Functions: \n• Working with program managers to prepare systems engineering plans (SEPs) to document the technical management approach.\n• Conduct periodic program engagements in support of technical reviews to confirm programs are executed in accordance with the SEP.\n• Review all aspects of the systems engineering process for major defense acquisition programs (MDAPs) to ensure they are adequate to support fielding and the achievement of cost and performance goals including reliability, sustainment, and other mission assurance considerations.\n• Participate in Systems Engineering Integrated Project Teams (IPTs), Systems Engineering Working Integrated Project Teams (WIPTs), and Systems Engineering technical reviews, especially Preliminary Design Reviews and Critical Design Reviews.\n• Work with DoD Service program managers, their staffs, and other organizations, technical authorities, and oversight organizations to develop and implement technical management programs for MDAPs.\n• Conceive plans and lead program support reviews and assessments of MDAP weapons systems and other programs (e.g., Major Automated Information Systems (MAIS)) to shape technical planning and management to ensure program success.\n• Conduct other technical reviews as requested, e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, focused technical assessments, and software readiness reviews to identify and mitigate program risk.\n\nMission Assurance Functions:\n• Establish Mission Assurance policy, guidance, and workforce development to drive the development of fully capable and supportable weapons systems.\n• Oversee Component implementation of Mission Assurance initiatives and conduct independent Mission Assurance assessments.\n• Develop education and training materials for instructing, maintaining, and enhancing the defense acquisition workforce.  Activities include: (1) developing guidance to enhance Systems Planning, Research, Development and Engineering (SPRDE) and Production Quality and Manufacturing (PQM) acquisition career planning and progression; and (2) monitoring, and facilitating Defense Acquisition University (DAU) updates to the systems engineering, quality and software engineering course, to ensure curriculum represents the education and training requirements necessary to be a viable team member in the acquisition process.\n• Drive an overall improvement in weapon system reliability through improved reliability engineering, reliability growth management, and reliability monitoring in program development contracting, execution and sustainment.\n• Prepare and submit annual reports to Congress on the Department’s capabilities and effectiveness in systems engineering and development planning.\n\nSystem Analysis Functions:\n• Execute the acquisition system elements of the National Cyber Security Strategy including cyber security, systems security, and program protection planning.\n• Guide Service and other component organizations in the development planning process to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Resolve long-term major systems engineering challenges such as systems of systems (SoS) systems engineering, systems engineering Complexity Analysis, and systems engineering based technical trade off analysis and pre-program formulation stages. \n• Provide necessary modeling and simulation policy and guidance, clarify the application of distributed simulation standards and work with the DoD modeling and simulation community to identify and prioritize required capabilities and competencies needed to support acquisition modeling and simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Initiatives"
                                    },
                                    "Description": {
                                        "val": "The DASD(SE) provides objective assessments of program risk to support knowledge-based decision making by DoD leaders regarding DoD MDAPs and MAISs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.490"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust: Major Program Support\n• Provided deep-dive SE reviews of MDAPs and special interest programs.  \n• Expanded conduct of SE and execution risk assessments.\n• Initiated systems integration and development planning risk assessments.\n• Expanded monitoring programs, providing SE oversight to include all MDAPs, MAIS and special interest programs.\n• Conducted systemic analysis and process management. \n• Expanded root cause analysis conducted during and after Program Support Reviews (PSRs).\n• Initiated detailed performance measurements and analysis.\n• Participated in Overarching Integrated Product Teams (OIPTs) and provided decision-quality information and recommendations to Defense Acquisition Boards (DABs), In-Process Reviews (IPRs), Defense Space Acquisition Boards (DSABs) and Information Technology Acquisition Boards (ITABs).\n• Reviewed MDAP Request for Proposals for critical reliability requirements.\n\nStrategic Thrust:  Department SE Capabilities Assessment\n• Conducted analysis of Military Departments self-assessments; conducted analysis of DoD’s SE capability.\n• Authored annual Congressional Report jointly with Development Test and Evaluation (DT&E).\n• Worked jointly with DT&E to develop and track new measurable performance criteria.\n• Developed and strengthened component SE organization and capabilities.\n\nStrategic Thrust: Policy and Guidance\n• Developed and updated core SE policy, guidance and standards; reviewed all acquisition policy for SE implications.\n• Developed and updated SE policy, guidance and standards. \n• Directed support and oversight to software intensive programs.\n• Developed and authored specialty engineering policy, guidance, and standards.\n• Provided workforce development: Functional Lead for SPRDE, PQM, and assisted software engineering.\n• Provided SE guidance to DoD earned value management (EVM).\n• Fostered early integration of systems safety, reliability, maintainability and life cycle sustainment into pre-MDAPs, MDAPs. and pre-material development decision (MDD) activities.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Developed policy and guidance for development planning and early SE; oversaw its establishment within Services.\n• Performed early acquisition risk assessment including pre-Milestone A engagement with Joint Requirements Oversight Council processes.\n• Supported Services and Combatant Commands (COCOMs) in pre-milestone (MS) A formulation.\n• Supported requirements analyses and analysis of alternatives.\n• Supported initial capabilities document definition and development.\n• Oversaw and executed modeling, simulation, and analysis for DoD.\n• Enhanced modeling and simulation (M&S) support to analysis of alternatives.\n• Led systems engineering research, systems of systems research and collaboration across Services and identified areas of improvement; develop and establish best practices.\n• Oversaw the Systems Engineering Research University Affiliated Research Center (UARC) and conducted studies and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.829"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust: Major Program Support\n• Deep-dive systems engineering reviews of MDAPs and special interest programs.  \n• Expand conduct of SE and execution risk assessments.\n• Initiate systems integration and development planning risk assessments.\n• Expand monitoring of programs, provide SE oversight to include all MDAPs, MAIS, and special interest programs.\n• Conduct systemic analysis and process management. \n• Expand root cause analysis conducted during and after PSRs.\n• Initiate detailed performance measurements and analysis.\n• Participate in OIPTs providing decision-quality information and recommendations to DABs, IPRs, DSABs and ITABs.\n• Review MDAP Request for Proposals for critical reliability requirements.\n\nStrategic Thrust:  Department Systems Engineering Capabilities Assessment\n• Conduct analysis of Military Departments self-assessments; conduct analysis of DoD’s SE capability.\n• Author annual Congressional Report jointly with DT&E.\n• Work jointly with DT&E to develop and track new measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n\nStrategic Thrust: Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop and update software engineering policy, guidance and standards. \n• Direct support and oversight to software intensive programs.\n• Develop and author specialty engineering policy, guidance and standards.\n• Workforce development: Functional Lead for SPRDE, PQM and assist software engineering.\n• Foster early integration of systems safety, reliability, maintainability and life cycle sustainment into pre-MDAPs, MDAPs and pre-MDD activities.\n\nStrategic Thrust: Early Systems Engineering and Development Planning\n• Develop policy and guidance for development planning and early SE; oversee its establishment within Services.\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support Services and COCOMs in pre-MS A formulation.\n• Support requirements analyses and analysis of alternatives.\n• Support initial capabilities document definition and development.\n• Lead systems engineering research, systems of systems research and collaboration across Services to identify areas of improvement; develop and establish best practices.\n• Oversee the Systems Engineering Research UARC and conduct studies and analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.452"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY 2012 efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P143"
                    },
                    "ProjectTitle": {
                        "val": "Program Protection"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.885"
                        },
                        "CurrentYear": {
                            "val": "4.609"
                        },
                        "BudgetYearOne": {
                            "val": "4.743"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.743"
                        },
                        "BudgetYearTwo": {
                            "val": "5.123"
                        },
                        "BudgetYearThree": {
                            "val": "5.752"
                        },
                        "BudgetYearFour": {
                            "val": "6.312"
                        },
                        "BudgetYearFive": {
                            "val": "6.767"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) must address cyber security and supply chain risks to DoD networks, weapons systems and information stored and processed on both DoD and Defense Industrial Base (DIB) unclassified networks that support DoD programs.  Increased reliance on the internet as a vehicle for sharing information, globalization of the supply chain, and advanced persistent threats (APTs) that can evade commercially available security tools and defeat generic security best practices, drive the need for better and smarter program protection planning and execution.  The President's Cyber Initiative has moved to counter these threats and mitigate the risks.  The Acquisition Cyber Security Initiative links high level policies and practical expertise to specific acquisition practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department will pilot activities with the DIB to reduce risks in sharing and storing critical program information, better understand and mitigate supply chain risks, improve program protection planning, and improve and streamline program protection engineering.  The Department has developed a Trusted Systems strategy which integrates Protection Planning for the development of capabilities, the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Protection"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.885"
                                            },
                                            "Text": {
                                                "val": "• Published Program Protection Plan Guidebook.  Implemented Program Protection Plan procedures with programs on an ongoing engagement basis with verification as they approached major milestone reviews.  Conducted support reviews for up to 15 Major Defense Acquisition Programs (MDAPs) and developed guidance for criticality analysis with Services to augment current research technology protection focused activity with procedures to ensure protection of critical components.\n\n• Developed acquisition guidance for supply chain risk management that incorporated lessons learned from vulnerability assessments conducted.  Supported programs in effective implementation of needed supply chain risk management.  Assessed sustainment issues for protection of critical components and program information.\n\n• Collaborated in the development of the Defense Acquisition Regulations System (DFARS) and Federal Acquisition Regulation (FAR) language to implement information security on DoD contracts for protection of defense program information to include Prime and subcontractors.  Developed and implemented process for adjudicating public comments.  Provided acquisition support to DIB Cyber Security program.\n\n• Oversaw and managed the acquisition security database; tracked implementation by the components.  Developed horizontal protection requirements.  Developed a strategy for oversight and implementation of horizontal protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.609"
                                            },
                                            "Text": {
                                                "val": "• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.  Conduct criticality analyses.  Develop Program Protection Plans, and tracked progress to verify protection of critical program capabilities.  Review ACAT I Program Protection Plans and provide recommendations for their approval to Under Secretary of Defense for Acquisition, Technology, and Logistics.  \n\n• Conduct outreach to further the implementation and understanding of system security engineering requirements and practices (courseware, guidance dissemination, mentoring of Service teams, training, and outreach).  \n\n• Collaborate in developing DFARS or FAR language to implement information security on DoD contracts for protection of defense program information.  Develop and implement process for adjudicating public comments.  Provide acquisition support to DIB Cyber Security program.\n\n• Oversee and manage the acquisition security database and tracked implementation by the components.  Implement horizontal protection adjudication process. Evolve the Horizontal Protection processes to meet changing threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.743"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.743"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY 2012 efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}