{
    "id": "342d7e8dbca4e654fd384556b64ed054de357249",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604780A"
        },
        "ProgramElementTitle": {
            "val": "Combined Arms Tactical Trainer (CATT) Core"
        },
        "R1LineItemNumber": {
            "val": "107"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "26.699"
            },
            "CurrentYear": {
                "val": "22.205"
            },
            "BudgetYearOne": {
                "val": "17.797"
            },
            "BudgetYearOneBase": {
                "val": "17.797"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "21.119"
            },
            "BudgetYearThree": {
                "val": "26.607"
            },
            "BudgetYearFour": {
                "val": "24.518"
            },
            "BudgetYearFive": {
                "val": "23.709"
            }
        },
        "ProgramElementNote": {
            "val": "Change Summary Explanation: None required."
        },
        "ProgramElementMissionDescription": {
            "val": "The Combined Arms Tactical Trainers (CATT) represent a family of combined arms simulation systems designed to support the Army's simulation-based Combined Arms Training Strategy.  CATT enables units, from crew to the battalion task force level, to conduct a wide variety of combat tasks on a realistic, interactive, synthetic battlefield.  CATT's combination of manned simulators and staff officer workstations enables units to train as a combined arms team in a cost effective manner.  The primary CATT system is the Close Combat Tactical Trainer (CCTT) which provides the underlying baseline architecture and After Action Review (AAR) for CATT expansions, Pre-Planned Product Improvements (P3I) and system enhancements.  The Reconfigurable Vehicle Simulator (RVS) and Dismounted Soldier Training System (DSTS) variants support combat convoy operations and Improvised Explosive Devices (IED) tasks.  Synthetic Environment (SE) Core provides for the expansion of the synthetic environment baseline to include enhanced interoperability and the products and infrastructure to support current and future combat operations and mission rehearsal required for Overseas Contingency Operations (OCO) and Decisive Operations.  The first synthetic environments expanded were in the Aviation Combined Arms Tactical Trainer (AVCATT) and the CCTT for both the Active and Reserve components.  Gaming Technology provides an application to train and rehearse convoy-operations, platoon level, mounted infantry tactics, dismounted operations, rules-of-engagement training, cross-cultural communications training, IED defeat training, route clearance, ground-air coordination, Unmanned Aerial Vehicle (UAV) integration, and other small unit and individual training and mission rehearsal requirements.  Soldiers can train in a common environment on geotypical or geospecific terrain.  It is also possible to link Gaming technology to actual communication, command, control, computer, and intelligence (C4I) systems and other CATT simulation systems to increase the utility and realism of the training.  By practicing skills in CATT, units are able to effectively prepare for costly live fire and maneuver exercises, as well as train tasks deemed too hazardous to conduct in a live training environment.  Fielded in both fixed site and mobile versions, CATT enables both Active and Reserve component units to prepare for real world contingency missions.  By being able to use a wide array of training terrain databases and modify the behavior of the computer generated opposing forces, CATT offers an unlimited array of training options to support the Army's many regional combat missions.  The combination of tough field and live fire training, and realistic simulation training in CATT, is the formula to prepare Soldiers and their Leaders for the uncertainties they face in current combat operations in Afghanistan, and their transition to Decisive Operations.\n\nFY 2013 Project 571 core funding of $4.252 million for CCTT enables the P3I for the CCTT Dismounted Soldier Training System (DSTS) system in support of Infantry Brigade Combat Teams, Stryker Brigade Combat Teams, Airborne, Ranger, Special Forces units and Heavy Brigade Combat Teams. \n\nFY 2013 Project 577 core funding of $1.348 million for Games for Training will integrate OneSAF and new commercial and government technology products into the current gaming system. \n\nFY 2013 Project 582 core funding of $9.616 million for SE Core will provide for common terrain databases to be generated by the Terrain Database Center (TDC).  The TDC continues development and refinement of the Standard Terrain Database Generation Capability (STDGC).\n  \nFY 2013 Project 585 core funding of $2.581 million for AVCATT will develop the capability for AVCATT to interoperate with real and simulated Army Battle Command Systems (ABCS) such as Blue Force Tracker (BFT), Force XXI Battle Command Brigade and Below (FBCB2), and Advanced Field Artillery Tactical Data Systems (AFATDs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.670"
                },
                "CurrentYear": {
                    "val": "22.226"
                },
                "BudgetYearOne": {
                    "val": "17.550"
                },
                "BudgetYearOneBase": {
                    "val": "17.550"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.699"
                },
                "CurrentYear": {
                    "val": "22.205"
                },
                "BudgetYearOne": {
                    "val": "17.797"
                },
                "BudgetYearOneBase": {
                    "val": "17.797"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.971"
                },
                "CurrentYear": {
                    "val": "-0.021"
                },
                "BudgetYearOne": {
                    "val": "0.247"
                },
                "BudgetYearOneBase": {
                    "val": "0.247"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.798"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.173"
                                },
                                "CurrentYear": {
                                    "val": "-0.021"
                                },
                                "BudgetYearOne": {
                                    "val": "0.247"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.247"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "571"
                    },
                    "ProjectTitle": {
                        "val": "CLOSE CBT TACT TRAINER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.513"
                        },
                        "CurrentYear": {
                            "val": "4.317"
                        },
                        "BudgetYearOne": {
                            "val": "4.252"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.252"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.519"
                        },
                        "BudgetYearThree": {
                            "val": "4.455"
                        },
                        "BudgetYearFour": {
                            "val": "6.646"
                        },
                        "BudgetYearFive": {
                            "val": "6.645"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program provides for Engineering and Manufacturing Development (EMD) and Pre-Planned Product Improvements (P3I) for the Close Combat Tactical Trainer (CCTT), which will enhance readiness for both Active and Reserve component forces to support the execution of current and future combat operations including Overseas Contingency Operations (OCO) and Decisive Operations.  The program develops a networked system of interactive computer driven simulators, emulators, and semi-automated forces that replicate combat vehicles and weapon systems, combat support systems, combat service support systems, and command and control systems to create a fully integrated, real-time collective task training environment.  CCTT allows Soldiers to practice Tactics, Techniques and Procedures (TTP) that, if performed on real equipment, would be too hazardous, time-consuming and expensive.  These trainers enhance realism and allow Soldiers and units to learn tactical, combat lessons on maneuver, command and control, convoy operations, and improved teamwork for increased survivability.  The P3I enhances CCTT's capabilities as a tactical trainer and maintains concurrency with fielded, tactical equipment and force structure.  These improvements will maintain interoperability with the Aviation Combined Arms Tactical Trainer (AVCATT), Army Battle Command System (ABCS), including Force XXI Battle Command Brigade and Below (FBCB2), and other simulation systems needed to execute training for current and future combat operations. \n\nFY 2013 core funding of $4.252 million for CCTT enables the P3I for the CCTT Dismounted Soldier Training System (DSTS) in support of Infantry Brigade Combat Teams, Stryker Brigade Combat Teams, Airborne, Ranger, Special Forces units and Heavy Brigade Combat Teams."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Close Combat Tactical Trainer (CCTT) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the CCTT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported government program management, engineering, technical, contracting support, and continued operational evaluation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.182"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supports government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.729"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Text": {
                                                "val": "Supports government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the CCTT DSTS."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the CCTT DSTS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Development of the CCTT DSTS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.135"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enables the P3I for the CCTT DS system in support of Infantry Brigade Combat Teams, Stryker Brigade Combat Teams, Airborne, Ranger, Special Forces units and Heavy Brigade Combat Teams."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.523"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.523"
                                            },
                                            "Text": {
                                                "val": "Enables the P3I for the CCTT DSTS in support of Infantry Brigade Combat Teams, Stryker Brigade Combat Teams, Airborne, Ranger, Special Forces units and Heavy Brigade Combat Teams."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Armored Security Vehicle (ASV) and Knight vehicle variants of the CCTT Reconfigurable Vehicle Simulator (RVS)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the ASV and Knight vehicle variants of the CCTT RVS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.942"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Development of the ASV and Knight vehicle variants of the CCTT RVS."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA3, Appropriation NA0170"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0170"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "84.279"
                                        },
                                        "CurrentYear": {
                                            "val": "13.290"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.984"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.984"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.324"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.365"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.893"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FY 2013 will enable Pre-Planned Product Improvements (P3I) for the Dismounted Soldier Training System (DSTS)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.899"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.182"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.729"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.729"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development of the ASV and Knight vehicle variants for CCTT RVS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.302"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.302"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.302"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development of CCTT Dismounted Soldier Training System"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Intelligent Decisions, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ashburn, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.876"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.135"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.523"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.523"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Development and P3I of the CCTT Dismounted Soldier Training System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development of the ASV and Knight vehicle variants for the CCTT RVS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "577"
                    },
                    "ProjectTitle": {
                        "val": "Gaming Technology in Support of Army Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.903"
                        },
                        "CurrentYear": {
                            "val": "1.427"
                        },
                        "BudgetYearOne": {
                            "val": "1.348"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.348"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.043"
                        },
                        "BudgetYearThree": {
                            "val": "0.872"
                        },
                        "BudgetYearFour": {
                            "val": "1.496"
                        },
                        "BudgetYearFive": {
                            "val": "1.521"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Games for Training (GFT) program provides a commercial-off-the-shelf (COTS) product line of personal computer based gaming applications to train Soldiers in decision-making, team and individual tasks at different skill levels, using multiple mission scenarios.  The program leverages the commercial game industry to provide state of the art training solutions.  The GFT program provides Army-wide licenses from the commercial market, or from Research and Development agencies, and the hardware required to operate the systems.  The individual products permit Soldiers and units to conduct training in a real-time, semi-immersive environment that will leverage Synthetic Environment Core (SE Core) capabilities and is compliant with Live, Virtual and Constructive Integrated Training Environment (LVC-ITE).  The GFT program currently supports both Overseas Contingency Operations (OCO) and Decisive Operations.\n\nFY 2013 core funding of $1.348 million will integrate OneSAF and new commercial and government technology products into the current gaming system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Games for Training (GFT) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the GFT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.754"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding provided modifications to the GFT system to integrate and provide interoperability with Army Battle Command Systems (ABCS) and other simulators and simulations in support of home station training, OCO and Decisive Operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.133"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding will provide modifications to the GFT system to integrate and provide interoperability with medical training systems,  ABCS and other simulators and simulations in support of home station training, OCO and Decisive Operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.009"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.009"
                                            },
                                            "Text": {
                                                "val": "Funding will provide modifications to the GFT system to ensure compliance with the LVC-ITE in support of Decisive Operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Games for Training (GFT) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the GFT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.149"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported Government program management, engineering, technical, contract and test support for the GFT program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.294"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supports Government program management, engineering, technical, contract and test support for the GFT program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.339"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.339"
                                            },
                                            "Text": {
                                                "val": "Supports Government program management, engineering, technical, contract and test support for the GFT program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA 3"
                                    },
                                    "Title": {
                                        "val": "OPA 3, Appropriation NA0176 Gaming Technology in Support of Army Training"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.937"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.956"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.056"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "5.900"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.016"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.501"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.736"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive contract against the approved Capabilities Production Document (CPD), dated 18 Sep 08."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.304"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.294"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Games for Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.513"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.133"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.009"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.009"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "LVC-IA integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "582"
                    },
                    "ProjectTitle": {
                        "val": "SYNTHETIC ENVIR CORE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.361"
                        },
                        "CurrentYear": {
                            "val": "13.914"
                        },
                        "BudgetYearOne": {
                            "val": "9.616"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.616"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.889"
                        },
                        "BudgetYearThree": {
                            "val": "18.784"
                        },
                        "BudgetYearFour": {
                            "val": "12.709"
                        },
                        "BudgetYearFive": {
                            "val": "12.760"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the Synthetic Environment Core (SE Core) Program.  SE Core's mission is to ensure the Army's virtual training systems and simulators are fully integrated and interoperable. SE Core provides visual models (buildings and vehicles), terrain (over which the simulator moves), and entity behaviors (models performing realistic and appropriate actions) that are relevant and realistic to Unified Land Operations.  The result is a \"Fair Fight\" capability; no simulator or operator will have an inherent advantage over another.  This allows for air and ground to have coordinated and integrated training events that accurately replicate combat operations.  Additionally, SE Core is building the Army's Common Virtual Environment (CVE) that provides the linkage between simulators and establishes a common environment for interoperability.  This allows various simulators to be \"hooked up\" together for a train as they fight capability. SE Core is a foundational element in the Army's Training Transformation Plan linking the embedded systems, multi-mode Live, Virtual, Constructive (LVC) training capability with current systems.\n\nThe SE Core components are One Semi-Automated Forces (OneSAF) integration; terrain database production; common visual models; a virtual systems architecture; a dynamic environment; mission command development; and net ready.  A major SE Core component is the Standard Terrain Database Generation Capability (STDGC) process used to produce the synthetic terrain used in simulators and simulations.  This terrain produced by SE Core is a key component for virtual simulators and constructive simulations and will expand to meet the growing demands of today's and future simulations.  \n\nFY 2013 base funding of $9.616 million will provide expanded development and production for common terrain databases as well as refining the production process.  FY2013 funds will focus on modifying the Terrain Development process for constructive Terrain Database Production and continue to enhance OneSAF in the SE Core Architecture, CCTT, AVCATT and other virtual simulator baselines.  Maintaining OneSAF for virtual simulations enables interoperability with the LVC ITE and reduces cost as individual virtual simulators will no longer develop and maintain separate SAFs.  The SE Core Product Line of Common Virtual Components will continue with upgrades, integration and refinement, and the continued development of common visual models."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Synthetic Environment Core (SE Core) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the SE Core program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.157"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "SE Core continued providing terrain databases to programs and improving the STDGC to increase efficiencies and increasing production outputs. SE Core continued integration of virtual requirements (new Contemporary Operating Environment and IED behaviors) into OneSAF.  SE Core stood up a virtual systems Architectural Management process that evaluates and consolidates virtual training requirements into common components to reduce redundancy and increase commonality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides terrain databases to an expanded number of programs in support of the Integrated Training Environment (ITE).  Architectural Management continues evaluation of virtual training requirements to harmonize the requirements throughout the virtual training domain as well as the Constructive and Live training domains.  This is to ensure interoperability within the ITE.  Continues to provide OneSAF the consolidated virtual SAF requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.704"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.704"
                                            },
                                            "Text": {
                                                "val": "Provides expansion of the production capability to meet the growing demand for synthetic terrain for training including constructive simulations.  In addition, SE Core will oversee the development of the SAF behaviors for the Dismounted Soldier System.  Efforts to improve interoperability across simulators and simulations continue."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Synthetic Environment Core (SE Core) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the SE Core program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.204"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided program management, engineering and technical oversight, contract support, and test support (including travel for Subject Matter Experts) for development of SE Core."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides program management, engineering and technical oversight, contract support, and test support (including travel for Subject Matter Experts) for development of SE Core."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.912"
                                            },
                                            "Text": {
                                                "val": "Provides program management, engineering and technical oversight, contract support, and test support (including travel for Subject Matter Experts) for development of SE Core."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA3, Appropriation NA0173"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0173 Aviation Combined Arms Tactical Trainer"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.974"
                                        },
                                        "CurrentYear": {
                                            "val": "9.413"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.977"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.977"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "1.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.322"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.452"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.425"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA3, Appropriation NA0170"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0170 Close Combat Tactical Trainer (CCTT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "84.279"
                                        },
                                        "CurrentYear": {
                                            "val": "13.290"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.984"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.984"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.324"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.365"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.893"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE, Appropriation 654760"
                                    },
                                    "Title": {
                                        "val": "RDTE, Appropriation 654760 One Semi-Automated Forces (OneSAF)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.132"
                                        },
                                        "CurrentYear": {
                                            "val": "11.678"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.720"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.720"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.835"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.234"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.437"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation, 121014000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121014000, TBWG"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.781"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.708"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.708"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.926"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.040"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An extension to the Architecture & Integration (A&I) contract was awarded to Science Applications International Corp (SAIC) in 2Q09.  A competitive, CPFF type contract for the development of SE Core Database Virtual Environment Development (DVED) project was awarded in FY06 to CAE with yearly options until FY11.  Program re-competed both of these contracts into a single contract which was awarded in 4th QTR FY11 to SAIC."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.622"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.622"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.622"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.095"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.884"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.912"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.912"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development - Architecture and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.946"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.946"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.946"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development -Architecture and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "50.785"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "50.785"
                                                    },
                                                    "TargetValue": {
                                                        "val": "50.785"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development -Database Virtual Environment Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CAE, USA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "56.179"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "56.179"
                                                    },
                                                    "TargetValue": {
                                                        "val": "56.179"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.030"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.704"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.704"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development - Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Test Community"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.125"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.125"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.125"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Common Virtual Environment Management Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "585"
                    },
                    "ProjectTitle": {
                        "val": "AVIATION COMBINED ARMS TACTICAL TRAINER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.922"
                        },
                        "CurrentYear": {
                            "val": "2.547"
                        },
                        "BudgetYearOne": {
                            "val": "2.581"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.581"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.668"
                        },
                        "BudgetYearThree": {
                            "val": "2.496"
                        },
                        "BudgetYearFour": {
                            "val": "3.667"
                        },
                        "BudgetYearFive": {
                            "val": "2.783"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Aviation Combined Arms Tactical Trainer (AVCATT) is an Army aviation training system for Active, Reserve and Army National Guard Components. A single suite of equipment consists of two mobile trailers housing six reconfigurable networked simulators that support the AH-64A\/D, UH-60A\/L, CH-47D, and OH-58D aircraft.  Other AVCATT modules, such as the Non-Rated Crewmember Manned Module (NCM3, a sub-system of AVCATT), can be linked to this basic configuration, when and where needed, to support specific unit training requirements.  Roleplayer, Semi-Automated Forces (SAF), and After Action Review (AAR) workstations are also provided as part of each suite.  AVCATT is a fully mobile system, capable of using shore and generator power and is transportable worldwide.  The AVCATT system permits aviation units to conduct collective task training on a real-time, virtual battlefield in a combined arms scenario by leveraging Synthetic Environment Core (SE Core) capabilities.  The AVCATT is designed to provide realistic, high intensity, collective and combined arms training for aviation units.  AVCATT supports the Aviation Combined Arms Training Strategy, Army Forces Generation (ARFORGEN), Overseas Contingency Operations (OCO), and Decisive Operations.\n\nFY 2013 core funding of $2.581 million will develop the capability for AVCATT to interoperate with real and simulated Army Battle Command Systems (ABCS) such as Blue Force Tracker (BFT), Force XXI Battle Command Brigade and Below (FBCB2), and Advanced Field Artillery Tactical Data Systems (AFATDs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Aviation Combined Arms Tactical (AVCATT) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the AVCATT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted a technology refresh of various components of AVCATT.  Examples include Servo Control Modules, Battle Master Controller and After Action Review computers and various projectors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.547"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct a technology refresh of AVCATT's Image Processor Display Generation (IPDG) systems, including design, development, and test of the new systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.581"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.581"
                                            },
                                            "Text": {
                                                "val": "Develop the capability to stimulate and be stimulated by Current Force virtual simulators and battle command systems through the use of the SE Core Gateway."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for AVCATT program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the AVCATT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported Government program management, engineering, technical, contract, and test support for AVCATT technology upgrades."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA3"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0173 Aviation Combined Arms Tactical Trainer"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.974"
                                        },
                                        "CurrentYear": {
                                            "val": "9.413"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.977"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.977"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "1.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.322"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.452"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.425"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Small Business Set aside for technology refresh efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AVCATT"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Communications Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "45.210"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.581"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.581"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AVCATT"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Daedalus Technologies, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.547"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.547"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.547"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Required Interoperability with battle command systems and virtual simulators"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Technology refresh of IPDG Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}