{
    "id": "3681d0729e762526ad28baf66457015e8c1c1794",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605799D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities"
        },
        "R1LineItemNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.092"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This Program Element (PE) transitions from PE 0605799D8Z to PE 0603699D8Z in FY 2012."
        },
        "ProgramElementMissionDescription": {
            "val": "This funding request supports the development of emerging capabilities under the Assistant Secretary of Defense (Research and Engineering) Rapid Reaction Technology Office (RRTO).  These funds are used to advance technical capabilities in mutual areas of interest through focused partnerships and projects with other federal departments and agencies.  In addition to supporting interagency cooperation, this PE incubates selected concepts and technologies of interest to joint warfighters and their interagency partners to provide mature options as capability needs emerge in and beyond the Future Years Defense Plan (FYDP).  This includes developing risk-reducing prototypes to demonstrate capabilities in response to joint warfighter and interagency partners’ shared requirements; and informing the Joint Capabilities Integration & Development System (JCIDS) and acquisition system through technical demonstrations.  Individual projects are developed and funded with interagency partners over a two to three year period – products are demonstrated and fielded in spirals within that project timeline – and generally do not include stand-alone studies.  Funding for this PE permits support for four to five major projects per year.  Typically, these projects support mid-term irregular warfare needs aligned with those of interagency partners, and often supports near term capability needs in support of the Department’s Rapid Fielding efforts.  This program element has evolved from exclusive support of force transformation activities to the activities described above, more closely aligned with departmental goals.  This PE will transition from PE 0605799D8Z to PE 0603699D8Z in FY 2012."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.701"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.092"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.609"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.431"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.100"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.072"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "This PE transitions from PE 0605799D8Z to PE 0603699D8Z in FY 2012."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P799"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.092"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Emerging Capability (EC) funding is utilized to develop new capabilities under the Assistant Secretary of Defense (Research & Engineering) Rapid Reaction Technology Office (RRTO).  EC projects seek to advance technical capabilities in mutual areas of interest through focused partnerships and projects with other federal departments and agencies.  In addition to supporting interagency cooperation, this Program Element (PE) incubates selected concepts and technologies of interest to joint warfighters and interagency partners to provide mature options as capability needs emerge in and beyond the Future Years Defense Plan (FYDP).  EC projects will inform the Joint Capabilities Integration & Development System (JCIDS) and acquisition system through technical demonstrations which include:  developing risk-reducing subsystems and prototypes, integrating new technologies for field and operational experiments, and demonstrating capabilities in response to joint warfighter and interagency partners' shared requirements.  Projects are in support of mid-term irregular warfare needs aligned with those of interagency partners, and often support near term capability needs in support of the Department's rapid fielding efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Law Enforcement Capabilities Project"
                                    },
                                    "Description": {
                                        "val": "The Law Enforcement Capabilities Project advances current thinking on the nature of, and need for, law enforcement capabilities across DOD, the Services and the interagency to support complex warfighting, conflict resolution, stabilization and reconstruction.  This project identified and described specific capabilities relevant to enhancing military cooperation with law enforcement agencies to further improve interagency cooperation.  The payoff was the development of a series of tools to enhance the capabilities of military, law enforcement agencies and their mutual interaction.  It also identified specific (technological and organizational) capabilities to further develop this capability in the future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Text": {
                                                "val": "Completed two table top exercises.  Developed doctrinal publications for the Marine Corps and the Department of Justice."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gunslinger Package for Advanced Convoy Security (GunPACS)"
                                    },
                                    "Description": {
                                        "val": "The GunPACS is a system built on the U.S. Marine Corps Medium Tactical Replacement Vehicle (MTRV) platform that provides enhanced situational awareness and cooperative engagement capabilities for ground and combat logistics elements in Afghanistan.  This technology provides accurate targeting solutions to small unit and logistics convoy vehicle crews enabling them to effectively engage hostile shooters with remote weapons while remaining under armor.  GunPACS utilizes 360-degree camera coverage, acoustic shot detection, and networked data fusion technology to determine shooter location information.  This information is used by the operators to designate targets for the remote weapons mount to enable vehicle crews to engage hostiles while remaining under armor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Text": {
                                                "val": "Fielded to Afghanistan for a twelve (12) month operational assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Humanitarian Assistance\/Disaster Response Capability Development effort:  QuickNets"
                                    },
                                    "Description": {
                                        "val": "The project sought to answer the fundamental question:  In a fast onset disaster, how do we generate unity of effort amongst all actors when unity of command is neither possible nor desirable and what technologies can contribute to this effort?  In previous humanitarian responses, ineffective coordination has led to a lack of unity amongst various responders and the host nation government, resulting in a time gap between quickly available financial, human, and relief resources and their application to problems faced on the ground.  This project seeks to capitalize on crowd-sourcing to determine how unity of effort can be achieved to help close the gap between identifying resources and their rapid utilization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Text": {
                                                "val": "Completed three software builds, each based on lessons learned from demonstrations, of a crowd-sourced situational awareness tool.  Participated in two operational demonstrations sponsored by Special Operations Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Building Effective States"
                                    },
                                    "Description": {
                                        "val": "The problem of failing and failed states is increasingly recognized as a key challenge in the contemporary world and lies at the root of global insecurity.  Currently there are estimated to be some 40 to 60 countries that fall short of standards of state functionality, including but not limited to Afghanistan, Pakistan, Iraq, Somalia, Yemen, Haiti and Sudan.  There has been increasing recognition within the Office of the Secretary of Defense (OSD) and the broader interagency of the need to develop a United States Government (USG) approach to realize the concepts articulated by the Institute for State Effectiveness (ISE).  Given the strong demand at senior levels throughout government and a present deficit within USG of actionable tools for effective institution building, this project is a critical next step to define the operational technologies, templates and tools required to facilitate implementation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Text": {
                                                "val": "Completed Phase I, a comprehensive mapping\/catalogue of United States and international conflict\/institutional assessment tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Mortar Targeting System (EMTS)"
                                    },
                                    "Description": {
                                        "val": "Existing Forward Operating Base (FOB) defense systems currently provide only the capability to detect, provide warning, and assess potential threats.  At smaller, more remote locations, the kinetic response capability is limited only to existing organic weapon systems, which can become overwhelmed; or, to supporting arms which may be unavailable due to weather, competing requirements or Rules of Engagement (ROE).  In addition, mortar crews are routinely exposed to enemy fire and\/or unable to man their system due to enemy action.  The integration of a more robust response capability into detect\/warn\/assess systems will enhance the capability of small units\/FOBs to defend themselves, which in turn enables greater tactical flexibility.  In the near term, this project augmented current kinetic capabilities available to units occupying small FOBs by providing the capability for precision mortar fire.  In the longer term, integrating this system and other weapons with existing and future sensors in order to maximize current capabilities and accelerate the development of future FOB defense technologies.   The EMTS provided rapid, 360 degrees indirect fire capability from a single firing position using an integrated fire control system and an electronic drive which provides auto-laying capability at a traverse rate of 15 degrees per second.  The mortar uses either 120 millimeters or 81 millimeters United States standard mortar tubes and provides an accuracy of 1 percent of range (for example: 30 meters at 3 kilometers).  The project seeks an end state where next generation FOB defense capabilities are integrated with a robust, precise, kinetic response scalable for application to FOBs ranging from sub-platoon to company sized locations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Text": {
                                                "val": "Deployed ten systems to Afghanistan.  Initiated Phase II to integrate the system with US Army Program of Record fire control software as a precursor to integration with sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Systems:  Stiletto"
                                    },
                                    "Description": {
                                        "val": "Stiletto was developed to provide the DOD a dedicated operational Research and Development (R&D) maritime platform.  Although the craft incorporates experimental naval architecture to explore the scalability of non-mechanical dynamic lift, carbon fiber construction, and high speed performance for military operations, it's the craft's electronic keel and associated craft characteristics (for example:  covered payload space, Unmanned Aerial Vehicle (UAV) flight deck, shallow draft, and ability to easily integrate Command, Control, Communications, Computers, Intelligence (C4I) systems) that provides Stiletto her agile R&D capabilities.  The electronic keel is flexible, modular and re-configurable to support near plug-and-play installation of C4I equipment used as part of experimentation.  In addition to testing C4I equipment, Stiletto is ideally suited for operational experimentation and has tested unmanned systems, sensors, and coastal warfare concepts of operations for various commands and agencies.  The Stiletto vessel is homeported at the Combatant Craft Division of the Naval Surface Warfare Center (NSWC), Carderock in Norfolk, Virginia."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.479"
                                            },
                                            "Text": {
                                                "val": "The Stiletto maritime experimentation platform project completed twelve (12) technology demonstrations in FY 2011, demonstrating the capabilities of:  sensors; biometrics data links; human factors capabilities; Intelligence, Surveillance, and Reconnaissance (ISR) technologies; display systems; and, radars.  Stiletto’s operational experimentation in FY 2011 included participation in the Irregular Warfare Innovation Cell’s Blue Dragon demonstration.  Blue Dragon was a technology demonstration project between the National Maritime Intelligence Center, Naval Air Warfare Center Aircraft Division and NSWC’s Combatant Craft Division.  Blue Dragon featured Stiletto as a “mothership” in conjunction with a family of maritime ISR sensors and platforms to advance the state of the art in the Maritime Domain Awareness arena.  Testing continues in support of the Combatant Command (COCOM), Services, and the Agency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Griffin Cooperative Autonomy Demonstration Program"
                                    },
                                    "Description": {
                                        "val": "Griffin leveraged the Navy’s Autonomous Maritime Navigation program to develop and install autonomous command and control systems and integrated the associated sensors on maritime platforms.  The goal was to provide a system that is capable of supporting a patrol mission with minimal human interaction, until a target of interest is identified, at which time the system either interrogated the target autonomously with its sensors, or requested operator support for interacting with the target.  There is no other fully functional autonomous unmanned surface vessel (USV) within DOD nor a system by which autonomous unmanned systems are able to act cooperatively.  Unmanned systems represent a large growth area for the warfighter, but currently require a greater logistics and personnel footprint than a similarly capable manned system.  This effort worked with cutting edge technologies to minimize human-machine interaction during the mission phase, while still producing high quality ISR data.  This will reduce manning requirements, allowing the tender vessel\/station to conduct normal operations while the USV is conducting its assigned mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The Griffin capability was exercised in Trident Warrior and successfully demonstrated the ability to autonomously and cooperatively patrol a maritime area of interest.  Additionally, Griffin successfully demonstrated the ability to escort a high value unit and provide maritime blocking maneuvers when a threat was detected.  A final report was promulgated to the Navy and other potential users of the technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Rigid Aeroshell Variable Buoyancy (RAVB) Air Vehicle - Project Pelican"
                                    },
                                    "Description": {
                                        "val": "Project Pelican is a non-deployable airship technology demonstrator that integrates independent technologies into a single, rigid aeroshell variable buoyancy (RAVB) vehicle.  Pelican will demonstrate the technical maturity of a scalable vertical takeoff and landing aircraft. Key technologies to be demonstrated include a buoyancy management system to enable ballast-independent operations, composite lightweight rigid external structure, a responsive low-speed\/hover control system, and a ground handling subsystem to enable operations on unimproved landing surfaces.\n\nThe program seeks to reduce risk by integrating and demonstrating a suite of technologies with the potential to reduce operational constraints on future heavy-lift, buoyant-aircraft development programs.  Success may lead to a nascent class of air vehicle which will radically reduce energy use per ton-mile, permit high-payload operations in austere regions with little infrastructure, and enable long-endurance manned or unmanned air operations.  RAVB aircraft appear to be scalable to payloads of 500-1,000 tons (compared with payloads in the 125-ton range for the largest current US cargo aircraft).  In addition, RAVB aircraft may also reduce need for intermodal transportation as cargo moves from origin to point of need, with corresponding reduction in delivery times."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "During FY 2011 a successful test of the variable buoyancy system was completed and the contractor continued several subsystem design and integration tests and began overall vehicle system level integration.  Periodic in-progress design reviews will continue."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "A follow-on to RRTO’s “Bluegrass” efforts, Thunderstorm has established an enduring multi-platform, multi-sensor Intelligence Surveillance and Reconnaissance (ISR) test bed using Southern Command's (SOUTHCOM) Joint Interagency Task Force South (JIATF-S) and Joint Task Force North (JTFN), along with DHS\/Customs and Border Protection (CBP) locations as venues to conduct operational experiments with next generation detection, cueing, monitoring, tracking, and handoff capabilities against asymmetric target sets.  \n\nIn FY2011 the U.S. Southwest border was chosen as exercise venues because the operational environment is similar to deployed locations (i.e. Iraq and Afghanistan), and contains many of the same elements (i.e., non-state actors, ad hoc available to facilitate the development of government and industry capabilities to meet warfighter networks, and an adaptive enemy).  The availability of CBP operational intelligence architectures coupled with a true interagency organizational construct made the Southwest border a realistic environment to vet capabilities prior to deployment to more stressing operational environments.\n\nIn addition to providing relevant intelligence to support JIATF-South, and now JTFN operations, Thunderstorm also encourages greater cooperation with multi-agency\/multinational partners, and identifies improvements in ISR concepts of operations that can be exported for other areas of responsibility to leverage.  OSD has made Thunderstorm exercise data requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.178"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm Spiral 4.0 was conducted in the CBP Tucson Sector from 1-15 May 2011.  Operations were conducted from a tactical operations center, located in the CBP Information and Operations Control Center (IOCC) located in Tucson, AZ.  Air and ground assets were tasked each day to perform two basic missions. First, each would be tasked to collect against actors performing scripted activity in Catalina State Park, AZ.  This activity provided ground truth for each of the sensors.  Following this, assets were tasked to fly along the border west of Nogales, AZ in support of real-world CBP activities. Sightings were relayed to CBP for their action.  Next year, Spirals 4.1 and 5.0 will be conducted in the same operational area, once again supporting CBP counter-drug efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Generic performance metrics applicable to Emerging Capabilities includes attainment of DoD Strategic Objective 4-2D:  Speed Technology Transitions Focused on Warfighting Needs.  The metric for this objective is to transition 30 percent of completing demonstration programs per year.  During FY 2011 Emerging Capabilities achieved a transition rate of 100 percent for six (6) completing projects, and exceeded the 30 percent objective."
                        }
                    }
                }
            ]
        }
    }
}