{
    "id": "36b9991e58fa1df4abe62773b678bdec71526d28",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602114N"
        },
        "ProgramElementTitle": {
            "val": "Power Proj Applied Research"
        },
        "R1LineItemNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "100.159"
            },
            "CurrentYear": {
                "val": "104.796"
            },
            "BudgetYearOne": {
                "val": "89.189"
            },
            "BudgetYearOneBase": {
                "val": "89.189"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "86.793"
            },
            "BudgetYearThree": {
                "val": "90.869"
            },
            "BudgetYearFour": {
                "val": "93.143"
            },
            "BudgetYearFive": {
                "val": "94.948"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports both advanced technology research and near to mid-term transition opportunities.  The advanced research focus is primarily on High Energy Lasers (HEL), Electromagnetic railgun development, high speed weapon propulsion, and electro-optic\/infrared (EO\/IR) sensor technologies.  The mid-term effort is focused on developing and demonstrating technologies supporting the Future Naval Capability (FNC) Program Enabling Capabilities (ECs) for Marine and Unmanned Vehicle Tactical Intelligence, Surveillance and Reconnaissance (ISR), Advanced Naval Fires Technology, Hostile Fire Detection and Response, Maritime Weapons of Mass Destruction Detection (MWMD-D), and Dynamic Target Engagement & Enhanced Sensor Capabilities.  Within the Naval Transformation Roadmap, this investment will achieve two of four key transformational capabilities required by Sea Strike as well as technically enable the Littoral Sea Control key transformational capability within Sea Shield.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.150"
                },
                "CurrentYear": {
                    "val": "104.804"
                },
                "BudgetYearOne": {
                    "val": "106.752"
                },
                "BudgetYearOneBase": {
                    "val": "106.752"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "100.159"
                },
                "CurrentYear": {
                    "val": "104.796"
                },
                "BudgetYearOne": {
                    "val": "89.189"
                },
                "BudgetYearOneBase": {
                    "val": "89.189"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.009"
                },
                "CurrentYear": {
                    "val": "-0.008"
                },
                "BudgetYearOne": {
                    "val": "-17.563"
                },
                "BudgetYearOneBase": {
                    "val": "-17.563"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.008"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.127"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.584"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-18.463"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-18.463"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.900"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.900"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.534"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "100.159"
                        },
                        "CurrentYear": {
                            "val": "104.796"
                        },
                        "BudgetYearOne": {
                            "val": "89.189"
                        },
                        "BudgetYearOneBase": {
                            "val": "89.189"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "86.793"
                        },
                        "BudgetYearThree": {
                            "val": "90.869"
                        },
                        "BudgetYearFour": {
                            "val": "93.143"
                        },
                        "BudgetYearFive": {
                            "val": "94.948"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses the technology issues involving the Navy's capability to project naval power on the broad seas and in the littoral regions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DIRECTED ENERGY"
                                    },
                                    "Description": {
                                        "val": "Description: The goal of this activity is to develop Directed Energy (DE) technology for Navy applications.  The DE program address the requirements of future Navy combatants to provide ship defense against the high speed, high maneuverability Cruise Missiles that are proliferating throughout the Navies of the world. The Directed Energy portion of this activity consists of two elements.  The first element involves applied research and development of technologies supporting advanced accelerators with applications to directed energy weapons.  This activity also includes the Free Electron Laser (FEL) Innovative Naval Prototype (INP) which if successful could be utilized for shipboard applications as a defensive weapon against advanced cruise missiles and asymmetric threats.\n\nFY 2011 to FY 2012 increase in funding is primarily due to the start of the second contractual phase of the FEL INP program. As a result of the Phase 1A competition, a single contractor was awarded the contract in late FY10 and in FY 2011 the selected contractor will begin the critical design, development and installation portion of the FEL INP 100kW test and demonstration program.  In addition long lead item procurement for the 100 kW FEL will begin in FY11\/12.  These long lead items require approximately 15 to 18 months for manufacturing and delivery to the test facility.  The other element influencing the funding increase is the additional S&T investment required to develop compact, high performance FEL components such as the high power injector (super conducting and normal conducting radio frequency), the mirror\/optical components and oscillator system, and the high power amplifiers. Additional development of these components is extremely critical for operation at required INP power levels and also to minimize the FEL footprint in anticipation of eventual ship integration.\n\nFY 2012 to FY 2013 decrease in funding is primarily due to a revised directed energy portfolio focused on a diversified approach."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n-Continued cryomodule and FEL component development at the FEL testing and integration facility.\n-Continued investigation into the application of FEL technology to other areas including advanced materials, optics, bioscience, medical, manufacturing, weaponization, and solid state physics.\n-Continued 1 micron filamentation, halo limitation, and short Rayleigh range studies.\n-Continued testing of Radio Frequency (RF) gun High Voltage Power Supply (HVPS) components which are required for the 100 kW high current injector.\n-Continued applied directed energy and accelerator research in: Compton radiation scattering, multiple dielectric thin film coatings, bunch characteristics of electron beam emittance, high grade electromagnetic field generators, electron beam lattice configuration, novel electron beam generation, novel high flux subatomic particle emission, high gain photonic amplification, fundamental power efficiency conversion.\n-Continued the development of physics based models for: characterization of subatomic particle interaction and propagation and modeling for validation of photon control structures.\n-Continued Innovative Prototype (INP) program for the FEL. Held Preliminary Design Review (PDR) for both contractors who were selected to participate in Phase 1A of the FEL INP program. Review proposals from the Phase 1A contractors. Downselect and award a contract to a single contractor to proceed forward in Phase 1B and the Critical Design Review (CDR) to be held in FY11.\n-Continued detailed design efforts required for presentation at the CDR for Phase 1B of the FEL program, including preparation of design, materials and parts, analyses and trade study, safety and supportability reports, and initial orders for long lead item components. In addition some preliminary preparations will begin at the test facility selected for installation of the 100 kW FEL system.\n-Continued development of components required for the successful testing of the 100 kW FEL, to support the scale up of the 100 kW FEL into a megawatt class weapon, and to reduce the overall footprint of the system to support the eventual ship integration of the FEL, including normal conducting and super conducting RF electron beam injectors, advanced high power cathode technologies, high power compact amplifiers, and advanced mirrors, coatings and optical components capable of handling the significantly higher energies that are present in a 100 kW level FEL.\n\n\nApplied Electromagnetics for High Power Weapons:\n-Continued a program to conduct applied research into applied electromagnetics as it relates to lasers, high power microwaves, and advanced sensors for Directed Energy Weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "60.416"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n-Complete execution of Phase 1B of 100 kW FEL demonstration program. Initiate Phase II of the 100 kW FEL program. Phase II will include the fabrication, integration, and acceptance testing of a 100 kW FEL system.\n-Continue S&T development of high power, compact components required for megawatt class FELs.\n-Conduct analysis, design, development and testing of photcathodes, thermionic cathodes, field emission array cathodes, Radio Frequency (RF) sources and input couplers, and cryomodules for Superconducting RF electron guns for high power FELs.\n\nApplied Electromagnetics for High Power Weapons:\n-Continue all efforts of FY 2011."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.686"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.686"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n-Continue Phase II of the 100 kW FEL program. Phase II tasks will include the acquistion of long lead items and the fabrication, integration, and acceptance testing of a 100 kW FEL demonstration system.\n-Continue S&T development of high power, compact components required for megawatt class FELs.\n-Continue analysis, design, advanced development of cathodes for high power FELs.\n\nApplied Electromagnetics for High Power Weapons:\n-Continue all efforts of FY 2012.\n\nSolid State Laser Technology Maturation and Development (SSL-TM&D):\n-Initiate the development of technologies suitable for a solid state laser weapon system, including technologies for maritime beam director, targeting and laser subsystems, which are capable of supporting future Navy missions to defeat small boat swarms, UAV swarms, and provide potential ISR disruption and\/or defeat.  This work supports future prototype developments and will include laser subsystem (potentially both slab and fiber solid state systems) and required beam director scientific studies. The focus of the effort will be to support the development and advancement of future Navy Solid State Laser prototypes, including the development of lethality studies and atmospheric characterization. These scientific studies are critical to understand and support missions identified for a layered defensive capability, in the  maritime environment, which shall include robust modeling and simulation of atmospheric absorption and turbulence.\n-Initiate and conduct lethality testing for notional designs of proposed solid state laser designs. This will include scientific studies of laser erosion, pitting, and ablation of various target materials for improved modeling and simulation, that will support development of the governing technical requirements for a beam director and targeting system capable of performing Navy surface ship self defense missions.  \n-Initiate and conduct studies of atmospheric absorption and turbulence, suitable for use to evaluate notional maritime beam director subsystems, and shall include studies in adaptive optics for improved lethality performance in low altitude, maritime surface conditions. These scientific studies are critical to understanding the impact of boundary layer and sea-water-air turbulent mechanics on future laser weapons systems and interfaces.\n-Initiate and conduct trade studies on innovative solid state laser subsystems designs, based off industry available technologies or those technologies which are supported through planned investments by the High Energy laser Joint Technology Office (HEL  JTO). These investments will be considered \"break through\" type of investments, which require additional scientific study to determine their potential for  near term capability improvements in a future naval prototype system.\n-Initiate and conduct scientific studies on laser subcomponents, including laser pump diodes and laser gain media, which have the potential to support future acquisition programs, but are based in a solid state laser technologies. Efforts in this area will focus on emerging commercial technologies and government sponsored research, which are suitable for use in a maritime domain. Research and technology developments will include advancements suitable for use by either solid state slab or solid state fiber optic laser subsystems - and which if matured, would enable rapid scientific advancements and improve specific systems performance in identified key performance parameters.\n-Initiate and conduct scientific trade studies of notional predictive avoidance systems, which examine the control interfaces between sensors and future prototypical naval laser weapons, which would provide an inherent \"safe-arm\" function for the projecting of laser power at long range (potentially beyond typical visible, line of sight distances.) Of particular concern is the designs for safety in future laser weapons to halt laser energy propagation, while performing Navy surface ship self defense missions, and avoid inadvertent illumination of non-threat forces (e.g. friendly sensors or platforms.)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HIGH SPEED PROPULSION AND ADVANCED WEAPON TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The high speed weapons work in this activity is focused on demonstrating propulsion and vehicle technologies for Mach3+ to Mach8 capable weapons.  The solid rocket motor Integrated High Performance Rocket Propulsion Technology (IHPRPT) technology development activities will provide improved rocket based weapon performance.  The rocket technologies apply to both air dominance and strike weapons and will provide both improved range and speed.\n\nThis work includes technologies associated with high acceleration capable projectile structures, high temperature and high strength materials to enable projectiles to survive high speed launch environment, improved thermal prediction methodologies and test techniques, wide dynamic pressure adaptable projectile controls and non-explosively launched lethal mechanisms.  The high speed projectile technologies are intended to support long range Naval Fire Support weapons. Decrease from FY12 to FY13 is due to realignment of investment to Electromagnetic Guns.\n\nFY 2012 to FY 2013 increase is primarily due to increased efforts to develop a projectile capable of surviving high G\/High Temperature environments are explored."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.320"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Speed Projectile & Advanced Weapon Technologies (Formerly Asymmetric Threat & Laser Control Technologies):\n-Continued high speed projectile technology development.\n-Continued effort to develop advanced guidance and control technologies for high speed weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiate investigations into advanced material solutions to high speed airframes and air systems operating in maritime environments. Areas of research will include advanced lightweight structures, high thermal conductivity materials, corrosion resistant components and systems, and high temperature resistant materials and structures.\n-Initiate high speed propulsion and integrated airframe technology development to enhance system range, responsiveness and reliability.\n-Continue advanced guidance and control technology development.\n-Continued high speed projectile technology development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.134"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.134"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue investigations into advanced high temperature material and thermal management technologies for high speed missiles and projectiles.\n-Continue high speed propulsion and integrated airframe technologies for high speed projectiles and high speed missiles.\n-Initiate high temperature capable thermal management, insulator and ablative technology investigations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION, ELECTRO OPTIC\/INFRARED (EO\/IR), AND SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity describes Navy Science and Technology (S&T) investments in the areas of EO\/IR devices and advanced sensors and includes investment\/performance in the technology areas of Electronics, Electronic Warfare, and Communications.\n\nFY 2012 to FY 2013 increase is due to acceleration of Netted Emulation of Multi-Element Signatures against Integrated Sensors (NEMESIS) effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.358"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electro Optic\/Infrared:\n-Completed development of tunable narrowband infrared absorption technology.\n\nElectronic Warfare:\n-Continued development of ultra low noise uncooled nanotechnology infrared sensors.\n-Continued development nanoatomic sensor nonvolatile memories.\n-Continued development of electronic field of view and zoom imagers.\n-Continued the development of an active optics system that can survey a wide area and instantly, non-mechanically zoom-in on an area of interest for target tracking\/identification.\n-Continued development of new processes\/methodologies to enable construction of composite countermeasures that fit the engagement timeline while maintaining effectiveness against existing and emerging IR guided threats.\n-Continued effort to develop mid & long wave IR focal plane arrays using graded-bandgap W-type-II.\nsuperlattices w\/much higher detectivity than that of state-of-the-art HgCdTe (MCT).\n-Completed development of an ultra-lean combustor for recuperated gas turbines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warfare:\n-Continue all efforts of FY 2011 unless completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electro Optic\/Infrared:\n-Initiated effort to develop power scaling of interband and quantum cascade lasers for mid-wave and long-wave infrared spectral bands. \n\nElectronic Warfare:\n-Initiate evaluation of long-range power beaming capabilities using high-power CW fiber lasers and advanced laser power converters to increase the flight duration and operational capabilities of EW UAVs.\n-Initiate the development of technologies for autonomous in-flight reconfiguration to increase flight endurance of EW UAS. \n-Initiate effort to develop germanium optical detectors on silicon substrates for high power density, high frequency applications. \n-Accelerate efforts for Netted Emulation of Multi-Element Signatures against Integrated Sensors (NEMESIS): The objective  is to develop a System of Systems (SoS) able to artificially create the appearance of a realistic naval force to many adversary surveillance and targeting sensors simultaneously. It will benefit the warfighter by providing battlespace confusion to adversary surveillance and targeting systems both above and below water, creating seamless cross-domain countermeasure coordination, and enabling rapid advanced technology\/capability insertion to counter emerging threats. Technology developments will include reconfigurable and modular EW payloads, Distributed Decoy and Jammer Swarms (DDJS), effective acoustic countermeasures (CM), and Multiple Input\/Multiple Output Sensor\/CM (MIMO S\/CM) for false force generation to both above and below water sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STRIKE AND LITTORAL COMBAT TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The focus of this activity is on those technologies that will support Naval Precision Strike Operations and provide the Navy of the future the ability to quickly locate, target, and strike critical targets ashore.\n\nFY 2011 to FY 2012 increase is due to the initiation of Strike Accelerator Program and FNC new starts.\n \nFY 2012 to FY 2013 decrease is due to the funding associated with Future Naval Capability (FNC) efforts being transferred to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.735"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increased Capability Against Moving and Stationary Targets:\n-Continued the Direct Attack Seeker Head (DASH) project by developing and testing of the radar sensor and procurement of the IIR sensor.\n-Continued the Multi-Mode Sensor\/Seeker (MMSS) project.\n\nEnhanced Weapon Technologies:\n-Continued three new products to expand current Counter Air \/ Counter Air Defense capabilities by providing improved range and end-game maneuverability while decreasing Time-of-Flight. Specific tasks to begin design and development phase are: Counter Air Advanced Medium-Range Air-to-Air Missile (AMRAAM) Improvements \/ Counter Air Defense \/ Improvement \/ High Speed Components.\n-Continued development and apply emerging technologies that support delivery of Technology Oversight Group approved FNC enabling capabilities structured to close operational capability gaps in power projection; package emerging power projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period; and mature power projection technologies that support naval requirements identified within the Sea Strike and FORCEnet naval capability pillars.\n\nStrike Accelerator:\n-Initiated Strike Accelerator program. This effort will provide an advanced airborne capability to accurately identify targets using Advanced Target Recognition (ATR). These capabilities are utilizing the F\/A-18 E\/F, AESA (Active Electronically Scanned Array) Radar and ATFLIR (Advanced Targeting Forward Looking Infrared) sensors.\n\nMulti-Target Laser Designator:\n-Initiated research for advanced optical techniques to enable multiple simultaneous target designation in order to defeat multiple simultaneous targets or SWARM attacks.\n\nSelectable Output Weapon:\n-Initiated Selectable Output Weapon Sea Strike Project. This project will develop and integrate new technologies to enable real time selection of a munitions energetic output."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increased Capability Against Moving and Stationary Targets:\n-Complete the (DASH) and (MMSS) projects.\n\nEnhanced Weapon Technologies:\n-Continue Counter Air Advanced Medium-Range Air-to-Air Missile (AMRAAM) Improvements, Counter Air Defense Improvement, and High Speed Components efforts.\n- Continue development and apply emerging technologies that support delivery of Technology Oversight Group approved FNC enabling capabilities structured to close operational capability gaps in power projection; package emerging power projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period; and mature power projection technologies that support naval requirements identified within the Sea Strike and FORCEnet naval capability pillars.\n\nStrike Accelerator:\n- Continue Strike Accelerator Project.\n\nMulti-Target Laser Designator:\n- Continue research for advanced optical techniques to defeat SWARM attacks.\n\nSelectable Output Weapon:\n- Continue Selectable Output Weapon Sea Strike Project\n\nHigh Energy Fiber Laser System:\n- Initiate development an advanced laser beam control, pointing mechanism and power subsystem to support an airborne laser weapon system. This system will provide the detection and defeat of current and future threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiate the development and demonstration of new Electronic Protection (EP) techniques that can discriminate advanced jamming false targets from true targets and also suppress false targets so that true targes can be readily detected."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WMD DETECTION"
                                    },
                                    "Description": {
                                        "val": "The Chief of Naval Operations (CNO) in the Navy Strategic Plan (NSP) has directed that the Navy be able to combat Weapons of Mass Destruction (WMD) at sea and Maritime domain.  This activity addresses the development of key technologies for standoff detection of WMD's and component nuclear materials on ships at sea.  The program will develop and demonstrate technology for actively detecting fissile material and other weapons of mass destruction.\n\nFY 2011 to FY 2013 funding decrease is due to the completion of the test exercises and re-aligment of funds for higher priority requirements.  The Maritime WMD Detection program in FY 2011 is moving from limited scale laboratory and field experimentation, into more complex, large scale demonstrations of Special Nuclear Material detection technologies. These tests must be conducted in a representative \"Navy unique\" maritime environment which include both over-water and in-water applications, and which require the expansion of required safety, environmental protocols  simulation and  evaluation of passive and active detection approaches.  Additionally, severe shortages of helium-3 material required for neutron detection has forced an urgent technology development investment in alternative detection technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Weapons Mass Destruction Detection\n-Continued investigations into the use of Free Electron Laser (FEL) accelerator technologies for the detection of WMD's and nuclear components & materials. Conducted experiments to determine the ability of the FEL to perform remote detection of nuclear material on surfaces, and chemical biological agents in aerosol clouds.\n-Continued modeling and simulation efforts to determine the ability to use neutron activation analysis to locate smuggled nuclear weapons and material through underwater detection.\n-Continued using particle beam (neutrons, gamma rays, muons, and others) to perform standoff detection of fissile material.\n-Continued development of hand held and portable detector technology for maritime interdiction.\n-Coontined standoff detection of fissile materials with a demonstration in a maritime environment from a suitable Naval vessel or surrogate. Demonstration will involve a team from DoD, Department of Energy (DOE), interagency, and academia partners to support the full demonstration.\n-Initiated the technical development and testing of solid state high energy neutron detector without Helium 3.\n-Initiated the development of technologies for remote real time imaging of suspected WMD in a maritime environment for both Passive Detection and Active Interrogation, including laboratory and field testing.\n-Initiated a laboratory demonstration of short range active interrogation for WMD detection.\n-Initiated the development of technology for \"at sea\" testing of in-water radiological WMD  \n\nDetection from unmanned underwater vehicles (UUVs).\n-Initiated the development of a compact Neutron Generator without need for cryogenic cooling.\n-Initiated the development of technology for and conduct radiological WMD Detection from Naval aviation platforms.\n-Examined system human dose limits and health effects of various Remote Stand Off Detection techniques.\n-Acquire WMD Special Nuclear Materials (SNM) simulator from DOE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Weapons Mass Destruction Detection\n-Continue all FY 2011 plans unless completed above.\n\nDetection from unmanned underwater vehicles (UUVs).\n-Continue all FY 2011 plans unless completed above.\n-Conduct high fidelity field testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.988"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.988"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all FY 2012 plans unless stated as completed.\n-Test 3 Helium free silicon based replacement radiological detectors\n-Conduct field experiments for Passive Interrogation of SNM stimulants using UUV's\n-Complete radiological testing and active interrogation"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTROMAGNETIC GUNS"
                                    },
                                    "Description": {
                                        "val": "This activity is the Electro Magnetic (EM) railgun program that is focused on developing the technology to launch a long range projectile from Navy ships. EM railgun is being considered for multi-mission applications including USMC Naval Surface Fire Support, anti-surface warfare (ASUW) and ship self defense from ballistic and cruise missiles and small boat threats.\n\nFY 2011 to FY 2012 increase is due to an increased in investment to support Phase II of the EM gun demonstration program.\n\nFY 2012 to FY 2013 increase is  a planned realignment from the 0603114N PE as the EM gun program Phase II efforts initiate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.261"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued launcher and projectile development.\n-Continued material, physics and thermal property research for single shot launchers, pulsed power and projectiles for 32MJ muzzle energy launch; and initiate assessments from next generation, rep rate, and operational environments.\n-Continued lethality studies of projectile development.\n-Continued design of next generation pulse power systems.\n-Continued Integrated Product Team (IPT) and Bore Life Consortium collaborations for 32 MJ launchers.\n-Continued analysis to verify the models and simulations correlate to results achieved in testing for launchers, pulsed power and projectiles at 32MJ launch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.946"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue launcher and projectile development.\n-Continue material, physics and thermal property research for single shot launchers, pulsed power and projectiles for 32MJ muzzle energy launch; and initiate assessments from next generation, rep rate, and operational environments.\n-Complete lethality studies of projectile. \n-Complete design studies of next generation pulse power systems.\n-Continue IPT and Bore Life Consortium collaborations for 32 MJ launchers.\n-Complete analysis to verify the models and simulations correlate to results achieved in single shot testing for launchers, pulsed power and projectiles at 32MJ launch.\n-Complete analysis of modeling and simulation capability to support bore life development and testing for single shot bore life assessments.\n-Initiate material applications and component design assessments for next generation repetitive fires"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue launcher and projectile development.\n-Continue material, physics and thermal property research for single shot launchers, pulsed power and projectiles for 32MJ muzzle energy launch; and initiate assessments from next generation, rep rate, and operational environments.\n-Continue IPT and Bore Life Consortium collaborations for 32 MJ launchers.\n-Continue material applications and component design assessments for next generation repetitive fires\n-Initiate development of modeling and simulation capability to support bore life development and testing for rep rate bore life development assessments"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "This PE develops early components technologies that if successful can be integrated into weapon systems that meet warfighter requirements.  Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).  The metrics used to evaluate 6.2 programs are necessarily less precise than those used in 6.3 programs. \n\nThe metrics for this PE can be divided into two categories:  technological and organizational\/functional.  Technological metrics address the success of the work performed.  The primary technological metrics used in this PE involve laboratory experiments\/tests demonstrating proof of the concept for the technology.  This demonstration is frequently a hand-assembled functioning breadboard of the concept.  The organizational\/functional metrics applied to this PE include:  transition of the technology to advanced development in a 6.3 PE and applicability of the technology to documented warfighter problems or requirements.  Successful implementation of these categories would result in the application of a pass\/fail metric and further evaluation for possible transition to a 6.3 development\/demonstration program."
                        }
                    }
                }
            ]
        }
    }
}