{
    "id": "36f0b36185964e51b8a52c369af36e47b7b42742",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605716A"
        },
        "ProgramElementTitle": {
            "val": "Army Evaluation Center"
        },
        "R1LineItemNumber": {
            "val": "151"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.694"
            },
            "CurrentYear": {
                "val": "63.202"
            },
            "BudgetYearOne": {
                "val": "62.765"
            },
            "BudgetYearOneBase": {
                "val": "62.765"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "62.444"
            },
            "BudgetYearThree": {
                "val": "60.386"
            },
            "BudgetYearFour": {
                "val": "59.063"
            },
            "BudgetYearFive": {
                "val": "59.470"
            }
        },
        "ProgramElementNote": {
            "val": "This project funds the salaries of civilian employees conducting Test and Evaluation (T&E) early involvement, evaluation and test design missions and associated personnel support\/sustainment costs including: temporary duty, professional training, supplies, equipment.  This project does not finance test facility operations, test instrumentation or test equipment."
        },
        "ProgramElementMissionDescription": {
            "val": "The Army Evaluation Center (AEC) provides independent and integrated technical and operational evaluations, and life-cycle Continuous Evaluation (CE) of assigned Major Defense Acquisition Programs (MDAP), Major Automated Information Systems, and In-Process Review (IPR) programs for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive, other Service Acquisition Executives, Joint Program Executive Officers, other governmental agencies, and force development.  AEC is The Army's independent evaluator.  AEC develops the evaluation strategy, designs tests, and evaluates the test results to address a system's combat effectiveness, suitability, and survivability factors pertinent to the decision process, such as:  Critical Operational Issues and Criteria (COIC), system performance, soldier survivability, performance in countermeasures, system survivability, reliability, supportability, etc.  AEC has the lead in planning and execution of Army Live Fire Tests and Continuous Evaluations through its evaluation and test design responsibilities.  The evaluations produced by AEC are required by the Army Chief of Staff, the Army Acquisition Executive, other Army, Service, Joint, and agency senior leaders and the Department of Defense Director of Operational Test and Evaluation for acquisition decisions.  In addition, Army leadership has recognized the numerous benefits of an early involvement initiative.  \n\nThis project funds the salaries of civilian employees conducting T&E early involvement, evaluation and test design missions and associated personnel support\/sustainment costs including: temporary duty, professional training, supplies, and equipment.  This project does not finance test facility operations, test instrumentation or test equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "61.450"
                },
                "CurrentYear": {
                    "val": "63.302"
                },
                "BudgetYearOne": {
                    "val": "65.696"
                },
                "BudgetYearOneBase": {
                    "val": "65.696"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.694"
                },
                "CurrentYear": {
                    "val": "63.202"
                },
                "BudgetYearOne": {
                    "val": "62.765"
                },
                "BudgetYearOneBase": {
                    "val": "62.765"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.756"
                },
                "CurrentYear": {
                    "val": "-0.100"
                },
                "BudgetYearOne": {
                    "val": "-2.931"
                },
                "BudgetYearOneBase": {
                    "val": "-2.931"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.570"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.931"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.931"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.186"
                                },
                                "CurrentYear": {
                                    "val": "-0.100"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "302"
                    },
                    "ProjectTitle": {
                        "val": "Army Evaluation Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.694"
                        },
                        "CurrentYear": {
                            "val": "63.202"
                        },
                        "BudgetYearOne": {
                            "val": "62.765"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.765"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "62.444"
                        },
                        "BudgetYearThree": {
                            "val": "60.386"
                        },
                        "BudgetYearFour": {
                            "val": "59.063"
                        },
                        "BudgetYearFive": {
                            "val": "59.470"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project funds the salaries of civilian employees conducting Test and Evaluation (T&E) early involvement, evaluation and test design missions and associated personnel support\/sustainment costs including: temporary duty, professional training, supplies, and equipment.  This project does not finance test facility operations, test instrumentation or test equipment."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Army Evaluation Center (AEC) provides independent and integrated technical and operational evaluations, and life-cycle Continuous Evaluation (CE) of assigned Major Defense Acquisition Programs (MDAP), Major Automated Information Systems, and In-Process Review (IPR) programs for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive, other Service Acquisition Executives, Joint Program Executive Officers, other governmental agencies, and force development.  AEC is The Army's independent evaluator.  AEC develops the evaluation strategy, designs tests, and evaluates the test results to address a system's combat effectiveness, suitability, and survivability factors pertinent to the decision process, such as:  Critical Operational Issues and Criteria (COIC), system performance, soldier survivability, performance in countermeasures, system survivability, reliability, supportability, etc.  AEC has the lead in planning and execution of Army Live Fire Tests and Continuous Evaluations through its evaluation and test design responsibilities.  The evaluations produced by AEC are required by the Army Chief of Staff, the Army Acquisition Executive, other Army, Service, Joint, and agency senior leaders and the Department of Defense Director of Operational Test and Evaluation for acquisition decisions.  In addition, Army leadership has recognized the numerous benefits of an early involvement initiative.  \n\nThis project funds the salaries of civilian employees conducting T&E early involvement, evaluation and test design missions and associated personnel support\/sustainment costs including: temporary duty, professional training, supplies, and equipment.  This project does not finance test facility operations, test instrumentation or test equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Evaluation Center"
                                    },
                                    "Description": {
                                        "val": "Provide integrated technical and operational evaluations and continuous evaluation of assigned MDAPs and major automated information systems for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive and force development.  Develop the evaluation strategy, design technical and operational tests, and evaluate the test results to address the combat effectiveness, suitability, and survivability factors pertinent to the decision process, for programs such as Mine resistant Ambush Protected Vehicle (MRAP), Global Command and Control System - Army (GCCS-A), Warfighter Information Network- Tactical (WIN-T), Stryker, High Mobility Artillery Rocket System (HIMARS), Land Warrior (LW), General Fund Enterprise Business System (GFEBS), Joint Tactical Radio System (JTRS), Patriot and Patriot Advanced Capability (PAC 3), Integrated Air and Missile Defense (IAMD), Family of Medium Tactical Vehicles (FMTV), Excalibur, Longbow Apache, and Distributed Common Ground System - Army (DCSG-A) (plus hundreds of other sytems\/programs across The Army).  Prepare integrated System Evaluation Plans and conduct integrated technical and operational evaluations for all Army weapon systems.  In support of Overseas Contingency Operations (OCO), AEC has continued its workload focus towards the evaluation of Rapid Initiative (RI) systems, Counter Improvised Explosive Device (IED) systems, and Urgent Material Releases. Includes civilian pay costs for 371 authorizations for FY 11 and 411 civilian authorizations FY12 and beyond."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "57.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided integrated technical and operational evaluations and continuous evaluation of assigned MDAPs and major automated information systems for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive and force development.  Continued to prepare integrated System Evaluation Plans and conduct integrated technical and operational evaluations for all Army weapon systems.  In support of Overseas Contingency Operations (OCO), Continued workload focus towards the evaluation of Rapid Initiative (RI) systems, Counter Improvised Explosive Device (IED) systems, and Urgent Material Releases. to include civilian pay costs for 371 authorizations for FY 11 (equates to 92% of AEC's total budget)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "59.409"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide integrated technical and operational evaluations and continuous evaluation of assigned MDAPs and major automated information systems for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive and force development.  Continue to prepare integrated System Evaluation Plans and conduct integrated technical and operational evaluations for all Army weapon systems.  In support of Overseas Contingency Operations (OCO), Continue workload focus towards the evaluation of Rapid Initiative (RI) systems, Counter Improvised Explosive Device (IED) systems, and Urgent Material Releases. to include civilian pay costs for 411 authorizations for FY 12 (equates to approximately 93% of AEC's total budget).  Additionally, provide Underbody Blast Modeling and Simulation support to provide early identification of vehicle improvements that directly impact Soldier survivability; improves test design; provides additional evaluation data to support acquisition.  Endstate is to have a valid, accredited model to evalute crew survivability. Also, provide Center for Reliability and Growth in response to DUSD (ATL) and AAE policies mandating Reliability Growth programs and periodic assessments for major systems.  These DOD and DA policies became Public Law 111-23 (The Weapon System Reform Act of 2009 - signed 22 May 2009).  The Law emphasizes that the service acquisition executive must ensure acquisition personnel have appropriate training and expertise to formulate robust RAM growth programs.   The policies and Law are a result of a Defense Science Board report on Developmental Test and Evaluation (May 2008), showing that there has been a significant increase in the number of Department of Defense weapon system programs evaluated as not being operationally suitable.  The report shows that about two thirds of Army systems from 1997 to 2006 failed to meet their realiability requirements during operational testing - primarily due to lack of material readiness due to poor system reliability and maintenance (RAM).  Funding provides resources dedicated to developing critical tools, methodologies, policies, formal guidance, and educational materials required to implement new policies and improve weapon system reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "58.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "58.999"
                                            },
                                            "Text": {
                                                "val": "Will provide integrated technical and operational evaluations and continuous evaluation of assigned MDAPs and major automated information systems for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive and force development.  Will continue to prepare integrated System Evaluation Plans and conduct integrated technical and operational evaluations for all Army weapon systems.  To include civilian pay costs for 386 authorizations for FY 13 (equates to approximately 94% of AEC's total budget).  Additionally, will provide Underbody Blast Modeling and Simulation support to provide early identification of vehicle improvements that directly impact Soldier survivability; improves test design; provides additional evaluation data to support acquisition.  Endstate is to have a valid, accredited model to evalute crew survivability. Also, will provide Center for Reliability and Growth in response to DUSD (ATL) and AAE policies mandating Reliability Growth programs and periodic assessments for major systems.  These DOD and DA policies became Public Law 111-23 (The Weapon System Reform Act of 2009 - signed 22 May 2009).  The Law emphasizes that the service acquisition executive must ensure acquisition personnel have appropriate training and expertise to formulate robust RAM growth programs.   The policies and Law are a result of a Defense Science Board report on Developmental Test and Evaluation (May 2008), showing that there has been a significant increase in the number of Department of Defense weapon system programs evaluated as not being operationally suitable.  The report shows that about two thirds of Army systems from 1997 to 2006 failed to meet their realiability requirements during operational testing - primarily due to lack of material readiness due to poor system reliability and maintenance (RAM).  Funding will provide resources dedicated to developing critical tools, methodologies, policies, formal guidance, and educational materials required to implement new policies and improve weapon system reliability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Early Involvement"
                                    },
                                    "Description": {
                                        "val": "Supports the Commanding General's early involvement initiative which positions acquisition certified liaison officers at 2 Joint and 9 Army Program Executive Offices (PEO), TRADOC\/ARCIC, REF, JIEDDO, and RDECOM.  Assigned personnel provide continuous support to materiel and combat developers from the inception of their programs.  The early involvement of LNOs supports the sections of the ATEC Mission Essential Task List (METL) that apply to ongoing contingency operations.  ATEC performance continues to meet 120 day rapid equipping requirement set by the CSA. Liaison officers continue to enable ATEC to sustain rapid, flexible T&E support in the evaluation of Rapid Initiative Systems, Counter IED systems, and Urgent Material Releases.  Effort results in cost savings, cost avoidance and critical design efficiencies being identified early in a system's development, thereby avoiding more expensive product improvement programs later in a system's life cycle.  T&E efficiency gains continue to be realized through early identification of instrumentation, modeling and simulation tools, and other resources needed for testing, as well as making more efficient use of data from developmental testing and experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued support of the Commanding General's early involvement initiative which positions acquisition certified liaison officers at 2 Joint and 9 Army Program Executive Offices (PEO), TRADOC\/ARCIC, REF, JIEDDO, and RDECOM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue support of the Commanding General's early involvement initiative which positions acquisition certified liaison officers at 2 Joint and 9 Army Program Executive Offices (PEO), TRADOC\/ARCIC, REF, JIEDDO, and RDECOM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.766"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.766"
                                            },
                                            "Text": {
                                                "val": "Will continue support of the Commanding General's early involvement initiative which positions acquisition certified liaison officers at 2 Joint and 9 Army Program Executive Offices (PEO), TRADOC\/ARCIC, REF, JIEDDO, and RDECOM."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}