{
    "id": "37060ef4e3fff57bfc1801e91834af7a9340f984",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603781D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI)"
        },
        "R1LineItemNumber": {
            "val": "59"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.291"
            },
            "CurrentYear": {
                "val": "29.347"
            },
            "BudgetYearOne": {
                "val": "30.036"
            },
            "BudgetYearOneBase": {
                "val": "30.036"
            },
            "BudgetYearTwo": {
                "val": "30.616"
            },
            "BudgetYearThree": {
                "val": "31.365"
            },
            "BudgetYearFour": {
                "val": "32.244"
            },
            "BudgetYearFive": {
                "val": "32.830"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Software is key to meeting the Department of Defense’s (DoD’s) increasing demand for high-quality, affordable, and timely national defense systems.  Systemic software issues are significant contributors to poor program execution, and reliance on software-intensive mobile and net-based products and systems has been increasing (e.g., Joint Tactical Radio System, DDG-1000, Joint Strike Fighter, F-22, and Army Modernization).  As stated in the 2010 National Research Council of the National Academy of Sciences report entitled Critical Code, “It is dangerous to conclude that we are reaching a plateau in capability and technology for software producibility.”  The report notes that software is “…unconstrained by traditional physical engineering limitations…” and what we can accomplish is derived “…from [the] human intellectual capacity to conceptualize and understand systems…”  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  The Software Engineering Institute (SEI) Program Element (PE) addresses the critical need to research, develop, and rapidly transition state-of-the-art technology and best practices to improve the engineering, management, fielding, evolution, and acquisition of software-intensive DoD systems.  The SEI PE’s program of work seeks to coordinate across the Department and the Services and leverages expertise in industry and academia to enable the development of Joint capabilities.\n\nSoftware is more pervasive than ever, and computer programs are growing in size and complexity.  Designing, managing, and securing integrated, complex, and large-scale mission-critical systems are abilities that the DoD and Defense Industrial Base (DIB) have not yet been mastered.  P781 of this PE funds the SEI Federally Funded Research and Development Center (FFRDC).  The SEI FFRDC is an institute which enables the exploitation of emerging software technology by bringing engineering, management, and security discipline to software acquisition, development, and evolution, focusing on software technology areas judged to be of the highest payoff in meeting defense needs.\n\nPrivate sector investment has created rapid advances in information technologies, but the pace of transition to DoD applications is often very slow or the commercial applications do not meet DoD-unique needs (e.g., high assurance software or large scale integrated systems). The DoD needs to create opportunities to discover emerging technologies, to evaluate their potential to fit DoD needs, and, where appropriate, conduct critical tests of the technologies under DoD conditions.  P783 of this PE includes the Software Producibility Initiative and Technology from Non-Traditional Sources (TNTS) Initiative.  The Software Producibility Initiative seeks to research and transition software science and tools to model and evaluate the performance and control complexities of software-intensive systems.  It also seeks to improve the design and sustainment of those systems.  The TNTS Initiative seeks to facilitate early interactions between innovative companies and DoD users to accelerate the application of emerging technical solutions addressing DoD needs, reduce development costs, avoid technological surprise, and understand how commercial developments impact DoD programs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.910"
                },
                "CurrentYear": {
                    "val": "30.424"
                },
                "BudgetYearOne": {
                    "val": "30.881"
                },
                "BudgetYearOneBase": {
                    "val": "30.881"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.291"
                },
                "CurrentYear": {
                    "val": "29.347"
                },
                "BudgetYearOne": {
                    "val": "30.036"
                },
                "BudgetYearOneBase": {
                    "val": "30.036"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.619"
                },
                "CurrentYear": {
                    "val": "-1.077"
                },
                "BudgetYearOne": {
                    "val": "-0.845"
                },
                "BudgetYearOneBase": {
                    "val": "-0.845"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.520"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.820"
                    },
                    "CurrentYear": {
                        "val": "-0.874"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.157"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.113"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                },
                                "CurrentYear": {
                                    "val": "-0.203"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.845"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.845"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P781"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.726"
                        },
                        "CurrentYear": {
                            "val": "22.304"
                        },
                        "BudgetYearOne": {
                            "val": "22.735"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.735"
                        },
                        "BudgetYearTwo": {
                            "val": "23.268"
                        },
                        "BudgetYearThree": {
                            "val": "23.837"
                        },
                        "BudgetYearFour": {
                            "val": "24.505"
                        },
                        "BudgetYearFive": {
                            "val": "24.951"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The SEI FFRDC was established in 1984 as an integral part of the DoD’s initiative to identify, evaluate, and transition high-leverage software engineering technologies and practices.  The SEI grows unique software research and program support capability in a space where the Defense Industrial Base (DIB) and academia cannot as readily address challenges.  The mission of the SEI is to provide technical leadership and innovation through research and development to advance the practice of software engineering and technology in support of DoD needs.  The Center works across government, industry, and academia to improve the state of software engineering from technical, acquisition, and management perspectives; engages in applied research and development of critical software technologies and tools, and collaborates with the larger software engineering research community; facilitates rapid, value-added transition of software engineering technologies into practice; and evaluates and calibrates emerging software engineering technologies to determine their potential for improving the development and evolution of software-intensive DoD systems.  Since its inception, the SEI has helped to transform the fields of software engineering and acquisition, network security, real-time systems and software\/system architecture and construction, and software engineering process management."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOFTWARE ENGINEERING INSTITUTE (SEI) RESEARCH"
                                    },
                                    "Description": {
                                        "val": "Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 SEI research projects are awarded on a competitive basis across the SEI.  Research projects cross-cut the FFRDC's experience base in order to advance existing SEI research initiatives and explore new technical ideas.  SEI research focuses on the most significant and pervasive software challenges within the DoD such as computing for real-time and embedded-systems, multi-core programming, computing at the tactical edge, System of System architectures, cyber-security, and improving the efficiency of acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.304"
                                            },
                                            "Text": {
                                                "val": "•\tAccelerate delivery and reduce time, risk, and cost of software by increased adoption of software-focused life-cycle methods. \n•\tEnable joint acquisition program decision-making and performance by modeling acquisition system dynamics. \n•\tExplore ways to harmonize architecturally-significant business and mission goals, software quality properties, software architecture, and acquisition strategy elements prior to Milestone A, where the performance, schedule, and cost trade space are the largest. \n•\tProtect DoD enterprise systems against insider threat through socio-technical engineering.  \n•\tReduce vulnerabilities in production software systems to manageable levels through new analysis techniques by codifying secure coding patterns and automated conformance checking.  \n•\tReduce the cost of improving software assurance and reliability to DoD suppliers and acquirers by using black-box fuzz testing techniques to detect and rectify vulnerabilities.  \n•\tInvestigate exploratory new technology ideas in the following areas: enabling and measuring the early detection of insider threats, semantic analysis and malware code de-obfuscation.  \n•\tDemonstrate new algorithms that provide for efficient delivery of reliable mission-critical capabilities in cyber-physical systems.  \n•\tDevelop new methods to provide assurance while quickly creating and deploying new system of systems (SoSs) from combinations of existing independent systems.  \n•\tDevelop architectural strategies and infrastructure practices for handheld and mobile platforms used by Warfighters at the tactical edge. Develop and use “resource-competition-inspired” approaches to elicit changing mission needs to enable efficient, mission-aware use of tactical resources.  \n•\tDevelop technology that supports earlier detection of architecture induced faults with the objective of measurably fewer failing tests and more effective use of finite testing resources.\n•\tDevelop a tool for deciding which parts of computer code are in greatest need of improvement, and for quantifying the benefit (future cost savings) of an investment in refactoring\/remodularization.  \n•\tTest the benefits of probabilistically modeling program change drivers and investigate the contribution of subjective inputs provided experts who undergo domain-specific calibration training.  \n•\tSeek fresh ideas and perspectives through external research collaborations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.735"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.735"
                                            },
                                            "Text": {
                                                "val": "•\tContinue research into areas that will accelerate delivery and reduce time, risk, and cost of software by increased adoption of software-focused life-cycle methods. \n•\tContinue to investigate and apply methods to improve acquisition efficiency for software-intensive systems.  \n•\tInitiate research into innovative approaches for data-intensive scalable computing and analytics. \n•\tContinue to build upon research in the Computer Network Defense, Computer Network Attack and Exploitation (CND\/CN\/E) mission space and transition technology solutions to DoD.  \n•\tDevelop new methods and mechanisms to enable trustworthy transactions in compromised systems.  \n•\tChallenge the traditional notion that humans play prescribed roles in technical systems.  Rather, consider that computation plays prescribed roles in social systems, hence, defining the system to support unpredictable human needs.  The goal is to field socio-technical systems that are fundamentally self-adaptive.\n•\tDevelop a more comprehensive program in cyber-physical systems.\n•\tDetermine the applicability and limitations of agile techniques in SoS engineering for DoD settings.\n•\tInvestigate the development of architecture constructs and patterns for mobile technologies to support mobile System of System end users.\n•\tContinue competitive awards for P781 funding.\n•\tContinue to seek innovative ideas and perspectives through external research collaborations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ACQUISITION PRACTICES FOR DOD SOFTWARE INTENSIVE SYSTEMS - ACQUISITION SUPPORT PROGRAM (ASP)"
                                    },
                                    "Description": {
                                        "val": "ASP develops, delivers, and codifies solutions from state-of-the-art research to affect acquisition challenges in a preventative, pro-active, and systematic manner to provide enduring performance impact to programs across the DoD and Intelligence Community (IC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.735"
                                            },
                                            "Text": {
                                                "val": "•\tExtended the SEI Acquisition Excellence Knowledge Base to include performance metrics and explore opportunities to collaborate with system integrator practitioners and other DoD knowledge centers.\n•\tResearched and identify common reasons for software system acquisition failure and disseminate findings to DoD acquisition programs.\n•\tDeveloped new courseware, publications, and collaboration venues to disseminate knowledge and best practices to DoD acquisition programs.\n•\tCreated derivative works of systems thinking analysis and Acquisition Archetypes to address potential solutions, augment training, and advance the state of practice in software engineering, systems engineering, and software and systems DoD acquisition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOFTWARE ENGINEERING TECHNICAL PRACTICES - NETWORKED SYSTEMS SURVIVABILITY PROGRAM (NSS)"
                                    },
                                    "Description": {
                                        "val": "NSS identifies, develops, matures, and broadly transitions new technologies, system development practices, and system management practices that enable informed trust and confidence in using information and communication technology. This Program houses the Computer Emergency Response Team (CERT), a critical asset which provides DoD and other government and private sector organizations with the information and training necessary to improve the ability to protect information infrastructures from current and emerging threats.  NSS's Survivable Systems Engineering Initiative develops and adapts practices, tools, techniques, and measures for addressing security and survivability issues in all phases of the development and acquisition lifecycles for software and software-reliant systems. The Assuring Network-Dependent Missions Initiative concentrates on the bodies of practice, tools, and security technologies that address the dynamics of operational systems, seeking to ensure that fielded systems meet their survivability requirements as vulnerabilities and threats evolve."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.831"
                                            },
                                            "Text": {
                                                "val": "•\tExplored emerging software and hardware-based approaches for establishing trusted transactions to significantly improve networked systems security and enterprise resiliency. \n•\tProvided a proof-of-concept demonstration of trusted application operations in a known compromised environment.  \n•\tDeveloped secure coding standards for mission-critical software-reliant acquisition and development for the C++ and Java programming languages and transitioned to international standards bodies.  \n•\tDeveloped and piloted a prototype Secure Mission Assurance Diagnostic Method and software security measures identification method.  \n•\tDeveloped and piloted a framework and new metrics for measuring resiliency in mission-critical software-reliant networked systems.  \n•\tDeveloped system dynamics models of insider threat based on findings from the analysis of actual cases and began to develop a prototype for DoD and other government and private sector organizations to measure insider threat risk based on exposure.  \n•\tInvestigate scalable search-and-retrieval techniques and fuzzy hashing techniques that detect and analyze malware more effectively."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOFTWARE ENGINEERING TECHNICAL PRACTICES – RESEARCH, TECHNOLOGY, AND SYSTEM SOLUTIONS PROGRAM (RTSS)"
                                    },
                                    "Description": {
                                        "val": "RTSS performs research focusing on the structure and behavior of software-reliant acquisition systems and provides the technical foundations, methods, practices, and solutions that enable assured and flexible system capabilities at all scales.  RTSS's Architecture Centric Engineering (ACE) Initiative creates, matures, pilots, and transitions technical foundations and practices for developing and evolving mission-critical software-reliant acquisition systems at all scales to ensure conformity to their architectures.  The System of Systems Practices (SoSP) Initiative is dedicated to the effective integration and interoperation of distributed systems that must work together in net-centric operations and SoS environments.  The System of Systems Software Assurance (SoSSA) Initiative aims to reduce the amount of time and effort required to achieve technically justified confidence that SoSs will behave acceptably in their actual environments of use."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.728"
                                            },
                                            "Text": {
                                                "val": "•\tDeveloped a reliability framework, new scheduling algorithms for real-time multi-core platforms, architecture-based testing strategies, and scalable static analysis capabilities that are designed for use in mission-critical software-reliant acquisition systems.  \n•\tDeveloped an initial version of architecture practices and a related measurement framework for improving incremental and iterative agile development of large-scale systems.    \n•\tDemonstrated the synergistic use of quantitative and qualitative methods for large-scale system design, analysis, construction, and evolution.  \n•\tInvestigated bio-inspired amorphous computing models to simulate the socio-technical behavior of ultra-large-scale systems.  \n•\tDeveloped principles for determining which assurance activities and arguments contribute most to obtaining justified confidence in mission-critical software-reliant acquisition system behavior.  \n•\tDeveloped an approach to reclaim unused resources and use them to optimize utility of mission-critical tasks while preserving timing guarantees of safety-critical tasks.   \n•\tCreated an analysis model incorporating architecture quality metrics to optimize the value of delivered capabilities during incremental software development.   \n•\tDefined principles for the successful use of cloud computing, service and infrastructure versioning, context-aware applications, and other emerging SoS technologies in DoD SoS implementations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** Based on recommendations from the 2010 Comprehensive Review of the SEI, P781 research funding will be awarded on a competitive basis across the SEI in FY 2012 and beyond.  All P781 activities beginning in FY 2012, and continued thereafter, will be captured in one program title to reflect that research awards across existing SEI programs will blend personnel and efforts. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOFTWARE ENGINEERING MANAGEMENT PRACTICES – SOFTWARE ENGINEERING PROCESS MANAGEMENT PROGRAM (SEPM)"
                                    },
                                    "Description": {
                                        "val": "SEPM identifies, matures, and transitions proven process management practices and performance improvement and measurement techniques for software and related disciplines in support of the management, development, and acquisition of current and future software, systems, and services.  SEPM's Capability Maturity Model Integration (CMMI) Initiative offers a systematic, well-understood, model-based approach to capability development for software-enabled systems and services, and a means to improve the delivery of needed products and services.  The Software Engineering Measurement and Analysis (SEMA) Initiative provides practical guidance and expertise in measurement and analysis to support management, engineering, acquisition, and services.  The Research into Performance Measurement and Analytical Methods (RPMAM) Initiative conducts research to improve data quality, analysis, and extraction and to ensure that benefit and value is realized from investments in large data repositories, as well as addresses the use of probabilistic methods for improved accuracy in the development of early system cost estimates."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.432"
                                            },
                                            "Text": {
                                                "val": "•\tInvestigated the efficacy of various statistical and probabilistic algorithms for automatically identifying data anomalies in program reports to OSD. \n•\tDeveloped a new approach to early life cycle cost estimation that incorporates the use of scenario elicitation to identify likely as well as unlikely program execution paths, modeling these scenarios in a Bayesian Belief Network, and using existing cost estimation models to produce a distribution of program costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** SEPM is not expected to compete for P781 funding in FY 2012 and beyond. ***"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** SEPM is not expected to compete for P781 funding in FY 2012 and beyond. ***"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "•\tTransition of tools and practices for use in DoD programs of record and to the Defense Industrial Base (DIB), and number of agencies and organizations sponsoring work.\n•\tNumber of publications in refereed journals and peer reviewed reports.\n•\tNumber of external research collaborations and interactions with the broader software engineering research community.\n•\tAdoption of coding standards and process techniques by standards bodies, working groups, and software\/systems engineering organizations.\n•\tNumber of training courses and curricula developed to contribute to the growth of capability in the software engineering research and development community and software\/system acquisition workforce.\n•\tDevelopment of new scalable technical and software-enabled cyber security approaches that address software assurance and improve enterprise resiliency.\n•\tReduced number of mission-critical software-reliant acquisition program failures and cost and schedule overruns, as well as quantitative improvements in overall system cost, time to develop, and performance – this will be evidenced by: reductions in time to test software and the amount of rework required; improved ability to articulate software requirements; development of techniques that offer orders of magnitude improvement in software productivity; development of new software algorithms and abstractions; and decreased number of software defects found through application of effective process and software development methods."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P783"
                    },
                    "ProjectTitle": {
                        "val": "Software Producibility Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.565"
                        },
                        "CurrentYear": {
                            "val": "7.043"
                        },
                        "BudgetYearOne": {
                            "val": "7.301"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.301"
                        },
                        "BudgetYearTwo": {
                            "val": "7.348"
                        },
                        "BudgetYearThree": {
                            "val": "7.528"
                        },
                        "BudgetYearFour": {
                            "val": "7.739"
                        },
                        "BudgetYearFive": {
                            "val": "7.879"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Shortcomings in software development often lead to schedule slippage, cost growth, and mission compromise.  These shortcomings can frequently be traced to software development technologies which are not capable of addressing the scale and complexity of the software needed in today’s systems.  The Software Producibility Initiative seeks to conduct an integrated program of research from applied research through demonstration and evaluation to advance the state-of-the-art in the producibility of software for DoD systems, particularly those systems characterized by high complexity, need for robustness, information assurance, real-time performance, and physical distribution.  The Initiative maintains a portfolio of work relevant to the Warfighter and DoD needs by periodically evaluating technology development efforts, retiring those that are under performing, and starting new efforts based on a risk-reward priority list.\n\nIn addition, obtaining an early, accurate understanding of the technological advances emerging from small, innovative companies has been problematic for the DoD due to these companies often avoiding or failing to notice federal sales opportunities.  Redoing work that is being conducted in the private sector does not effectively utilize resources.  The Technology from Non-Traditional Sources (TNTS) Initiative identifies and selectively funds experimentation with innovative, emerging technologies to evaluate their potential for DoD application, with the ultimate goal of accelerating the delivery of capabilities to the Services and the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOFTWARE PRODUCIBILITY INITIATIVE"
                                    },
                                    "Description": {
                                        "val": "The Software Producibility Initiative seeks to improve the DoD’s ability to design, build, test, and sustain software-intensive systems which meet mission critical requirements, exhibit predictable behavior, and enable evolution and interoperability. Technology thrust areas include specification of complex requirements; “correct-by-construction” software development; scalable composition; high-confidence software and middleware; system architectures for network-centric environments; technologies for system visualization, testing, verification, and validation; and model-driven development approaches. Performers include Army Communications Electronics Research Development and Engineering Center (CERDEC), Army Research Laboratory (ARL), Space and Naval Warfare Center (SPAWAR), and the Air Force Research Laboratory (AFRL), as well as university and industry collaborators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.177"
                                            },
                                            "Text": {
                                                "val": "• Created a tool to aid analysts in performing quality assurance and vulnerability testing of binary code, allowing for the discovery of errors and weaknesses in very large and complex software that is unreadable by humans.\n• Together with the research community, successfully co-developed content, including 42 challenge problems, for the software engineering collaboration environment.\n• Demonstrated an open architecture to facilitate the re-use of code on different processors to make upgrades easier and allow processors from different manufacturers to be more readily used in the same application.  This open architecture has been adopted by initial DoD users.\n• Performed a use-case demonstration of a graphical drag-and-drop, scalable, software development framework to show collaborative and efficient design, development, test, evaluation, and optimization of complex systems.\n• ARL completed a new Cooperative Research Agreement with the University of California, Berkeley to develop and demonstrate techniques supporting model-based design of complex, heterogeneous, software-intensive systems. The project developed and published the theory in the form of one text book, numerous papers, keynotes, and invited talks and began the software implementation of the theory in mid 2011.\n• Developed a way to accelerate an existing technique that guarantees synchronous behavior in different parts of a system. This method has the potential to improve the safety and reliability of systems like autonomous vehicles and aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.043"
                                            },
                                            "Text": {
                                                "val": "• Continue the development of the software engineering collaboration environment. Increase the number of challenge problems and their difficulty. Continue to engage existing users and attract new users.  Identify opportunities for transition in FY2013. \n• Demonstrate to the DoD software community the binary code analysis tool developed by CERDEC that combines code reverse engineering with code visualization. \n• Assess the effectiveness of the accelerated synchronous behavior technique in representative systems and identify potential DoD users.\n• Demonstrate the effectiveness of graphical drag-and-drop, scalable, software development framework with a DoD research activity directly supporting the Warfigher. \n• Explore model-based design of scalable systems of systems that will allow the scaling-up of model-based design.\n• Improve the design and development of complex systems, including combining multiple models, programming and efficiently using multi-core computers, and software for real-time embedded systems and cyber-physical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.301"
                                            },
                                            "Text": {
                                                "val": "• Continue the development of the software engineering collaboration environment. Increase the number of challenge problems and their difficulty. Continue to engage existing users and attract new users.  Identify opportunities for transition in FY2013. \n• Demonstrate to the DoD software community the binary code analysis tool developed by CERDEC that combines code reverse engineering with code visualization. \n• Assess the effectiveness of the accelerated synchronous behavior technique in representative systems and identify potential DoD users.\n• Demonstrate the effectiveness of graphical drag-and-drop, scalable, software development framework with a DoD research activity directly supporting the Warfigher. \n• Explore model-based design of scalable systems of systems that will allow the scaling-up of model-based design.\n• Improve the design and development of complex systems, including combining multiple models, programming and efficiently using multi-core computers, and software for real-time embedded systems and cyber-physical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TECHNOLOGY FROM NON-TRADITIONAL SOURCES (TNTS) INITIATIVE"
                                    },
                                    "Description": {
                                        "val": "The TNTS Initiative utilizes workshops and direct interaction with DoD users to identify needs and relevant emerging private solutions, and provides experimentation funds for promising technologies to allow for limited, DoD-internal buy-and-try experimentation money to aid in procurement decisions.  Experimentation sponsors include the National Security Agency, Air Force Materiel Command Electronic Systems Center (AFMC ESC), CERDEC, SPAWAR, and U.S. Marine Corps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.388"
                                            },
                                            "Text": {
                                                "val": "•  Conducted thorough technical reviews of 177 companies with innovative and emerging products that could be used for technology forecasting for Office of the Assistant Secretary of Defense Research and Engineering ASD(R&E), and energy efficiencies for the Department of the Navy.  Also conducted workshops for NASA's Johnson Space Center to assist in medical, nutrition, and command and control of space flights.\n•  Provided experimentation funding to the Department of the Navy and USMC Expeditionary Energy office for the evaluation of innovative emerging technology products that deliver capabilities at optimum cost to the warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** The TNTS Initiative will be moved from P783 under the SEI PE to P832 under the Quick Reaction Special Projects PE (0603826D8Z) in FY 2012 and beyond. ***"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** The TNTS Initiative will be moved from P783 under the SEI PE to P832 under the Quick Reaction Special Projects PE (0603826D8Z) in FY 2012 and beyond. ***"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "•  Number of open source tools developed which enable the specification of interface formalisms, the definition of component interfaces, and the checking of component composition.\n•  Demonstrable reduction in the number of vulnerabilities and errors detected in software code due to an improved ability to visualize and execute large software systems as compared to the state of the practice.\n•  Number of transitions of promising systems and software engineering technologies to the DoD and DIB, and successful adoption of technologies by early adopter partners.\n•  Number of successful deployments in operational contexts of emerging technologies from small, innovative companies.\n•  Observed improvements in cost, schedule, and performance via advances in the producibility of software for complex DoD systems and the productivity of software developers. \n•  Number of multiple, active collaborations achieved between Software Producibility performers and the broader software engineering research community.\n•  Number of synergies\/coordination\/Joint activities across research efforts."
                        }
                    }
                }
            ]
        }
    }
}