{
    "id": "3a994e18d6fedf9f9011b8dffaf8a46dedbd1005",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V1_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602102F"
        },
        "ProgramElementTitle": {
            "val": "Materials"
        },
        "R1LineItemNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "136.846"
            },
            "CurrentYear": {
                "val": "144.219"
            },
            "BudgetYearOne": {
                "val": "114.166"
            },
            "BudgetYearOneBase": {
                "val": "114.166"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "121.176"
            },
            "BudgetYearThree": {
                "val": "120.257"
            },
            "BudgetYearFour": {
                "val": "119.996"
            },
            "BudgetYearFive": {
                "val": "119.047"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops advanced materials, processing, and inspection technologies to reduce life cycle costs and improve performance, sustainability, availability, affordability, supportability, reliability, and survivability of current and future Air Force systems and operations.  The program has five projects that develop: (1) the materials and processing technology base for spacecraft and launch systems; (2) structural, propulsion, and sub-systems materials and processes technologies;  (3) electronic, optical, and survivability materials and processes technologies;  (4) sustainment materials, processes technologies, and advanced non-destructive inspection methodologies; and (5) air base operations technologies including deployable base infrastructure, force protection, and fire fighting capabilities.  Efforts in the program have been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary materials technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "137.273"
                },
                "CurrentYear": {
                    "val": "136.230"
                },
                "BudgetYearOne": {
                    "val": "136.277"
                },
                "BudgetYearOneBase": {
                    "val": "136.277"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "136.846"
                },
                "CurrentYear": {
                    "val": "144.219"
                },
                "BudgetYearOne": {
                    "val": "114.166"
                },
                "BudgetYearOneBase": {
                    "val": "114.166"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.427"
                },
                "CurrentYear": {
                    "val": "7.989"
                },
                "BudgetYearOne": {
                    "val": "-22.111"
                },
                "BudgetYearOneBase": {
                    "val": "-22.111"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.011"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "8.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.738"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.822"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "1.133"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-22.111"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-22.111"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Other Adjustments include 2.400 Congressional Add and -1.267 Congressional General Reductions\n\nFY12: Congressional Add for Nanotechnology research\n\nDecrease in FY13 is due to higher Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624347"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Structures, Propulsion, and Subsystems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "85.962"
                        },
                        "CurrentYear": {
                            "val": "89.908"
                        },
                        "BudgetYearOne": {
                            "val": "58.464"
                        },
                        "BudgetYearOneBase": {
                            "val": "58.464"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "63.328"
                        },
                        "BudgetYearThree": {
                            "val": "55.443"
                        },
                        "BudgetYearFour": {
                            "val": "55.326"
                        },
                        "BudgetYearFive": {
                            "val": "55.289"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the materials and processing technology base for aircraft, spacecraft, launch systems, and missiles to improve affordability, maintainability, and performance of current and future Air Force systems.  A family of affordable lightweight materials is being developed, including metals, polymers, ceramics, metallic and nonmetallic composites, and hybrid materials to provide upgraded capabilities for existing aircraft, missile, and propulsion systems to meet the future system requirements.  Develops high-temperature turbine engine materials that will enable engine designs to double the turbine engine thrust-to-weight ratio.  Advanced high temperature protection materials are being developed that are affordable, lightweight, dimensionally stable, thermally conductive, and\/or ablation and erosion resistant to meet aerospace and missile requirements.  Alternative or replacement materials are being developed to maintain the performance of aging operational systems.  Materials for thermal management including coolants, adaptive thermally conductive materials, coatings, friction and wear-resistant materials, and other pervasive nonstructural materials technologies are being developed for directed energy, propulsion, and subsystems on aircraft, spacecraft, and missiles.  Develops nanostructured and biological materials for aircraft structures, munitions, air vehicle subsystems, and personnel.  Develops novel materials for electromagnetic interactions with matter for electromagnetic pulse (EMP), high power microwave, and lightning strike protection.  Concurrently develops advanced processing methods to enable adaptive processing of aerospace materials."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Nanotechnology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop ceramic, ceramic matrix composite, and hybrid materials technologies for performance and supportability improvement in propulsion systems and high temperature aerospace structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.242"
                                            },
                                            "Text": {
                                                "val": "Initiated development of new advanced processing methods, environmental coatings, and life prediction for higher temperature capable ceramic matrix composites.  Continued validation of the life prediction model to address time dependent degradation associated with environmental exposure.  Continued validation of the severe environment durability of advanced ceramic composite systems with advanced interfaces via mechanical testing.  Initiated development of new ceramic matrix composite systems with higher temperature capability.  Completed assessment of thermal protection system materials for hypersonic applications.  Continued development of suitable materials and materials process technologies for application in combined optical and radio frequency (RF) communication system apertures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.630"
                                            },
                                            "Text": {
                                                "val": "Advance development of new processing methods, environmental coatings, and life prediction for higher temperature capable ceramic matrix composites.  Continue validation of the life prediction model to address time dependent degradation associated with environmental exposure.  Continue validation of the severe environment durability of advanced ceramic composite systems with advanced interfaces via mechanical testing.  Continue development of new ceramic matrix composites systems with higher temperature capability.  Continue validation of suitable materials and materials process technologies for applications in combined optical and RF communication system apertures.  Initiate development of new hybrid materials and materials process technologies for applications in combined optical and RF communication system apertures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.628"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.628"
                                            },
                                            "Text": {
                                                "val": "Continue development of new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable ceramic matrix composites. Transition life prediction model to address time dependent degradation associated with environmental exposure.  Demonstrate severe environment durability of advanced ceramic composite systems via mechanical testing.  Advance development of new ceramic matrix composites systems with higher temperature capability.  Demonstrate materials and processes for applications in combined optical   and RF communication system apertures.  Continue development of new hybrid materials and processes for applications in combined optical and RF communication system apertures.  Use computational analysis to enhance understanding of environment for structural characterization. Increase in FY13 due to higher Air Force priority on hypersonic research."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop nanostructured materials and nanoscale architectures to address electromagnetic applications.  Develop metamaterials for sensors, antennas, electronics, and optical elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.395"
                                            },
                                            "Text": {
                                                "val": "Completed development of material concepts for adaptive and multifunctional aircraft structures.  Validated and demonstrated materials and process low-cost processing methodologies for photovoltaics for remotely piloted aircraft applications.  Investigated new materials systems and nano geometries to improve electrochemical energy storage including development of long-life electrodes.  Advanced concepts for RF passive metamaterials-based components.  Explored RF\/Infrared (IR) photonics for compact air vehicle applications.  Developed fabrication and characterization for Electro-optic (EO)\/IR metamaterials.  Developed fabrication and characterization for emerging metamaterial applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.455"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate new materials systems and nano geometries to improve electrochemical energy storage including development of long-life electrodes.  Accelerate applications development for optical metamaterials.  Continue to investigate concepts for RF passive metamaterials-based components.  Continue to develop RF\/IR photonics for compact air vehicle applications.  Continue to develop fabrication and characterization for EO\/IR metamaterials.  Develop fabrication and characterization for emerging metamaterial applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.669"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.669"
                                            },
                                            "Text": {
                                                "val": "Demonstrate concepts for RF Passive metamaterials-based components.  Demonstrate use of RF\/IR photonics for compact air vehicle applications. Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Develop lightweight metallic\/inter-metallic high temperature materials, life prediction, and metals processing technologies for sustainment issues such as lower costs, increased durability, and improved reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.082"
                                            },
                                            "Text": {
                                                "val": "Continued development of an advanced disk system concept for insertion into advanced propulsion concepts for air platforms.  Continued development of advanced computation methods to support modeling of materials for advanced propulsion systems.  Continued development and demonstration of lightweight metallic thermal protection systems.  Optimized fabrication methods for hybrid composite material systems.  Continued development and validation of quantitative, predictive models for performance of metallic-based thermal management systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.442"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced blade and disk system concept for insertion into advanced propulsion concepts for air platforms.  Continue development of advanced computation methods to support material development and characterization modeling for advanced aerospace systems.  Continue development and validation of quantitative, predictive models for performance of metallic-based thermal management systems.  Determine relationships between microstructure, processing, and the functional properties and performance of metallic, hybrid, nano, and composite materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.566"
                                            },
                                            "Text": {
                                                "val": "Transition advanced blade and disk system into advanced turbine engine systems. Demonstrate advanced computation methods to support material development and characterization modeling. Demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and composite materials. Increase in FY13 due to higher Air Force priority in turbine engines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4"
                                    },
                                    "Description": {
                                        "val": "Explore new material systems for expendable supersonic\/hypersonic weapon system applications. Develop and evaluate lightweight, active, adaptive, multifunctional, high temperature, and durable composite and hybrid materials for extreme environments. Develop composite and hybrid life prediction tools for engine and airframe applications. Develop computational materials science techniques and models to characterize high performance materials for expendable space and hypersonic\/hypersonic applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.111"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate new materials for space and high-speed vehicle applications.  Continued to explore composite\/hybrid life prediction tools and advanced composite\/hybrid materials for engine and airframe applications.  Continued to explore novel high-performance coolants, thermoelectric materials, and multi-scale predictive tools for thermal management.  Continued to integrate ceramic and metallic Thermal Protection System subcomponents and evaluated in a relevant space environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.309"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate improved performance of new material systems for space and supersonic\/hypersonic vehicle applications.  Continue to develop lightweight, active, adaptive, multifunctional, high temperature, and durable composite and hybrid materials for extreme environments including hypersonic applications.   Evaluate advanced carbon fibers modified by carbon nanotubes.  Develop tailorable\/adaptive high performance thermal interfaces, coolants, thermoelectric, and energy storage materials and models for air, space, propulsion, and directed energy applications.  Initiate development of novel materials and processes for improved thermal transport, storage, and thermal management for Air Force applications.  Continue to transition high-performance material systems for space and high-speed vehicle applications.  Develop composite and hybrid life prediction tools for engine and airframe applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.821"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.821"
                                            },
                                            "Text": {
                                                "val": "Further demonstrate and transition improved material systems for space and supersonic\/hypersonic vehicle applications.  Continue to develop lightweight, active, adaptive, multifunctional, high temperature, and durable composite and hybrid materials for extreme environments including hypersonic applications.   Evaluate advanced carbon fibers modified by carbon nanotubes.  Develop tailorable\/adaptive high performance thermal interfaces, coolants, thermoelectric, and energy storage materials and models for air, space, propulsion, and directed energy applications.  Initiate development of novel materials and processes for improved thermal transport, storage, and thermal management for Air Force applications.  Continue to transition high-performance material systems for space and high-speed vehicle applications.  Develop composite and hybrid life prediction tools for engine and airframe applications. Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 5"
                                    },
                                    "Description": {
                                        "val": "Develop materials for power, fluids, lubricants, aircraft topcoat, and corrosion resistant coatings using alternative energy and bio-inspired concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.988"
                                            },
                                            "Text": {
                                                "val": "Continued to develop combined thermal\/friction coating materials for extreme environments.  Analyzed integration and continue development of alternative\/renewable material and technologies for agile and adaptive deployed applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.688"
                                            },
                                            "Text": {
                                                "val": "Continue development of alternative\/renewable energy materials and technologies for deployed applications, including biomass and other alternative energy solutions.  Continue to develop combined thermal\/friction coating materials for extreme environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 6"
                                    },
                                    "Description": {
                                        "val": "Develop the basic nanomaterial building blocks for munitions and propulsion energetic systems.  Develop fundamental Science and Technology for pervasive device processing mechanisms via bio-inspired concepts and nanoscale technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.383"
                                            },
                                            "Text": {
                                                "val": "Demonstrated nanomaterials that provide stable, triggerable, nanoscale energetic materials for enhanced energy release munitions, high efficiency air-breathing propulsion, and access to space. Developed understanding of rapid propulsion methods for nano bio-material devices for aircraft and space structures, actuators, sensors, and electronics.  Demonstrated the transport and compartmentalization of nanoparticles being investigated as nanoenergetics to evaluate potential environmental impact.  Validated microstructural characterization tools to provide robust processing-performance correlations of nanoenergetic systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.732"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and validate nanomaterials for structural nano-energetic (SNE) munitions, high efficiency air-breathing propulsion, and access to space.  Develop biological engineering methods to facilitate the generation of sensors, materials, and electro-optic devices for production of complex hybrid materials.  Investigate the confluence on nano-materials and bio-materials focusing on transitioning mechanical optical or electronic devices based upon nano-materials and bio-materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.780"
                                            },
                                            "Text": {
                                                "val": "Develop and analyze nano-biomaterials for human performance sensing.  Develop computation materials science techniques and models to characterize nanomaterials. Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 7"
                                    },
                                    "Description": {
                                        "val": "Develop high temperature materials, structures, and thermal management concepts to enable furture defense capabilities for prompt global strike concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.761"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate advanced ceramics, ceramic matrix composites, hybrids, and metallic concepts for hot structure and thermal protection systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.652"
                                            },
                                            "Text": {
                                                "val": "Develop advanced ceramics, ceramic matrix composites, hybrids, and metallic concepts for reuseable hot structure and thermal protection systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A."
                                    },
                                    "Title": {
                                        "val": "N\/A."
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624348"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Electronics, Optics, and Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.985"
                        },
                        "CurrentYear": {
                            "val": "30.419"
                        },
                        "BudgetYearOne": {
                            "val": "28.805"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.805"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "31.562"
                        },
                        "BudgetYearThree": {
                            "val": "31.774"
                        },
                        "BudgetYearFour": {
                            "val": "31.156"
                        },
                        "BudgetYearFive": {
                            "val": "31.187"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials technologies for surveillance and situational awareness systems and subsystems for aircraft and missile applications, including sensor, microwave, and infrared detection and countermeasures devices used for targeting, electronic warfare, and active aircraft protection.  Materials for protection of aircrews, sensors, and aircraft from laser and high-power microwave directed energy threats are also developed.  Electronic and optical materials are being developed to enable surveillance and situational awareness with faster operating speeds, greater tunability, higher power output, improved thermal management (including higher operating temperatures), greater sensitivity, and extended dynamic range.  New materials are being developed to counter the most prominent laser threats and to respond to emerging and agile threat wavelengths without impairing mission effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop IR detector and hybrid materials, Materials and Processes (M&P) technologies for performance, affordability, and operational capability of surveillance, tracking, targeting, and situational awareness systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.473"
                                            },
                                            "Text": {
                                                "val": "Optimized 2000 pixel by 2000 pixel (2k x 2k) detector and readout integrated circuit design, processing, and packaging for enhanced focal plane array yields.  Furthered IR materials development for long wavelength.  Advanced mid wavelength materials development for high temperature, low-noise operation for use on low-power systems.  Modeled and evaluated optical behavior of materials for Low Observable (LO), Intelligence, Surveillance, Reconnaissance (ISR), and other applications.  Explored enhancing detection capability of three-dimensional detection.  Investigated next generation alternative three-dimension schemes.  Scaled up growth technology for nano-scale IR.  Advanced novel nano-scale materials options.  Continued to model and evaluate materials optical\/IR behavior for LO, ISR, and other applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.295"
                                            },
                                            "Text": {
                                                "val": "Demonstrate reproducibility of optimized 2k x 2k detector and readout integrated circuit design, processing, and packaging for enhanced focal plane array yields.  Develop a superlattice based material system for use in the detector elements of very long wavelength IR detector focal plane arrays.  Continue to advance mid wavelength materials development for high temperature, low-noise operation for use on low-power systems.  Validate models of materials optical\/IR behavior for LO, ISR, and other applications.  Initiate development of materials for nano-scale detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.362"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.362"
                                            },
                                            "Text": {
                                                "val": "Transition optimized design of 2k x 2k IR detectors with integrated circuits, processing, and packaging for enhanced focal plane array yields.  Continue to develop a super-lattice based material system for use in the detector elements of very-long wavelength IR detector focal plane arrays.  Operate a mid-wavelength IR focal plane array at temperatures above 200 Kelvin to demonstrate overcoming the challenge of cryogenic cooling requirements. Transition mid-wavelength materials for high temperature, low-noise sensing for use on low power systems.  Demonstrate models of materials optical\/infrared behavior for LO, ISR, and other applications. Continue to develop nano-scale materials for use in producing detectors. Utilize computational materials science to improve performance prediction models."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to enhance the safety, survivability, and mission effectiveness of aircrews, sensors, viewing systems, and related assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.913"
                                            },
                                            "Text": {
                                                "val": "Demonstrated optimized nonlinear optical limiter materials for damage protection.  Demonstrated enhanced photorefractive hybrid materials concepts for Air Force passive protection applications.  Matured improved liquid crystal materials for photo-tunable devices for sensor system protection concepts.  Demonstrated thin film growth capabilities for enhanced fixed filter performance.  Demonstrated semiconductor optical limiter materials performance for damage protection in the short wave infrared."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.728"
                                            },
                                            "Text": {
                                                "val": "Continue demonstration of optimized nonlinear optical limiter materials for damage protection.  Continue to develop new optical limiter materials and material technologies for robust in-band protection.  Continue demonstration of enhanced photorefractive hybrid materials concepts for Air Force passive protection applications.  Develop tunable\/switchable materials and concepts to provide jamming protection to a variety of systems.  Develop and demonstrate passive optical coating technology for advanced applications in airborne, space, and personnel systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.818"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.818"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of materials and technologies to protect against directed energy threats.  Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems.  Develop materials for high energy laser interactions.  Utilize computational materials science to enhance multi-scale modeling."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Develop M&P technologies for power generation and control, and microwave components for surveillance, tracking, targeting, situational awareness, and lethal and non-lethal systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.701"
                                            },
                                            "Text": {
                                                "val": "Developed materials growth adjustment\/mitigation methodologies for improved reliability.  Improved materials and materials applications for increased reliability and power for high power microwave directed energy applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.610"
                                            },
                                            "Text": {
                                                "val": "Develop and validate characterization and modeling tools to analyze material changes that occur at the nanoscale within an operating device.  Develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, high power microwave directed energy applications.  Continue to develop nanostructured materials using multiple approaches for high energy density capacitors for pulsed power applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.701"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.701"
                                            },
                                            "Text": {
                                                "val": "Continue to develop modeling tools to analyze material changes that occur at the nanoscale within an operating device.  Continue to develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, high power microwave directed energy applications."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4"
                                    },
                                    "Description": {
                                        "val": "Develop enabling and foundational biotechnologies for guidance and control, rapid tagging, tracking, and identification of targets, and bio-integrated electronics and sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.860"
                                            },
                                            "Text": {
                                                "val": "Developed new bio-materials and nano-materials that enable broad spectrum mitigation of environmental threats.  Integrated delivery methods and bio-materials and nano-materials appropriate for specific Air Force requirements.  Demonstrated materials with specific performance characteristic."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.730"
                                            },
                                            "Text": {
                                                "val": "Develop bio-materials and nano-based and functionalized materials for tagging, tracking, and locating applications.  Develop biological engineering methods for sensors and electro-optic devices for complex hybrid materials.  Develop bio-materials and nano-materials that enable broad spectrum mitigation of environmental threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.177"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.177"
                                            },
                                            "Text": {
                                                "val": "Continue to develop biological engineering methods for sensors and electro-optic devices for complex hybrid materials.  Use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 5"
                                    },
                                    "Description": {
                                        "val": "Develop materials enabling higher performance lasing media, new laser architectures, optical isolators, beam steering, and other high energy laser components for directed energy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.038"
                                            },
                                            "Text": {
                                                "val": "Pursued materials for enabling improved laser source components operating in the mid-infrared range.  Improved very high-speed beam steering materials and pursued most promising beam steering configurations.  Improved materials to increase high energy laser efficiency and gain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.056"
                                            },
                                            "Text": {
                                                "val": "Develop materials for enabling improved laser source components operating in the mid-infrared range.  Continue to develop materials processes for fabricating new laser beam scanning architectures that utilize the latest generation of EO polymers to enable the  high-speed beam steering.  Develop and demonstrate materials that increase high energy laser efficiency and gain."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.747"
                                            },
                                            "Text": {
                                                "val": "Demonstrate materials for improved laser source components operating in the mid-infrared range. Develop materials with tailorable properties for beam steering in the newly accessible W band.  Demonstrate materials processes for fabricating new laser beam scanning devices that utilize electro-optic polymers to enable high-speed beam steering. Develop and demonstrate materials that increase high energy laser efficiency and output. Utilize computational materials science to improve performance predictions and shorten design cycle time."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A."
                                    },
                                    "Title": {
                                        "val": "N\/A."
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624349"
                    },
                    "ProjectTitle": {
                        "val": "Materials Technology for Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.170"
                        },
                        "CurrentYear": {
                            "val": "20.050"
                        },
                        "BudgetYearOne": {
                            "val": "26.897"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.897"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "26.286"
                        },
                        "BudgetYearThree": {
                            "val": "33.040"
                        },
                        "BudgetYearFour": {
                            "val": "33.514"
                        },
                        "BudgetYearFive": {
                            "val": "32.571"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials and materials processing technologies to support operational Air Force mission areas by providing the ability to inspect the quality of delivered systems, transitioning more reliable and maintainable materials, establishing a capability to detect and characterize performance threatening defects, characterizing materials processes and properties necessary for materials transition, and providing quick reaction support and failure analysis to the operational commands and repair centers.  Repair techniques and nondestructive inspection\/evaluation (NDI\/E) methods are developed that are needed for metallic and non-metallic structures, coatings, corrosion control processes, and to support integration of composite structures for aerospace systems.  Various NDI\/E methods are essential to ensure optimum quality in the design and production of aircraft, propulsion, and missile systems.  These NDI\/E methods are also essential to monitor and detect the onset of any service-initiated damage and\/or deterioration due to aging of operational systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop sensing and life prediction technologies to identify damage and characterize the health of aging structures, propulsion systems, and low-observable (LO) materials and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.862"
                                            },
                                            "Text": {
                                                "val": "Demonstrated advanced novel sensing techniques to detect and track corrosion and other damage to materials in aerospace systems. Demonstrated augmented multi-layer sensing capabilities to demonstrate applications and damage models for a wide variety of aerospace structures. Demonstrated sensing technologies that detect changes in material properties from corrosion and in-field use, damage evolution, and other factors that detrimentally affect aerospace systems. Developed and validated affordable prognosis approaches for life cycle sustainment and management and for life extension capability.  Demonstrated novel LO point inspection probes to enable rapid assessment of LO material performance.  Investigated next generation LO point inspection needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.153"
                                            },
                                            "Text": {
                                                "val": "Advance novel sensing modeling, methods, and techniques to detect and track damage to other materials and components for aerospace systems.  Investigate enhanced sensing through multiple layers of skin and structures to improve the probabilities of finding deeply imbedded or hidden damage in aerospace systems.  Advance sensing technologies that detect changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems.  Develop and improve affordable prognosis approaches for life cycle management and life extension capability for aerospace structure and turbine engines.  Investigate and augment innovative LO point inspection probes to enable rapid assessment of LO material performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.487"
                                            },
                                            "Text": {
                                                "val": "Continue to advance novel sensing modeling, methods, and techniques to detect, characterize, and track materials state awareness in aerospace system components.  Continue to investigate enhanced sensing through multiple layers of materials and structures to improve the probabilities of finding deeply imbedded or hidden damage in aerospace systems.  Advance sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Demonstrate design assessment of reliability of  affordable prognosis approaches to life cycle management and life extension for aerospace structures and turbine engines.  Continue to develop innovative LO point inspection probes to enable rapid assessment of LO material performance.  Increase in FY13 due to correction in applying overhead costs of laboratory space to Major Thrust."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve problems with materials in the production and repair of systems components and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.919"
                                            },
                                            "Text": {
                                                "val": "Evaluated advanced materials and processes technology to repair Air Force legacy systems and test failure limits for emerging Air Force systems.  Developed and demonstrated test methods and techniques to understand the effects of in-service environments and materials processes, such as the application of residual stress on the surface of steel and other structural metals, to support studies and point design solutions that will extend the life of specific structural components on Air Force systems.  Demonstrated and transitioned technologies for improved maintainability and life cycle cost of advanced materials and designs, such as conductive outer-mold-line, films, coatings, access panel treatments and multifunctional systems. Developed and demonstrated laboratory test methods to evaluate and characterize candidate space materials for properties and material behavior suitable for use in space applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.053"
                                            },
                                            "Text": {
                                                "val": "Evaluate advanced materials and processes technology to repair Air Force legacy systems and test failure limits for emerging Air Force systems.  Develop and demonstrate test methods and techniques to understand the effects of in-service environments, residual stress and materials processes on structural materials, and to support studies and point design solutions that will extend the life of specific structural components on Air Force systems.  Demonstrate and transition technologies for improved maintainability and life cycle cost of advanced materials and designs, such as conductive outer-mold-line, aircraft films, coatings, access panel treatments, and multifunctional systems.  Develop and demonstrate laboratory test methods to evaluate and characterize candidate space materials for properties and material behavior suitable for use in space applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.370"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.370"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate advanced materials and processes technology to repair Air Force legacy systems.  Investigate failure limits for emerging Air Force systems. Validate and demonstrate test methods and techniques to understand effects of service environments, residual stresses, and material processes on structural materials.  Conduct studies and support designs that will extend the life of specific structural components on Air Force systems. Transition advanced materials technologies and designs for improved maintainability and life cycle cost of conductive outer-moldline films, coatings, access panel treatments, and multifunctional systems.  Continue to develop and demonstrate laboratory test methods to evaluate and characterize materials for properties and behaviors suitable for space applications.  Use computational materials science to perform 3D analysis to predict and analyze material boundary conditions."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve materials problems and provide electronic and structural failure analysis of components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.389"
                                            },
                                            "Text": {
                                                "val": "Performed quick response failure analysis and materials investigations for fielded system, acquisition organization, depot system materials failures, and provided advanced materials solutions to ensure system availability and safety of flight. Developed advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems.  Demonstrated advanced test methodologies for analyzing structural failures of emerging materials for Air Force systems.  Developed advanced wiring materials technologies to replace aging wiring systems and new wiring technologies for emerging weapon systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.844"
                                            },
                                            "Text": {
                                                "val": "Perform quick response failure analysis and materials investigations.  Provide advanced materials solutions to ensure system availability and safety of flight.  Initiate development of Microelectromechanical System (MEMS) failure analysis capabilities.  Develop advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems.  Demonstrate advanced test methodologies for analyzing electrical and structural failures of emerging materials.  Develop and demonstrate advanced wiring materials technologies to replace aging wiring systems and new wiring technologies for emerging weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.040"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.040"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight.  Continue development of Microelectromechanical System (MEMS) failure analysis capabilities.  Validate  advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems.  Transition advanced test methods for analyzing electrical and structural failures of emerging materials.  Validate and demonstrate advanced wiring materials  technologies to replace aging wiring systems.  Validate and demonstrate new wiring technologies for emerging weapon systems. Increase in FY13 due to correction in applying overhead costs of laboratory space to Major Thrust."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A."
                                    },
                                    "Title": {
                                        "val": "N\/A."
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624915"
                    },
                    "ProjectTitle": {
                        "val": "Deployed Air Base Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.729"
                        },
                        "CurrentYear": {
                            "val": "3.842"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops new deployable airbase technologies to reduce airlift and manpower requirements, setup times, and sustainment costs, and to improve protection and survivability of deployed Air Expeditionary Force (AEF) warfighters.  Affordable, efficient technologies are developed for base infrastructure, fire fighting, and force protection to improve Expeditionary Combat Support operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop deployable infrastructure airbase technologies to reduce airlift and manpower requirements, setup times, and sustainment costs in support of AEF operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.862"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated deployable applications of higher efficiency collection and conversion of solar power for deployed applications.  Developed and optimized performance of candidate high temperature operating surface materials.  Developed and improved remote and autonomous non-destructive inspection of airfield surface evaluation technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.974"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop innovative airbase alternative energy generation capability, power grid conditioning, and distribution methods.  Explore and continue development of high operating temperature materials and technologies for aircraft operating surfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop affordable technologies to provide force protection and survivability to AEF deployed warfighters and infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.867"
                                            },
                                            "Text": {
                                                "val": "Developed and optimized fire suppression agents using methodologies supporting deployed warfighters and infrastructure.  Developed novel cost-effective technologies for fire fighter effectiveness in deployed environments.  Developed novel structural materials and technologies to support deployed warfighters and infrastructure using methodologies developed for protection from emerging threats.  Developed and optimized techniques and materials for defeat of new and evolving improvised explosive devices and high energy threats.  Analyzed functions of microbes and develop effective methodologies to capture biological processes for use in Air Force applications, such as sensing and development of solid state materials.  Evaluated design and performance of microbial-based technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.868"
                                            },
                                            "Text": {
                                                "val": "Develop technologies for airbase structural protection against blast and fragmentation.  Explore technology to enhance structural integrity.  Investigate composite material combustion processes and develop modeling for aircraft fires.  Develop innovatve technologies for airbase fire fighting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Decrease in FY13 due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A."
                                    },
                                    "Title": {
                                        "val": "N\/A."
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}