{
    "id": "3c7d0c570a809ed44381c8bb214c93a2c1f034ff",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605804D8Z"
        },
        "ProgramElementTitle": {
            "val": "Development Test & Evaluation"
        },
        "R1LineItemNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.978"
            },
            "CurrentYear": {
                "val": "18.621"
            },
            "BudgetYearOne": {
                "val": "15.110"
            },
            "BudgetYearOneBase": {
                "val": "15.110"
            },
            "BudgetYearTwo": {
                "val": "15.708"
            },
            "BudgetYearThree": {
                "val": "16.358"
            },
            "BudgetYearFour": {
                "val": "16.882"
            },
            "BudgetYearFive": {
                "val": "17.197"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Developmental Test and Evaluation (DT&E) program element is budgeted in the Research and Development budget activity because it supports and assesses the DT&E efforts of each Major Defense Acquisition Program (MDAP) and other Special Interest acquisition programs as designated by Under Secretary of Defense (Acquisition, Tecnology & Logistics), assesses the DT&E capabilities of the Military Departments and Department of Defense (DoD) Components, oversees the DT&E acquisition workforce, issues policy and guidance for the conduct of DT&E within DoD, and produces the annual DT&E report to Congress.  \n\nThe Department of Operational Energy Plans and Programs (DOEPP) is funded within this program element in FY 2011 for technical analysis and policy guidance for the DoD operational energy programs and initiatives, including institutionalizing energy in DoD’s business processes (for example: Fully Burdened Cost of Fuel and the Energy Efficiency Key Performance Parameters (KPPs)).  In FY 2012, funding will be re-allocated to a new DOEPP Program Element."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.688"
                },
                "CurrentYear": {
                    "val": "15.805"
                },
                "BudgetYearOne": {
                    "val": "16.053"
                },
                "BudgetYearOneBase": {
                    "val": "16.053"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.978"
                },
                "CurrentYear": {
                    "val": "18.621"
                },
                "BudgetYearOne": {
                    "val": "15.110"
                },
                "BudgetYearOneBase": {
                    "val": "15.110"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.290"
                },
                "CurrentYear": {
                    "val": "2.816"
                },
                "BudgetYearOne": {
                    "val": "-0.943"
                },
                "BudgetYearOneBase": {
                    "val": "-0.943"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.689"
                    },
                    "CurrentYear": {
                        "val": "-0.555"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.006"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.943"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.943"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.095"
                                },
                                "CurrentYear": {
                                    "val": "-0.129"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.132"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "7.200"
                                },
                                "CurrentYear": {
                                    "val": "3.500"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Weapon System Acquisition Reform Act (WSARA) of 2009 directed a new Office of the Director, Systems Engineering and Office of the Director, Developmental Test and Evaluation. In FY 2011, funding in the amount of $21.244 miilion from this Program Element (P805) for previous systems and software engineering efforts, has been transferred to a new Systems Engineering Program Element (0605142D8Z)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P804"
                    },
                    "ProjectTitle": {
                        "val": "Development Test & Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.425"
                        },
                        "CurrentYear": {
                            "val": "18.621"
                        },
                        "BudgetYearOne": {
                            "val": "15.110"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.110"
                        },
                        "BudgetYearTwo": {
                            "val": "15.708"
                        },
                        "BudgetYearThree": {
                            "val": "16.358"
                        },
                        "BudgetYearFour": {
                            "val": "16.882"
                        },
                        "BudgetYearFive": {
                            "val": "17.197"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports and assesses the DT&E efforts of each Major Defense Acquisition Program (MDAP) and other Special Interest acquisition programs as designated by USD (AT&L), assesses the DT&E capabilities of the Military Departments and DoD Components, oversees the DT&E acquisition workforce, issues policy and guidance for the conduct of DT&E within DoD, and produces the annual DT&E report to Congress.  Specific activities include the following:\n\n- Review and approve the Test and Evaluation Strategy (TES) and Test and Evaluation Master Plans (TEMPs) for each MDAP and USD (AT&L) designated Special Interest program.\n- Provide the Milestone Decision Authority with independent evaluations of acquisition program DT&E planning, execution, and system performance.\n- Coordinate closely with the Director of Systems Engineering to ensure that the developmental test and evaluation activities of the Department of Defense are fully integrated into and consistent with the systems engineering and development planning processes of the Department.\n- Provide Assessments of Operational Test Readiness (AOTRs) to inform the Service Acquisition Executive on readiness of Programs to proceed into Initial Operational Test and Evaluation with a high probability of being found operationally effective, suitable and survivable.\n- Develop policy and guidance to ensure efficient and effective DT&E across DoD, including policy and guidance for joint T&E and, in conjunction with Director, Operational Test and Evaluation (DOT&E), integrated DT&E and OT&E.\n- Provide DT&E assessments for the Systems Engineering Program Support Review process, Nunn-McCurdy certification review teams, and the Director, Performance Assessment and Root Cause Analysis (PARCA).\n- Review the organizations and capabilities of the military departments with respect to developmental test and evaluation and identify needed changes or improvements to such organizations and capabilities, and provide input regarding needed changes or improvements for the test and evaluation strategic plan developed by TRMC. \n- Developing policy, guidance and certification standards to enhance DT&E acquisition workforce planning and progression.  Monitoring and facilitating Defense Acquisition University (DAU) updates of T&E courses to ensure the curriculum supports the certification standards and provides the appropriate education and training.\n\nThe decrease in funding from FY 2010 to FY 2011 is due to the WSARA of 2009, which directed a new Office of the Director, Systems Engineering, in FY 2011 to receive their a new Systems Engineering Program Element (0605142D8Z)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test and Evaluation Accomplishments and Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.425"
                                            },
                                            "Text": {
                                                "val": "-Initiated establishment of a Center of Excellence for Experimental Design and Analysis.\n-DASD DT&E named OSD lead for modeling and simulation.\n-Developed DT&E policies and methodologies addressing Scientific Test and Evaluation Design, Responsible Test Organizations, T&E of Cyber defense, Net-Ready Key Performance Parameter (KPP) and Information Assurance.  \n-Continued hiring\/staffing to support WSARA mission.\n-Refined internal processes to support acquisition decisions.\n-Refined the annual reporting process and develop the second Joint Annual Report to Congress.\t\n-Published 2 AOTRs on JASSM-ER and SM-6 prior to their entry into IOT&E.\n-Conducted review and approval of 44 TEMPs and 4 TESs submitted to support major acquisition reviews for MDAPs.\n-Provide data-based assessments of system performance in support of all scheduled Defense Acquisition Board decisions.\n-Continued to promote the application of sound systems engineering, DT&E, and related technical disciplines across the Department's acquisition community and programs.\n-Monitored T&E resource availability and TRMC Strategic Plan implementation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.621"
                                            },
                                            "Text": {
                                                "val": "-Reassess Government and Contractor staff manning and resources and ability to meet Title Ten roles and responsibilities. \n-Refine internal processes to support acquisition decisions.\n-Refine annual reporting process and develop Joint Annual Report to Congress.\t\n-Refine DT&E policies and methodologies addressing DT&E across all MDAP and Special Interest programs. \n-Publish formal AOTRs for all Programs under DT&E oversight prior to entry into IOT&E.\n-Conduct review and approval of all TEMPs and TESs submitted to support major acquisition reviews for MDAPs.\n-Provide data-based assessments of system performance in support of all scheduled Defense Acquisition Board decisions.\n-Continue to promote the application of sound systems engineering, DT&E, and related technical disciplines across the Department's acquisition community and programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.110"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.110"
                                            },
                                            "Text": {
                                                "val": "-Reassess Government and Contractor staff manning and resources and ability to meet Title Ten roles and responsibilities. \n-Refine internal processes to support acquisition decisions.\n-Refine annual reporting process and develop Joint Annual Report to Congress.\n-Refine DT&E policies and methodologies addressing DT&E across all MDAP and Special Interest programs. \n-Publish formal AOTRs for ACAT ID and IC Programs under DT&E oversight prior to entry into IOT&E.\n-Conduct review and approval of all TEMPs submitted to support major acquisition reviews for MDAPs.\n-Provide data-based assessments of system performance in support of all scheduled Defense Acquisition Board decisions.\n-Continue to promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P806"
                    },
                    "ProjectTitle": {
                        "val": "Energy"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.553"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program enables analyses to implement operational energy requirements as directed in the 2009 National Defense Authorization Act (NDAA)(10 USC 2925).   Work conducted under this line focuses on research and development prioritization analysis related to identified operational energy capability gaps; campaign-level model modifications to allow simulated United States logistics forces to interact independently in analysis and planning; energy tool development for military requirements analysts related to operational energy gaps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energy Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Text": {
                                                "val": "Provide direct analytic support and model development support to the Director for Operational Energy Plans & Programs.  Work conducted under this line included analysis to identify operational energy capability gaps and establish processes to address them; identification and collection of operational energy data to support development of metrics and establish an operational energy baseline for the Department; and analysis into tactical systems operational energy requirements and potential efficiencies.  All work under this line will also provide a basis for broader analyses within the Analytic Agenda, in which these organizations will help interject more realistic fuel logistics risk assessment, and alternative force structure assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts will be transferred to the new Operational Energy Capability Improvement program element, 0604055D8Z, in FY 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}