{
    "id": "3c9e0f590d499c0f78c26000616af102b29c06e4",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Tech Dev"
        },
        "R1LineItemNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.832"
            },
            "CurrentYear": {
                "val": "11.286"
            },
            "BudgetYearOne": {
                "val": "11.706"
            },
            "BudgetYearOneBase": {
                "val": "11.706"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "11.854"
            },
            "BudgetYearThree": {
                "val": "12.108"
            },
            "BudgetYearFour": {
                "val": "12.329"
            },
            "BudgetYearFive": {
                "val": "12.541"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DOD's Joint Non-Lethal Weapons Program (JNLWP) was established by the Secretary of Defense, who assigned centralized responsibility for DOD joint research and development of non-lethal technology to the Commandant of the Marine Corps as the Executive Agent.  The Under Secretary of Defense for Acquisition, Technology and Logistics provides direct oversight of the JNLWP.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions provided by the Joint NLW Integrated Product Team, a multi-service flag level corporate board that executes the JNLWP for the Commandant of the Marine Corps.  This direction is based on the needs and capabilities of the Services, the Special Operations Command, and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document.  This coordinated joint S&T development approach addresses mutual capability gaps and assures the best non-lethal technologies and equipment are provided to the operating forces while eliminating duplicative service S&T investment.\n\nThis program funds Advanced Technology Development of next-generation Non-Lethal Weapons (NLWs) and includes performing analysis, technical development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these NLWs.  Investment areas include research and development of next-generation NLWs such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-material missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications).  Next-generation NLW systems focus on long-range localized Non-Lethal (NL) effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities.  By order of the Under Secretary of Defense for Acquisition, Technology, and Logistics, the Marine Corps is established as the Executive Agent for DoD Joint Non-Lethal Weapons RDT&E.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.131"
                },
                "CurrentYear": {
                    "val": "11.286"
                },
                "BudgetYearOne": {
                    "val": "11.597"
                },
                "BudgetYearOneBase": {
                    "val": "11.597"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.832"
                },
                "CurrentYear": {
                    "val": "11.286"
                },
                "BudgetYearOne": {
                    "val": "11.706"
                },
                "BudgetYearOneBase": {
                    "val": "11.706"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.299"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.109"
                },
                "BudgetYearOneBase": {
                    "val": "0.109"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.242"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.001"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.001"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.110"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.110"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.057"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3022"
                    },
                    "ProjectTitle": {
                        "val": "Joint Non Lethal Weapons"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.832"
                        },
                        "CurrentYear": {
                            "val": "11.286"
                        },
                        "BudgetYearOne": {
                            "val": "11.706"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.706"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.854"
                        },
                        "BudgetYearThree": {
                            "val": "12.108"
                        },
                        "BudgetYearFour": {
                            "val": "12.329"
                        },
                        "BudgetYearFive": {
                            "val": "12.541"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the research and development of next-generation NLWs and includes performing analysis, technical development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these NLWs.  Investment areas include research and development of next-generation NLWs such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-material missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications). Next-generation NLW systems focus on long-range localized NL effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JOINT NON-LETHAL WEAPONS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.832"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued effort to assess the general utility, effect, and effectiveness of technologies for incapacitating personnel, clearing facilities, stopping vehicles and vessels, and denying enemy access to protected areas.\n- Continued design of a man-transportable laser weapons system that can be used for non-lethal counter-personnel or non-lethal counter-materiel applications through ultra-high precision engagement of selected targets with minimal collateral damage.\n- Continued research to define the optimum approaches, technologies and tactics necessary to clear a facility\/building with and without entry.\n- Continued modeling\/research to develop an understanding of the complex relationships between individual, group and crowd dynamics in order to predict the macro effects of NLWs. Specifically, investigate factors that cause crowds to move to violent behavior, and what non-lethal technologies will be effective in controlling or mitigating violent crowd behavior.\n- Continued effort to examine and optimize non-lethal effects and effectiveness of various non-lethal stimuli, to include light, acoustics, electrical, high power laser, high power microwave and active denial technology. Research includes human effects analysis with respect to existing non-lethal stimuli and other emerging system stimuli to characterize behaviors and their operational relevance.\n- Continued non-lethal effects characterization through modeling and effects testing using the Advanced Total Body Model.\n- Continued prototype development and demonstration of the most promising candidate technologies employing multi-sensory stimuli.\n- Continued investigations of technology advancements to miniaturize proven non-lethal weapon prototypes \/demonstrators to enable their transition to tactically relevant, cost effective capabilities in the field.\n- Continued prototype development of advanced payloads for candidate technological capabilities with applications relevant to emerging capability gaps.\n- Continued prototype development and demonstration of the most promising candidate technologies addressing the extended range\/duration incapacitation capability gap.\n- Continued transition to higher levels of development and demonstration for the most promising candidate technologies employing multi-sensory stimuli.\n- Continued to address non-lethal counter-personnel capability gaps with alternative directed energy technologies.\n- Completed design of a man-transportable laser weapons system that can be used for non-lethal counter-personnel or non-lethal counter-materiel applications through ultra-high precision engagement of selected targets with minimal collateral damage.  \n- Completed investigations of technology advancements to miniaturize proven non-lethal weapon prototypes\/ demonstrators to enable their transition to tactically relevant, cost effective capabilities in the field.\n- Completed prototype development and demonstration of the most promising candidate technologies employing multi-sensory stimuli and transition best candidates to higher levels of technology development and demonstration. \n- Initiated transition to higher levels of technology development and demonstrate the most promising directed energy technologies under consideration for counter-personnel and counter-material applications.\n- Initiated technology development employing optimized electro-muscular disruption waveforms and mechanisms for an extended duration counter-personnel suppression capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.286"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2011, less those noted as completed above.\n- Initiate transition to higher levels of technology development the optimum approaches and technologies necessary to clear a facility\/building with and without entry.\n- Initiate transition to higher levels of technology development the most promising candidate technologies addressing the extended range\/duration incapacitation capability gap.\n- Initiate transition to higher levels of technology development for advanced payloads with applications relevant to emerging capability gaps.\n- Initiate advanced prototype development and demonstration of a smaller, lighter active denial technology demonstrator based on most promising and mature 95 GHZ source technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2012, less those noted as completed. \n- Completed integration of the Advanced Total Body Model into a suite of non-lethal effects modeling capability now referred to as the Human Effects Modeling and Analysis Program (HE-MAP) during FY11.  Non-lethal effects characterization through modeling and effects testing continues using HE-MAP.\n- Initiate evaluation of alternative non-lethal prototype technologies offering operational utility and transition best candidates to higher levels of technology development and acquisition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Program Element is the development of technologies that lead to the next-generation of Non-Lethal Weapons which address identified and prioritized joint NLW capability gaps.  The program consists of a collection of projects for the development and evaluation of feasibility demonstration models.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include both the effectiveness of the technology, human effects and effectiveness, mitigation of high priority joint NLW capability gaps, and potential for compliance with policy and legislation.  Overarching considerations include the advancement of related Technology Readiness Levels and Human Effects Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}