{
    "id": "3d297aa043d80002e26352b14fe6ee5f975451e8",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605798D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Technology Analysis"
        },
        "R1LineItemNumber": {
            "val": "160"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.991"
            },
            "CurrentYear": {
                "val": "15.582"
            },
            "BudgetYearOne": {
                "val": "12.056"
            },
            "BudgetYearOneBase": {
                "val": "12.056"
            },
            "BudgetYearTwo": {
                "val": "11.981"
            },
            "BudgetYearThree": {
                "val": "12.320"
            },
            "BudgetYearFour": {
                "val": "12.963"
            },
            "BudgetYearFive": {
                "val": "13.214"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) is the principal staff advisor to the Under Secretary of Defense for Acquisition, Technology & Logistics (USD(AT&L)) and the Secretary and Deputy Secretary of Defense for research and engineering (R&E) matters.  In this capacity, the ASD(R&E) has the responsibility to conduct analysis and studies; develop policies; provide technical leadership, oversight and advice; make recommendations; and issue guidance for DoD R&E programs.  Additionally, the ASD(R&E) provides technical support to the USD(AT&L) on R&E aspects of programs subject to review by the Defense Acquisition Board, to include assessments of technology maturity consistent with DoD acquisition policy.  The mission of the DoD R&E program is to create, demonstrate, prototype, and apply technology that enables affordable and decisive military superiority.  Pursuing the R&E mission requires attention to: identification and development of new technological opportunities; insertion of new technologies into warfighting systems and operations; and management and evaluation of the effectiveness of technology programs.  This program element provides mission support to the Office of the ASD(R&E) (OASD(R&E)).  It covers a wide range of studies and analysis in support of the R&E program and it impacts the Department's decision to fund RDT&E efforts.  \n\nThe program element provides funding for the Defense Laboratory Office within the OASD(R&E)).  The Defense Laboratory Office advocates and invests in the DoD laboratory system in three areas: facilities and infrastructure; quality of workforce; and global insight of critical or strategic technologies important to the Department and the Nation.\n\nThe program element also provides engineering, scientific, and analytical support to the Office of the Deputy Assistant Secretary of Defense for Research in its responsibility for direction, overall quality, and content of the science and technology (S&T) program and ensures that the technology being developed is affordable and minimizes system development risk.  The Defense Technology Analysis program conducts assessments and analysis to ensure maximum utilization of research and development funds to accomplish the overall objectives of the S&T program.  The Weapons Systems Acquisition Reform Act (WSARA) of 2009 expanded the role of the ASD(R&E) in acquisition decisions.  Full implementation of the Act requires increases in both the number and depth of technology maturity assessments.  Funds are required for technical, analytical and management support, equipment and supplies, travel, and publications.\n\nThe DoD's key expertise for reviewing and guiding R&E programs resides in the OASD(R&E).  The OASD(R&E) staff augment their responsibilities through their connections to technology experts in various fields throughout academia, industry, and government.  The Defense Support Teams project supports the directed responsibilities by building teams of technology experts to conduct program technical assessments.  The teams analyze the key engineering problem areas and offer adjustments in the development and test plan; alternate technical approaches; or new technologies that could enable successful development.  The teams constitute expert non-advocate reviews and gather advice from the Nation's leading technical experts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.858"
                },
                "CurrentYear": {
                    "val": "16.135"
                },
                "BudgetYearOne": {
                    "val": "13.172"
                },
                "BudgetYearOneBase": {
                    "val": "13.172"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.991"
                },
                "CurrentYear": {
                    "val": "15.582"
                },
                "BudgetYearOne": {
                    "val": "12.056"
                },
                "BudgetYearOneBase": {
                    "val": "12.056"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.867"
                },
                "CurrentYear": {
                    "val": "-0.553"
                },
                "BudgetYearOne": {
                    "val": "-1.116"
                },
                "BudgetYearOneBase": {
                    "val": "-1.116"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.193"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.264"
                    },
                    "CurrentYear": {
                        "val": "-0.445"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.700"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.057"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.036"
                                },
                                "CurrentYear": {
                                    "val": "-0.108"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.116"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.116"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P796"
                    },
                    "ProjectTitle": {
                        "val": "Laboratory Resource Management"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.114"
                        },
                        "CurrentYear": {
                            "val": "5.001"
                        },
                        "BudgetYearOne": {
                            "val": "4.819"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.819"
                        },
                        "BudgetYearTwo": {
                            "val": "4.912"
                        },
                        "BudgetYearThree": {
                            "val": "5.027"
                        },
                        "BudgetYearFour": {
                            "val": "5.117"
                        },
                        "BudgetYearFive": {
                            "val": "5.204"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Laboratory Office provides advocacy, strategic planning, and policy for the DoD's in-house laboratories.  The DoD Laboratory Enterprise consists of 67 laboratories with approximately 65,000 employees and an annual budget of more than 20 billion dollars.  The Defense Laboratory Office will develop plans and investment strategies for laboratory infrastructure, technology programs, and personnel development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Laboratory Office"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Text": {
                                                "val": "Areas of emphasis included:\n•\tIdentification of Department-wide laboratory in-house core technical competencies (CTCs);\n•\tUnderstanding Service and laboratory performance within CTCs;\n•\tEnsuring that CTCs are performing at the cutting-edge of global science, technology, and engineering;\n•\tAdvocacy for investment in CTCs; and\n•\tMeasurement of performance of the Defense laboratory enterprise.\n\nDoD Lab CTCs are derived from COCOM S&T Planning Scenarios, Quadrennial Defense Review Technology Area Studies, Intelligence Community products, Technology Horizon Scanning, and DoD\/Service strategic plans. Laboratory fiscal information and program execution was collected via the Defense Technical Information Center (DTIC) R&E database. The Defense Laboratory Office, in partnership with DTIC, developed a new data structure and architecture which facilitated the gathering and subsequent analysis of relevant information.  This new database architecture represents a consolidation of the existing R&E, Work Unit Summary, and in-house S&T report databases.  From the analysis, the Laboratory Office is able to track the status of the DoD laboratory enterprise’s program performance in support of the CTCs.  OASD(R&E) teamed with the Services to determine modifications of programs and investments to ensure alignment of the laboratory enterprise with DoD technology goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.001"
                                            },
                                            "Text": {
                                                "val": "The ASD(R&E)\/Research Directorate Laboratory Office will refine and continue to execute laboratory management responsibilities.  Areas of emphasis include:\n•\tContinued identification and validation of Department-wide  DoD laboratory in-house CTCs;\n•\tUnderstanding Service and laboratory performance within CTCs;\n•\tEnsuring that CTCs are performing at the cutting-edge of global science, technology, and engineering;\n•\tAdvocacy for investment in CTCs; and\n•\tMeasurement of performance of the Defense Laboratory Enterprise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.819"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.819"
                                            },
                                            "Text": {
                                                "val": "The ASD(R&E)\/Research Directorate Laboratory Office will refine and continue to execute laboratory management responsibilities.  Areas of emphasis include:\n•\tContinued identification and validation of Department-wide  DoD laboratory in-house CTCs;\n•\tUnderstanding Service and laboratory performance within CTCs;\n•\tEnsuring that CTCs are performing at the cutting-edge of global science, technology, and engineering;\n•\tAdvocacy for investment in CTCs; and\n•\tMeasurement of performance of the Defense Laboratory Enterprise."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The performance of the Laboratory Resource Management project is based on the success of initiatives to implement stragegic planning objectives. Measures include the quality and timeliness of policy, plans, guidance, and processes."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P797"
                    },
                    "ProjectTitle": {
                        "val": "Defense Technology Analysis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.300"
                        },
                        "CurrentYear": {
                            "val": "7.394"
                        },
                        "BudgetYearOne": {
                            "val": "4.796"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.796"
                        },
                        "BudgetYearTwo": {
                            "val": "4.831"
                        },
                        "BudgetYearThree": {
                            "val": "5.243"
                        },
                        "BudgetYearFour": {
                            "val": "5.999"
                        },
                        "BudgetYearFive": {
                            "val": "6.625"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "﻿The Defense Technology Analysis (DTA) project provides engineering, scientific and analytical support to the Office of the Deputy Assistant Secretary of Defense for Research in its responsibility for direction, overall quality, and content of the S&T program and ensures that the technology being developed is affordable and minimizes system development risk.  The DTA program conducts assessments and analyses to ensure maximum utilization of research and development funds to accomplish the overall objectives of the S&T program.  The Weapons Systems Acquisition Reform Act (WSARA) of 2009 expanded the role of the ASD(R&E) in acquisition decisions.  Full implementation of the Act requires increases in both the number and depth of technology maturity assessments.  Funds are required for technical, analytical, and management support, travel, and publications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Technology Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.300"
                                            },
                                            "Text": {
                                                "val": "The Defense Technology Analysis program funded over forty efforts in FY 2011.  The funded efforts were primarily technical and programmatic support using Federally Funded Research and Development Centers (FFRDCs) and technical support services.  Activities included workshops, development of congressional reports, completion of focused studies, and access to technical expertise in support of the DoD R&E program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.394"
                                            },
                                            "Text": {
                                                "val": "Provide engineering, scientific, analytical, and managerial support to the Office of the Deputy Assistant Secretary of Defense for Research in:\n•\tDeveloping strategies, plans, and policies to develop and exploit technology; \n•\tConducting technology analyses, making recommendations, and developing guidance for S&T plans and programs;\n•\tReviewing acquisition programs and making recommendations to optimize effectiveness of the DoD investments; and\n•\tOversight of S&T issues and initiatives and responding to Congressional special interests.\n\nSeek opportunities for interdepartmental and international cooperation in high priority S&T. Conduct intradepartmental coordination to achieve goals as necessary."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.796"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.796"
                                            },
                                            "Text": {
                                                "val": "Provide engineering, scientific, analytical, and managerial support to the Office of the Deputy Assistant Secretary of Defense for Research in:\n•\tDeveloping strategies, plans, and policies to develop and exploit technology; \n•\tConducting technology analyses, making recommendations, and developing guidance for S&T plans and programs;\n•\tReviewing acquisition programs and making recommendations to optimize effectiveness of the DoD investments; and\n•\tOversight of S&T issues and initiatives and responding to Congressional special interests.\n\nSeek opportunities for interdepartmental and international cooperation in high priority S&T. Conduct intradepartmental coordination to achieve goals as necessary."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Several indicators allow the Department to measure the success of the DTA program element:\n•\tThe number of efforts funded and completed satisfactorily and the OASD(R&E) influence on S&T program decisions serve as valuable indicators of the program’s effectiveness.\n•\tFeedback into the oversight mechanisms of the program to guide investment decisions serve as additional metrics."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P798"
                    },
                    "ProjectTitle": {
                        "val": "Defense Support Teams"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.577"
                        },
                        "CurrentYear": {
                            "val": "3.187"
                        },
                        "BudgetYearOne": {
                            "val": "2.441"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.441"
                        },
                        "BudgetYearTwo": {
                            "val": "2.238"
                        },
                        "BudgetYearThree": {
                            "val": "2.050"
                        },
                        "BudgetYearFour": {
                            "val": "1.847"
                        },
                        "BudgetYearFive": {
                            "val": "1.385"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department's key expertise for reviewing and guiding R&E programs resides in the OASD(R&E). The OASD(R&E) staff augments their responsibilities through connections to technology experts in various fields throughout academia, industry, and government.  The Defense Support Teams project supports the directed responsibilities by building teams of technology experts to conduct program technical health check-ups.  The teams analyze the key engineering problem areas and offer adjustments in the development and test plans; alternate technical approaches; or new technologies that could enable successful development. The teams constitute expert non-advocate reviews and gather advice from the Nation’s leading technical experts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Support Teams"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.577"
                                            },
                                            "Text": {
                                                "val": "Established support teams and conducted technology analyses to support R&E program investment decisions.  Continued or completed teams established in FY 2010. Reviewed in technical detail the program issues and offered technical solutions to program managers.  Assessed the maturity of technologies that were candidates for transitioning to an acquisition program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.187"
                                            },
                                            "Text": {
                                                "val": "Establish support teams and conduct technology analyses to support R&E program investment decisions.  For selected acquisition programs and efforts, review in technical detail the respective program issues and offer technical solutions to program managers.  Assess the maturity of technologies that are candidates for transitioning to an acquisition program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.441"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.441"
                                            },
                                            "Text": {
                                                "val": "Establish support teams and conduct technology analyses to support R&E program investment decisions.  For selected acquisition programs and efforts, review in technical detail the respective program issues and offer technical solutions to program managers. Assess the maturity of technologies that are candidates for transitioning to an acquisition program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Several indicators allow the Department to measure the success of the DTA program element:\n•\tThe number of technological introspections as evidenced by completed support teams and OASD(R&E) influence on acquisition decisions serve as valuable indicators of the program’s effectiveness.\n•\tThe establishment and outputs of Defense Support Teams are additional indicators of program metrics.\n•\tFeedback into the oversight mechanisms of the S&T program to guide investment decisions serve as additional metrics."
                        }
                    }
                }
            ]
        }
    }
}