{
    "id": "3d6f85c2950701ad6cce4ad51956a710991c0f1f",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602784A"
        },
        "ProgramElementTitle": {
            "val": "MILITARY ENGINEERING TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "73.346"
            },
            "CurrentYear": {
                "val": "80.190"
            },
            "BudgetYearOne": {
                "val": "70.693"
            },
            "BudgetYearOneBase": {
                "val": "70.693"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "66.914"
            },
            "BudgetYearThree": {
                "val": "63.432"
            },
            "BudgetYearFour": {
                "val": "62.648"
            },
            "BudgetYearFive": {
                "val": "64.600"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 Funding realigned to higher priority efforts"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates, evaluates, and advances technologies, techniques and tools for depiction and representation of the physical and human environment for use in military operations; for characterizing geospatial, atmospheric and weather conditions and impacts on systems and military missions; for conducting mobility, counter-mobility, survivability and force protection; and for enabling secure, sustainable, energy efficient facilities.  Research focuses on special requirements for battlefield visualization, tactical decision aids, weather intelligence products, and capabilities to exploit space assets.  Projects 855 and H71 support the materiel development, testing, and operations communities in evaluating the impacts of weather, terrain, and atmospheric obscurants on military materiel and operations. Project T40 advances technologies for adaptive and expedient force protection across the range of military operations (includes Deployable Force Protection).  This project also designs and evaluates software and hardware to identify and mitigate positive and negative ground obstacles; characterizes austere navigation environments and designs\/evaluates materiel solutions including rapidly emplacable bridging, ground stabilization and breakwater structures; and builds and uses modeling and simulation tools to advance understanding of the interactions of weapons\/munitions and novel defeat methodologies with buildings, shelters, bunkers, berms and bridges.  Project T41 investigates and evaluates application of technologies to enable garrison\/post commanders to plan, monitor and operate facilities more efficiently, cost-effectively, securely and sustainably; and creates tools (including advanced models and simulation) that provide a framework for making trades and decisions.  Project T42 develops and validates models and simulations to understand the impacts of the physical environment on the performance of forces, ground and air vehicles, and sensors; as well as the impact of natural and man-made changes in the environment on military operations.  Project T45 investigates and evaluates materials, components and systems that have potential to reduce energy losses in buildings and shelters; and potential to detect and mitigate consequences of contaminants such as bacteria and molds in air handling equipment and building materials.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nResearch is transitioned to PE 0603734A (Military Engineering Advanced Technology) and PE 0603125A (Combating Terrorism, Technology Development).  \n\nWork in this PE is led, managed or performed by the U.S. Army Engineer Research and Development Center, Vicksburg, MS, and the Army Research Laboratory, Aberdeen Proving Ground, MD. Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "79.189"
                },
                "CurrentYear": {
                    "val": "80.317"
                },
                "BudgetYearOne": {
                    "val": "78.856"
                },
                "BudgetYearOneBase": {
                    "val": "78.856"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "73.346"
                },
                "CurrentYear": {
                    "val": "80.190"
                },
                "BudgetYearOne": {
                    "val": "70.693"
                },
                "BudgetYearOneBase": {
                    "val": "70.693"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.843"
                },
                "CurrentYear": {
                    "val": "-0.127"
                },
                "BudgetYearOne": {
                    "val": "-8.163"
                },
                "BudgetYearOneBase": {
                    "val": "-8.163"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.678"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.163"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.163"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.165"
                                },
                                "CurrentYear": {
                                    "val": "-0.127"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "855"
                    },
                    "ProjectTitle": {
                        "val": "TOPOGRAPHICAL, IMAGE INTEL & SPACE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.660"
                        },
                        "CurrentYear": {
                            "val": "17.329"
                        },
                        "BudgetYearOne": {
                            "val": "15.486"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.486"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.497"
                        },
                        "BudgetYearThree": {
                            "val": "16.389"
                        },
                        "BudgetYearFour": {
                            "val": "16.451"
                        },
                        "BudgetYearFive": {
                            "val": "18.021"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and advances capabilities for collection, processing, and creation of data and information depicting physical and human terrain, environmental conditions, and relationships in time and space; for digital map creation, transmission, and dissemination; and for map-based analytics for planning, decision making and execution.  This project uses non-traditional methods that exploit existing open source text, multi-media and cartographic materials addressing social, cultural and economic geography to advance the capability to produce and transmit high fidelity digital maps depicting the physical terrain, human terrain and environmental conditions. This project also develops software tools and methods for map-based analytics that allow deeper insights into the effects of the physical terrain, human terrain and environmental conditions on military operations, to include tactics and effects upon equipment and Soldier's performance.  The Army is defining and implementing the Army Geospatial Enterprise (AGE). The AGE provides map and geospatial data, information and software services seamlessly to the total force. This project explores and advances components and methods that optimize the utility of the AGE to the total Army.\n\nWork in this project supports the Army S&T Command, Control, Communications (C3) Portfolio.\n\nWork in this project complements efforts in PE 0602784A, Project H71.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nThe work in this project is performed by the U.S. Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Terrain Analysis for Signal and Sensor Phenomenology (Previously titled - Terrain Analysis for Signal and Signature Phenomenology)"
                                    },
                                    "Description": {
                                        "val": "This effort develops means to create, structure, and represent detailed data, information and effects of the physical and human terrain on military ground operations.  The research focuses on tactical, rather than national or commercial, remote sensing of physical terrain data to achieve the fidelity required for current and future operations.  Research includes methods for radical, effective active remote sensing to 'tag' features, items and people of interest; these capabilities are based upon full waveform light detection and ranging (LiDAR) sensor systems and an array of other sensor phenomenology for optimal data detection, identification and classification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matrix test chemical, biological, radiological, nuclear and explosives reporters, which are engineered materials that emit signals when triggered by a target molecule; conducted laboratory and field trials under real environmental conditions to optimize reporter selection for incorporation into a nano-material tool kit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.832"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop data collection and processing algorithms for novel and advanced full waveform Geiger-mode light detection and ranging (LIDAR) data output for improved terrain analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Will evolve an Army Geospatial Enterprise capability supporting mission and battle command functions and processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Imagery and GeoData Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops human terrain, environment, and analysis to support the Warfighter. It further advances map creation and content through non-traditional methods that exploit existing open source text, multi-media and cartographic materials addressing social, cultural and economic geography."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.002"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed urban mapping tools and techniques, including modeling complex buildings, roofs, building interiors, and subterranean features."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop new feature extraction workflows that combine multi-source high-resolution imagery with elevation data to address tactical data gaps; provide capability to evolve and transition an Army geospatial enterprise supporting mission and battle command functions and processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.220"
                                            },
                                            "Text": {
                                                "val": "Will apply and evaluate non-traditional mapping methods to representative data holdings for Afghanistan and Pacific Command (PACOM) for verification and improvements; design and evaluate utility of socio-cultural Wiki in unclassified and secret modes to take advantage of existing open source materials addressing social, cultural and economic geography."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Reasoning"
                                    },
                                    "Description": {
                                        "val": "This effort develops and evaluates software analysis tools and methods to provide impact and context of the effects of the physical terrain, human terrain and environmental conditions on military operations.  This analysis examines and models these effects upon unit tactics, equipment and Soldiers' performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.345"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed geospatially-enabled decision support aids to meet uncertain adaptive threats and develop techniques to increase the rate at which large volumes of geospatial data and products are disseminated."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop rapid, field-accessible terrain analysis tools for urban and complex environments; develop urban and complex environment sensor placement decision support tools; create an integrated game-board of landscapes and relationships supporting Intelligence Preperation of the Battlefield (IPB) for Civil Military Operations (CMO)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.528"
                                            },
                                            "Text": {
                                                "val": "Will develop and implement a web presence, compliant with Defense Information Systems Agency, and enterprise for open analytics supporting Army, USMC and Combatant Command (COCOM) Mission Partners addressing the span of counter-insurgency (COIN) and capacity building missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial and Temporal Information Structure and Framework (Previously titled - Geospatial Infostruture & Framework)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates geospatial data and information architecture to ensure content and representation of data and actionable geospatial information for operational decision making. Success in meeting these objectives advances the Army's ability to network the force to achieve information dominance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporated weather effects and cultural feature analysis to support unmanned systems command and control; develop a framework for describing elements of political, military, economic, social, infrastructure, and information domains and linking to temporal and spatial analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.646"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop feature linkage tools to identify common features across databases, opposing force movement index-based on suppression and interdiction capabilities, and data mining algorithms to support detection of important events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.988"
                                            },
                                            "Text": {
                                                "val": "Will develop a more structured analysis and decision framework capable of describing causal relationships and the effects of operational decisions in security and sustainment operations; develop new feature extraction methodologies and techniques that combine multi-source high-resolution imagery with elevation data to address tactical data gaps; evolve and transition an Army Geospatial Enterprise capability supporting mission and battle command functions and processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise (Previously titled - Geo-Enabled Battle Command Enterprise)"
                                    },
                                    "Description": {
                                        "val": "This effort explores and advances components and methods that optimize the utility of the Army Geospatial Enterprise (AGE) to the total Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.175"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extended common geospatial architecture and services to support geospatial analysis tools and linkages to command and control for U.S. and coalition force applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.092"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a geospatial architecture allowing input of user-generated content into the information system to enhance the decision-making battle command process."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H71"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Research for Battle Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.476"
                        },
                        "CurrentYear": {
                            "val": "6.147"
                        },
                        "BudgetYearOne": {
                            "val": "6.298"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.298"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.361"
                        },
                        "BudgetYearThree": {
                            "val": "6.441"
                        },
                        "BudgetYearFour": {
                            "val": "6.468"
                        },
                        "BudgetYearFive": {
                            "val": "6.492"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops tactical weather and atmospheric effects\/impacts algorithms for their integration into battlefield information products.  Efforts include high-resolution, local assessments and forecasts of meteorological conditions in near real time including effects of urban and mountainous terrain; analytical tools to assess the impact of the atmosphere to optimize system performance and operations planning and advanced atmospheric sensing applications to characterize and mitigate wind and turbulence in complex terrain.  It provides detailed model applications for various effects of the atmosphere on electro-optical and acoustic target detection, location, and identification.  This project develops both physics-based decision aids and rule-based decision support systems for assessing the impacts of weather\/atmosphere across a spectrum of friendly and threat weapons systems, sensors, platforms, and operations.  Information can be applied to mission planning and execution, battlefield visualization, reconnaissance surveillance and target acquisition, and route planning to maximize stealth and efficiency, web enabled tactical decision aids, and also modeling of environmental impacts for combat simulations and war games.  \n\nWork in this project supports the Army S&T Command, Control, Communications (C3) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work transitions technologies to the Department of Defense weather and operations modeling community, the US Air Force Weather Agency to improve their operational weather support to the Army PM-MaTIC (PM-Meteorological and Target Identification Capabilities for field artillery systems, the Project Manager, Distributed Common Ground System-Army (DCGS-A), the Joint Improvised Explosive Device (IED) Defeat Organization, the Program Executive Office Aviation,  Tactical Airspace Integration System, and Product Manager for Robotics Unmanned Sensors.\n\nWork in this project is performed by the Army Research Laboratory located at Adelphi, MD and White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atmospheric Modeling (Previously titled - Weather Modeling)"
                                    },
                                    "Description": {
                                        "val": "This effort develops high resolution, short-range forecasting and high resolution atmospheric modeling capabilities for mountainous, urban and forest complex terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.144"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed a full physics version of the Weather Running Estimate-Nowcast (WRE-N) model for Distributed Common Ground Station - Army (DCGS-A) Nowcasting, and verified the accuracy improvements in the 3Dimensional Wind Field (3DWF) and Atmospheric Boundary Layer Environment (ALBE) models achieved by applying an immersed boundary method and parameterizations of unresolved turbulence in high resolution urban and complex terrain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.401"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop computational optimization methods for the ABLE model using advances in high performance computing to produce a very high resolution meteorological model for use in urban and complex terrain; and improve the WRE-N model at kilometer and sub-kilometer scales validated with the data resulted from the model accuracy assessment studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.460"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.460"
                                            },
                                            "Text": {
                                                "val": "Will verify the improved ABLE model against measurements to quantify its performance and accuracy in extreme terrain applications;  develop the best set of physics parameterizations and nest configurations for sub-kilometer Weather Research Forecasting (WRF) model-based Weather Running Estimate-Nowcast (WRE-N) to improve the spatial detail and accuracy of the ABLE complex terrain model and reduce the latency of perishable environmental data used in actionable weather impact decision aids; develop modeling and post-processing techniques to enhance meteorological accuracy for artillery applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Diagnostics (Previously titled - Weather Diagnostics)"
                                    },
                                    "Description": {
                                        "val": "This effort develops diagnostic technologies and methods to improve the acquisition of environmental data such as temperature, humidity, wind speed and direction for use in decision aids that enhance and protect autonomous and semi-autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented methods for optimizing aircraft routing in adverse weather conditions and integrated Atmospheric Impacts Routing  4-dimensional visualization, situational awareness tools, and weather decision support systems to improve the safety and efficiency of unmanned and manned aviation; experimentally validated applications of wide band acoustic information processing to improve the characterization of local atmospheric parameters and to detect, locate and identify sources of emitted and reflected acoustic sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.896"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop weather effects application models for the improved design of emerging technologies such as Terahertz spectroscopy and imaging systems, continuous solid state high energy laser weapons, and passive short wave infrared imaging systems; and develop analysis tools to fuse thermal and infrared polarimetric images, so as to achieve increased target detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.942"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.942"
                                            },
                                            "Text": {
                                                "val": "Will investigate electro-optic\/acoustic atmospheric remote sensing techniques for the improved detection of adverse environmental conditions affecting Army operations for force protection and improved target detection, localization, and classification; will evaluate the utility of next generation (dual-band) infrared polarimetric imaging systems for use on the battlefield for increased target detection, classification, and identification; collect and analyze signatures from international infrasound events\/experiments for improved situational awareness and force protection for Military Intelligence and Army Operations; will develop web services and mobile applications to enhance and share weather impact and Atmospheric Impacts Routing (AIR) weather information to Army air system and ground systems and personnel."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Prediction for Local Areas (Previously titled - Weather Prediction)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software models and sensors to improve local characterization and prediction of atmospheric conditions in urban and complex terrain by directly integrating boundary layer meteorological (MET) measurements into high resolution models and decision aids and verifies these improvements with field measurements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed testing of coupled 3Dimensional Wind Field (3DWF) and Weather Running Estimate-Nowcast (WRE-N) models for transition to the DCGS-A Weather Services; employed active LIDAR with passive spectral sensing systems for environmental characterization; and extended the Local Rapid Evaluation of Atmospheric Conditions (L-REAC) system to integrate additional hazard models that will improve decisions on evacuation versus shelter in place and safe routing of emergency responders"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.850"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate real time networked environmental sensors and produce optimized sensor placement recommendations from the L-REAC system; and complete accuracy studies of coupled microscale wind model with WRE-N for transition to DCGS-A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.896"
                                            },
                                            "Text": {
                                                "val": "Will develop microscale and fine resolution mesoscale model capabilities for analysis and short term forecasting for target areas to enhance mission performance; develop initial application of ensemble model  probabilistic forecast grids for weather Nowcasts and decision support tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "MOB\/WPNS EFF TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.282"
                        },
                        "CurrentYear": {
                            "val": "40.986"
                        },
                        "BudgetYearOne": {
                            "val": "34.166"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.166"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "29.214"
                        },
                        "BudgetYearThree": {
                            "val": "25.564"
                        },
                        "BudgetYearFour": {
                            "val": "25.574"
                        },
                        "BudgetYearFive": {
                            "val": "25.749"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, evaluates, and creates technologies for adaptive and expedient force protection across the range of military operations; for force projection and maneuver, including austere port entry and overcoming battlespace gaps (such as cliffs, ravines, mudflats, shallow rivers, and other natural obstacles) through prediction, definition, avoidance, or defeat of the gaps; for scalable weapons effects; and for high-resolution representation of near-surface terrain and environment for use with sensor models for things such as target detection and unmanned ground systems (UGS) navigation.  This research further provides physics-based representations of ground vehicle mobility, obstacle and barrier placement, survivability, and weapons effects in complex and urban terrain modeling and simulation.  Work in this project increases the survivability of critical assets from conventional, unconventional, and emerging weapons attacks and enables  maneuver support of deployed forces, while reducing their logistical footprint. This project supports Deployable force protection (DFP) efforts for overcoming critical capability gaps for protecting troops operating at smaller bases that are remote or integrated in with local communities.      \n\nWork in this project supports the Army S&T Ground, Command, Control, Communications (C3), and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS. Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, creates, and validates technologies that address Army protection capability shortfalls; and where feasible, enhance Current Force capabilities through spiral development technology insertions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a computational protection testbed for validated high-performance modeling to predict and evaluate protective material and system response to blast and ballistic loads. Developed and evaluated force protection technologies for use in remote outposts or in other expeditionary modes, where there is little access to engineering equipment and explore options for use of organic materials in conjunction with light-weight, blast and penetration resistant composite materials and detection capabilities.  This work was performed in collaboration with PE 0603005A\/221 and activities in PE 0602618A and PE 0602105A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and validate novel layered protective systems to include overhead protection from direct and indirect fire that must defeat large-caliber rockets, vehicle borne-improvised explosive devices (IEDs), human borne-IEDs, and shoulder-fired rockets; mature the numerical modeling capability of ground vehicle protective schemes against surface and buried threats by improving coupling between the blast events, vehicles, and occupants.  This work is performed in collaboration with PE 0603005A\/221 and activities in PE 0602618A and PE 0602105A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.623"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.623"
                                            },
                                            "Text": {
                                                "val": "Will provide force protection and assessment technologies for structures located in contingency-based environments for 300 to 6000 person camps. Will design comprehensive model of improvised explosive device (IED) detonation in soils to accurately predict blast pressure and fragmentation of IEDs on ground vehicle systems over a wide range of operational environments. Will begin effort to defeat complex attacks (multiple weapons and multiple hits) for enhanced 360 degree hemispherical protection of fixed, semi-mobile\/mobile forces in a theater of operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates tools and technologies that address theater access and strategic responsiveness capability shortfalls and that overcome tactical maneuver constraints to support movement and maneuver in the battle space."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.197"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided modeling solutions of physical and operational conditions (i.e. wetland, mudflats, or shallow rivers) that provide improved logistics and force projection capability for austere entry and maneuver."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.992"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and begin development of a sea-land intermodal mobility bridge for ship to shore transit of heavy military equipment and ground vehicles as well as heavy-lift expedient landing platforms and surfaces for aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.543"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.543"
                                            },
                                            "Text": {
                                                "val": "Will create physics-based, multi-scale wave, current, and water-depth forecasting capability.  Will create algorithms to predict the impact of the environment on the transport of military equipment and personnel into austere entry points.  Will investigate use of new sensor systems to measure current and sub-surface conditions that directly affect operations for determining throughput capability at austere entry points given the infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable Weapons Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides a prediction capability for effects from scalable, selectable, and adaptive weapons that can destroy target function and\/or neutralize attributes while limiting damage to surrounding structures\/personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.454"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Participated in demonstrations of small, medium and large caliber scalable weapons against urban structure and bunker targets. Provided ballistic data to validate and finalize prediction capabilities developed in for the use of scalable weapons.  This work is performed in collaboration with PE 0602618A\/H80, PE 0602105A\/H84, PE 0602624A\/H18\/AH28, PE0603004A\/232, PE 06022303A\/214."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.792"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development and investigate the performance of the shoulder launched wall breaching system against reinforced concrete, triple block, and concrete masonry units; complete weapon back-blast simulation methods to address safety concerns about firing in confined urban spaces.  This work will be performed in collaboration with PE 0602618A\/H80, PE 0602105A\/H84, PE 0602624A\/H18\/AH28, PE0603004A\/232, PE 06022303A\/214."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.959"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Text": {
                                                "val": "Will begin to create an integrated modeling and simulation capability to predict the penetration and damage effects from threat weapons. This will enable capability to perform design analysis of new weapon systems for attack of deep buried hardened structures and assessment of current and future force protection technologies. This work is performed in collaboration with PE 0602618A\/H80, PE 0602105A\/H84, PE 0602624A\/H18\/AH28, PE0603004A\/232, PE 06022303A\/214."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Impacts on Sensor Performance (Previously titled - Near Surface Effects)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates physics-based, multiscale numerical models of the geo-environment and synthetic environments representing geo-environment impacts on various sensor modalities and systems.  These enable such things as development of sensors and sensor algorithms for object or target detection, for sensor-target pairing, and for intelligent autonomous navigation and tactical behaviors in unmanned ground systems.  This effort further investigates, designs, and creates non-line-of-site and beyond- line-of-sight sensing and communications for sensors and disadvantaged users in remote areas, including optimizing coupling of sensors to soil for understanding surface and subsurface activities. This effort supports persistent surveillance and detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided novel automated target recognition algorithms for electro-optical, infrared, radar and multi-modal sensors. Developed and validated parameter estimation models to approximate terrain surface properties for false alarm reduction. Integrated sensor perception in unmanned systems for improved autonomous performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide high fidelity models to predict and improve the performance of current and future force sensor systems operating in multiple sensor modalities within complex geo-environmental settings; complete new perception algorithms of terrain to enable adaptive tactical behavior technologies for unmanned ground vehicles; investigate technologies and methods leading to use of sensors above the soil surface with equivalent sensitivity as buried sensors thus allowing for adaptive use in variable environments; research methodologies for characterizing sensor performance in areas where there is limited ground truth data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.014"
                                            },
                                            "Text": {
                                                "val": "Will advance target detection of non-line-of-sight sensor system in soil resulting in reduced installation time as well as improved detection for persistent surveillance capabilities in dense vegetation and turbulent maritime environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NORAD-NORTHCOM Surveillance Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops a physics-based, multi-scaled numerical testbed that provides an enriched virtual environment for evaluating, fusing, and simulating the interaction of local sensors with environmental factors; this effort would also develop high fidelity models to predict and improve performance of current and future force sensor systems for surface, near-surface, and sub-surface target detection within complex geo-environmental settings (solar, weather, soil, vegetation, clutter, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature capability to image subsurface voids, or tunnels, up to thirty feet below surface. Conduct experiments using technologies and sensor fusion capabilities to characterize tunnel features, (such as axes of approach and cross sections) and movement of contraband."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.042"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will continue additional experiments of integrated technologies and sensor fusion capabilities to characterize tunnel features; will develop a physics-based, multi-scaled numerical testbed that provides an enriched virtual environment for evaluating, fusing, and simulating the interaction of local sensors with environmental factors to provide the ability to detect, deny, and aggressively alert Warfighters to clandestine subsurface approaches."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs, and creates rapidly deployable detection, assessment, passive protection and active defensive technology-enabled capabilities to meet critical capability gaps for troops operating remotely at smaller bases or integrated with local communities. The needs at these smaller bases (less than 300 persons, not all U.S. troops) are unique based on constraints in transportability, manpower, organic resources, lack of hardening of structures, resupply, and training for example. Moreover, lack of interoperability and scaleability consume manpower and take away from time to needed to perform missions. Threats include bases being overrun by hostiles; direct fire; rockets, artillery and mortars; and improvised explosive devices. Force protection challenges at these remote, smaller bases include providing increased standoff detection, blast and ballistic protection, and kinetic technologies subject to the constraints mentioned above. This work is coordinated with PE 0603784A\/T08, PE 0603125A\/DF5, PE 0603313A\/G03 and PE 0602786A. Work is performed by Army, Navy and Air Force labs and centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This effort moved from PE 0602784A Project T41 to this Project T40 in FY11. Developed integrated system constructs for base protection technologies at smaller bases that often operate in remote locations or are near\/with local populations and have a less overt security posture.  The integrated designs include interoperable systems that are reliable, transportable by smaller vehicles or sling-load, use minimal power and energy, and have low manpower requirements for set-up and operation.  Technologies pursued address detection of threats, assessment of activities and signals, and passive and active defense capabilities.  Investigated means to increase sensor detection capabilities for layered defense of the operational environment, including electro-optical, infrared, seismic and acoustic.  Developed designs for sustainable power and energy.  This effort moves to PE 0602784A\/T40 in FY12.  These efforts support deployable force protection activities in PE 0603734A, PE 0603313A, PE 062786A, and PE 0603125A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform research to address high priority capability gaps in force protection needs for smaller bases operating in remote areas or integrated with local communities; continue research on previously selected technologies to improve designs based on user assessment and feedback; will design and begin development of an integrated simulation tool for technology exploration and to provide decision support for identifying system improvements.  This work is done in collaboration with PE 0603784A, PE 0603125A, PE 0603313A and PE 0602786A.  This work is performed in PE 0602784\/T41 in FY 11."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.962"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.962"
                                            },
                                            "Text": {
                                                "val": "Will develop significantly improved materials and system designs for rapidly erectable, or constructed, personnel protective systems to decrease logistics (e.g., weight, set up time), increase transportability, and increase protection levels for the next-generation systems; research and develop low-logistics, on-demand structural components for exterior and interior protection of existing structures; integrate and evaluate capabilities to detect, particularly via non-line-of-site, accurately locate, and suppress hostiles across a range of environments; identify extensions for integrated simulation tool and decision support tools for identifying system improvements; continue research on previously selected technologies for improved detection and assessment of threat, passive protection against enemy threats, and active defense to improve design and performance based on user assessment and feedback."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and leverages physics-based computational models and laboratory experiments to understand the relationships between the chemical and micro-structural composition of material and performance characteristics when used in protecting facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.969"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This effort moved from PE 0602784A Project T41 to this Project T40 in FY11. Investigated and developed foundational knowledge of nano- and macro-scale physical, chemical, and mechanical properties of materials as well as understanding of the fate (i.e. movement, binding and degradation) of the materials once in the environment to research and develop designs that scale well for production and manufacturing; this research also focused on composite materials with exceptional properties such as tensile strength and resistance to cracking and penetration; the goal is to increase performance and decrease volume and weight while keeping the environment safe. This work moves to PE 0602784A\/T40 in FY12.  This work is coordinated with Nanotechnology\/Fate and Effects effort in PE 0602720A\/Project 835."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop foundational knowledge of nano- and macro-scale physical, chemical, and mechanical properties of materials for improved performance through computational modeling and laboratory experimental research with focus  on composite and bio-inspired materials with exceptional properties such as tensile strength and resistance to cracking and penetration.  This work is a continuation of work performed in 0602784\/T41 in FY 11, Materials Modeling and is coordinated with ongoing activities in PE 0602720A\/835, Nanotechnology - Environmental Effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.065"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.065"
                                            },
                                            "Text": {
                                                "val": "Will create initial integrated modeling capability for the investigation, design, and advancement of experimental materials and properties for achievement of improved strength and durability at the nano-composite scale (1 to 100nm). This work is coordinated with ongoing activities in PE 0602720A\/835, Nanotechnology - Environmental Effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Integrated Base Defense"
                                    },
                                    "Description": {
                                        "val": "This funding is intended to support the stand-up of a Joint Program Office."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This funding is intended to support the stand-up of a JPO.  The funding is expected to be reprogrammed to a non-S&T PE by FY12 to support the efforts of the JPO."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T41"
                    },
                    "ProjectTitle": {
                        "val": "MIL FACILITIES ENG TEC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.730"
                        },
                        "CurrentYear": {
                            "val": "7.294"
                        },
                        "BudgetYearOne": {
                            "val": "6.433"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.433"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.466"
                        },
                        "BudgetYearThree": {
                            "val": "6.584"
                        },
                        "BudgetYearFour": {
                            "val": "5.766"
                        },
                        "BudgetYearFive": {
                            "val": "5.894"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates technologies and techniques to ensure sustainable, cost efficient and effective facilities and to achieve resilient and sustainable installation and base operations.  The project focuses on facilities and operations technologies directly supporting training, readiness, force projection, force protection, homeland security, and forward base operations.  Facility enhancement technologies contribute to cost reductions in the Army facility life cycle process (infrastructure planning, assessment, design, construction, revitalization, sustainment, and disposal), and the supporting installation operations.  This work improves the ability of installations to support forces to meet transformation goals, improves designs for close battle training facilities, and enhances security of Soldiers, families, and civilians.  Technologies evolving from this work include integrated planning and design tools for US facilities and forward bases, models predicting water dispersed contaminant effects on facilities and occupants; sustainable facility and base management; collaborative decision support tools; and advanced materials.  In addition, technologies from this work will support analysis of socio-cultural and facility issues in forward base operations, including urban environments.  \n\nWork in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-functional materials in support of Defeat of Emerging Adaptive Threats (DEFEAT)"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and develops self healing technologies; evaluates protective systems; and assesses the use of novel materials in multi-functional structural protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluations of multi-layered protective systems and performed protection laboratory assessment; and developed decision tools for user community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete laboratory assessment of material self healing technologies and optimal design methods for composite plates; integrate use of novel materials into multi-functional structural protection systems.  These products will PE transition to 0603734A project T08 supporting Army Technology Objective DEFEAT."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive and Resilient Installations (Previously titled \"Facility Modeling and Simulation\")"
                                    },
                                    "Description": {
                                        "val": "This effort develops sustainable, cost efficient and effective facilities; and provides technologies and techniques for achieving resilient and sustainable installation and base operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed sensor integration sub-models to incorporate into a facility life-cycle model designed to reduce uncertainty in infrastructure costs and maintenance; developed sensor fusion algorithms for facility life-cycle model; conducted evaluations of multi-layered protective systems and protection decision\/assessment tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop a computational framework for expanding to net-centric regional management of facilities with emerging resiliency concepts; design of computer models to facilitate assessment of forward operating base operations to increase effectiveness and efficiency.  This effort is coordinated with efforts in PE 0602720A\/T48 and PE 0602786A\/VT4 and VT5."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "Will develop and validate algorithms and models that represent the complex adaptive systems for energy, water, waste, and protection impacting forward operating base operations.  Will initiate development of interface component models for water, solid waste, and green house gas and integrate them into the net-zero energy (NZE) framework to produce a capability for Installations and regional scale analysis and optimization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social\/Cultural Behavior (Previously titled \"Socio-Cultural Modeling\")"
                                    },
                                    "Description": {
                                        "val": "This effort provides technologies which support analysis of socio-cultural and facility issues in forward base operations, including urban environments.  Technology development efforts will include means to identify dynamic signatures, or indicators, in the socio-cultural realm to assist in estimating or predicting behavioral response to operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.663"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed models relating socio-cultural and cultural geographic factors to human behaviors to inform decision making in Counter-Insurgency Operations, Stability and Support Operations, and nation building; developed means to identify dynamic signatures, or indicators, in the socio-cultural realm to assist in estimating or predicting behavioral response to operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.995"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extend the development of dynamic socio-cultural models for estimating host population response to military operations; will develop information framework linking socio-cultural data to Army tasks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.033"
                                            },
                                            "Text": {
                                                "val": "Will provide computer-aided analysis and reasoning tools and ability to model, simulate and forecast socio-cultural issues and needs. Will predict the perceptions and actions and reactions of indigenous population groups in relation to on-going or planned military operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T42"
                    },
                    "ProjectTitle": {
                        "val": "Terrestrial Science Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.990"
                        },
                        "CurrentYear": {
                            "val": "5.236"
                        },
                        "BudgetYearOne": {
                            "val": "5.101"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.101"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.142"
                        },
                        "BudgetYearThree": {
                            "val": "5.190"
                        },
                        "BudgetYearFour": {
                            "val": "5.167"
                        },
                        "BudgetYearFive": {
                            "val": "5.167"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates the condition and changes to the physical environment brought about by natural and manmade causes, especially those affecting military operations. Further, the investigations identify and quantify the physical environment's effect on personnel, platforms, sensors, and systems in order to develop improved tactics, techniques, procedures, and plans that ensure information superiority, situational awareness, and force projection. To achieve this, both empirical and theoretical approaches seek to forecast terrain properties and processes through various modeling approaches, and link them to planning and decision aids forming new capabilities for the Army.   \n\nWork in this project supports the Army S&T Command, Control, Communications (C3) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Terrain State"
                                    },
                                    "Description": {
                                        "val": "This effort investigates improved numerical modeling of key terrain properties, and exploits them for tactical advantage in terms of mission planning and tactical decision aids.  The goal is to provide Soldiers with an accurate and timely understanding of the battlefield environment's effect on their intended operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.401"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed weather effects physical security sensor planning tool integrated with passive protection systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.012"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporate an optimal sensor placement and selection model including stationary and moving surveillance platforms into the Environmental Awareness for Sensor and Emitter Employment model supporting integration of many different sensors in the battlespace; develop a framework to achieve effective persistent monitoring of targets of interest, ground and airborne, providing timely knowledge of multi-modality sensor performance in dynamic complex weather-affected terrain and adverse weather conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.053"
                                            },
                                            "Text": {
                                                "val": "Will develop a sensor to provide the passive, standoff capability to remotely assess soil state as a function of land use\/condition providing measures of bulk density, mineralogy and soil texture applicable to mobility, targeting, and cultural assessments; investigate combined terrain-atmosphere modeling and image analysis techniques to remotely establish aircraft landing potential in denied areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signature Physics"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the dynamics of electromagnetic, acoustic and seismic signatures in response to changing terrain state and complex terrain features and geometry.  The understanding gained and products developed improve the ability to predict signature (emitter) behavior and sensor performance in complex operational environments, and support materiel development, sensor performance products for tactical decision-making, and visualization for mission planning\/rehearsal."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.589"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Defined normal and anomalous sensor data features (statistical properties) as a function of the geospatial and socio-cultural context; leveraged the Warfighter's understanding of important features and contextual cues; and developed street-level simulation of sensor data across a wide range of modalities and urban terrain contexts to develop signal propagation rules for fusion and anomaly recognition. Developed re-usable, object-oriented, software tools for cross-modality sensor performance modeling, high-level fusion including operational environment context, and emplacement recommendations that can be readily incorporated into Army command and control and terrain analysis systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.224"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop random sampling approaches for uncertainties across multiple sensing modalities and establish quantifiable approaches for the value of increased terrain and weather resolution on signal propagation predictive skill; develop an adequate definition of the soil biology as a function of prevailing conditions, such as soil-water potential and temperature that can be predicted or measured using stand-off techniques supporting emerging developments of bio-inspired persistent standoff sensing capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.048"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.048"
                                            },
                                            "Text": {
                                                "val": "Will develop mission planning tools for combat outpost applications incorporating infrared, visible, and radar multi-modal terrain signature models incorporating weather impacts;  develop and evaluate methods for enhanced bio-sensing surveillance capability applying sensor-vegetation characterization and quantification for bio-affected sensor performance mission planning."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T45"
                    },
                    "ProjectTitle": {
                        "val": "ENERGY TEC APL MIL FAC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.208"
                        },
                        "CurrentYear": {
                            "val": "3.198"
                        },
                        "BudgetYearOne": {
                            "val": "3.209"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.209"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.234"
                        },
                        "BudgetYearThree": {
                            "val": "3.264"
                        },
                        "BudgetYearFour": {
                            "val": "3.222"
                        },
                        "BudgetYearFive": {
                            "val": "3.277"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates technologies necessary for secure, energy efficient, sustainable military installations, emphasizing energy and utility systems protection in response to evolving needs.  Energy technologies and processes are also applied to the Army's industrial base to maintain its cost-effective readiness for munitions production, training, and in the theater of operations to reduce logistical footprint.  This effort provides technologies to protect facility indoor air quality from contaminants such as mold, bacteria and viruses in work and living spaces as well as develops methods to optimize sustainable energy generation and use including integration of renewable energy resources and approaches for the reduction of carbon footprint.   In addition, technologies from this work provide a better understanding of critical infrastructure interdependencies.  \n\nWork in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Response to Threats"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and validates technologies necessary for secure, energy efficient, sustainable military installations, emphasizing energy and utility systems protection from, and in response to, evolving threats such as chemical, biological and radiological attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated sensing ability with encapsulation and re-suspension after freeze drying to assess improving the stability of the complex using chemical preservatives and encapsulation with silica."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive and Resilient Installations (Previously Titled \"Installation Modeling and Simulation\")"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops technologies necessary for energy efficient and sustainable military installations, emphasizing energy and utility systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed a computational framework for non-linear network simulation to predict performance and optimize integration of installation energy systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.198"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature operational user assessment of installations energy systems with a decision support concept; began design on a model for assessment and mitigation of energy losses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.209"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.209"
                                            },
                                            "Text": {
                                                "val": "Will validate thermal models and long term thermal performance prediction of phase change materials and emerging materials for mitigation of energy losses in building envelopes. Will provide to installation planners an operational user assessment decision support tool capability for integrated energy analysis and optimization in support of Net Zero Energy Installations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}