{
    "id": "3df09e32b52a37553e12504ee2ac9f80e84b33c9",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0303140D8Z"
        },
        "ProgramElementTitle": {
            "val": "Information Systems Security Program"
        },
        "R1LineItemNumber": {
            "val": "207"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.658"
            },
            "CurrentYear": {
                "val": "11.352"
            },
            "BudgetYearOne": {
                "val": "11.780"
            },
            "BudgetYearOneBase": {
                "val": "11.780"
            },
            "BudgetYearTwo": {
                "val": "12.163"
            },
            "BudgetYearThree": {
                "val": "12.433"
            },
            "BudgetYearFour": {
                "val": "12.514"
            },
            "BudgetYearFive": {
                "val": "12.741"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The NII Information Systems Security Program (ISSP) provides focused research, development, testing and integration of technology and technical solutions critical to the Defense Information Assurance Program (10 USC 2224) through pilot programs and technology demonstration; investment in high leverage, near-term programs that offer immediate Information Assurance (IA) benefit; federal and multi-national initiatives; and short-term studies and research critical to protecting and defending information systems by ensuring their availability, integrity, authentication, confidentiality, and non-repudiation. These efforts focus on Computer Network Defense (CND) and the restoration of information systems by incorporating protection, detection, analysis and reaction and response capabilities; emerging cryptographic technologies; technology transition and IA research capabilities.  This program is designed to meet the requirements of 10 USC 2224 (Defense Information Assurance Program), 44 USC 3544, (Federal Information Security Management Act of 2002), OMB Circular A-130, and DoD Directives 8500.1, and 0-8530.1. This program is funded under Budget activity 7, Operational System Development because it integrates technology and technical solutions to the Defense Information Assurance Program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.077"
                },
                "CurrentYear": {
                    "val": "11.753"
                },
                "BudgetYearOne": {
                    "val": "11.703"
                },
                "BudgetYearOneBase": {
                    "val": "11.703"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.658"
                },
                "CurrentYear": {
                    "val": "11.352"
                },
                "BudgetYearOne": {
                    "val": "11.780"
                },
                "BudgetYearOneBase": {
                    "val": "11.780"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.419"
                },
                "CurrentYear": {
                    "val": "-0.401"
                },
                "BudgetYearOne": {
                    "val": "0.077"
                },
                "BudgetYearOneBase": {
                    "val": "0.077"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.419"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.077"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.077"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "-0.078"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "SBIR Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "-0.285"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "STTR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.038"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011:  Includes Studies Contractor Efficiency -1.169 million, Service Support Contract Efficiency -0.357 million, Program adjustment -0.419 million.\nFY 2012:  FFRDC reduction -0.078 million, SBIR reduction -0.258 million, STTR reduction -0.038 million.\nFY 2013:   Program Adjustment 0.077 million.\n\nStudies contract Efficiencies will be realized by reducing the number of studies that we participate in while still supporting enterprise-wide information technology goals critical to DoD Mission.\nService Support Contract efficiencies will be realized by reducing the reliance on DoD Service Support Contractors by utilizing in-house government support in a constrained personnel and resource environment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "140"
                    },
                    "ProjectTitle": {
                        "val": "Information Systems Security Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.658"
                        },
                        "CurrentYear": {
                            "val": "11.352"
                        },
                        "BudgetYearOne": {
                            "val": "11.780"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.780"
                        },
                        "BudgetYearTwo": {
                            "val": "12.163"
                        },
                        "BudgetYearThree": {
                            "val": "12.433"
                        },
                        "BudgetYearFour": {
                            "val": "12.514"
                        },
                        "BudgetYearFive": {
                            "val": "12.741"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The NII Information Systems Security Program (ISSP) provides focused research, development, testing and integration of technology and technical solutions critical to the Defense Information Assurance Program (10 USC 2224) through pilot programs and technology demonstration; investment in high leverage, near-term programs that offer immediate Information Assurance (IA) benefit; federal and multi-national initiatives; and short-term studies and research critical to protecting and defending information systems by ensuring their availability, integrity, authentication, confidentiality, and non-repudiation. These efforts focus on Computer Network Defense (CND) and the restoration of information systems by incorporating protection, detection, analysis and reaction and response capabilities; emerging cryptographic technologies; technology transition and IA research capabilities.  This program is designed to meet the requirements of 10 USC 2224 (Defense Information Assurance Program), 44 USC 3544, (Federal Information Security Management Act of 2002), OMB Circular A-130, and DoD Directives 8500.1, and 0-8530.1. This program is funded under Budget activity 7, Operational System Development because it integrates technology and technical solutions to the Defense Information Assurance Program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Systems Security Program Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.658"
                                            },
                                            "Text": {
                                                "val": "• Continued refinement of IA architecture, policy and IA capabilities necessary to support “end-to-end” IA capability for the GIG-including enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support technology demonstration, development and pilots focusing functions required in mid to long term increment of the IA Component of the GIG Architecture.\n\n• Developed central engineering in-depth concept of criticality analysis, and Concept of Operations for leveraging criticality analysis to guide use of intelligence resources to support the DoD trusted defense system strategy (including Software and Hardware Assurance). Applied criticality analysis within USD(AT&L) program protection planning engagements\n\n• Continued refinement of SAST (now called Zanthenon Inductive User Interface) to provide more robust and realistic T&E, training and exercise environment. Improvements include creation of a virtual or “fake” internet, instrumentation to support CEMAT collection capabilities, DoD CAC Engine and new traffic protocols in support of IA joint exercises and the Department’s international exercise program.\n\n• Completed Phase I of Cyber Challenge, the Department’s FY13 annual awareness training product.\n\n• Continued refinement of CND improvements for integration and certification to support interoperability and operational initiatives including additional data feeds, small agency SCAP data collections, authentication and authorization, SCAP remediation standards and continued development\/validation of CND data-standards. \n\n• Provided essential support to DoD Information Assurance (IA) Risk Management (RM) Transformation that included migrating the Defense IA RM process to comply with the mandated Federal (NIST) community RM standards, performing the functions of the DIACAP TAG Secretariat IAW DoD 8510.01, supporting enterprise-wide IA RM automation (eMASS) requirements identification and implementation, and managing DoD's single, virtual, authoritative community of interest for DoD IA RM policies, activities, and initiatives known as the DIACAP Knowledge Service.\n\n• Developed the DoD Mobile Device Strategy and Roadmap, to include policy and IA capabilities necessary to support \"end-to-end\" IA capability for the GIG-including mobile enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support mobile technology demonstrations, development and pilots focused on functions required in mid to long term increment of the IA Component of the GIG Architecture.\n\n• Developed and refined the DoD policy for Digital Persona Protection to include the construction of an implementation plan based on the final policy to support workforce protection awareness, education and training throughout the department.\n\n• Researched and developed DoD policies related to wireless, emerging technologies and mobile computing while to ensure the security standards and policies are implemented with legacy and cutting edge technologies in mind throughout their entire life-cycle.\n\n• Provided IA Mobile Enterprise Services support in the development of DoD-enterprise cloud computing adoption strategy as the DoD Mobile Device Strategy and Roadmap will work in lockstep with the cloud computing strategy.\n\n• Delivered two DoD level signed policies: DoD Instruction 8520.02 \"PKI and PK-Enabling\" and a new DoD Instruction 8520.03- \"Identity Authentication.\"  The new policies commit the Department to adopt the use of PKI-based capabilities internally in business processes and externally with DoD commercial partners and require DoD systems to use stronger authentication solutions, reducing anonymity on DoD networks.  \n\n• Lead the DoD SHA-256 Migration Coordination Cell.  Support development and implementation of the SHA-256 Cryptographic migration plan.  The migration plan directs transitioning the DoD IT infrastructure to support the use of the SHA-256 hash algorithm. \n\n• Developed processes to quickly identify the alignment of DoD Components networks and information systems to a certified and accredited CNDSP in accordance with the Department of Defense Directive (DoDD) 8530.1.\n\n• Evolved and document the assessment methodology for conducting Measures of Effectiveness (MOE) of CNDSPs and apply across the DoD to assess the quality and effectiveness of CND services coverage over specific DoD component networks and information systems.\n\n• Expanded the International Cyber Defense Workshop bi-annual events to cover two time zone and more nations; operationalized IA\/CND relationships with France, Sweden and Poland.\n\n• Developed and circulated of Cloud Security Architecture to compliment the Defense Cloud Strategy\n\n• Continued to assess and design solutions to enhance the resiliency of the GIG, including the analysis of communications paths, and the design of robust DoD systems to withstand sophisticated cyber attacks and cyber outages.\n\n• Continued to develop capabilities to enhance cyber awareness throughout the GIG, including the delivery of enterprise network mapping and leak detection system (ENMLDS) capabilities.\n\n• Lead in the augmentation of the C&A process to leverage the NIST 800-53 security controls, and collaborate with members of the Intelligence Community in the development of cross-community security profiles to aid in the accreditation of systems across the DoD and IC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.352"
                                            },
                                            "Text": {
                                                "val": "• Continue refinement of IA architecture, policy and IA capabilities necessary to support “end-to-end” IA capability for the GIG-including enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support technology demonstration, development and pilots focusing functions required in mid to long term increment of the IA Component of the GIG Architecture.\n\n• Continue to provide essential support to DoD Information Assurance (IA) Risk Management (RM) Transformation that includes migrating the Defense IA RM process to comply with the mandated Federal (NIST) community RM standards, performing the functions of the DIACAP TAG Secretariat IAW DoD 8510.01, supporting enterprise-wide IA RM automation (eMASS) requirements identification and implementation, and managing DoD's single, virtual, authoritative Community of Interest (known as the DIACAP Knowledge Service) for DoD IA RM policies, activities, and initiatives.\n\n• Further develop, refine and deploy criticality analysis in support the DoD trusted defense system strategy (including Software and Hardware Assurance).\n\n• Complete Phases 3 & 4 of the Zanthenon Inductive User Interface (formerly known as SAST) GUI to enhance ease of use and permit independent development, testing and maintenance of T&E, training and exercise scenarios.  Improvements will support joint exercises, the Department’s international exercise program, and capstone events at Service schools.\n\n• Pilot ICDW-like training exercise for DoD agencies.\n\n• Complete Phase II of Cyber Challenge, the Department’s FY 2013 annual awareness training product.\n\n• Automate CEMAT capabilities in the IA Range.\n\n• Develop 508 solution for VTE content.\n\n• Continue refinement of the DoD Mobile Device Strategy and Roadmap, to include policy and IA capabilities necessary to support \"end-to-end\" IA capability for the GIG-including mobile enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support mobile technology demonstrations, development and pilots focusing functions required in mid to long term increment of the IA Component of the GIG Architecture.\n\n• Further develop and refine the DoD policy for Digital Persona Protection to include the construction of an implementation plan based on the final policy to support workforce protection awareness, education and training throughout the department.\n\n• Continue to refine and update DoD policies related to wireless, emerging technologies and mobile computing while to ensure the security standards and policies are implemented with legacy and cutting edge technologies in mind throughout their entire life-cycle.\n\n• Continue to provide IA Mobile Enterprise Services support to further develop and refine the DoD-enterprise cloud computing adoption strategy as the DoD Mobile Device Strategy and Roadmap will work in lockstep with the cloud computing strategy.\n\n• Support and monitor implementation of the SHA-256 Cryptographic migration.\n\n• Provide policy and guidance for the use of Federal PIV and non-Federal PIV-I credentials within the DoD for mission applications and business functions.\n\n• Respond to inquiries from DoD Customers and Information system owners regarding DoD PKI and Identity Management policy and guidance.\n\n• Collaborate with CYBERCOM to develop implementation guidance for DoD PKI and Identity Management policy.\n\n• Improve the International Cyber Defense Workshop virtual environment by moving the portals and SAST to the .mil domain; conclude information sharing agreement with Finland and provide more IA\/CND information in releasable form to all formal international partners (NATO, FVEY, Japan, ROK, Singapore, France, Germany, Poland, Sweden)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.780"
                                            },
                                            "Text": {
                                                "val": "• Develop products and test tools for a comprehensive cybersecurity awareness program.\n\n• Extend ICDW-like training exercises to all DoD agencies.\n\n• Continue Zanthenon GOTS API\/SDK enhancements.\n\n• Continue to provide essential support to DoD Information Assurance (IA) Risk Management (RM) Transformation that includes migrating the Defense IA RM process to comply with the mandated Federal (NIST) community RM standards, performing the functions of the DIACAP TAG Secretariat IAW DoD 8510.01, supporting enterprise-wide IA RM automation (eMASS) requirements identification and implementation, and managing DoD's single, virtual, authoritative Community of Interest (known as the DIACAP Knowledge Service) for DoD IA RM policies, activities, and initiatives.\n\n• Continue refinement of the DoD Mobile Device Strategy and Roadmap, to include policy and IA capabilities necessary to support \"end-to-end\" IA capability for the GIG-including mobile enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support mobile technology demonstrations, development and pilots focusing functions required in mid to long term increment of the IA Component of the GIG Architecture.\n\n• Further develop and refine the DoD policy for Digital Persona Protection to include the construction of an implementation plan based on the final policy to support workforce protection awareness, education and training throughout the department.\n\n• Continue to refine and update DoD policies related to wireless, emerging technologies and mobile computing while to ensure the security standards and policies are implemented with legacy and cutting edge technologies in mind throughout their entire life-cycle.\n\n• Continue to provide IA Mobile Enterprise Services support to further develop and refine the DoD-enterprise cloud computing adoption strategy as the DoD Mobile Device Strategy and Roadmap will work in lockstep with the cloud computing strategy.\n\n• Develop Advanced Persistent Threat (APT) data standards and data collection capabilities\n\n• Pilot NIPRNet – Internet isolation capabilities. \n\n• Expand scope of International Cyber Defense Workshop to include more training modules and expanded IA range capabilities in SAST model; develop web portals for classified FVEY information sharing and methodologies for releasing IA\/CND information to formal partners in near real time."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0303140D8Z"
                                    },
                                    "Title": {
                                        "val": "Information System Security Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "26.043"
                                        },
                                        "CurrentYear": {
                                            "val": "13.772"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.021"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.021"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.947"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.195"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.673"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.576"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "-  Zanethenon improvements available as a core enterprise IA\/CND simulation tool     -   CEMAT effectively supports T&E community data collection, reduction      analysis and reporting.\n     -  508 solution available for VTE content.\n     -  Cyber Challenge used DoD-wide.\n     -  DoD agency CIOs report ICDW-like training exercises are valuable tool to enhance cybersecurity skills of personnel."
                        }
                    }
                }
            ]
        }
    }
}