{
    "id": "3edc70f88b48b861e49bc418fc653a02ac5688c1",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603114N"
        },
        "ProgramElementTitle": {
            "val": "Power Projection Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "125.673"
            },
            "CurrentYear": {
                "val": "114.270"
            },
            "BudgetYearOne": {
                "val": "56.543"
            },
            "BudgetYearOneBase": {
                "val": "56.543"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "45.522"
            },
            "BudgetYearThree": {
                "val": "28.755"
            },
            "BudgetYearFour": {
                "val": "25.475"
            },
            "BudgetYearFive": {
                "val": "26.049"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis program develops and demonstrates advanced technologies, including Em Rail Gun for naval weapon systems.  This Program Element (PE) includes elements of the following Future Naval Capabilities (FNCs); Time Critical Strike, and ForceNet.  Within the Naval Transformation Roadmap, this investment will achieve one of four key transformational capabilities required by Sea Strike as well as technically enable elements of both Sea Shield and Force Net.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "117.908"
                },
                "CurrentYear": {
                    "val": "114.270"
                },
                "BudgetYearOne": {
                    "val": "56.247"
                },
                "BudgetYearOneBase": {
                    "val": "56.247"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "125.673"
                },
                "CurrentYear": {
                    "val": "114.270"
                },
                "BudgetYearOne": {
                    "val": "56.543"
                },
                "BudgetYearOneBase": {
                    "val": "56.543"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.765"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.296"
                },
                "BudgetYearOneBase": {
                    "val": "0.296"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.484"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.119"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.234"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.234"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.530"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.530"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.600"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2911"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "125.673"
                        },
                        "CurrentYear": {
                            "val": "114.270"
                        },
                        "BudgetYearOne": {
                            "val": "56.543"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.543"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.522"
                        },
                        "BudgetYearThree": {
                            "val": "28.755"
                        },
                        "BudgetYearFour": {
                            "val": "25.475"
                        },
                        "BudgetYearFive": {
                            "val": "26.049"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 Activity to a new FNC R2 activities titled, Strike and Littoral Combat Technologies and Sea Strike.  Efforts in this R2 Activity have been continued from FY 2012 to FY 2013 in the new R2 Activities to support all FNC program EC investments and the objective of Precision Strike Technology is the only effort that remains in this R-2 activity effective FY 2013."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Time Critical Strike (TCS) and ForceNet FNC components which address technological issues associated with the development of strike weapons to significantly decrease the launch to engagement timeline; provide the Navy of the future the ability to quickly locate, target, and strike critical targets; and enhance mission capabilities and operational utility of Naval forces by dramatically increasing the autonomy, performance, and affordability of Naval organic Unmanned Vehicle systems. The Navy is furthering the development of solid state high energy laser technology for use as a weapon system on future surface ships."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PRECISION STRIKE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on the development of high speed (Mach 3 to Mach 4+) strike and directed energy technologies which significantly decrease the engagement timeline from multiple sea surface and air launched platforms.\n\nFY2011 to FY2012 reduction is due to the completion of Long Range Anti-Ship Missile (LRASM) Program detailed hardware design, test component and subsystem functionality testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "115.069"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic (EM) Railgun:  \n-Continued development and testing of barrel life components with EM lab launcher expanding to 32 MJ of muzzle energy.\n-Continued development of industry advanced launcher prototypes including delivery and installation at Electromagnetic Launch Facility (EMLF) for government test and evaluation with 100 shot demo and 3 shot burst assessment.\n-Continued development and testing of projectile component concepts at 32 MJ muzzle energy tests.\n-Continued ship integration study efforts.\n-Continued next generation pulsed power concept design.\n-Completed planning phase for FY 2011 final INP Phase I assessment.\n\nLong Range Anit-Ship Missile (LRASM):\n-Completed detailed hardware design.\n-Completed and tested component and subsystem functionality and fit.\n-Continued detailed hardware fabrication\n\nWeapons System Improvement:\n-Continued kill-chain studies to identify and recommend engineering trades to enable weapon system interoperability and data fusion alternatives. These studies will assess engineering feasibility of various kill-chain options and assess the capability provided."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.130"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic (EM) Railgun:  \n-Complete development and testing of single shot barrel life components with EM lab launcher to 32 MJ of muzzle energy including a 100 shot demo.\n-Complete development of industry advanced launcher prototypes including delivery and installation at EMLF facility for government test and evaluation with 100 shot demo.\n-Continue development and testing of projectile component concepts at 32 MJ muzzle energy tests.\n-Continue ship integration study efforts.\n-Complete next generation single shot pulsed power concept design.\n-Complete final INP Phase I assessment of industry advanced launcher prototypes assessments.\n-Initiate next generation industry rep rate launcher development and test planning.\n-Initiate next generation rep rate pulsed power fabrication in support of future rep rate launcher testing.\n\nLong Range Anit-Ship Missile (LRASM):\n-Initiate and complete fabrication of flight hardware.\n-Initiate and complete launch canister expulsion tests.\n-Initiate and complete booster separation flight tests.\n-Initiate and complete integrated flight tests.\n\nWeapons System Improvement:\n-Continue all efforts of FY 2011."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.543"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.543"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic (EM) Railgun:  \n-Continue development and testing of projectile component concepts at 20-32 MJ muzzle energy tests including guidance and navigation, warhead, and aerodynamic flight body.\n-Continue ship integration study efforts including system performance, quantification of intermediate battery energy store, system trades, ship platform sizing studies, and hull, mechanical and electrical (HM&E) impacts.\n-Complete next generation industry rep rate launcher conceptual\/feasibility design.\n-Continue next generation pulsed power concept design and fabrication in support of rep rate launcher testing including fabrication of a portion of a multi-module, multi-year build towards a full scale rep-rate capability.\n-Initiate fabrication of rep rate lab launcher for testing of barrel life components\n-Initiate next generation industry rep rate launcher preliminary design.\n-Initiate component fabrication and testing of repetitive firing rate barrel life with EM lab launcher at tactically relevant muzzle energy.\n\nWeapons System Improvement:\n-Continue all efforts of FY 2012.\n\nSolid State Laser Technology Maturation Program (SSL-TMP):\n-Initiate development of a maritime beam director through competitive procurement, which will be capable of supporting missions such as small boat, UAV, and ISR disruption and defeat.  This work will include Laser Beam Director scientific and engineering trade studies, including the development of a demonstration system which will take the output from a suitable high power, solid state laser (SSL) and track and maintain aim point over a stand-off distance through the maritime environment which includes atmospheric absorption and turbulence.\n-Evaluate at least one maritime beam director design through competitive procurement of selected subsystem parts.  \n-Initiate and conduct initial testing for subcomponents needed for a maritime beam director obtained through competitive procurement.\n-Initiate Laser System Interface scientific and engineering trade studies, examining the various types of solid state, as well as other laser types. Efforts in this area will focus on the technologies that are suitable for developing a common interface, suitable for use by solid state slab, and solid state fiber optic laser systems - to permit industrial as well as scientific advancements to continue improving overall systems performance.\n-Initiate laser lethality studies of laser erosion, pitting, and ablation in order to develop understanding of power requirements and related requirements for a beam director and targeting system capable of performing Navy surface ship self defense missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STRIKE AND LITTORAL COMBAT TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The focus of this activity is on those technologies that will support the Naval Precision Strike Operations and provide the Navy of the future the ability to quickly locate, target, and strike critical targets. This activity includes support to the following FNC Enabling Capabilities (ECs): Advanced Naval Fires Technology, Hostile Fire Detection and Response, Dynamic Target Engagement & Enhanced Sensor Capabilities, and Discriminate and Provide Terminal Guidance for Weapons Targeted at Moving Targets.\n\nFY 2011 to FY 2012 funding increase is due to the initiation of High Energy Fiber Laser System and due to increases in multiple FNC Demonstration Program investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.604"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Discriminate and Provide Terminal Guidance for Weapons Targeted at Moving Targets:\n-Completed Weapon Data Link project by demonstrating the performance capability of the system and the architecture developed under the project.\n\nIncreased Capability Against Moving and Stationary Targets:\n-Continued the Direct Attack Seeker Head (DASH) project to drive down seeker cost during the procurement and test of the infrared imaging seeker components.\n-Continued Multi-Mode Sensor\/Seeker (MMSS) project to conduct a Critical Design Review (CDR) and initiate the build of a common aperture Laser Radar (LADAR) and infrared sensor system.\n-Initiated research for advanced optical techniques to enable multiple simultaneous target designation in order to defeat multiple simultaneous targets or SWARM attacks.\n-Initiated Strike Accelerator program. This effort will provide an advanced airborne capability to accurately identify targets using Advanced Target Recognition (ATR). These capabilities utilizing the F\/A-18 E\/F, AESA (Active Electronically Scanned Array) Radar and ATFLIR (Advanced Targeting Forward Looking Infrared) sensors will enable Strike Aircraft to quickly ID and Target maritime threats.\n\nSelectable Output Weapon:\n-Initiated Selectable Output Weapon Sea Strike Project. This project will develop and integrate new technologies to enable real-time selection of a munitions energetic output.\n\nEnhanced Weapon Technologies:\n-Continued three new products to address short-falls in current Counter Air (CA) and Counter Air Defense (CAD) capabilities by providing improved range and end-game maneuverability while decreasing Time-of-Flight.\n-Continued definition and documentation of system level requirements for airframe, thrust level, insensitive-munitions and safety\/reliability for CA Advanced Mid-Range Air-to-Air Missile (AMRAAM) Improvements.\n-Continued definition and documentation of system level requirements for CAD.\n-Continued definition and documentation of system level requirements for High Speed Components.\n-Initiated development of advanced technologies that support delivery of Navy approved FNC enabling capabilities structured to close operational capability gaps in power projection.\n-Initiated package advanced power projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period.\n-Initiated mature power projection technologies that support naval requirements identified within the Sea Strike and FORCEnet naval capability pillars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.640"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increased Capability Against Moving and Stationary Targets:\n-Continue all efforts of FY 2011.\n\nEnhanced Weapon Technologies:\n-Continue all efforts of FY 2011.\n\nSelectable Output Weapon:\n-Continue all efforts of FY 2011.\n\nStrike Accelerator:\n-Continue all efforts of FY 2011.\n\nMulti-Target Laser Designator:\n-Continue all efforts of FY 2011.\n\nHigh Energy Fiber Laser System:\n-Initiate development of an advanced laser weapon subsystem for demonstration on an air-borne platform. This system will provide the detection and defeat of current and future threats.\n-Initiate development of advanced technologies that support delivery of Navy approved FNC enabling capabilities structured to close operational capability gaps in power projection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DATA DECISION TOOLS"
                                    },
                                    "Description": {
                                        "val": "The Navy is furthering Decision Making Tools in the following areas:\n\n1)  Data to Decision: The Navy is performing a series of limited technology experiments (LTE) identifying issues to enable the integration of combat systems and C2 systems to enable rapid, accurate decision making.  These experiments are integrating S&T capabilities directly into current combat systems and SOA C2 systems.  This is a joint series of experiments with the AF and Army including Navy PEO IWS and PEO C4I which will lead to transition directly into the Advanced Capability Builds 12 - 16 for the IWS POR and into CANES for PEO C4I POR.  In FY2012, Navy will continue work associated with the LTEs and perform integrated prototype testing in a more operational environment.\n\n2)  Autonomy and Data to Decision: This Navy effort involves integrated reverie and land scenarios.  The objective is to develop autonomous networked sensor systems (disparate platforms and sensors) that significantly reduce (objective eliminate) human system management and analysis to enable small forces such as Navy reverie expeditionary teams to focus on the execution of missions with significant sensor support. Currently mission execution is limited by the number of people that have to be engaged in sensor management and analysis.  Autonomous Data to Decision capability is also adaptable to autonomous sensor networks in support of forward operating base protection.  More funds in the first year would enable a much richer diversity of sensors, platforms, and automated analysis techniques."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiate and complete an integrated prototype testing in a operational environment for the integration of combat systems and C2 systems to enable rapid, accurate decision making.\n-Initiate and complete futhering diversity of sensors, platforms and automated analysis techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CYBER SECURITY ARCHITECTURE"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Architecture effort will establish a prototype environment that be used to integrate the results of numerous ongoing S&T efforts to build a cyber security architecture of ever increasing capability There are a number of strategies that have been taken to help mitigate cyber attacks.  This effort is aimed at developing an integrated approach that draws on these different strategies and enables new concepts to be brought into the integrated approach.  The key is developing a highly flexible architecture. The overarching approach is to providing integrated and modularized cyber defense platform with built-in multiple levels of intelligence for controlling and acting against known and new cyber attacks. The platform encompasses all levels of hierarchy and abstraction of cyber infrastructure, and allows for all cyber defense techniques to efficiently and synergistically co-exist, providing maximum collective coverage against cyber attacks and enhancing mission assurance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiate and complete a Cyber Security Architecture prototype environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW\/EP MODELING"
                                    },
                                    "Description": {
                                        "val": "Electronic Warfare\/Electronic Protection (EW\/EP) Technology Development, Modeling and Implementation:  Research in this activity addresses EW battle space management.  Project goal is to develop technology that will utilize EW for platform \/ task force protection through the integration of EW into a networked coherent structure to provide better fleet defense, and develop techniques to deny the enemy the effective use of their sensors to do battle space awareness and targeting by creating a distorted battle space picture. This effort also continues EP modeling and implementation improvements by funding upgrades to hardware and software required for the characterization of platforms, contribute to modeling and simulation of implementable solutions, and technology validation through flight demonstrations of those solutions.  EP upgrades scheduled for transition to the platform program offices in FY 2013 and FY 2014."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiate and complete integration of EW into a networked coherent structure to provide better fleet defense.\n-Initiate and complete development of EP techniques to deny enemy battlespace awareness.\n-Initiate and complete upgrades for improved EP modeling and simulation and for EP technology validation and transition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The metrics used are programmatic milestones and technical milestones such as flight test and testing of projectile concepts for technical demonstration programs; Technology Transition Agreements (TTAs) which are agreements between the Office of Naval Research and an acquisition program office to transition FNC 6.3 technologies into an acquisition program."
                        }
                    }
                }
            ]
        }
    }
}