{
    "id": "3f4c165166abaab2dd295fe92ac9df64aca2a5cf",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603728A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Demonstrations"
        },
        "R1LineItemNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.417"
            },
            "CurrentYear": {
                "val": "15.934"
            },
            "BudgetYearOne": {
                "val": "13.626"
            },
            "BudgetYearOneBase": {
                "val": "13.626"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "13.299"
            },
            "BudgetYearThree": {
                "val": "14.157"
            },
            "BudgetYearFour": {
                "val": "13.801"
            },
            "BudgetYearFive": {
                "val": "13.867"
            }
        },
        "ProgramElementNote": {
            "val": "Not applicable for this item"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates technologies that assist Army installations in becoming environmentally compatible without compromising readiness or training critical to the success of the future force.  Project 002 demonstrates tools and methods for compliance with environmental laws by control, treatment, and disposal of hazardous waste products; and conservation of natural and cultural resources while providing a realistic environment for mission activities. Project 025 demonstrates pollution prevention tools and methods to minimize the Army's use and generation of toxic chemicals and hazardous wastes.  Project 03E focuses on restoration of sites contaminated with toxic and\/or hazardous materials (such as unexploded ordnance) resulting from Army operations. This program demonstrates technological feasibility, assesses the technology as well as its producibility, and transitions mature technologies from the laboratory to the user.  Technologies developed by this program element improve the ability of the Army to achieve environmental restoration and compliance at its installations, at active\/ inactive ranges and other training lands, and at its rework as well as production facilities.  Technologies demonstrated focus on reducing the cost of treating hazardous effluents and remediating Army sites contaminated by hazardous\/toxic material.    \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nThis program is fully coordinated and complementary to PE 0602720A (Environmental Quality Technology).\n\nWork in this PE is performed by the US Army Engineer Research and Development Center, Vicksburg, MS, and the US Army Research, Development, and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.878"
                },
                "CurrentYear": {
                    "val": "15.959"
                },
                "BudgetYearOne": {
                    "val": "14.027"
                },
                "BudgetYearOneBase": {
                    "val": "14.027"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.417"
                },
                "CurrentYear": {
                    "val": "15.934"
                },
                "BudgetYearOne": {
                    "val": "13.626"
                },
                "BudgetYearOneBase": {
                    "val": "13.626"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.461"
                },
                "CurrentYear": {
                    "val": "-0.025"
                },
                "BudgetYearOne": {
                    "val": "-0.401"
                },
                "BudgetYearOneBase": {
                    "val": "-0.401"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.279"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.401"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.401"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.182"
                                },
                                "CurrentYear": {
                                    "val": "-0.025"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "ENVIRONMENTAL COMPLIANCE TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.083"
                        },
                        "CurrentYear": {
                            "val": "4.687"
                        },
                        "BudgetYearOne": {
                            "val": "2.314"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.314"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.274"
                        },
                        "BudgetYearThree": {
                            "val": "2.798"
                        },
                        "BudgetYearFour": {
                            "val": "2.313"
                        },
                        "BudgetYearFive": {
                            "val": "2.272"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology), Projects 048 and 896, that assist Army installations in achieving environmental compliance.  These technologies reduce the cost of treating hazardous effluents from Army installations, including forward operating bases, to satisfy increasingly stringent waste, wastewater and air pollutant discharge requirements.  Army facilities are subject to fines and facility shutdowns for violation of federal, state, and local environmental regulations.  This technology is essential to control and reduce the generation of waste to satisfy hazardous waste reduction goals and to avoid future environmental costs as well as liabilities to the Army.  Efforts under this project enable the Army to reduce environmental constraints at installations while complying with the myriad of federal, state, and host country environmental regulations and policy.  Technologies demonstrated also reduce the cost of resolving training noise compliance issues for the Army, avoid reductions in availability of training facilities, and sustain the viability of testing and training ranges as well as protect the critical resources, i.e., land, air, and waters of the Army.  \n\nWork in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy, and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands (Previously Titled - Installation Operations)"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment and ecosystem analysis, monitoring, modeling and mitigation technologies to support sustainable use of the Army's ranges and lands.  This effort demonstrates environmentally safe and cost effective technologies to manage and reduce the increase in noise and pollution concerns associated with training ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.083"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed integration of cell-based sensor components and initiated performance evaluation phase for field assessment of perchlorate and lead.  Initiated demonstration of noise mapping software utilizing real-time meteorology to enable the Army's Operational Noise Program and Sustainable Range Program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate a cell-based, field portable sensor design for real time analysis to detect and quantify or evaluate toxicity of water; mature noise assessment models corrected to adequately reflect discrete noise events, local community response to training noise metrics, and continuous noise mapping software to ensure compliance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.314"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.314"
                                            },
                                            "Text": {
                                                "val": "Will complete development, demonstration and validation of a field portable sensor for detection of hazardous and toxic compounds in water including heavy metals, perclorate and general toxicity; complete development, testing and demonstration of smart cell sensors for intracellular markers of toxicity and stress, interdigitated electrode arrays (IdEA) for measuring cell membrane integrity, and biomarker detection systems for sensing extracellular signs of damage; test and validate results using real world field samples for incorporation into final portable sensor hardware component and system design specifications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "025"
                    },
                    "ProjectTitle": {
                        "val": "POLLUTION PREVENTION TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.527"
                        },
                        "CurrentYear": {
                            "val": "3.712"
                        },
                        "BudgetYearOne": {
                            "val": "3.720"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.720"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.399"
                        },
                        "BudgetYearThree": {
                            "val": "3.853"
                        },
                        "BudgetYearFour": {
                            "val": "4.020"
                        },
                        "BudgetYearFive": {
                            "val": "4.089"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates pollution prevention advanced technologies required for sustainable operation of Army weapon systems, to include compliance with regulations mandated by federal, state, and local environmental and health laws.  Technology thrusts under this project include demonstration of advanced technologies to enable sustainment of propellant, explosive and pyrotechnic production and maintenance facilities and training ranges through elimination or significant reduction of environmental impacts.  These technologies will ensure that advanced energetic materials required for future force's high performance munitions are developed that meet weapons lethality and survivability goals and that are compliant with environmental and health laws.  \n\nWork in this project supports the Army S&T Enduring Technologies Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nThe project is fully coordinated and complementary to PE 0602720A, Project 895.  This project transitions technologies developed under that PE.\n\nWork in this project is performed by the Research, Development, and Engineering Command the Army Research Laboratory, Aberdeen Proving Ground, MD, the Armaments Research, Development, and Engineering Center, Picatinny Arsenal, NJ, and the Aviation and Missile Research, Development, and Engineering Center, Redstone Arsenal, AL in conjunction with the Army Public Health Command (Provisional), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates pollution prevention advanced technologies required to sustain operation of Army weapons systems to comply with state, federal, and local environmental and health laws and regulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.527"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Rocket and Missile Propellants: developed flight-scale hardware for hydrazine and ammonium perchlorate replacement rocket motors; Conventional Ammunition: performed material qualification evaluation and assessed performance of representative compositions for eventual transition into an end-item; Pyrotechnics: demonstrated a perchlorate-free countermeasure in a relevant end-item."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Rocket and Missile Propellants: finalize design of flight-scale hardware and prepare to conduct flight performance evaluation; Conventional Ammunition: refine and optimize compositions in a relevant end item; Pyrotechnics: integrate flare, delay and signal formulations into system prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.720"
                                            },
                                            "Text": {
                                                "val": "Rocket and Missile Propellants: will qualify and test lead-free propellant in 2.75-inch Hydra rocket system; Conventional Ammunition: will initiate insensitive munitions testing on environmentally benign formulation in relevant end item; Pyrotechnics: will integrate high nitrogen materials into pyrotechnic signal prototypes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03E"
                    },
                    "ProjectTitle": {
                        "val": "ENVIRONMENTAL RESTORATION TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.807"
                        },
                        "CurrentYear": {
                            "val": "7.535"
                        },
                        "BudgetYearOne": {
                            "val": "7.592"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.592"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.626"
                        },
                        "BudgetYearThree": {
                            "val": "7.506"
                        },
                        "BudgetYearFour": {
                            "val": "7.468"
                        },
                        "BudgetYearFive": {
                            "val": "7.506"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology), Projects 835 and 896 that improve the Army's ability to achieve cost-effective environmental restoration and management of contamination resulting from Army training or operations at its installations, active and inactive ranges, its rework and production facilities, in operations and on the battlefield.  Advanced development activities address the management\/mitigation of materials released to the natural environment and residual environmental effects of military training and operations.  The emphasis of this effort includes restoration of legacy materials, e.g., traditional explosives energetics, and unexploded ordinance; management of new materials, e.g., nanomaterials and emerging contaminants; and mitigation of residual impacts from implementation of sustainable technologies and processes.  Technologies matured within this project enable the Army to cost effectively address current and future environmental liabilities resulting from the use of militarily relevant materials in the environment and implementation of the new family of sustainable technologies for energy production.  Current and planned efforts enable the Army to efficiently characterize, evaluate, assess, and remediate soil and water at installations, ranges, facilities, and during operations in the face of changing weather and climatic conditions.  Efforts also identify ways to economically comply with the myriad of federal, state, and host country regulations dealing with contaminated soil and water.  A key aspect of this work is the enhancement of risk assessment and life cycle analysis techniques that can more accurately display the environmental liabilities associated with fielding new systems and technologies.  This program includes pilot scale field studies to establish technological feasibility and assess performance and productivity of the risk assessment techniques.  \n\nWork in this project supports the Army S&T Enduring Technologies Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unexploded Ordnance (UXO)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an active range ordnance impact assessment and positioning system in relevant environments and provides technologies for automated UXO removal. This effort also develops real time detection and discrimination methodologies for unique and emerging UXO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.362"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed performance characterization of UXO related range maintenance technologies; completed identification and characterization of unique and emerging UXO; completed protocols for implementation of adaptive, real time UXO detection, remediation, ordnance impact and monitoring; developed detection and discrimination methodologies for unique and emerging UXO; continued working on adaptive, real time UXO detection and remediation methodologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.333"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate the active range ordnance impact assessment and positioning system in a relevant environment; continue development of real time detection and discrimination methodologies for unique and emerging UXO."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.406"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.406"
                                            },
                                            "Text": {
                                                "val": "Will mature emergent technology in smart sensors and real time assessment of UXO discrimination for enhanced range maintenance, sustainability and construction support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hazard\/Risk Assessment Tools for Toxicity of Munitions Constituents (MCs)"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools to assess hazard and risk of munitions constituents. The tools provide rapid screening assessments of existing and future military relevant compounds and allow for improved predictive risk assessment and provide environmental life cycle assessment capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.445"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed construction of a computational biology tool for predictive toxicology; defined hydraulic, biological, geophysical, and chemical models for integration into a training range environmental evaluation and characterization system; identified approaches for environmental life-cycle assessment of nanomaterials to support advanced Warfighter technologies development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide a beta-version of computational tool for predictive toxicology for user review that implements ab initio quantum chemical and molecular dynamics approaches to aid in the prediction of sorption properties of MCs and emerging contaminants; mature and demonstrate tools for rapid, standardized, and quantitative measurement of effects and toxicity from current MCs using toxicogenomics and computational biology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.306"
                                            },
                                            "Text": {
                                                "val": "Will provide novel screening assays for neurotoxicity and reproductive toxicity, and predictive models integrated with toxicology and genomic screening protocols; continue to mature the computational tool for rapid and reliable forensic and predictive assessment of munitions constituents, providing risk evaluation capability designed to meet Army needs for proactive land management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Green Remediation Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and matures technologies to control contaminant transport in environmental media on training ranges and Army lands as well as assess and demonstrates novel detection, remediation and mitigation capabilities for depleted Uranium and other emerging contaminants on Army lands."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess and mature bioreactor technologies for control of contaminant transport in soil on training ranges; assess and demonstrate novel detection capabilities for depleted Uranium on Army lands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.941"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.941"
                                            },
                                            "Text": {
                                                "val": "Will determine effectiveness of green remediation technologies on munitions constituents and select appropriate field sites for validation; predict the effects of landscape contouring and identify optimal placement of treatment systems to ensure the selection of efficient and cost-effective treatment designs; incorporate terrestrial animal uptake values, contaminant flow in food webs, as well as the effects of stabilization and removal activities on uptake and toxicity of depleted Uranium in ecological risk assessment models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Prediction and Mitigation Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates capabilities to anticipate and adapt to multiple environmental related stressors to military installations and training lands in the face of changing weather and climatic conditions"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.939"
                                            },
                                            "Text": {
                                                "val": "Will mature a decision framework and screening assessment tool to evaluate multi-stressor climatic change impacts to vulnerable Army installations based on mission critical criterion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}