{
    "id": "4381676a56df7995a50bb25eb7b6dcf28a5b12ed",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303166D8Z"
        },
        "ProgramElementTitle": {
            "val": "Support to Information Operations Capabilities"
        },
        "R1LineItemNumber": {
            "val": "173"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.604"
            },
            "CurrentYear": {
                "val": "11.771"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program is part of the Defense Department’s coordinated effort to integrate Information Operations (IO), Cyber, and Intelligence Operations Integrations (IOI) test and evaluation capabilities to assess IO, Cyber, and IOI technologies and tactics in a representative operational environment against realistic targets.  The Defensewide IO Program Review revalidated the need for a suite of automated data analysis and decision support software tools to facilitate joint-IO.  The advent of critical Cyberspace Operations mandate Cyber Technologies be assessed in a like environment.  In addition, joint warfighter requirements are driving the need for the integration of intelligence and operations capabilities\/capacities.  This program enables users to accomplish Joint Intelligence Preparation of the Operational Environment (JIPOE), develop effective IO, Cyber, and operational strategies and candidate campaign targets, plan missions, and monitor and assess execution of operations.  The objectives of this program are to create a flexible, seamless and persistent environment enabling Combatant Commanders to achieve the same level of confidence and expertise in employing IO and Cyber capabilities that they have in kinetic weapons; to lead the development of joint IOI capabilities and capacity that facilitate operational and intelligence planning activities by the Services and COCOMs; and to transform IO, Cyber, and IOI activities to support  joint IO training, education, and exercises."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "31.500"
                },
                "CurrentYear": {
                    "val": "12.209"
                },
                "BudgetYearOne": {
                    "val": "11.630"
                },
                "BudgetYearOneBase": {
                    "val": "11.630"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.604"
                },
                "CurrentYear": {
                    "val": "11.771"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.896"
                },
                "CurrentYear": {
                    "val": "-0.438"
                },
                "BudgetYearOne": {
                    "val": "-11.630"
                },
                "BudgetYearOneBase": {
                    "val": "-11.630"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.081"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.610"
                    },
                    "CurrentYear": {
                        "val": "-0.357"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Department adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-11.630"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.630"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.277"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds were realigned to Joint Staff due to JFCOM closure."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "IO Range"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.780"
                        },
                        "CurrentYear": {
                            "val": "8.700"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Military Strategy of the United States stresses the importance of integrating Information Operations (IO) capabilities for the success of Joint Operations and Decision Superiority.   The Defense-Wide IO Program Review revalidated a requirement for an integrated range supporting “exercises, testing, and development of IO capabilities.”  Further direction by the Office of the Secretary of Defense (OSD) identified the need for an “integrated IO test and evaluation capability to assess IO technologies and tactics in a representative operational environment against realistic targets.” The 2006 National Security Strategy identifies \"Strengthen Alliances to Defeat Global Terrorism and Work to Prevent Attacks Against Us and Our Friends\", which involves significant Information Operations (IO) and Cyber operations as a goal.  Through the Defense Planning Guidance (DPG) and the Integrated Priority Lists, COCOMs repeatedly state the need to expand IO\/Cyber training and education for the developing cadre of IO\/Cyber professionals and provide an environment for analysis, testing, training, combat assessments, and measures of effectiveness for more reliable IO\/Cyber capabilities.  Deputy Secretary of Defense Memorandum on the IO Range established the requirement for creating a cooperative IO range among the Military Services.  \n\nThe IO Range provides a secure, flexible, and seamless environment for the Military Services and Joint warfighters to test, train, develop tactics, and exercise selected IO\/Cyber capabilities.  The basis of the functional structure of the IO Range is the integration of existing ranges, laboratories, information warfare centers, and other Government facilities that currently support IO\/Cyber test, training, exercise, and experimentation events.  Capabilities at the selected sites are securely connected and integrated into the IO Range.  A key feature of this concept is a persistent, secure connection that links the sites together, allowing the exchange of data and the visualization of effects as we employ capabilities.  Creation of a “virtual range” based on persistent connections significantly reduces the amount of lead-time required to set up each new warfighter event.  The long-term goal for the IO Range is to be a full spectrum IO\/Cyber Range supporting: operations security (OPSEC), computer network operations (CNO), electronic warfare (EW), military information support operations (MISO), and military deception (MILDEC).  This environment enables the  warfighters to visualize non-kinetic weapons effects, understand the intricate and interactive effects generated by kinetic and non-kinetic weapons and achieve the same level of confidence and expertise in employing IO\/Cyber capabilities as they have with kinetic capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "IO Range"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.780"
                                            },
                                            "Text": {
                                                "val": "- Developed, tested and evaluated IO Range concepts during events based on a list of prioritized requirements and available funding. \n- Evolved full spectrum IO and Cyber towards full range of capabilities to include Computer Network Operations, EW, Deception, and other related targets.\n- Implemented IO and Cyber capabilities at field sites.  This continuing effort supports progress toward reaching full capability in which more than 90 persistent IO Range sites will be connected and integrated for IO Range use."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.700"
                                            },
                                            "Text": {
                                                "val": "- Develop, test and evaluate IO Range concepts during events based on a list of prioritized requirements and available funding. \n- Move toward full spectrum IO and Cyber and evolve with the addition of a more robust set of targets.  \n- Implementation of IO and Cyber capabilities at field sites.  This continuing effort supports progress toward reaching full capability in which more than 90 persistent IO Range sites will be connected and integrated for IO Range use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The IO Range continues to deploy additional nodes.  The acquisition, management, and contracting strategy follows guidance outlined in DoD 5000 series directives, Federal Acquisition Regulation (FAR), and FAR supplement policies and procedures.  Management uses project management tools and meetings to ensure delivery of stated capabilities performance criteria."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to time, money, realism, and fidelity as defined below:\n\n• Time – Will enable the warfighter to speed up processes faster than current capabilities allow.\n• Money –  Will enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities will allow.\n• Realism – Will enable the warfighter to create an environment that is closer to the real world environment than current capabilities will allow. \n• Fidelity – Will ensure unity of efforts throughout the IO, Cyber, and IOI Communities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "IO Capability Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.260"
                        },
                        "CurrentYear": {
                            "val": "3.071"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports new and cutting-edge operational activities that address the issues of rapidly changing technology and the complex inter-relationships associated with data exchange and analysis.  This includes support of data analysis tools for assessment of machine-based and electromagnetic spectrum-based information transmittal."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "IO Capability Activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.260"
                                            },
                                            "Text": {
                                                "val": "- Improved packing and collaboration of data analysis and tracking.\n- Transitioned technology projects.\n- Pursued emergent, cutting-edge IO, cyber, and IOI technologies to meet warfighter requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.071"
                                            },
                                            "Text": {
                                                "val": "Support development of IO, cyber and IOI cutting-edge capabilities that support COCOMs and Services executing operations during current and future conflicts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "IO Capability Activities acquisition, management, and contracting strategy follows guidance outlined in DoD 5000 series directives, Federal Acquisition Regulation (FAR), and FAR supplement policies and procedures.  Management uses project management tools and meetings to ensure delivery of stated capabilities performance criteria."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to time, money, realism, and fidelity as defined below:\n\n• Time – Effort will enable the warfighter to speed up processes faster than current capabilities allow.\n• Money – Effort will enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities will allow.\n• Realism – Effort will enable the warfighter to create an environment that is closer to the real world environment than current capabilities will allow.\n• Fidelity – Effort will ensure unity of efforts throughout the IO, Cyber, and IOI Communities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "VisIOn"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.564"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Virtual Support for the Information Operations Environment (VisIOn) project was the DoD primary Joint IO\/Cyber decision support system for analysis, planning, and assessment of IO and Cyber operations.   Components of the VIsIOn project will be transitioned to the Defense Intelligence Information Enterprise Framework."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "VIsIOn"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.564"
                                            },
                                            "Text": {
                                                "val": "Transitioned components of the Virtual Integrated Support for the Information Operations Environment (VIsIOn) to the Defense Intelligence Information Enterprise Framework."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The VIsIOn  acquisition, management, and contracting strategy follows guidance outlined in DoD 5000 series directives, Federal Acquisition Regulation (FAR), and FAR supplement policies and procedures.  IOII efforts acquire and sustain capabilities, systems, tools, products, and services through an acquisition process that is responsive and responsible to internal and external customers and stakeholders."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to time, money, realism, and fidelity as defined below:\n\n• Time – Effort will enable the warfighter to speed up processes faster than current capabilities allow.\n• Money – Effort will enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities will allow.\n• Realism – Effort will enable the warfighter to create an environment that is closer to the real world environment than current capabilities will allow.\n• Fidelity – Effort will ensure unity of efforts throughout the IO, Cyber, and IOI Communities."
                        }
                    }
                }
            ]
        }
    }
}