{
    "id": "446841a34133ee7e6db1fa0cea404e44e5e8ebb9",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V2_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604602F"
        },
        "ProgramElementTitle": {
            "val": "Armament\/Ordnance Development"
        },
        "R1LineItemNumber": {
            "val": "70"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.659"
            },
            "CurrentYear": {
                "val": "7.755"
            },
            "BudgetYearOne": {
                "val": "9.951"
            },
            "BudgetYearOneBase": {
                "val": "9.951"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "7.078"
            },
            "BudgetYearThree": {
                "val": "5.720"
            },
            "BudgetYearFour": {
                "val": "5.879"
            },
            "BudgetYearFive": {
                "val": "5.957"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Armament Ordnance Development program provides for initial and continuing development of weapons\/munitions (kinetic and non-kinetic) and munitions equipment for support and operational use.  This PE develops and improves the following weapons and weapons subsystems:  bombs, bomb fuzes, insensitive explosive fills (Insensitive Munitions - IM), aircraft ammunition, stores-aircraft interface upgrades to include the Universal Armament Interface (UAI), directed energy technology transition to weapons, munitions materiel handling equipment (MMHE), munitions containers, and other weapon subsystems.  \n- Armament Subsystems:  This project develops and improves conventional weapons\/munitions (kinetic and non-kinetic) and fuzes.  The project also provides an opportunity to quickly insert emerging technologies into existing and developing aircraft munitions.  The project provides for research, development, and testing of medium caliber ammunition and enterprise management of guns, ammunition, and Munitions Materiel Handling Equipment (MMHE) systems integration and testing to ensure tested and certified medium caliber ammunition is provided to users.  The project helps the AF meet Insensitive Munitions (IM) compliance through strategic planning, development of insensitive explosive fills, and bomb case modifications to make weapons insensitive to unplanned stimuli.   Armament Standardization\/Control\/Munitions Materiel Handling Equipment (MMHE) is a continuing project to develop and improve the standardization and commonality of munitions handling and armament equipment to preclude duplication.  This project also funds the operation of the tri-service Container Design Retrieval System (CDRS), maintaining a container database to preclude proliferation and duplication of munitions containers and supporting organic container design.\n- Stores-Aircraft Interface: This project conducts stores-aircraft interface upgrades and standards development to include the Universal Armament Interface (UAI).  UAI is an Air Force initiative to develop standardized software interfaces in aircraft, weapons and mission planning to support integration of weapons independent of aircraft Operation Flight Program (OFP) cycles.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and munufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.693"
                },
                "CurrentYear": {
                    "val": "10.055"
                },
                "BudgetYearOne": {
                    "val": "9.933"
                },
                "BudgetYearOneBase": {
                    "val": "9.933"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.659"
                },
                "CurrentYear": {
                    "val": "7.755"
                },
                "BudgetYearOne": {
                    "val": "9.951"
                },
                "BudgetYearOneBase": {
                    "val": "9.951"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.034"
                },
                "CurrentYear": {
                    "val": "-2.300"
                },
                "BudgetYearOne": {
                    "val": "0.018"
                },
                "BudgetYearOneBase": {
                    "val": "0.018"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.300"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.034"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.018"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11 adjustments for Congressional General Reductions -$0.034\n\nFY12 Congressional Mark -$2.3M to Project 655361, Stores-Aircraft Interface, due to Universal Armament \"Contract Delay\""
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653133"
                    },
                    "ProjectTitle": {
                        "val": "Bombs & Fuzes"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.209"
                        },
                        "CurrentYear": {
                            "val": "3.936"
                        },
                        "BudgetYearOne": {
                            "val": "3.993"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.993"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.065"
                        },
                        "BudgetYearThree": {
                            "val": "1.031"
                        },
                        "BudgetYearFour": {
                            "val": "1.060"
                        },
                        "BudgetYearFive": {
                            "val": "1.074"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Armament Subsystems Project contains a variety of work:\n- Bombs\/munitions and fuzes.\n(a) Medium Caliber Ammunition project assesses, refines, and develops medium caliber ammunition, to include, but not limited to, conducting PGU‐28A\/B qualification testing (F‐22) and performing a 20mm clean sheet (alternate round) assessment.\n(b)  Fixed Wing Advanced Precision Kill Weapon System II (FW APKWS II) Joint Capability Technology Demonstration (JCTD) will integrate the existing APKWS II, a rotary wing (helicopter) system, onto the fixed-wing A-10 platform and provide a precision laser guided, low collateral damage capability against static and moving targets.\n(c)  This project funds follow-on development activities for legacy fuzes, including reliability enhancements and producibility improvements.\n- Insensitive Munitions (IM). IM develops explosive fills and bomb case modifications to make conventional weapons insensitive to unplanned stimuli. The project also supports AF IM strategic planning to achieve IM compliance IAW U.S. Code, Title 10, Subtitle A, Part N, Chapter 141, Section 2389, \"Ensuring safety regarding insensitive munitions.\"\n- Munitions Materiel Handling Equipment (MMHE) and Container Design Retrieval System (CDRS).  Armament Standardization\/Control\/Munitions Materiel Handling Equipment (MMHE) is a continuing project to develop and improve the standardization and commonality of munitions handling and armament equipment to preclude duplication.  Efforts are limited to the study, design, and development of MMHE and armament control systems.  Procurement will be performed and funded by the applicable weapons system project.  The tri-service  Container Design Retrieval System (CDRS) is a database intended to preclude proliferation and duplication of munitions containers.  It also supports organic container design, acquisition transportation, prototyping, testing capabilities, as well as the Joint Ordnance Commander's Working Group (JOCG) for Packaging, Handling, and Loading.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and munufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Materiel Handling Equipment\/Container Design Retrieval System"
                                    },
                                    "Description": {
                                        "val": "MMHE\/CDRS: enhance safety and improve standardization of munitions handling and armament equipment; maintain tri-service database to preclude proliferation\/duplication of munitions containers and support organic container design"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.557"
                                            },
                                            "Text": {
                                                "val": "Provided container design expertise and technical support to AF munitions\/weapons containers developers. Managed and operated the Tri-Service Container Design Retrieval System (CDRS) database.  Processed 32 excess container requests.  Tested and validated new Miniature Air Launched Decoy (MALD) Container.  Completed CV-22 Osprey Test Instrumentation Data Acquisition System (TIDAS) version 3H Rack crash load stress analysis.  Developed Deck Ring Pull Test Fixture to complete deck ring\/pear ring pull test of MHU-226 trailer deck for potential nuclear weapon load certification.  Completed 22 Munitions Materiel Handling Equipment (MMHE) support equipment projects. Fabricated 26 equipment prototypes for drafting verification and delivery to Air Force units for additional test and evaluation.  Supported Medium Caliber Ammunition Program with redesign of 20MM table chute and prototype for new processing assembly table base.  Supported B-2 program with forklift adapter to transport Rotary Launcher Adapter (RLA).  Assisted F-35 program with development of internal weapons loading adapter.  Provided direct customer support through customer support visits to Kadena AB, Okinawa, Andersen AFB, Guam, Joint Base Elmendorf Richardson, AK and Whiteman AFB, MO."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.776"
                                            },
                                            "Text": {
                                                "val": "Provide container design expertise and technical support to AF \nmunitions\/weapons containers developers.  Planned completion of 10 Munitions Materiel Handling Equipment (MMHE) support equipment projects to include engineering, drafting, proof load, technical data, and safety authorizations.  Planned fabrication of 7 prototypes for test and evaluation purposes. Project to complete 7 first article equipment fabrications for drafting verification and delivery to Air Force units for additional test and evaluation.  Provide support to all Specialized Program Office (SPO) with new weapons and container development.  Continue support and sustainment of all previously existing items developed by the MMHE program office."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.802"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Text": {
                                                "val": "Provide container design expertise and technical support to AF munitions\/weapons containers developers.  Complete 10 Munitions Materiel Handling Equipment (MMHE) support equipment projects to include engineering, drafting, proof load, technical data, and safety authorizations. Fabricate 7 prototypes for test and evaluation purposes. Complete 7 first article equipment fabrications for drafting verification and delivery to Air Force units for additional test and evaluation. Provide support to all Specialized Program Office (SPO) with new weapons and container development. Continue support to the F-35 programs with equipment to test and evaluate various pylons and adapters. Continue support and sustainment of all previously existing items developed by the MMHE program office."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Ammunition"
                                    },
                                    "Description": {
                                        "val": "Assess, refine, and develop medium caliber ammunition.  The project provides enterprise management of guns, ammunition, and Munitions Materiel Handling Equipment (MMHE) systems integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Conducted PGU-28A\/B F-22 qualification testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.760"
                                            },
                                            "Text": {
                                                "val": "Conduct PGU‐28A\/B F-22 qualification testing; perform 20mm clean sheet (alternate round) assessment"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.790"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.790"
                                            },
                                            "Text": {
                                                "val": "Conduct PGU-28A\/B F-22 qualification testing; perform 20mm clean sheet (alternate round) assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM)"
                                    },
                                    "Description": {
                                        "val": "Strategic IM planning for the AF; support Joint Service IM efforts; provide technical guidance and test expertise to AF IM programs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.231"
                                            },
                                            "Text": {
                                                "val": "Initiated FY13\/14 AF IM Strategic Plan; supported DoD and Joint Service IM planning; provided IM planning expertise to individual AF programs, including the BLU-129, SDB II, and JASSM ER."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Deliver FY13\/14 AF IM Strategic Plan; support DoD and Joint Service IM planning; provide IM planning expertise to individual AF programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.401"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.401"
                                            },
                                            "Text": {
                                                "val": "Initiate the FY15\/16 AF IM Strategic Plan; support DoD and Joint Service IM planning; provide IM planning expertise to individual AF programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fixed Wing Advanced Precision Kill Weapon System II (FW APKWS II) Joint Capability Technology Demonstration (JCTD)"
                                    },
                                    "Description": {
                                        "val": "FW APKWS II JCTD: will integrate the existing APKWS II, a rotary wing (helicopter) system, onto the AV-8B and A-10 platforms and demonstrate its military utility to provide a precision laser guided, low collateral damage capability against static and moving targets, both close support and urban targets; system will leverage existing rocket motor and warhead stockpiles"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.221"
                                            },
                                            "Text": {
                                                "val": "Awarded contract and completed integrated baseline review. Completed management transition plan and conducting the System Requirements Review (SRR) and Program Design Review (PDR). Completed A-10 and F-16 Instrumented Measurement Vehicle (IMV) flight clearances.  Conducting (a)AV8B IMV flight test and at China Lake, (b) A-10 and F-16  test flights at Eglin Test Range, and (c) Adjacent Rocket Fire test at MCAS Yuma, AZ."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Fuzes (including JPF) is a continuing effort with most activities performed in-house or through contracted services (small contracts).\nFixed Wing APKWS II JCTD is being conducted under the current contract for the rotary wing APKWS II system.  \nMMHE\/CDRS project activities are performed in-house with limited technical and analysis contract support.\nMedium Caliber project activities are performed in-house with technical and analysis contract support, organic government test support, and possible contracted services (small contracts)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_653133_0.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_653133_1.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Munitions Materiel Handling Equipment (MMHE): design, prototype, test priority MMHE projects"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Container Design Retrieval System (CDRS): support tri-service data base"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Medium Caliber Ammunition: Conduct PGU-28A\/B F-22 qualification testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Medium Caliber Ammunition: Perform 20mm (alternate round) assessment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Submit AF FY13\/14 Insensitive Munitions (IM) Strategic Plan"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FW APKWS II JCTD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FW APKWS II JCTD: Design\/Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FW APKWS II JCTD: A-10 Fight Tests"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "655361"
                    },
                    "ProjectTitle": {
                        "val": "Stores-Aircraft Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.450"
                        },
                        "CurrentYear": {
                            "val": "3.819"
                        },
                        "BudgetYearOne": {
                            "val": "5.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.958"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.013"
                        },
                        "BudgetYearThree": {
                            "val": "4.689"
                        },
                        "BudgetYearFour": {
                            "val": "4.819"
                        },
                        "BudgetYearFive": {
                            "val": "4.883"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Universal Armament Interface (UAI) is an Air Force program to develop, enhance, and implement standardized interfaces in current and future aircraft (manned or unmanned), weapons and mission planning to support integration of weapons independent of aircraft Operational Flight Program (OFP) cycles. UAI is currently being implemented on the F-15E, F-16 Block 40\/50, and EPAF(European Participating Air Forces) F-16 aircraft, Small Diameter Bomb (SDB) I and II, Joint Direct Attack Munition (JDAM), Laser JDAM, Joint Air-to-Surface Stand-off Missile (JASSM) and Precision Guided Munitions Planning Software (PGMPS). Additional aircraft and weapons, including but not limited to, Joint Strike Fighter (JSF\/F-35), MQ-9, as well as Army and Navy systems, have program plans to implement UAI. The UAI program office is responsible for development and enhancement of the standard (U.S. and allied),  support to coalition\/allied\/joint interoperability efforts for weapons-platform interface efforts, provision of certification tools (test assets) and implementation support to aircraft and weapons.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and munufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "UAI Development"
                                    },
                                    "Description": {
                                        "val": "Conduct stores-aircraft interface upgrades and standards development to include the Universal Armament Interface (UAI), development of and maintenance to the UAI, and facilitation of aircraft and stores program users in the UAI process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.450"
                                            },
                                            "Text": {
                                                "val": "In FY 2011: continued development and configuration management of UAI standards in response to user needs, working group management, technical meetings and workshops, risk reduction studies, common mission planning, integration support, updates to test tools, maintenance and procurement of certification tool(s) to continue CV02."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.819"
                                            },
                                            "Text": {
                                                "val": "In FY 2012: Continued development and configuration management of UAI standards in response to user needs, working group management, technical meetings and workshops, risk reduction studies, common mission planning, integration support and updates to test tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.958"
                                            },
                                            "Text": {
                                                "val": "In FY2013:  Continue development and configuration management of UAI standards in response to user needs, working group managment, technical meetings and workshops, risk reduction studies, common mission planning, and integration support.  Also, continue integration and updates to test tools, including maintenance and procurement of certification tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "None"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In December 2004, under the authority of a class Justification and Approval (J&A), the UAI program office awarded individual Cost Plus Fixed Fee (CPFF) contracts to Boeing, Lockheed Martin, Northrop Grumman and Raytheon.  Each OEM is responsible for a different piece of the total UAI requirement based on its product-specific (platform\/weapon) expertise.  During FY10 these contracts expired.  Under the authority of a new class J&A, Cost Plus Incentive Fee (CPIF) contracts were awarded to the four UAI vendors in August 2010.  Follow-on period of performance was awarded in August 2011 for 18 months to better align future contract awards with funding through the FYDP."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_655361_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-15E Suite 6, CV01 Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15E Suite 7, CV01 Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JDAM Block 9, CV01 Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JASSM, CV01 Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CV02 - Configuration Version 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SDB 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 M6+ (Block 40\/50)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SDB II"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-35"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}