{
    "id": "4662c7af0993127aa45fa002cae165b7ca00dd7f",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305199D8Z"
        },
        "ProgramElementTitle": {
            "val": "Net Centricity"
        },
        "R1LineItemNumber": {
            "val": "229"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.162"
            },
            "CurrentYear": {
                "val": "14.432"
            },
            "BudgetYearOne": {
                "val": "21.190"
            },
            "BudgetYearOneBase": {
                "val": "21.190"
            },
            "BudgetYearTwo": {
                "val": "21.778"
            },
            "BudgetYearThree": {
                "val": "22.184"
            },
            "BudgetYearFour": {
                "val": "18.429"
            },
            "BudgetYearFive": {
                "val": "18.764"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides systems engineering and technical analysis of the DoD Information Technology (IT) portfolio containing over 600 programs valued at over $180 billion.  The Principal Staff Assistant (PSA) advises OSD leadership on end to end warfighter communication capabilities to include portfolio management, developmental support responsibilities on numerous programs, synchronization, and interoperability efforts and issues.  Emphasis is placed on the information transport, information assurance, net and spectrum management, command and control (C2), space, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of acquisition programs.  The PSA develops portfolio-wide guidance and provides technical analysis to enable the warfighter, intelligence, and business communities to meet their respective mission requirements.  This program is funded under Budget Activity 7, Operational System Development, and it supports system definition, development, testing, and program analysis of major acquisition programs engineering development and synchronization activities.  \n\nThis project provides the resources necessary to implement net centric processes and authoritative analytic methods that provide the capability to synchronize interdependent capabilities across all layers (ground, air, space) of the net-centric architecture, to forecast and achieve a balance in supply and demand for network capacity, and field net centric capabilities more rapidly as an enabler for C2 capabilities and applications.  Resources are required to transform current networks into an operationally unified and architecturally diverse joint network that will provide end-to-end communications transport layer capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, and contested communications on the move capabilities.  These funds develop the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance capabilities with other net centric capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).  \nIn addition, funding will continue to be used to support the Defense Information System's Agency's (DISA) and Services' interoperable improvement efforts and processes in the development of common standards and protocols.  This effort includes initiating the Joint Interoperability Enhancement Process (IEP) that allows operators, engineers, and program managers to verify capabilities and identify issues in a design with Joint \/Allied units prior to system fielding, or with fielded systems to identify required systems changes for systems upgrade planning.  DISA and the Joint Forces Combatant Command lead the effort to transform the current standards and interoperability management tools to a common set of Joint network-enabled standards to ensure adherence to the Global Information Grid (GIG) enterprise-wide technical baseline and for implementation of future TDES capabilities. These joint standards, protocols, and processes will be used for implementation and testing to ensure the TDES capabilities are synchronized with the development and integration timelines of other planned network-enabled Global Information Grid (GIG) initiatives.  The threats to the networking waveforms and the Joint NC migration will also be looked at in cooperation with the Intelligence agencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.831"
                },
                "CurrentYear": {
                    "val": "14.926"
                },
                "BudgetYearOne": {
                    "val": "24.806"
                },
                "BudgetYearOneBase": {
                    "val": "24.806"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.162"
                },
                "CurrentYear": {
                    "val": "14.432"
                },
                "BudgetYearOne": {
                    "val": "21.190"
                },
                "BudgetYearOneBase": {
                    "val": "21.190"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-18.669"
                },
                "CurrentYear": {
                    "val": "-0.494"
                },
                "BudgetYearOne": {
                    "val": "-3.616"
                },
                "BudgetYearOneBase": {
                    "val": "-3.616"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-15.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.436"
                                },
                                "BudgetYearOne": {
                                    "val": "0.118"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.118"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Studies Contract Efficiency"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.477"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Service Support Contract Efficiency"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.756"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.100"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "SBIR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.347"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "STTR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.047"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Transfer"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.734"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.734"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011:  Congressional Reduction -15.000 million, Studies Contract Efficiency -2.477 million, Service Support Contract Efficiency -0.756 million, Program adjustment -0.436 million.\nFY 2012:  FFRDC reduction -0.100 million, SBIR reduction -0.347 million, STTR reduction -0.047 million.\nFY 2013:  Disestablishment of  ASD(NII) Efficiency – transfer  acquisition related functions to AT&L PE 0604771D8Z  -12.337 million, transfer in communications and information networks architecture; strategy and policy; and frequency spectrum analysis and management functions from ASD(NII) PE 0604771D8Z  8.603 million, Program Adjustment 0.118 million.\n\nStudies Contract Efficiencies will be realized by reducing the number of studies that we participate in while still supporting enterprise-wide information technology goals critical to DoD Mission.\nService Support Contract efficiencies will be realized by reducing the reliance on DoD Service Support Contractors by utilizing in-house government support in a constrained personnel and resource environment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "199"
                    },
                    "ProjectTitle": {
                        "val": "GIG Evaluation Facilities (GIG-EF) and GIG Enterprise-Wide Systems Engineering Advisory Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.162"
                        },
                        "CurrentYear": {
                            "val": "14.432"
                        },
                        "BudgetYearOne": {
                            "val": "21.190"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.190"
                        },
                        "BudgetYearTwo": {
                            "val": "21.778"
                        },
                        "BudgetYearThree": {
                            "val": "22.184"
                        },
                        "BudgetYearFour": {
                            "val": "18.429"
                        },
                        "BudgetYearFive": {
                            "val": "18.764"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element provides systems engineering and technical analysis of the DoD Information Technology (IT) portfolio containing over 600 programs valued at over $180 billion.  The Primary Staff Assistant advises OSD leadership on end to end warfighter communication capabilities to include portfolio management, developmental support responsibilities on numerous programs, synchronization, and interoperability efforts and issues.  Emphasis is placed on the information transport, information assurance, net and spectrum management, command and control (C2), space, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of acquisition programs.  The PSA develops portfolio-wide guidance and provides technical analysis to enable the warfighter, intelligence, and business communities to meet their respective mission requirements.  This program is funded under Budget Activity 7, Operational System Development, and it supports system definition, development, testing, and program analysis of major acquisition programs engineering development and synchronization activities.  \n\nThis project provides the resources necessary for the Deputy of the Assistant Secretary of Defense for Communication, C2, Space, and Spectrum to implement net centric processes and authoritative analytical methods that provide the capability to synchronize interdependent capabilities across all layers (ground, air, space) of the net-centric architecture, to forecast and achieve a balance in supply and demand for network capacity, and field net centric capabilities more rapidly as an enabler for C2 capabilities and applications.  Resources are required to transform current networks into an operationally unified and architecturally diverse joint network that will provide end-to-end communications transport layer capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, and contested communications on the move capabilities.  These funds develop the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance capabilities with other net centric capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).  \n\nNote that FY 2010\/2011 funding disconnect resulted from duplicate cuts to a program titled Horizontal Fusion (HF) formerly part of this PE to support priority net centric transformation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Net Centricity Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.162"
                                            },
                                            "Text": {
                                                "val": "– Led pre-Milestone A developmental planning by selecting and developing solution sets in the space, aerial, and ground domain (e.g. Joint space communications layer, Joint aerial network layer, Joint terrestrial network layer, and contested communications on the move capabilities).\n– Designed the integrated master schedule to analyze portfolio capability schedules and dependencies between programs to capture critical programmatic operational and developmental dependencies.\n– Developed a tactical radio strategy to meet the demand of the Combined Joint Force (CJF) Commander.\n– Developed DoD SATCOM roadmaps (narrowband, wideband, and protected)  including MILSTAR, AEHF, terminals, gateways, and waveforms.\n– Defined current network connectivity, capacity, capability gaps, and potential solutions (space, air, terrestrial) in the Combined Joint Operational Area (CJOA) to meet the demands of  the warfighter.\n– Defined technical and operational baselines, develop analytical tools and provide analysis and engineering documentation in sufficient detail to support fiscal decision making for SATCOM programs such as MUOS, Teleports, WGS, terminals, and gateways.\n– Provided Crypto Modernization responsibilities by developing the Crypto Modernization Management Charter.\n– Developed synchronization plans for ground support systems, ground terminals and interfaces to other components within the GIG by capturing up to date changes on the numerous interdependent programs.\n– Performed systems engineering for technical baseline compliance, information assurance, and tactical networking using the Quantifiable Capability Delivery Increment (QCDI) updates.  \n– Provided specific engineering and analysis to ensure communications programs are complying with Department net-centric guidance through forums such as the Narrowband SATCOM Systems Engineering radio modernization , and satellite synchronization Groups.  \n– Developed a prototype COCOM C4 architecture and analyze their end-to-end tactical network management systems.\n– Developed Afghan Mission Network transport requirements; defined battlespace functions; decreased\/minimized demand of and capacity allocated to multiple network environments. \n– Defined interoperability net centric gaps to be filled by technology.  Determined appropriate technology and operational impacts. \n– Performed legacy waveform migration analysis to select optimum waveforms for warfighter interoperability and DoD cost reduction; conducted dynamic spectrum performance modeling and threat assessment to determine appropriate application within DoD networks; created plan for investments into new, more efficient, more flexible waveforms to ensure interoperability and performance standards within DoD are met.\n– Developed capability to effectively measure and monitor defense programs’ bandwidth requirements to ensure that bandwidth needed to support such programs. \n– Conducted technical analysis on spectrally efficient technologies, sharing techniques, and regulatory alternatives to increase efficient use of spectrum to maximize its effectiveness and ensure timely delivery to the warfighter.\n– Evolved data interoperability standards to promote interoperability in the GIG Technical Guidance (GTG).\n– Developed and executed a Joint Capability Technology Demonstration to address tactical and operational data strategy implementation and integration for expanded Command and Control net-centric data strategy capabilities.\n– Provided technical analysis for evolution of Joint Command and Control (C2) programs, program\/acquisition strategies and functional requirements. Developed the Joint C2 Capability Analysis of Alternatives and Insights from the Command and Control Analysis of Alternatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.432"
                                            },
                                            "Text": {
                                                "val": "– Assess  aerial layer waveforms (Link-16, TTNT, CDL) for cost and complexity in implementation . Identify technologies and platform architectures that enable improved performance and lower technology insertion costs for advanced tactical data. \n– Direct DoD efforts to develop and test proposed JALN modifications and developing ATDL technologies with greater system throughput and performance in future operational environments; assess Service plans to field systems to support JALN with ATDLs; and assess any additional allied participation alternatives for JALN architectures and ATDL networks. Working with ASD(R&E), coordinate the planned technology developments to address communications shortfalls and ensure support of joint interoperable solutions that are technically effective and financially sound. Working with the services incorporate the ATDL and JALN recommendations to provide the warfighters with effective communication systems.\n– Continue the expansion of the TDES community participation including the incorporation of the ATDL with the associated gateway efforts and enhanced joint, allied and coalition partnership within the JTMP process to facilitate Joint TDES migration.\n– Further refine, develop and analyze future capabilities for advanced waveforms and data links for terrestrial (line-of-sight) and satellite (beyond-line-of-sight) systems. This includes detailed engineering analysis of new technologies, alternatives and interoperability Continue to analyze and propose solutions for Generation 4 to 5 advanced data link interoperability.\n– Continue to model and similar various coalition aerial networks, sowing interoperability between US aircraft in US only nets, US aircraft in coalition networks and allied aircraft.\n– Implement the joint Interoperability Enhancement Process (IEP) with the joint to define and plan the expansion of TDES technologies to include tactical information integration and configuration management with Link 16, VMF, CDL and MADL; continue to develop policy-based network management preferred system concept and methodology for enterprise situational awareness.\n– Finalize the 2011 TDES migration plan and start draft of 2013 plan. Enhance modeling and simulation capability to support data link technical and operational capability assessments including integration to other component of the GIG.  \n– Lead advanced tactical link assessment .  Update the Joint Tactical Data Enterprise Services (TDES) migration plan for 2012.  Establish the Joint Interoperability Enhancement Process.  Conduct JALN implementation analysis.  Provide dtalink migration engineering support.  Conduct advanced waveform analysis of Gen 4\/5 aircraft.\n– Analyze Gen 4-5 fighter\/bomber waveform modification (MADL).  Model advanced tactical datalinks.  Develop a MADL waveform standard specification.  Analyze MADL and link 16 gateway capabilities.\n– Work with the Intelligence, Surveillance, and Reconnaissance (ISR) community to define a set of non-duplicatve CDLs for joint use.\n– Provide pre-Milestone A technical assessment for “Developmental Planning” to ensure selection and development of solutions that are interoperable across the strategic and tactical boundaries in regards to Joint space communications layer, Joint aerial network layer, and contested communications on the move capabilities.\n– Refine the DoD Radio and COMSEC roadmap to incorporate department changes.\n– Build waveform roadmaps that provide a chronology of tactical communications waveforms and captures delivery of new approved waveforms as well as disestablishment\/migration of existing\/legacy waveforms.\n– Define current network capacity, capability gaps and potential solutions (space, air, terrestrial) in the Combined Joint Operational Area (CJOA) to meet the demand of the Combined Joint Force (CJF) Commander.\n– Develop engineering solutions for space support (launch, satellite operations, weather, PNT, and space control). \n– Design synchronization plan for ground support systems, ground terminals and interfaces to other components within the GIG by capturing up to date changes on the numerous interdependent programs.\n– Perform systems engineering analysis for technical baseline compliance, information assurance, and tactical networking.\n– Combine the Narrowband, Protected and Wideband SATCOM synchronization matrix data calls with the NS4R data calls to better accomplish program planning and data integration.\n– Develop a Crypto modernization migration strategy for Nuclear and general force C2 systems.\n– Develop Integrated Master Schedule for Nuclear C2 Systems.\n– Develop a plan and methodology for GIG enterprise-wide spectrum demand analysis for conducting net-centric operations. \n– Define programmatic changes within space programs to improve net-centric capabilities and information assurance requirements.\n– Assess DoD capability improvements as integration with commercial capability providers.\n– Develop network management (NM) technical solutions to share NM data and execute control through all levels of DoD networks.\n– Perform waveform migration analysis to select optimum waveforms for warfighter interoperability and DoD cost reduction.\n– Continue to effectively measure and monitor defense programs’ bandwidth requirements to ensure that bandwidth needed to support such programs will be met and a determination of how they will be met.\n– Provide technical solutions to integrate spectrum resources and optimize electromagnetic systems that use spectrum resources in the tactical environment.\n– Execute technical analysis on spectrally efficient technologies, sharing techniques, and regulatory alternatives to increase efficient use of spectrum technologies.\n– Develop mechanisms for the marking and release of information to coalition partners to inform policy recommendations.\n– Assess the services infrastructure requirements (and limitations) of implementing C2 functional services to operate from the tactical edge.\n– Perform analysis of technical capabilities to support the ASSIST RFP development and assessment.\n– Conduct analysis to support congressional direction to develop an expedited process for the design and acquisition of cyber capabilities in the Department.\n– Provide technical analysis for evolution of Joint C2 programs, program acquisition strategies and functional requirements. Develop technical trade-offs to include cost analysis, for rapid transition of Global Command and Control System Family of Systems and other relevant C2 capabilities (applications, data and services) required to support future command and control of joint task forces across the range of military operations.\n– Develop Spectrum Data Community of Interest to advance electromagnetic spectrum operations by improving the collection, exposure and sharing of spectrum related data across the GIG.\n– Continue development of a Global Electromagnetic Spectrum Information System (GEMSIS),  transforming spectrum operations from a preplanned and static frequency assignment system into a responsive and agile capability to request, assign, allocate, and deconflict portions of the electromagnetic spectrum; providing an integrated approach to electromagnetic spectrum, enabling C2 access to spectrum situational information and providing spectrum efficiency and effectiveness enhancements to JTRS and integration of spectrum consideration to networking protocols.\n– Perform detailed feasibility studies, band analysis, operational impact studies and cost estimates in response to future domestic and global spectrum reallocations that might inhibit the DoD’s ability to complete its warfighting mission.\n– Refine the DoD radio strategy and establish a working group with the services. Develop and populate an ACCESS database for radios and COMSEC. Combine SATCOM and SATCOM terminal data calls with the NS4R and drive toward a single overarching report. Update existing SATCOM synch matrices to reflect changes in department funding, emerging systems\/technology and JALN AOA recommendations. \n– Conduct joint network modeling and network design for Army, USMC, Air Force brigade, MEB and wing. Provide analysis of SATCOM systems in support of the RBSC effort. Conduct a MUOS alternative study to determine a technical solution for getting the most out of the MUOS payload side of the satellite through modifications at the NAF and with, ground terminal mods.  This effort will include waveform options, cost and schedule impacts. Through a FFRDC host radio industry technology forums to review current, future radio technology and industry trends.\n– Perform cyber CND analysis for tactical networks, resiliency based satellite analysis, secure voice telephone modeling replacement, analysis to determine options for extending enterprise services to the tactical edge, current waveform capabilities and functions and evolutionary strategy for 2 MHz – 2 GHz.\n– Develop a common set of interface standards to minimize the network management complexity in tactical communication networks. Support the development of a DoDI for NETOPS. Develop a strategy for improving integration of network situational awareness, management and control across the DISN.\n– Analyze the use and feasibility of  NET FPGA technology as a layer 3 solution for the Soldier Radio Waveform (SRW) as a future enhancement.  Conduct analysis and performance modeling for implementation on tactical networks,  Capabilities document to determine what can be removed to facilitate an alternative solution.\n– Develop an initial roadmap for C2 information sharing with multi-national mission partners.\n– Multi-National Information Sharing : Provide C2 policy support and technical analysis with emphasis on coalition C2 and Multi-National Information Sharing.\n– Provide technical analysis and develop trade-offs for evolution of C2 information sharing policies, strategies and functional requirements to support continued development and delivery of Coalition C2 and C2 Information Sharing capability metrics and mechanisms.\n– Pursue a C2 research project to improve the state of the art of Agile C2. Develop and operationalize net enabled C2 and Agile C2 as described in the NATO NEC C2 Maturity Model. Satisfy requirements for technical assistance in support of the DoD C2 Operational Agility Research Initiative. \n– Develop communications waveform policy technical assessments, waveform specification database and technical analysis to support waveform policy oversight.\n– Develop wireless architecture and advanced technologies analyses, technical analyses in waveform policy oversight, COMSEC\/TRANSEC guidance for spectrum dependent systems and spectrum technology radar analyses.\n– Provide technical analyses on network management to include cyber and spectrum issues and develop a network management strategy roadmap.\n– Provide DoD wireless communications support analyses and program oversight for airborne ISR encryption policy  to enclude an encryption implementation plan, technical support to land mobile radio policy and technical engineering support for wireless efforts.  \n– Develop approaches for security policy for dynamic spectrum access systems, identify new strategies and policies for more efficient and effective use of spectrum and prioritize alternative spectrum use options for each spectrum band.\n– Develop wideband SATCOM architecture and policy, support DoD CIO participation on the Joint SATCOM panel, support the JSCL AOA relative to wideband SATCOM architecture and finalize the JIPM evolution and deployment strategy. \n– Provide engineering and technical expertise and analytic support for the Ten Year Plan and DoD Long-term Spectrum Strategy and spectrum relocation analyses.\n– Develop Engineering analysis, including secure voice conferencing, to support the total replacement of the Defense Red Switch Network (DRSN) in the DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.190"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.190"
                                            },
                                            "Text": {
                                                "val": "– Expand the Radio and COMSEC modernization roadmap to include 3rd party for MUOS tactical terminals developers.\n– Define network capability, based on the approved JSLC AoA to include in the Combined Joint Operational Area (CJOA) to meet the demand of the Combined Joint Force (CJF) Commander.\n– Perform systems engineering analysis for technical baseline compliance, information assurance, and tactical networking for commercial alternatives to MILSATCOM including commercial alternatives.\n– Update the DoD Narrowband SATCOM Synchronization matrix to  include  meeting MUOS terminal Deliveries, red-black waveform availability and  legacy terminal upgrades.\n– Update the  DoD Protected SATCOM roadmap to address recommendations of the JSCL AoA to include the space layer, fixed terminal and mobile tactical terminal segments.\n– Determine requirements for future upgrades to MUOS to including anti- jam improvements.\n– Define implications of MUOS performance enhancements including increased capacity UHF data capabilities and full duplex operations on operational forces.\n– Perform analysis of identify management and assurance solutions for network edge devices that integrate with current PKI solutions.\n– Establish COCOM Mission Network transport requirements; define battle space functions; decrease\/minimize demand of and capacity allocated to multiple network environments\n– Analyze potential solutions to provide anti-jam satellite communications utilizing a commercial satellite bus. Analysis includes identifying NC2 and other military unique capabilities that may not be appropriate for a commercial based solution.\n– Develop Integrated Master Schedule update for new program initiatives funded in FY 2013. \n– Analyze  communications options for UAV out of band control requirements.\n– Assess the capability to effectively measure and monitor new defense programs’ bandwidth requirements to ensure that bandwidth needed to support such programs will be met and a determination of how they will be met in support of the DoD acquisition process.\n– Update Wideband and Protected SATCOM synchronization matrices to reflect programmatic decisions regarding implementing KMI in applicable programs including protected SATCOM. \n– Develop and operationalize the C2 Vision embodied in the DoD C2 Strategic Plan and incorporate “Agile C2” into elements of the operational force.\n– Execute technical analysis on spectrally efficient technologies, sharing techniques, and regulatory alternatives to increase efficient use of spectrum technologies.\n– Provide technical solutions to integrate spectrum resources and optimize electromagnetic systems that use spectrum resources in the tactical environment.\n– Produce GIG enterprise-wide spectrum demand analysis that provides a superior capability to conduct net-centric operations; review and evaluate domestic and global spectrum regulatory trends that might inhibit the DoD’s ability to complete its warfighting mission; collect and analyze system spectrum data for current and projected acquisition efforts for 300MHz – 3.5 GHz and 3.5 GHz – 6 GHz bands.\n– Develop Spectrum Data Community of Interest to advance electromagnetic spectrum operations by improving the collection, exposure and sharing of spectrum related data across the GIG.\n– Continue development of a Global Electromagnetic Spectrum Information System (GEMSIS),  transforming spectrum operations from a preplanned and static frequency assignment system into a responsive and agile capability to request, assign, allocate, and deconflict portions of the electromagnetic spectrum; providing an integrated approach to electromagnetic spectrum,  enabling C2 access to spectrum situational information and providing spectrum efficiency and effectiveness enhancements to JTRS and integration of spectrum consideration to networking protocols.\n– Perform detailed feasibility studies, band analysis, operational impact studies and cost estimates in response to future domestic and global spectrum reallocations that might inhibit the DoD’s ability to complete its warfighting mission.\n– Update the Joint TDES Migration Plan 2013 update to include: Interoperability enhancement process, digitally aided close air support, multi function advanced data link joint migration, in flight data link gateways and NADL migration; NATO TDES migration plan.\n– Start development, integration and fielding of the recommended systems for JALN implementation of AoA recommendations and support of follow on efforts including future ATDL with R&E and DARPA; NATO narrowband, wideband and cooperative developments.\n– Conduct analysis and redevelop CDL migration plan, support ISR and UAS task force interoperability and migration recommendations. \n– Conduct design implementation roadmap for ground support systems, ground terminals air layer systems, air layer platforms resulting from JLAN AoA decisions.  \n– Conduct additional analysis to validate development of CDL backbone and IA technologies. \n– Provide technical analysis of waveform applications and make disposition recommendations; build and maintain approved waveform specification database (SIPR), and apply technical analysis in waveform policy oversight, and develop, coordinate, and complete LMR deliverables.\n– Bandwidth Assessment:  Conduct analysis on process pilots throughout DoD and apply analysis to DoD policy.  \n– Network Management:  Provide technical analysis to include cyber and spectrum issues and develop network management strategy roadmap to support DoD Policy.\n– Wireless Architecture and Advanced Technologies:  Conduct and apply technical analysis in policy recommendations and in waveform policy oversight; and develop COMSEC\/TRANSEC guidance for spectrum dependent systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "User Activity and Participation - A key measurement of GIG-EF success is the amount of user\/program participation and usage of the GIG-EF in support of Joint warfighting requirements.\n    - Contributions to GIG development and transition.  \n    - Demonstrations in support of GIG overall goals.\n    - Number of GIG Enterprise-Wide Systems Engineering Oversight working group requirements addressed.\n    - Tangible products such as frameworks and design guidance used for program assessments and reviews.\n    - Streamlined business processes for documenting GIG enterprise-wide technical guidance.\n    - Prioritized listing of enterprise-wide technical issues.\n    - Technical solutions to enterprise interoperability and performance issues.\n    - Specific modifications to Programs based on the frameworks and guidance that improve program compatibility and end-to-end performance.\n    - A more collaborative environment where systems engineering organizations of individual GIG programs and the enterprise-wide systems engineering oversight organization mutually identify and solve issues related to maximizing end to end performance."
                        }
                    }
                }
            ]
        }
    }
}