{
    "id": "47deda4848bcda67b1a7c7ef2a952170729bcb47",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605853N"
        },
        "ProgramElementTitle": {
            "val": "Management, Technical & Intl Supt"
        },
        "R1LineItemNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "58.588"
            },
            "CurrentYear": {
                "val": "58.162"
            },
            "BudgetYearOne": {
                "val": "32.782"
            },
            "BudgetYearOneBase": {
                "val": "32.782"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "56.516"
            },
            "BudgetYearThree": {
                "val": "55.264"
            },
            "BudgetYearFour": {
                "val": "62.208"
            },
            "BudgetYearFive": {
                "val": "63.385"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "International Cooperative RDT&E: provide program management, execution, and support to implement a broad range of cooperative Naval Research and Development, Test and Evaluation initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, and identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches, coordinating with partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership initiative.\n\nNaval War College Strategic Studies Support:  Provides research, analysis and gaming activities which serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, joint and interagency communities.  These efforts generate strategic and operational alternatives, quantitative analysis, war gaming and political military assessments, and provide recommendations regarding the formulation and execution of maritime options .  The War Gaming Department plans, designs, executes, analyzes and reports on the Navy's Title 10 war games.  These war games provide analytical input to the Navy's Strategic Plan, assessments of future concepts, and recommendations to the Navy's Quadrennial Defense Review, force design, and strategy process.  The War Gaming Department also designs, executes and analyzes war games for theater security cooperation plans and operational war fighting issues.  \n\nAssessment Program: The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense (DoD) M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.  It develops tools and analytical methodologies that assist in evaluating Navy programs and provides technical leadership for the analysis functional area of Naval Modeling and Simulation.\n\nMid-Range Financial Improvement Plans: This project supports the Research Development Test & Evaluation, Navy (RDTEN) portion of the larger DoD and Navy-wide effort to implement the financial improvement plan.  Funding is for the sustainment of clean and auditable statements for RDTEN.\n\nOperations Integration Group:  Classified\n\nCHENG: Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability and Anti-Tamper initiatives.\n\nNaval Research Laboratory (NRL)Facilities Modernization: This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.329"
                },
                "CurrentYear": {
                    "val": "68.301"
                },
                "BudgetYearOne": {
                    "val": "57.606"
                },
                "BudgetYearOneBase": {
                    "val": "57.606"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.588"
                },
                "CurrentYear": {
                    "val": "58.162"
                },
                "BudgetYearOne": {
                    "val": "32.782"
                },
                "BudgetYearOneBase": {
                    "val": "32.782"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.259"
                },
                "CurrentYear": {
                    "val": "-10.139"
                },
                "BudgetYearOne": {
                    "val": "-24.824"
                },
                "BudgetYearOneBase": {
                    "val": "-24.824"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.139"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.721"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.983"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-24.756"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-24.756"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.068"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.068"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.479"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0149"
                    },
                    "ProjectTitle": {
                        "val": "International Coop RDT&E"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.515"
                        },
                        "CurrentYear": {
                            "val": "3.506"
                        },
                        "BudgetYearOne": {
                            "val": "3.031"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.031"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.332"
                        },
                        "BudgetYearThree": {
                            "val": "4.153"
                        },
                        "BudgetYearFour": {
                            "val": "3.823"
                        },
                        "BudgetYearFive": {
                            "val": "3.900"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides program management, execution, and support to implement a broad range of cooperative naval Research and Development, Test and Evaluation (RDT&E) initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches in coordination with combatant commanders (COCOMs), and appropriate partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership Initiative.\n\nThe project scope was expanded from primarily North Atlantic Treaty Organization (NATO)-centric to include Overseas Contingency Operations (OCO), and  Maritime Domain Awareness (MDA) emphasis.  Relationships have been, and are being initiated with a greatly expanded and diverse group of maritime countries, particularly those with nascent and littoral navies, located in new regions critical to U.S. security.  The project was restructured internally to both maintain ongoing international relationships and projects, while preparing to facilitate support for a global network of maritime nations under MDA and increase OCO-related support requirements. \n\nOngoing cooperative RDT&E programs, projects and exchanges are pursued to identify cooperative acquisition programs, enhance OCO efforts and MDA development, fill capability gaps, improve US\/coalition interoperability, and set standardization with international partners. Such efforts have resulted in:\n1. Negotiating and developing approximately 57 international RDT&E Agreements annually with allied and friendly nations;\n2. Executing approximately 300 Information Exchange Annexes (IEAs) with foreign partners;\n3. Improving IEA information dissemination with allied and friendly countries and within Department of the Navy (DoN);\n4. Coordinating Navy inputs to the Office of the Under Secretary of Defense (OUSD) Acquisition, Technology, and Logistics (AT&L) Foreign Comparative Test (FCT) Program, and Coalition Warfare Program (CWT) as well as the DoN Technology Transfer Security Assistance Review Boards (TTSARB). \n5. Represent the US Navy in Office of the Secretary of Defense (OSD) directed Armaments Cooperation Forums, including the Conference of NATO Armaments Directors' groups {NATO Naval Armaments Group (NNAG)}, and Senior National Representative-Maritime (SNR-M);\n6.  Funding of various international RDT&E support databases including Technical Project Officer (TPO), International Agreement Generators, Information\/Data Exchange Agreements, and Project Agreements\/Memorandums of Understanding;\n7.  Leading the Engineering and Scientist Exchange Program (ESEP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Coop RDT&E"
                                    },
                                    "Description": {
                                        "val": "FY13 funding decrease is due to programmatic realignments to other Navy priorities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.515"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained internal DoN international databases to support international cooperative activities and projects with allies. Assessed functional ability to integrate DoN international databases across OPNAV departments to improve leveraging of program dollars, fielding of better products and speeding delivery.\n\n- Continued to support Maritime Theater Missile Defense Forum that obtained $8.1M in R&D monies from Partner Nation contributions. The multi-lateral forum (9 Maritime Partner countries and the US Navy) entered into four international agreements (Battle Management Command, Control, Communications, Computers and Intelligence (BMC4I); Distributed Engineering Plant; Open Architecture; and Modeling and Simulation (M&S)). The Maritime Theater Missile Defense Forum has a goal of an at-sea capability demonstration in 2015.\n- Continued to coordinate US Navy's participation in OUSD AT&L's Foreign Comparative Test (FCT) Program and the Coalition Warfare Program (CWP) selection processes to meet emerging military Capability requirements.\n- Continued execution of approximately 300 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries.\n- Continued execution and support in placement of US Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP). Funded various evolving potential cooperative exchanges and projects contributing to Maritime Domain Awareness (MDA) and irregular warfare including Multi-Mission Aircraft (MMA), Broad Area Maritime Surveillance (BAMS), Submarine Littoral Weapons System, and Swimmer Engagement. Coordinated US Navy support to OUSD (AT&L) International Cooperation office. Supported new CNO-Initiated Strategy Dialogue with Australia, including Air and Expeditionary Warfare Working Groups for mutual development of requirements and projects. Supported NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs including harbor protection, electronic warfare, and Defense Against Terrorism (DAT) trials.\n- Completed US Navy International Bench, a new internet-based connector and composeable tool to enhance collaboration between US military and agency personnel engaged in international work."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.506"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY11."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.031"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.031"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY12."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy International Cooperative RDT&E project supports the implementation of many international cooperative program activities throughout the Department of the Navy (DoN) RDT&E communities. The project funds DoN participation in NATO and OSD lead Armaments Cooperation as well as DoN lead international cooperation that promotes coalition interoperability and set standards with international partners. The focused activities under this project maximize the DoN's efforts by leveraging international technologies and funding to fill capabilities gaps, gain access to foreign research and testing data, and avoid duplication of research and development efforts. The performance goals and metrics are, in cooperation with Maritime Partner nations, to set and harmonize requirements, utilize respective technologies, encourage financial contributions and facilities use, and support forums and work that reduce DoN funding requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1767"
                    },
                    "ProjectTitle": {
                        "val": "Naval War Col Strategic Studies Supt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.648"
                        },
                        "CurrentYear": {
                            "val": "3.927"
                        },
                        "BudgetYearOne": {
                            "val": "3.473"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.473"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.314"
                        },
                        "BudgetYearThree": {
                            "val": "5.182"
                        },
                        "BudgetYearFour": {
                            "val": "4.828"
                        },
                        "BudgetYearFive": {
                            "val": "4.910"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Naval War College (NWC) research, analysis and gaming activities serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, Joint and Interagency communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analysis, war gaming, political-military assessments, and provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Studies"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts research in strategic studies in response to tasking from the Secretary of the Navy (SECNAV), Chief of Naval Operation (CNO), Fleet Commanders, numbered Fleet Commanders, and Combatant Commanders.  NWC also hosts the activities of the CNO's Strategic Studies Group (SSG).  The CNO SSG is a select group of senior officers from the Navy, Marine Corps, Coast Guard and Air Force handpicked by the CNO or appropriate Chief of Service, who report directly to the CNO in the generation of revolutionary warfighting and operational concepts for the future Navy, such as Sea Strike and FORCEnet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted research and analysis projects and provided supporting events for the Office of the Chief of Naval\n  Operations (OPNAV), the numbered Fleets, Navy Component Commanders, and the Combatant Commanders.  \n- Conducted support of the OPNAV Staff on operational and strategic level of war tasked research projects.   \n- CNO SSG tasking from the CNO to SSG XXX to generate revolutionary operating and warfighting concepts for the Navy's \n  future computing and information environment.  Followed up on CNO and OPNAV actions resulting from SSG XXVIII Final\n  Report \"The Unmanned Imperative\" and SSG XXIX Final Report \"Maritime Freedom of Action 2020\" addressing warfare in \n  the age of hypersonic and directed energy weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets,\n  Navy Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- Continue CNO SSG tasking from the CNO to SSG XXXI to generate revolutionary operating and warfighting concepts for\n  future Navy and maritime operations.  Following up on CNO and OPNAV actions resulting from SSG XXIX and SSG XXX \n  Final Reports."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.431"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.431"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, \n  Navy Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- Continue CNO SSG tasking from the CNO to SSG XXXII to generate revolutionary operating and warfighting concepts \n  for future Navy and maritime operations.  Following up on CNO and OPNAV actions resulting from SSG XXX and SSG \n  XXXI Final Reports. \n- Conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval War Gaming Support"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts strategic and operational war gaming and research for the Office of the Chief of Naval Operations (OPNAV), the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Each year, 50-60 major war games and associated events provide support to efforts that explore and analyze military, political, informational and economic aspects of differing strategic and operational scenarios and tactical imperatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.304"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to conduct over 55 major war games and related events in support of OPNAV, the numbered Fleets, and the \n  Combatant Commands.   \n- Continued to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continued to provide war \n  gaming expertise to other services' Title 10 war games. \n- Continued to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such \n  as MDA, Irregular Warfare, cyber, and C4ISR. \n- Continued to foster and sustain cooperative relationships with international partners through the use of war gaming, \n  research, and analysis. \n- Continued to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC) and US\n  Joint Forces Command.  \n- Continued to conduct analytic research on maritime security cooperation planning for forward based fleets.  \n- Supported Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure \n  protection. \n- Continued to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for the \n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continued to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for \n  the Office of the Secretary of Defense (OSD).   \n- Continued war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime \n  security, and sea control. \n- Continued International War Gaming in support of Maritime Security Cooperation and implementation of Cooperative \n  Strategy for 21st Century Seapower.  Planned a Joint Operational Planning war game with the Kuznetsov Naval Academy\n  to further international understanding of maritime security operations.    \n- Continued to conduct research and developed advanced gaming for Joint\/Combined Force Maritime Component Commander Flag\n  Officer Course and Maritime Staff Officers Course.   \n- Continued to develop educational materials for the Maritime Advanced Warfighting School.  \n- Continued to conduct research and analysis on key operational challenges such as theater anti-submarine Warfare, \n  maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea \n  basing.    \n- Continued to develop advanced war gaming analytical methods and tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.488"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the \n  Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war \n  gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such\n  as MDA, Irregular Warfare, cyber, and C4ISR. \n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming,\n  research, and analysis. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC) and US\n  Joint Staff Command.  \n- Continue to conduct analytic research on maritime security cooperation planning for forward based fleets.  \n- Support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure\n  protection. \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for the\n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for\n  the Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime \n  security, and sea control. \n- Continue International War Gaming in support of Maritime Security Cooperation and implementation of Cooperative \n  Strategy for 21st Century Seapower.  Plan a Joint Operational Planning war game with the Kuznetsov Naval Academy to\n  further international understanding of maritime security operations. \n- Continue to conduct research and develop advanced gaming for the Joint\/Combined Force Maritime Component Commander \n  Flag Officer Course and Maritime Staff Officers Course.   \n- Continue to develop educational materials for the Maritime Advanced Warfighting School.  \n- Continue to conduct research and analysis on key operational challenges such as theater anti-submarine Warfare, \n  maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea \n  basing.   \n- Continue to develop advanced war gaming analytical methods and tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Continue to conduct 45-50 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.   \n- Continue with limited support to CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such as MDA, Irregular Warfare, cyber, and C4ISR \n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming, research, and analysis. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC) and US Joint Staff Command.  \n- Support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection. \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime security, and sea control. \n- Continue to develop educational materials for the Maritime Advanced Warfighting School.  \n- Continue to conduct research and analysis on key operational challenges such as theater anti-submarine Warfare, maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea basing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) supports senior decision-makers from the Department of Defense, Department of the Navy, the numbered Fleets, Fleet Commanders and Combatant Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research that integrates traditional research and analysis, ongoing wargaming efforts and advanced decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.307"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Established and commenced research on a multi-year research project to research, analyze and wargame future \n  warfighting trends through a detailed, scenario based research methodology.  This work is in direct support of CNO \n  objectives and OPNAV wholeness reviews.\n- Continued to conduct major decision events in support of Office of the Chief of Naval Operations (OPNAV), the\n  numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Projects were in direct support of warfighting \n  analysis requirements.\n- Conducted analytical research on key strategic and operational challenges such as maritime ballistic missile defense,\n  proliferation security initiative, global maritime security, maritime situational awareness, maritime operations\n  headquarters, interconnectivity, and multi-service force deployment.   \n- Conducted Command & Control Futures Assessment with OPNAV N2N6.\n- Conducted Unmanned Undersea Vehicle (UUV) Innovation with Naval Undersea Warfare Center (NUWC).\n- Conducted Long-Range Air-to-Surface Missile (LRASM) program research in support of Defense Advanced Research Projects\n  Agency (DARPA).\n- Conducted Integrated Air and Missile Defense (IAMD) Operations research in support of Navy Air and Missile Defense\n  Command (NAMDC).\n- Conducted Unmanned Undersea Vehicles (UUV) Enabling Concept development in support of Naval Undersea Warfare Center\n  (NUWC), Navy Warfare Development Command (NWDC), and Naval War College (NWC).\n- Conducted strategic outlook \/ futures research in support of Space and Naval Warfare Systems Command (SPAWAR).\n- Conducted  Affinity Axis Model for theater engagement assessment research and assessment in support of OPNAV N52.\n- Continued additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conducted research targeted at the strategic and policy level decision making within China.\n- Continued to provide direct support to NWC student research groups and war gaming. \n- Conducted 35-45 major decision events in support of their efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue research on a multi-year research project to research, analyze and wargame future warfighting trends through\n  a detailed, scenario based research methodology.  This work is in direct support of CNO objectives and OPNAV\n  wholeness reviews.\n- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the \n  Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet\n  commanders.\n- Conduct analytical research on key strategic and operational challenges such as maritime ballistic missile defense,\n  proliferation security initiative, global maritime security, maritime situational awareness, maritime operations\n  headquarters, interconnectivity, and multi-service force deployment.  \n- Conduct Command & Control Futures Assessment with OPNAV N2N6.\n- Conduct Unmanned Undersea Vehicle (UUV) Innovation with Naval Undersea Warfare Center (NUWC).\n- Conduct Long-Range Air-to-Surface Missile (LRASM) program research in support of Defense Advanced Research Projects\n  Agency (DARPA).\n- Conduct Integrated Air and Missile Defense (IAMD) Operations research in support of Navy Air and Missile Defense \n  Command (NAMDC).\n- Conduct Unmanned Undersea Vehicles (UUV) Enabling Concept development in support of Naval Undersea Warfare Center \n  (NUWC), Navy Warfare Development Command (NWDC), and Naval War College (NWC).\n- Conduct strategic outlook \/ futures research in support of Space and Naval Warfare Systems Command (SPAWAR).\n- Conduct Affinity Axis Model for theater engagement assessment research and assessment in support of OPNAV N52.\n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- Conduct 40-50 major decision events in support of their efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue research on a multi-year research project to research, analyze and wargame future warfighting trends through\n  a detailed, scenario based research methodology.  This work is in direct support of CNO objectives and OPNAV\n  wholeness reviews.\n- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the \n  Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet \n  commanders and were expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian \n  Ocean.   \n- Conduct analytical research on key strategic and operational challenges such as maritime ballistic missile defense, \n  proliferation security initiative, global maritime security, maritime situational awareness, maritime operations \n  headquarters, interconnectivity, and multi-service force deployment.   \n- Conduct Command & Control Futures Assessment with OPNAV N2N6.\n- Conduct Unmanned Undersea Vehicle (UUV) Innovation with Naval Undersea Warfare Center (NUWC).\n- Conduct Long-Range Air-to-Surface Missile (LRASM) program research in support of Defense Advanced Research Projects \n  Agency (DARPA).\n- Conduct Integrated Air and Missile Defense (IAMD) Operations research in support of Navy Air and Missile Defense\n  Command (NAMDC).\n- Conduct Unmanned Undersea Vehicles (UUV) Enabling Concept development in support of Naval Undersea Warfare Center\n  (NUWC), Navy Warfare Development Command (NWDC), and Naval War College (NWC).\n- Conduct strategic outlook \/ futures research in support of Space and Naval Warfare Systems Command (SPAWAR).\n- Conduct Affinity Axis Model for theater engagement assessment research and assessment in support of OPNAV N52.\n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- Conduct 40-50 major decision events in support of their efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NWC Student Research Projects"
                                    },
                                    "Description": {
                                        "val": "Selected top performing Naval War College (NWC) students to conduct focused research and analysis of current and future strategic and operational challenges and tactical imperatives.  These students are organized under the supervision of the Mahan Scholars Program and the Halsey Group Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.113"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted focused research, analysis and war gaming of current and future strategic\/operational challenges and \n  tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continued to conduct focused research, analysis and free-play war gaming of current and future\n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial \n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM)\n  and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continued in those areas \n  above, and expanded to include a detailed focus on counter-targeting, operational deception, and countering \n  information denial and missile defense at the theater joint operational level.    \n- Conducted research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct focused research, analysis and war gaming of current and future strategic\/operational challenges\n  and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups will continue to conduct focused research, analysis and free-play war gaming of current and future\n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial \n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM)\n  and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts will continue in those\n  areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and \n  countering information denial and missile defense at the theater joint operational level.    \n- Continue to conduct research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct focused research, analysis and war gaming of current and future strategic\/operational challenges \n  and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups will continue to conduct focused research, analysis and free-play war gaming of current and future \n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial\n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM)\n  and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts will continue in those \n  areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and \n  countering information denial and missile defense at the theater joint operational level.    \n- Continue to conduct research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Headquarters \/ Maritime Operations Center (MOC) Analysis"
                                    },
                                    "Description": {
                                        "val": "A. MISSION DESCRIPTION AND BUDGET ITEM JUSTIFICATION: Formerly JFMCC\/Worldwide Naval Component Commanders (WNCC).  Naval War College (NWC) conducts research and analysis at the operational level of war, including direct support for the Maritime Headquarters (MHQ) and Maritime Operations Centers (MOC), as well as Combined\/Joint Forces Maritime Component Commander (C\/JFMCC) activities.  These activities include support for concept and doctrine development of numbered fleet war games, exercises, education, research and analysis.  NWC is responsible for development of the Professional Military Education for Naval Component Commanders and Numbered Fleet Staff personnel, and the Numbered Fleet Commander, including education and research initiatives in support of the concept of operations development, training and C\/JFMCC advisory and assist team."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Researched\/Developed educational products to enhance the activities and operational capability of the C\/JFMCC \n  including conducting US and international-based course materials.\n- Researched\/Developed methods to improve direct support for the Numbered Fleet Commanders, including education, \n  exercise development and execution, planning methods\/means, assessment processes, and real-time execution of directed\n  tasks.\n- Researched\/Developed specific MOC-related planning and assessment tools for Commander, FOURTH Fleet in response to\n  Haiti contingency.\n- Researched\/Developed specific MOC-related training for Commander, TENTH Fleet and tailored planning assistance for\n  cyberspace operations and integration of non-kinetic capabilities.\n\t- EW Symposium attendance (JUN 2011) to enhance knowledge of Electronic Attack (EA), Electronic Surveillance \n  (ES) and Electronic Protection (EP) and how these evolving tactical capabilities will blend with cyberspace \n  activities at the operational level of war.\n- Provided assist team visits in support of analysis and definition of maritime operational processes, including \n  execution battle management, tasking subordinates, operational level planning and operational\/Fires (effects) \n  assessment. \n\t- Supported the Navy Planning Process academics, IO and cyberspace operations discussions with critical \n  planners and deployers at NIOC Norfolk (Little Creek, VA).  Knowledge gained by AAT representatives will greatly \n  enhance IO\/cyber support to other numbered fleets and C10F\/FCC.\n- Continued research into the required competencies for Maritime Staff Operations Course for officer and enlisted \n  personnel to successfully operate at the operational level of war.\n\t- Interviews and discussions with multiple Joint service Fires & Targeting experts greatly enhanced the \n  development of expanded academic knowledge base in Joint FIRES for both kinetic and non-kinetic capablities.\n- Researched\/Developed educational products on maritime matters at the Operational Level of War (OLW) to better \n  prepare officers and senior enlisted personnel to effectively serve in operational staff assignments in Maritime \n  Operations Centers (MOC) at 3 or 4 star operational headquarters, or represent maritime planning efforts while \n  serving in other service, joint or combined liaison billets.\n- Developed methods to improve Naval War College's mission to provide a continuum of Joint Professional Military \n  Education and support operational commanders through enhanced education and training.  Included improved methods to\n  familiarize students with operational and Navy theory, concepts, doctrine, organizations, capabilities, \n  responsibilities, functions, planning and execution processes techniques and practices.\n- Provided subject matter expertise for concept and doctrine development of numbered fleet war games, exercises,\n  education, research and analysis.\n\t- Supported NWDC critical re-write of Maritime Dynamic Targeting Tacmemo (MDT TM).\n\t- Supported  critical response to CNO task memo on implementation of Navy Information Dominance with high- \n           demand, low-density expertise on cyberspace analysis and planning activities.\n- Provided research and analysis of senior mentor and executive leadership development within maritime headquarters.  \n- Conducted research and analysis in competencies and manpower capabilities at the operational level of war, including\n  direct support for objective manpower resource data and decision making tools at operational level maritime \n  headquarters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "All activities\n- Remain credible, relevant and focused through continued development of MOC processes, doctrine and edcucational\n  products.\n- Actively participate in creation and review of existing and emerging doctrine, and have active involvement in\n  development of evolving operational level issues.\n\t- Continue the ongoing re-write of the Operational Assessment (OA) Tacmemo (TM) in both FY2011\/2012 through \n  focused research and analysis of conceptual scenarios and real-world operations, to include Operation Odyssey Dawn \n  (OOD) and the Southern Partnership Station (SPS) deployment to the SOUTHCOM AOR.\n\t- Support NWDC transition of Maritime Dynamic Targeting Tacmemo (MDT TM) into more formal NTTP doctrine in \n  both FY2011\/2012 through focused research and analysis of current and foreseeable processes, capabilities and\n  requirements facing MOC staffs and subordinate CTFs.\n\t- Support NWDC in update revisions to existing doctrine such as MOC TTP (NTTP 3-32.1) and NWP 3-32 through \n  focused research and analysis of MOC best practices, developments in joint components' capabilities and processes of \n  Maritime Staff Operators Course (MSOC).\n- Expand research into the required competencies for Maritime Staff Operations Course for officer and enlisted \n  personnel to successfully operate at the operational level of war.\n- Incorporate more interactive technologies for staff collaboration while conducting distributed operations.\n- Conduct research in advanced adaptive intelligence, information warfare, and other advanced decision-support tools, \n  including adapting Spiral-developed systems into the MOC classroom environment. \n- Continue research to improve coalition-related MOC education programs for International Officers and senior\n  officers (continued improvements).  Includes support for MAWS and alignment with all other operational level \n  education at NWC and other Service educational facilities.\n- Examine gaps in education at the OLW; develop COI to close same gaps (Information management\/knowledge management, \n  et al). \nAssist and Assess Team (AAT)\n- Expand research and analysis into integrating lateral and vertical operations of Commander, TENTH Fleet MOC with \n  operations at existing numbered fleet MOCs, USFFC and US Pacific Fleet, as well as upward to the new USCYBERCOM and\n  downward to subordinate CTFs and commands.\n\t- May pursue additional research, analysis, and educational opportunities with organizations such as NIOC \n  Maryland, CWDG (Cyberspace Warfare Development Group - formerly NIOC Suitland), and potentially other C10F \n  subordinate commands.\n- Conduct research and analysis into potential methods for integration of information operations (to include cyber\n  space operations) with traditional kinetic joint fires operations.  Cyberspace operations (offensive and defensive) \n  present unique challenges due to the global nature of the domain, the potential effects on other MOCs and the\n  importance of alignment for effective strategic communication.\n- Conduct research into how Navy units worldwide can support Commander, TENTH Fleet in the execution of the full\n  spectrum of information and cyberspace operations. \n- Provide tailored assistance to Commander, TENTH Fleet and Commanders of other MOCs to communicate results of above\n  research and analysis efforts and to strengthen staff knowledge of joint information operations planning, execution, \n  and assessment.\n- Support development of evolutionary Knowledge Management (KM) processes through research, analysis and authoring of\n  KM articles in critical military and industry journals such as Proceedings, IOSphere, etc. Joint\/Combined Forces \n  Maritime Commanders Course (J\/CFMCC).\n- Continue development\/research in national and international implications of maritime commander leadership roles, and\n  development of new flag course curriculum accordingly.\n- Research in the impacts of transition from contract to government employee support for senior mentors with regards \n  to implementation of CNO's priorities on operational level leadership and flag academics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This project provides research, analysis and war gaming to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of war games, analysis and the extent to which demand for war games and research products can be accommodated within funding levels.  Results of research products and war games are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2221."
                    },
                    "ProjectTitle": {
                        "val": "JT Mission Assessment Studies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.370"
                        },
                        "CurrentYear": {
                            "val": "30.881"
                        },
                        "BudgetYearOne": {
                            "val": "10.484"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.484"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "24.860"
                        },
                        "BudgetYearThree": {
                            "val": "24.225"
                        },
                        "BudgetYearFour": {
                            "val": "19.606"
                        },
                        "BudgetYearFive": {
                            "val": "19.927"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations, Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis. The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Standard Scenarios with Warfare and Warfare Support Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.582"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed, updated, and maintained detailed level Navy Standard scenarios based on Defense Planning Guidance.\n-Developed alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses.  \n-Developed, updated, and maintained analytic baselines for the Major Combat Operations based on Defense Planning Guidance. \n-Developed a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Developed measures of performance (MOPs) and measures of effectiveness (MOEs) and recommended appropriate modeling\/methodology to support analyses.  \n-Developed scenarios and operational concepts based on government inputs that were sufficiently detailed for use in naval and joint campaign analyses.  \n-At the mission level, scripted operational situations (OPSITS) or tactical situations (TACSITS) for use in effectiveness analyses in specific warfare lanes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.573"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop, update, and maintain detailed level Navy Standard scenarios based on Defense Planning Guidance (DPG).  \n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update, and maintain analytic baselines for the Major Combat Operations (MCO) based on DPG. \n-Continue to develop a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-At the mission level, continue to script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas.\n-Develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi Service Force Deployment Plans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to update and maintain detailed level Navy Standard scenarios based on DPG.  \n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi Service Force Deployment Plans.\n-Maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.\n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses, and provide input to operational situations or tactical situations for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.105"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Assessed capability sponsors' products for Navy senior leadership decision forums.  \n-Performed collaborative assessment with capability sponsors.  \n-Proactively participated in Capability Sponsors' Integrated Process Teams.  \n-Presented opposing analytically-based points of view to the Chief of Naval Operations (CNO) and Navy senior leadership.  \n-Provided analytically-based decision recommendations to CNO for both warfighting and support areas.  \n-Developed CNO Investment strategy recommendations and performed assessments for Program Review and Program Objective Memorandum.  \n-Assessed capability sponsors' products for senior leadership decision forums.  \n-Conducted Verification, Validation & Accreditation of warfare, performance, and pricing models.  \n-Conducted Overseas Contingency Operation (OCO) Capabilities-Based Assessment (CBA) that provided a rapid and scalable process to utilize a Concept of Operation and developed investment strategy and a capability roadmap.  \n-Conducted Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments.  \n-Conducted independent assessment of Anti-Submarine Warfare.  \n-Conducted weapons safety and sea basing capabilities assessments.  \n-Conducted Intelligence, Surveillance, and Reconnaissance (ISR) and Meteorological and Oceanographic (METOC) assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support Major Combat Operations (MCOs), the OCO, and intelligence preparation of the environment for both MCOs and OCO.   \n-Performed CBAs to meet the requirements of current and future scenarios, and made strategic decisions within a constrained economic framework.  \n-Performed rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues that supported decision-making in the Planning, Programming, Budgeting Execution process. \n-Performed analyses and provided technical and engineering support, including joint campaign analysis that examined the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determined system capabilities; conducted analyses of alternative force structures that determined the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Conducted cost analyses; cost-effectiveness analyses; and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan.  \n-Developed innovative analysis techniques that evaluated the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation.  \n-Provided rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Performed analyses for accreditation of models, used estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.183"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to assess capability sponsors' products for Navy senior leadership decision forums. \n-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the Chief of Naval Operations (CNO) and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct Overseas Contingency Operation (OCO) Capabilities-Based Assessments (CBAs) that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct Intelligence, Surveillance, and Reconnaissance (ISR) and Meteorological and Oceanographic (METOC) assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support Major Combat Operations (MCOs), the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to perform CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the Planning, Programming, Budgeting Execution process. \n-Continue to perform analyses and provide technical and engineering support, including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost analyses, cost-effectiveness analyses, and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to perform analyses for accreditation of models, use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.406"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.406"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to assess capability sponsors' products for Navy senior leadership decision forums. \n-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the Chief of Naval Operations (CNO) and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct Overseas Contingency Operation (OCO) Capabilities-Based Assessments (CBAs) that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct Intelligence, Surveillance, and Reconnaissance (ISR) and Meteorological and Oceanographic (METOC) assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support Major Combat Operations (MCOs), the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to perform CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the Planning, Programming, Budgeting Execution process. \n-Continue to perform analyses including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Campaign Analysis-Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed and maintained common baselines from which campaign excursions and mission-level analyses are executed.  \n-Identified, developed, and improved data and modeling.  \n-Led Navy's participation in Office of the Secretary of Defense (OSD)\/Joint Staff analytic agenda, baseline development, and collection of data.  \n-Provided coordination across the Navy.  \n-Brokered agreed upon assumptions, Concept of Operations (CONOPS), scenarios and data.   \n-Led campaign analysis for Office of the Chief of Naval Operations (OPNAV).  \n-Conducted modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.946"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop, and improve data and modeling. \n-Continue to lead Navy's participation in the OSD\/Joint Staff analytic agenda, baseline development, and collection of data. \n-Continue to provide coordination across the Navy. \n-Continue to broker agreements upon assumptions, CONOPS, scenarios, and data. \n-Continue to lead campaign analysis for OPNAV. \n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.951"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.951"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue Navy's participation in Office of the Secretary of Defense (OSD)\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to provide coordination across the Navy.\n-Continue to broker agreements upon assumptions, Concepts of Operations, scenarios, and data.\n-Continue to lead campaign analysis of Office of the Chief of Naval Operations (OPNAV).\n-Maintain common baselines from which campaign excursions and mission-level analyses are executed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OSD\/Joint Staff Study Analysis and Assessment with Investment Strategy Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.126"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Coordinated and led OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhanced Planning Process, Strategic Planning Guidance, and participated in Capability Sponsors' Integrated Process Teams. \n-Provided overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance. \n-Provided analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Conducted net assessments and provided independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Served as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Provided the lead requirements and acquisition for OPNAV. \n-Coordinated and led Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Participated in OSD and Joint Staff analysis assessment and provided structure for coordination across the Navy. \n-Coordinated and supported Joint Analytical Model Improvement Program. \n-Developed new analytic techniques for informing resource allocation decisions; conducted all campaign and warfare mission-level analyses and developed investment strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching PPBES analyses and guidance. \n-Continue to provide analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to provide the lead requirements and acquisition for OPNAV. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to participate in Office of the Secretary of Defense (OSD) and Joint Staff (JS) analysis assessment and provide structure for coordination across the Navy. \n-Continue to coordinate and support Joint Analytical Model Improvement Program. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.067"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.067"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to coordinate OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance. \n-Continue to provide analytically-based decision recommendations to Office of the Chief of Naval Operations (OPNAV) for joint war fighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Class Modeling, Simulation, and Capability Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.337"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed and improved the Navy's Modeling and Simulation (M&S) capabilities used to develop analyses and assessments to aid in the optimization of Navy programs and investment decisions.  Supported validation models (e.g. price performance Planning, Programming, Budgeting and Execution (PPBE) models) as appropriate.  Areas of M&S development and improvement span strategic, operational, and resource decision making; price performance models relating investments and manpower to output performance and readiness; Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance interactions; emerging challenges in irregular, unconventional, information and cyber warfare as well as terrorist, disruptive, and catastrophic threats; Sea Strike, Information Dominance, Sea Shield, and Sea Basing mission areas. \n-Conducted mission-level warfare Modeling and Simulation (M&S) of Joint Capability Areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Develop and improve the Navy's analyses and assessment capabilities through innovative, concise, and credible M&S to help optimize Navy programs, investment decisions, and policies across the Office of the Chief of Naval Operations (OPNAV) enterprise.  \n-FY12 plan continues to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts will include:   Field the Cyber Force Structure model that balances operational risks and deployment costs across cyber personnel, network architecture, operational procedures, and cyber security portfolio options.  \n-Develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Integrate the components of ship readiness (operational, maintenance, etc.) into a PPBE Performance-Pricing model with ship scheduling and optimization capability. \n-Deliver interim version of Synthetic Theater Operations Research Model (STORM) with expanded logistic capabilities critical to United States Navy and United States Marine Corps.  \n-Improve air warfare models to include airborne electronic attack capabilities developed in FY11. \n-Deliver interim Integrated Air and Missile Defense mission model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JT Mission Assessment Studies"
                                    },
                                    "Description": {
                                        "val": "CBA - The CBA is the JCIDS analysis process that includes three phases: the FAA, the FNA, and the Functional Solution Analysis. The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval war fighting capabilities and force structure needed to support the JROC\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.384"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued FY10 CBA efforts. The additional funds in FY11 were required to initiate FY11 CBAs supporting future Naval capability requirements for next-generation shipbuilding, aviation, and weapons systems. Provided analysis support for development of the Integrated Sponsor Program Proposal supporting Guidance to Develop the Force Direction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY11 CBA efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY12 CBA efforts.  Provide analysis support for development of the Integrated Sponsor Program supporting Guidance to Develop the Force Direction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AOA for ASUW Capability"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct analysis of alternatives for offensive anti-surface warfare (OASUW) capabilities, based on analysis plan and kill chain linkages assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OASUW Pre-Milestone A"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The additional funds in FY12 are required to initiate OASUW pre-Milestone A requirements to continue material solution analysis to ensure compliance with statutory and regulatory requirements of this pre-Major Defense Acquisition Program effort. Efforts to be performed in support of OASUW requirements include analysis to support development of the Technology Development Document, Capabilities Development Document, and Technical Demonstration documentation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "-The overall goal is to conduct analysis to support the Navy decisions needed to turn strategy and guidance into the Fleet we need within acceptable risk. METRIC: Risks are balanced across capability that delivers the right capabilities within the resources available to Navy. Navy Assessment Program supports the development of platform specific studies and Capability-Based Assessments, an analytical effort resulting in Functional Area Analysis, Functional Needs Analysis , and Functional Solutions Analysis. Efforts provide added analytical rigor relative to program's maturation under the Joint Capabilities, Integration, and Development System and support warfare integration initiatives. \n-Navy Standard Scenarios with Warfare and Warfare Support Analyses: Goal: To ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved source material. METRIC: Consistency with other ongoing analyses as directed, develop Measures of Performance and Measures of Effectiveness and recommend appropriate modeling\/methodology to support analysis. Models\/methodology used reflect study objects, level of fidelity required and time constraints. \n-Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support: Goal: To provide analyses and technical and engineering support including, but not limited to, joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, force structure of modernization decision; mission-level effectiveness analyses to determine system capabilities; analyses of alternative force structures to determine ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations; cost-effectiveness and analyses; Acquisition Category Program Office and Systems Command assessments; and analyses of new technologies. METRIC: Develop analysis plans; determine proposed alternatives for analysis; and research performance data on current and future threats, coalition and own force systems; perform technology investigations and forecasts; develop or obtain cost data for current or planned systems; develop and use Cost Estimating Relationships to determine cost for conceptual or future systems for which no cost data is available; identify analysis assumptions, limitations and uncertainties; use established models or develop new models or methodologies to perform analyses; and interpret and analyze results. \n-Campaign Analysis-Modeling and Simulation: Goal: Develop and maintain a standard set of models for use in warfare analyses and analyses performed to support Planning Strategy that work at the campaign, mission, and engagement levels. METRIC: A combination of model design statements, model study reports, system specifications, updated model reports, model\/database documents, model verification and validation plans, code, and Plan of Action and Milestones reports developed or updated that encompass all aspects of Sea Power 21 to include at a minimum air, land, sea, and Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance.\n-Joint Assessments and Integration and Investment Strategy Development: Goal: Conduct assessments to determine shortfalls and redundancies in existing or planned operational or support capabilities; identify key issues including deficiencies in war fighting capability; determine priorities for needed capabilities; assesses affordability of high payoff systems and technologies; assess effectiveness and affordability of alternative force structures; and formulate investment strategies. Continue development and refinement of Navy program planning to determine the war fighting wholeness and cost effectiveness of alternative Navy strategies. METRIC: Identify shortfalls and redundancies in existing or planned capabilities. Determine the impact of variations in warfare systems and architectures in threat, U.S. and combined forces and strategies. Provide engineering and analytic support for the assessment and transition of technology for use in the Investment Strategy. \n-World Class Modeling, Simulation, and Capability Analysis: Goal: Development of new models or model upgrades to meet requirements identified by the WCM requirements process that support the Program Objective Memorandum decision-making process, with the goal of creating a state-of-the art set of models for use in warfare and warfare support analyses. METRIC: Develop model design documents, model study reports, system specifications, updated model reports, model documentation, model verification and validation plans, code, Plan of Action and Milestones reports, and technical reports.\nThe May 2007 revision of the Joint Chiefs of Staff's Joint Capabilities Integration and Development System (JCIDS) instruction (CJCSI 3170.01F) requires a Capabilities-Based Assessment (CBA) to assess new requirements. A CBA instruction has been developed by the CNO's warfare integration office that prescribes a procedure and structure to this warfighting requirements generation process (JCIDS). A CBA is required to address and validate capability shortfalls or gaps as defined by combatant commanders. It is an analytical process that includes three phases: the Functional Area Analysis, the Functional Needs Analysis, and the Functional Solution Analysis. This process is designed to address future warfighting requirements and analysis needs and improve the quality of Analysis of Alternatives. CBA supports Navy programming decisions and provides the means to develop the analytic underpinning to support the determination of Naval capabilities and force structure recapitalization investments required to fulfill the Maritime Strategy."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3025"
                    },
                    "ProjectTitle": {
                        "val": "Mid-Range Financial Improvement Plans"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.389"
                        },
                        "CurrentYear": {
                            "val": "1.244"
                        },
                        "BudgetYearOne": {
                            "val": "0.647"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.647"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.888"
                        },
                        "BudgetYearThree": {
                            "val": "0.895"
                        },
                        "BudgetYearFour": {
                            "val": "0.845"
                        },
                        "BudgetYearFive": {
                            "val": "0.875"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "One of DoD's and Navy's priority goals is to gain a clean and auditable financial statement.  The Office of the Secretary of Defense (OSD) Comptroller, in his 8 August 2003 memorandum, directed the Military Departments and Defense Agencies, in coordination with the Defense Finance and Accounting Service (DFAS), to prepare a comprehensive mid-range financial improvement plan to identify measurable steps to ensure each material line is auditable, and ensure all major deficiencies are resolved.  \n\nThis project supports the Research, Development, Test and Evaluation, Navy (RDT&E,N) portion of the larger DoD and Navy-wide effort to implement the Financial Improvement Plan (FIP).  Corrective actions required to resolve known deficiencies and determine resource requirements (people and systems) are being identified."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mid-Range Financial Improvement Plans"
                                    },
                                    "Description": {
                                        "val": "Decrease from FY11 to FY12 due to sustainment phase of FIP.\nDecrease from FY12 to FY13 due to reduced level of effort for audit readiness and sustainment phase of FIP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued performing obligation validations ensuring accuracy.\n- Continued eliminating problem disbursements older than 120 days, narrowing to 60 days, and potentially narrowing even further.\n- Continued to be proactive in executing the first and second phases (discovery and correction) of the Office of Management and Budget Circular No. A-123 process which requires Federal agencies to take responsibility for conducting a rigorous assessment of internal controls over financial reporting.\n- Continued to participate in the Navy Financial Management Office (FMO) segment testing which includes Reimbursable Work Order (RWO) Grantor, RWO-Performer, and Funds Distribution and Reporting.\n- Supported the Statement of Budgetary Resources (SBR) assertion with Naval Audit Service"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Financial records are compliant in accordance with the Chief Financial Officers Act."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3039"
                    },
                    "ProjectTitle": {
                        "val": "CHENG"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.666"
                        },
                        "CurrentYear": {
                            "val": "16.486"
                        },
                        "BudgetYearOne": {
                            "val": "12.725"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.725"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "18.697"
                        },
                        "BudgetYearThree": {
                            "val": "18.411"
                        },
                        "BudgetYearFour": {
                            "val": "17.357"
                        },
                        "BudgetYearFive": {
                            "val": "17.713"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability and Anti-Tamper initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Standards, Policy, and Guidelines"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued alignment of standards, policy, and guidelines across the Naval Enterprise and with OSD and Joint Service organizations - added alignment with law. \n- Investigated Aggregation of Systems and the application of Systems Engineering Processes and Practices to them across the Naval Enterprise, particularly those involved in Information Assurance (IA) and Integration and Interoperability.\n- Continued ISP and NR-KPP Implementation Plans in support of Integration and Interoperability Management.\n- Established Net Ready Key Performance Parameter (NR-KPP) processes and practices to support the implementation of net-centric requirements.\n- Continued representing ASN RD&A in Systems Engineering and related forums, such as OSD CIO Interoperability, Information Technology, Architecture, and policy sessions such as joint staff and OSD AT&L.\n- Continued roadmap for acquisition programs on how policies and programs fit together and added investigation and resolution of policy issues, particularly for NR-KPP, ISP, and Information Assurance.\n- Completed Best Practices for End to End Information Assurance Engineering Survey Report.\n- Assisted in the revision to CJCSI 6212.01 by providing DON NR-KPP Guidebook Analysis process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.407"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval System Engineering Resource Center (NSERC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Successfully transitioned Naval Collaborative Engineering Environment (NCEE) to NSERC, a collaborative system engineering environment that provides support across SYSCOMs and their associated program offices. Leadership of NSERC was transitioned to System Engineering Stakeholders Group.  \n- Established  collaborative and intergrated system engineering capabilities and training for: Surface Electronic Warfare Improvement Program , Next Generation Interface Test Set, Littoral and Mine Warfare, USMC Emergency Response System, USAF Mission Planning Enterprise, USCG National Security Cutter and Offshore Patrol.\n- Coordinated closely with DON CIO and SYSCOM CIO to support capabilities alignment policies including portal, infrastructure, and applications reduction.\n- Successfully deployed the Probability of Program Success version two tool on ASN RDA Dashboard."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.482"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Delivered Database Naval Architecture Repository System (NARS) with integrated dictionary. \n-  ASN (RD&A) released the Software Supplement to the Guidebook for Acquisition of Naval Software Intense Systems.\n-  Coordinated with six SYSCOMs to deliver the Naval SYSCOM System Engineering Technical Review (SETR) Handbook; Naval System Engineering Policy\n-  Successfully got acquisition responsibilities for HSI included in OPNAVINST 5310.23 and SECNAVINST 5000.2E\n-  Convinced the SYSCOMs to include ONR as a member of the System Engineering Educational Continuum to encourage improved coordination of the STEM efforts across the DON \n-  Continued SOS SE Integrated Product Team (IPTs) for Battlespace, Mine Warfare and Missile Defense Agency to support CNO priority capability needs.\n-  Brought together an end to end mission thread which included Surface, Undersea, Land and Air unmanned systems by influencing the Unmanned System Cross Fuctional (UxS) Team to include LCS and the MOC.\n-  Continued acquisition milestone review documentation to assess Integration and Interoperability in Information Support Plans, Systems Engineering Plans and Risk Assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.597"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Standards, Policy, and Guidelines: - Alignment of SPGs across the Naval Enterprise and with OSD and Joint organizations will support standard acquisition implementation and improve compatibility and interoperability thereby lowering development and maintenance costs across programs\t\t\t\t\t\t\t\t\t\t\t\t\n- Aggregating systems for the purpose of conducting certification and accreditation and consolidating mandatory documentation for aggregations versus individual systems will optimize (cost tradeoffs and focus on high priority issues) certifications, reduce paperwork and associated costs, and put attention on systems engineering, IA, and ISPs for systems in their aggregated operational state vice just the individual system development state.   Document costs for major programs are $1 to $3.5 Million per system.  An aggregation may include 15 or more systems with four or more being major systems.  Aggregation presents a high potential for Return on Investment.\t\t\t\t\t\t\t\t\t\t\t\t\n- NR-KPP processes will clarify requirements and capabilities (including their metrics) that acquisition programs need to develop systems.  This clarification will eliminate guesses in terms of operational needs, thereby reducing the risk of program failure and reducing program and life-cycle costs.\t\t\t\t\t\t\t\t\t\t\t\t\nNaval Collaborative Engineering Environment (NCEE): Number of customers\/ users.\t\t\t\nPercentage of time the tool is available.\t\t\t\t\t\t\t\t\t\nNumber of tools integrated into the system.\t\t\t\t\t\t\t\t\t\t\t\t\nSystems Engineering:\t\t\t\t\t\t\t\t\t\t\t\t\nReviews and comment on all ACAT I system engineering plans presented to ASN (RDA) within 30 days of receipt to provide system engineering and system of system system engineering guidance to the Acquisition Program Manager.\t\t\t\t\t\t\t\t\t\t\t\t\nReview 80% of the MDAP Gate reviews held in FY10 to provide software acquisition process improvement guidance, system of systems engineering guidance and integration and interoperability management guidance to the Acquisition Program Managers."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3330"
                    },
                    "ProjectTitle": {
                        "val": "Naval Research Laboratory (NRL) Facilities Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.118"
                        },
                        "BudgetYearOne": {
                            "val": "2.422"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.422"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.425"
                        },
                        "BudgetYearThree": {
                            "val": "2.398"
                        },
                        "BudgetYearFour": {
                            "val": "15.749"
                        },
                        "BudgetYearFive": {
                            "val": "16.060"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new project starting FY12."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NRL Facilities Modernization"
                                    },
                                    "Description": {
                                        "val": "Critical Science and Technology research cannot be sustained or succeed in deteriorated facilities.  World class research can only be accomplished in facilities that are at a minimum \"adequate\", but preferably \"state-of-the-art.\"  Due to their advanced age and deterioration, funds are planned to restore\/modernize various laboratory facilities at the Naval Research Laboratory."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.118"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initial year of a concerted effort to modernize electronics science and technology laboratories, equipment, and specialized facilities.  Existing NRL buildings will be renovated in order to relocate critical electronics S&T equipment and specialized laboratories from space that has reached a significant level of maintenance and operational disruption and failure due to advanced age (45 year old building) and inability to sustain and modernize with scientists and researchers in place."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        },
                        "PerformanceMetrics": {
                            "val": "Restoration and modernization of the laboratory facilities will begin in a phased approach until completion."
                        }
                    }
                }
            ]
        }
    }
}