{
    "id": "4d7716d71b7024f501b337d94d301a73e6de4698",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601152N"
        },
        "ProgramElementTitle": {
            "val": "In-House Lab Independent Res"
        },
        "R1LineItemNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.011"
            },
            "CurrentYear": {
                "val": "18.092"
            },
            "BudgetYearOne": {
                "val": "18.261"
            },
            "BudgetYearOneBase": {
                "val": "18.261"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "18.522"
            },
            "BudgetYearThree": {
                "val": "18.758"
            },
            "BudgetYearFour": {
                "val": "19.126"
            },
            "BudgetYearFive": {
                "val": "19.499"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) sustains U.S. Naval Science and Technology (S&T) superiority by providing new technological concepts for the maintenance of naval power and national security and by helping to avoid scientific surprise while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNCs).  The Department of Navy (DON) component responds to S&T directions of the Naval S&T Strategic Plan for long term Navy and Marine Corps improvements and is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command and the Marine Corps Combat Development Command.  It enables technologies to significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities.  The In-house Laboratory Independent Research (ILIR) program also adds increased emphasis to the revitalization of the scientist and engineer workforce component at the Navy's Warfare Centers and Laboratories by attracting superior candidates and retaining our best members through the provision of exciting and meaningful work.\n\nThis PE addresses DON Basic Research which includes scientific study and experimentation directed toward increasing knowledge and understanding in national-security related aspects of physical, engineering, environmental, and life sciences; and is the core of Discovery and Invention.  Basic research projects are developed, managed, and related to more advanced aspects of research in some hundred-plus technology and capability-related 'thrusts', which are consolidated in thirteen research focus areas: Power and Energy; Operational Environments; Maritime Domain Awareness; Asymmetric and Irregular Warfare; Information, Analysis and Communication; Power Projection; Assure Access and Hold at Risk; Distributed Operations; Naval Warfighter Performance and Protection; Survivability and Self-Defense; Platform Mobility; Fleet\/Force Sustainment; Affordability, Maintainability and Reliability.  \n\nThis portion of the DON Basic Research Program provides participating Naval Warfare Centers and Laboratories with funding for: basic research to support the execution of their assigned missions; developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems; promoting hiring and development of new scientists; and encouragement of collaboration with universities, private industry, and other Navy and Department of Defense laboratories.  \n\nILIR efforts are selected by Naval Warfare Centers\/Lab Commanding Officers and Technical Directors near the start of each Fiscal Year through internal competition.  Efforts typically last three years, and are generally designed to assess the promise of new lines of research.  Successful efforts attract external, competitively awarded funding.  Because the Warfare Centers and Labs encompass the full range of naval technology interests, the scope of ILIR topics roughly parallels that of PE 0601153N, Defense Research Science.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.979"
                },
                "CurrentYear": {
                    "val": "18.092"
                },
                "BudgetYearOne": {
                    "val": "18.181"
                },
                "BudgetYearOneBase": {
                    "val": "18.181"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.011"
                },
                "CurrentYear": {
                    "val": "18.092"
                },
                "BudgetYearOne": {
                    "val": "18.261"
                },
                "BudgetYearOneBase": {
                    "val": "18.261"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.032"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.080"
                },
                "BudgetYearOneBase": {
                    "val": "0.080"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.123"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.087"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.087"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.167"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.167"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.091"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "In-House Lab Independent Res"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.011"
                        },
                        "CurrentYear": {
                            "val": "18.092"
                        },
                        "BudgetYearOne": {
                            "val": "18.261"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.261"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "18.522"
                        },
                        "BudgetYearThree": {
                            "val": "18.758"
                        },
                        "BudgetYearFour": {
                            "val": "19.126"
                        },
                        "BudgetYearFive": {
                            "val": "19.499"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project sustains U.S. Naval S&T superiority, provides new technological concepts for the maintenance of naval power and national security, and mitigates scientific surprises, while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNC's).  It responds to S&T directions of the Naval S&T Strategic Plan for long term Navy and Marine Corps improvements.  It is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command (NWDC) and the Marine Corps Combat Development Command (MCCDC), and enables technologies to significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities.  \n\nThis portion of the DON Basic Research Program provides participating Naval Warfare Centers and Laboratories with funding for basic research to support the execution of their assigned missions, for developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research and apply them to naval problems, to promote hiring and development of new scientists, and to encourage collaboration with universities, private industry, and other Navy and Department of Defense laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Efforts include: structural materials; functional materials; maintenance reduction, hydrodynamics; power generation; energy conservation and conversion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued  research on the use of Density Functional Theory (DFT) for intelligently designing the next advancement in chromophore (dye) structures.\n- Continued research to develop new narrow and wide band gap electroactive polymer materials with tunable energy levels for high power and energy density batteries.\n- Continued research to develop several novel experimental techniques to understand the phenomena of mixing in energetic material in the metal-metal oxide combustion zone.\n- Continued research for Acoustic Metamaterials.\n- Continued research for Absorbent Materials for Fuel Desulfurization.\n- Continued research on Phase Equilibria and High-Temperature Ceramics for Zirconium Based Systems.\n- Continued research on the Atomic Structure and Lattice Dynamics of Thermoelectric Materials.\n- Continued research for the Fundamental Understanding of the Thermodynamic Properties of Metamaterials.\n- Continued research for the Internal Behavior of Electromagnetic Properties of Metamaterials and Wideband Tunability. \n- Continued research for Liquid-Crystalline Polymers for Broadband Noise Attenuation in Towed Array SONAR Systems.\n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated research for biaxial fatigue in corrosive environments.\n- Initiated research for control and dispersion of electromagnetic energy using metamaterials.\n- Initiated research for polyurea silicate composites.  \n- Initiated research to develop a process to quickly and reliably fabricate large areas of Carbon Nanotubes (CNTs) without the need of costly chemical vapor deposition systems. This process will be studied and optimized and resulting CNT's will be characterized, applications could improve size, weight, and power in DoD and commercial systems.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete  research on the use of Density Functional Theory (DFT) for intelligently designing the next advancement in chromophore (dye) structures.\n- Complete research to develop new narrow and wide band gap electroactive polymer materials with tunable energy levels for high power and energy density batteries.\n- Complete research to develop several novel experimental techniques to understand the phenomena of mixing in energetic material in the metal-metal oxide combustion zone.\n- Complete research for Acoustic Metamaterials.\n- Complete research for Absorbent Materials for Fuel Desulfurization.\n- Complete research on Phase Equilibria and High-Temperature Ceramics for Zirconium Based Systems.\n- Complete research on the Atomic Structure and Lattice Dynamics of Thermoelectric Materials.\n- Complete research for the Fundamental Understanding of the Thermodynamic Properties of Metamaterials.\n- Complete research for the Internal Behavior of Electromagnetic Properties of Metamaterials and Wideband Tunability. \n- Complete research for Liquid-Crystalline Polymers for Broadband Noise Attenuation in Towed Array SONAR Systems. \n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2012 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.243"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.243"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Complete FY 2011 initiated ILIR projects during FY 2013.\n- Complete research for Biaxial Fatigue in Corrosive Environment with the overall effort to: (1) characterize of the biaxial fatigue behavior in corrosive environment, comparing with that in air, (2) identify the basic mechanism of environment-assisted biaxial fatigue cracking, (3) expand model for corrosion fatigue crack growth under biaxial loading, and (4) demonstrate and validate the model in the application to aircraft structure.\n- Complete research for Control and Dispersion of Electromagnetic Energy Using Metamaterials where the dispersion and control of electromagnetic (EM) waves in the microwave (RF) region using fabricated metamaterial structures were demonstrated. Six metamaterial structures were modeled using in-house programs, DOD supercomputer resources, and High Frequency Structure Simulation (HFSS) software and fabricated use photolithography, vapor deposition, and chemical and reactive ion etching. Scattering parameters (transmittance and reflectance), were acquired using a Network Analyzer coupled to a free space analysis setup.\n- Complete research for Polyurea Silicate Composites.  The objective of this research is to identify the structural transitions and interactions of the polyurea and nanoparticle that underlie the enhanced mechanical mechanisms for the protective response of polyurea nanocomposites. The approach is to use small angle and wide angle x-ray scattering (SAXS and WAXS) simultaneously with tensile and recovered impact tests to obtain a fundamental understanding of the polyurea nanoparticle effect at the molecular level. The strain rate material responses, both elastic and plastic, would be incorporated into a constitutive equation needed for modeling and for hydrocode simulations for further calculations of optimized geometries and layer thicknesses. \n- Initiate fundamental research on high strength nanostructures\/nanomaterials.\n- Initiate research for new concepts, configurations, and applications for metamaterials.\n- Initiate research for high temperature alloys for engine applications.\n- Initiate research for low-cost high-strength material repair.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTRONICS SENSOR SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: sensing, diagnostics, and detectors; navigation and timekeeping; nano electronics; real time targeting, Electro Optical\/InfraRed (EO\/IR) electronics; EO\/IR electronic warfare; and EO\/IR sensors for surface and subsurface surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued research efforts in basic understanding of electromagnetic scattering in the nano-regime.\n- Continued research investigation for Millimeter Wave Spectroscopy.\n- Continued research for Underwater Coherent Target Detection in Sonar Imagery in Clutter.\n- Continued research on Non-Traditional Sensors for Surveillance.\n- Continued research for Analog Photonic Amplification.\n- Continued research in the Investigation of Acoustic Cloaking.\n- Continued research for Scattered Acoustic Vector Fields in the Near Field Resonance Region.  \n- Continued research efforts for Magnetoelastic\/Piezoelectric Layered Composite Structures.\n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated research for high finesse optical domain radio frequency (RF) filters.\n- Initiated research for computer vision techniques on optical and acoustic sensor data for underwater object detection and classification.\n- Initiated research for wideband retro-reflective arrays.\n- Initiated research on an application of Green's function technique to explore exotic and unexpected nano-phenomena in the electromagnetic scattering of finite-length nanowires.  This effort has broad applicability to a variety of nano devices such as, nano-antennas, nano-lasers, nano-sensors, subwavelength photonic integration, and metamaterial designs.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Electric Power Sources and Multifunctional Electronics for Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Persistent Surveillance, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete research efforts in basic understanding of electromagnetic scattering in the nano-regime.\n- Complete research investigation for Millimeter Wave Spectroscopy.\n- Complete research for Underwater Coherent Target Detection in Sonar Imagery in Clutter.\n- Complete research on Non-Traditional Sensors for Surveillance.\n- Complete research for Analog Photonic Amplification.\n- Complete research in the Investigation of Acoustic Cloaking.\n- Complete research for Scattered Acoustic Vector Fields in the Near Field Resonance Region.  \n- Complete research efforts for Magnetoelastic\/Piezoelectric Layered Composite Structures. \n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2012 will focus on supporting Electric Power Sources and Multifunctional Electronics for Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Persistent Surveillance, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\nComplete FY 2011 initiated ILIR projects during FY 2013.\n- Complete research for High Finesse Optical Domain RF Filters where the objective is to design and fabricate a chip scale integrated optical filter architecture with periodic flat passbands of narrow bandwidth compatible with conventional digital signal processing (i.e. < 50MHz) and a finesse of 100 or greater. This type of filter design is previously unexploited in the optical domain and will help enable real time spectrum analysis and channelization in the photonic domain across multi-GHz RF signals.\n- Complete research for Computer Vision Techniques on Optical and Acoustic Sensor Data for Underwater Object Detection and Classification. The goal of this research is to use advances in machine learning and computer vision to utilize optical and acoustic sensors in concert for object detection and classification in underwater applications. This technology can be used for object identification in a multitude of scenarios as well as for visual surveillance of a harbor. Furthermore, advanced computer vision can be used for self localization of an underwater vehicle. A specific goal of the research will be object detection and classification of mines found on the sea floor.\n- Complete research for Wideband Retro-Reflective Arrays.  Metamaterial transmission lines (MTMs) are proposed to be investigated for the design of a wideband, retroreflective Van-Atta array. The technical objectives of the project are to explore the basic science behind metamaterial transmission line technologies and their practical implementation. The goal is to achieve enhanced bandwidth and increased gain performance of a Van-Atta array that is compact in size for low-observable, retro-reflective applications.\n- Initiate research for Wireless Highly Reliable Networks.\n- Initiate research for the Optimization of Autonomous ASW Sensor Suites.\n- Initiate research for Nano-sensor Technology.\n- Initiate research for Nano-circuit Devices.\n- Initiate research on Advanced Chem-Bio Sensor and Detection.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENERGY SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: undersea weaponry; energetic materials and propulsion; directed energy; and TeraHertz Time-Domain Spectroscopy (THz-TDS) technology that addresses overseas contingency operations and Counter Improvised Explosive Device (C-IED) detection by detecting and spectroscopically identifying military and home-made explosives and formulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.351"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued the research on Molecular Switching of Explosive Molecules.\n- Continued the research on the Synthesis of Non-toxic High-energy Explosive Materials.\n- Continued research and understanding of Modified Energy Released Weapons.\n- Continued research for the Analytical Ballistic Penetration Study of the Adaptable High-Speed Underwater Munitions. \n- Continued research effort for the understand of Sulfur Hexafluoride as a Oxidant for Unmanned Underwater Vehicle (UUV) Electrochemical Power Systems.\n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated research on the microbial biosynthesis of critical energetic ingredients.\n- Initiated research for accelerated quantum chemistry simulations of energetics using a novel metadynamics approach.\n- Initiated research for convergent synthesis of high performance heterocycles via late amination.\n- Initiated research to investigate the dispersion and control of electromagnetic (EM) waves in the microwave (RF) region using fabricated metamaterial structures.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete the research on Molecular Switching of Explosive Molecules.\n- Complete the research on the Synthesis of Non-toxic High-energy Explosive Materials.\n- Complete research and understanding of Modified Energy Released Weapons.\n- Complete research for the Analytical Ballistic Penetration Study of the Adaptable High-Speed Underwater Munitions. \n- Complete research effort for the understand of Sulfur Hexafluoride as a Oxidant for Unmanned Underwater Vehicle (UUV) Electrochemical Power Systems. \n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.267"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.267"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Complete FY 2011 initiated ILIR projects during FY 2013.\n- Complete the research on the Microbial Biosynthesis of Critical Energetic Ingredients which investigated new methods of microbial synthesis in the production of feedstocks for energetics. Microbial synthesis is the controlled harvesting of organic molecules from biological factories such as E. coli. It is hypothesized that large scale control and manipulation of these efficient microbial factories could lead to increased availability of traditionally rare feedstocks, enhanced sustainability due to the reduced need for organics from non-petroleum-derived feedstocks, and the significant reduction of hazardous waste. \n- Complete the research for Accelerated Quantum Chemistry Simulations of Energetics using a Novel Metadynamics Approach the goal of which to develop methods based on a metadynamics approach that can predict important chemical properties of energetic materials and additives that are normally inaccessible to first-principles simulation. The main properties use to evaluate the method are uni- and bimolecular decomposition barriers, oxidation reactions, accelerated aging studies, and crystalline density predictions. The focus will be on complex or novel systems that have previously been difficult to simulate, such as polymer chains, novel high-nitrogen explosives, and organometallic compounds\n- Complete the research for Convergent Synthesis of High Performance Heterocycles via Late Amination which focuses on convergent synthesis of energetic, high nitrogen CHNO heterocycles using novel energetic synthons to provide increase performance to Navy ordnance. Designing higher heats of formation and higher densities into novel energetic CHNO compounds, while retaining good kinetic stability and safety properties, requires new structural motifs. The 1,2,3,4-tetrazine 1,3-dioxide structural motif, first described by Tartakovsky et al. in the 1991 synthesis of benzo tetrazine dioxide, remains an undeveloped energetic synthon. Although furazano tetrazine dioxide has been known for the last decade, its energetic properties are still unknown. The synthetic routes chosen are expected to permit ready transition to the pilot level and offer reasonably priced materials.\n- Initiate research for High-Output Low-Cost Energetic Materials\n- Initiate research for High-Speed Energetic Weapons.\n- Initiate research on Fundamental Development of Polymer Materials with Tunable Energy Levels.\n- Initiate Research for High-Density High-Output Batteries.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: biosensors, biomaterial, bioprocesses; marine mammals; casualty care management, undersea medicine; human factors and organizational design; manpower, personnel and advanced cockpit; and operational training and education.  These efforts are coordinated with the Navy Medical Research Center (NMRC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.162"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued research on Exhaled Nitric Oxide (NO) and Carbon Monoxide (CO) as Noninvasive Markers of Hyperbaric Oxidative Stress in Humans (decompression treatment, carbon monoxide poisoning, wound healing, and crush injuries for which pulmonary oxygen toxicity is a potential side effect).\n- Continued research on Characterization of Mesenchymal Stem Cell Contribution to the Formation of Heterotopic Ossifications (understanding treatment\/recovery of devastating injury patterns - involving massive zones of injury that violate soft tissue).\n- Continued research on the Evaluation and Training of Institution Using Individual Differences\n- Continued research on the study to identify the Underlying Mechanisms Resulting from IR Exposure.\n- Continued research for Advanced Adsorbent Materials for Chemical, Biological, Radiological Filtration and\/or Detection.\n- Continued research on Mission Defined Language and Unmanned Vehicle (UV) Capacitance Using Predictive Tools.\n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated research for characterization of decision making behaviors associated with Human Systems Integration (HSI) design tradeoffs.\n- Initiated research for Localization of human spatial processing using dense-array Electroencephalography.  \n- Initiated Integration of an implantable potentiostat for continuous monitoring of Nitric Oxide (NO) into a rat model of Hyperbaric Oxygen (HBO) toxicity.\n- Initiated research to characterize the naturalistic decision making processes used in Naval Aviation acquisition programs to assess cost, schedule and performance tradeoffs within and between Human Systems Integration (HSI) domains.  Content analysis will be performed to identify knowledge, skills, abilities, heuristics, and biases associated with HSI decision making.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete research on Exhaled Nitric Oxide (NO) and Carbon Monoxide (CO) as Noninvasive Markers of Hyperbaric Oxidative Stress in Humans (decompression treatment, carbon monoxide poisoning, wound healing, and crush injuries for which pulmonary oxygen toxicity is a potential side effect).\n- Complete research on Characterization of Mesenchymal Stem Cell Contribution to the Formation of Heterotopic Ossifications (understanding treatment\/recovery of devastating injury patterns - involving massive zones of injury that violate soft tissue).\n- Complete research on the Evaluation and Training of Institution Using Individual Differences\n- Complete research on the study to identify the Underlying Mechanisms Resulting from IR Exposure.\n- Complete research for Advanced Adsorbent Materials for Chemical, Biological, Radiological Filtration and\/or Detection.\n- Complete research on Mission Defined Language and Unmanned Vehicle (UV) Capacitance Using Predictive Tools.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.021"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.021"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Complete FY 2011 initiated ILIR projects during FY 2013.\n- Complete research for Characterization of Decision Making Behaviors Associated with Human Systems Integration (HSI) Design Tradeoffs where analysis performed to identify knowledge, skills, abilities, heuristics, and biases associated with HSI decision making. This incorporated a coding study to gauge inter-rater reliability as part of the content analysis. The results will be used to (a) generate assessment test materials for a follow-on decision making experiment, and (b) created a summary of the recorded HSI tradeoff case studies, including key learnings and a description of tradeoff decision requirements.\n- Complete research for Localization of Human Spatial Processing using Dense-array Electroencephalography.  Aviation mishap statistics confirm that in-flight spatial disorientation (SD) pose one of the greatest human factor problems for military aviators. The impact of this cognitive threat costs the DoD an average of 20 aircraft and 25 flight personnel annually. Recent animal research has identified specialized neural structures involved in spatial orientation. The objective of this research is to determine if spatial neural mechanisms found in animal studies and in human functional magnetic resonance imaging tests can be further localized and defined by introducing limited ranges of normal human motion. \n- Complete Integration of an Implantable Potentiostat for Continuous Monitoring of Nitric Oxide (NO) into a Rat Model of Hyperbaric Oxygen (HBO) Toxicity.  The U.S. Navy has long used oxygen breathing for covert underwater operations. The major limitation to HBO is the risk of HBO-induced pulmonary and central nervous system toxicity. NO is a critical second messenger involved in the pathophysiology of HBO-induced toxicity. The study examines an implantable NO sensor in conjunction with both traditional and experimental implantable potentiostats. This work will lead to the development of new research capabilities to measure NO production in vivo.\n- Initiate research for Brain and Spinal (and other) Injury Due to Shock Blast.\n- Initiate research for Adaptive Learning Tools Based on Individual Awareness.\n- Initiate research for Warfighter Impact Due to Operational Noise on Navy Ships.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INFORMATION SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: mathematical foundation and computational theory and tools for design communications; decision support theory; algorithm and tools, information assurance, secure and reliable infrastructure for command and control; mathematical optimization for optimal resource allocation and usage; modeling and computational propagation; seamless, robust connectivity and networking and cyber warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.187"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued research on Novel Image Processing Algorithms for Matrix Completion, Automated Scene Understanding, and Biotechnology Algorithms for Genetic and Proteomic analysis.\n- Continued research for the use of Neural Networks in Clustering Classification.\n- Continued research on the Relationship of Quantum Random Walk and Search Efficiency.\n- Continued research for Statistical Modeling and Analysis of Object Shapes in Sonar Imagery.\n- Continued research on Cognitive Correlators for Cyber Operations.\n- Continued research on Off-Hull Intermittent Connectivity Network Management using Computational Intelligence.\n- Continued research for Vision-Capable Unmanned Vehicle (UxV) Calibration, Environment Mapping, and Obstacle Avoidance.\n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated research for the numerical analysis and design of methods for Partial Differential Equations (PDE) constrained optimization.\n- Initiated research for framework for collaborative robotic asset management.\n- Initiated research to develop a theory of Systems-of-Systems (SoS) network engineering and analysis based on the theory of time series of attributed graphs to understand how such systems can be mathematically formulated, simulated, analyzed, and tested.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY 2011, less those noted as complete above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete research on Novel Image Processing Algorithms for Matrix Completion, Automated Scene Understanding, and Biotechnology Algorithms for Genetic and Proteomic analysis.\n- Complete research for the use of Neural Networks in Clustering Classification.\n- Complete research on the Relationship of Quantum Random Walk and Search Efficiency.\n- Complete research for Statistical Modeling and Analysis of Object Shapes in Sonar Imagery.\n- Complete research on Cognitive Correlators for Cyber Operations.\n- Complete research on Off-Hull Intermittent Connectivity Network Management using Computational Intelligence.\n- Complete research for Vision-Capable Unmanned Vehicle (UxV) Calibration, Environment Mapping, and Obstacle Avoidance. \n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Complete FY 2011 initiated ILIR projects during FY 2013.\n- Complete research for the Numerical Analysis and Design of Methods for Partial Differential Equations (PDE) Constrained Optimization.  PDE Constrained Optimization problems arise in many areas of science and engineering, and include problems such as optimal shape design and parameter estimation. While advanced methods for general non-linear optimization have existed for over a half century, the existence of PDE constraints in optimization problems make the existing optimization methods at best inefficient and often times infeasible. The goal is to design and analyze new methods which build on previous efforts developed over the last decade, and enable these new methods to be used on problems currently seen in the analysis of naval systems. \n- Complete research for Systems-of-Systems (SoS) Network Analysis where the design of Systems-of-Systems (SoS) requires careful analysis of not only the subsystems, but also the interconnections between the subsystems. These interconnections could possibly correspond to dependencies, communications, shared information, joint operation, or other relationships. This research seeks to develop a theory of SoS engineering and analysis based on graph theory, in particular the theory of time series of attributed graphs, in which the vertices and edges may have attributes (such as readiness levels or communication throughput). This theory will involve both a mathematical formulation of the SoS problem, but also a consideration of how such systems can be simulated, analyzed, and tested. \n- Complete research for Framework for Collaborative Robotic Asset Management where a formalized and extensible approach for discovering, modeling, monitoring, and managing a distributed collection of disparate unmanned systems is defined. This framework will support near real-time system modeling, resource appraisal, and brokering functionalities while using scalable abstract representations of mission, job, and resource capabilities to provide new levels of intelligent resource utilization to the Navy. The proposed work directly supports research initiatives in the areas of underwater communication networks, minimal operator intervention, intelligent decision-making, and promotes increased situational awareness. This project will present the design of a hierarchical architecture of software components and definition of the elements that comprise the framework Knowledge Representation Scheme in order to provide deliberative management capabilities for a system of collaborating robotic assets. \n- Initiate research on Weak Signature Identification.\n- Initiate research on Advanced Target Classification.\n- Initiate research on Collaborative Unmanned Systems Communication and Asset Management\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL PLATFORM DESIGN SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: novel hull forms, materials, structures and signatures; and virtual shaping concepts for structures and platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.491"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued research on Hydrodynamic Self-cleaning and Ship Performance use Flow Generated Forces.\n- Continued research on New Approach to Dynamic Similarity for Surface Ship Scale Modeling.\n- Continued research on Internal Actuation for Marine Sensor Platforms. \n- Continued research on High Accuracy Inertial Measurement Unit from an Array of Low Cost Sensors. \n- Continued research on the Applications of Hydrofoils with Leading Edge Protuberances.\n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated research for high fidelity Reynolds-averaged Navier-Stokes (RANS) cavitation simulation.  \n- Initiated research for development of a new vehicle dynamics-based motion planning and control algorithm into the motion planning process.\n- Initiated research for wall pressure fluctuation measurements in high Reynolds number turbulent pipe flow.\n- Initiated research to characterize the biaxial fatigue behavior of carrier-based aircraft in a corrosive environment, identify the basic mechanism of environment assisted biaxial fatigue cracking, develop an accurate model for corrosion fatigue crack growth under biaxial loading, and demonstrate and validate the model in the application to aircraft structure.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.498"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete research on Hydrodynamic Self-cleaning and Ship Performance use Flow Generated Forces.\n- Complete research on New Approach to Dynamic Similarity for Surface Ship Scale Modeling.\n- Complete research on Internal Actuation for Marine Sensor Platforms. \n- Complete research on High Accuracy Inertial Measurement Unit from an Array of Low Cost Sensors. \n- Complete research on the Applications of Hydrofoils with Leading Edge Protuberances. \n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Complete FY 2011 initiated ILIR projects during FY 2013.\n- Complete research for High Fidelity Reynolds-averaged Navier-Stokes (RANS) Cavitation Simulation.  This research advances the state of the art in cavitation prediction enhancing the understanding of the dynamics of cavitation on control surfaces and propellers though the use of computational fluid dynamics (CFD). Advances in cavitation modeling will be accomplished through the use of a true two-phase method to model the vapor and liquid as separate fluids rather than a homogenous mixture which is commonly used. The final product should be a RANS code useful for predicting cavitation on control surfaces and propulsors of interest to the US Navy where these predictions may reveal new details of the cavitation sheet break up and associated acoustics.\n- Complete research for Development of a New Vehicle Dynamics-Based Motion Planning and Control Algorithm into the motion planning process. The Sampling-Based Model Predictive Control (SBMPC) algorithm is in development as an efficient Model Predictive Control (MPC) algorithm that generates control inputs and system trajectories. The method is based on sampling the input space at each sample period and implementing a goal directed optimization method in place of linear programming, nonlinear programming or evolutionary algorithms. This formulation of MPC readily applies to systems with nonlinear dynamics and avoids the local minima which can limit the performance of MPC algorithms implemented using nonlinear programming. The generic framework will be adapted to enable time and energy optimal trajectory generation for UUV\/USV systems.\n- Complete research for Wall Pressure Fluctuation Measurements in High Reynolds Number Turbulent Pipe Flow.  The objective of this effort addresses the problem of flow noise and flow induced vibration experienced by hull mounted and towed SONAR arrays. Turbulent wall pressure fluctuations at moderate to high Reynolds numbers constitute a primary source of direct flow noise for hull mounted and towed SONAR arrays. In addition, they act as a primary source of radiated noise from undersea vehicles. Furthermore, contemporary finite element structural analysis requires forcing functions as input parameters. The general complexity of the turbulent wall pressure field leads to the requirement for measurements and modeling in order to characterize the field and better understand the physics of this unique class of flows.\n- Initiate research for Vehicle Dynamics and Turbulent Wake Characterization.\n- Initiate research for Hydrodynamic Self Cleaning and Improved Ship Performance\n- Initiate research for Predicting Complex Drag on Towed Arrays.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCEAN\/SPACE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Littoral Geosciences, Optics, and biology; Marine Mammals; Ocean Acoustics; and autonomous systems.\n\nFunding levels in the Ocean\/Space Sciences activity decrease in FY 2013 due to creation of a separate activity to highlight Science Technology Engineering and Math (STEM) efforts at Navy labs previously funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.772"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year. \n- Continued Naval Research Enterprise Intern Program (NREIP) to support undergraduate and graduate students performing Navy-related research at Naval Warfare Centers under the supervision and mentorship of DON Scientists, thus exposing them to interesting and challenging work done at the centers. NREIP is a continuing Navy education program.\n- Continued research on Free-Surface Interface Capturing Algorithm for CFD in the Understanding\/Modeling of Autonomous Undersea Systems.\n- Continued research for Coherent Terrain Navigation.\n- Continued research on Multipath Signal Processing Cancellation Techniques for Mine Hunting.\n- Continued research for Optical Integration Algorithm for Global Positioning System (GPS).\n- Continued research for Flight Behavior and Surveillance for Unmanned Underwater Systems for Anti-Submarine Warfare (ASW) Mission.\n- Continued research for Full Spectrum Propagation Prediction.\n- Continued all efforts of FY 2010, less those noted as completed above. \n- Completed FY 2009 initiated ILIR projects during FY 2011.\n- Initiated optical propagation studies for Non-Line-of-Sight (NLOS) underwater laser communications.\n- Initiated research for turbulent wake characterization\n- Initiated research for surface piercing strut wake signature reduction.  \n- Initiated research to assess the effects of Mid-Frequency Active (MFA) sonar on the movement of fish species in a natural environment to compare the behavior and movement of fish prior to exposure to sonar, during exposure, and for a significant amount of time post-exposure to provide valuable data on fish behavior, movement, and survival following exposure to high-intensity tactical MFA sonar.\n- Initiated ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and National Naval Responsibility initiatives in Ocean Acoustics and Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above. \n- Complete FY 2010 initiated ILIR projects during FY 2012.\n- Complete research on Free-Surface Interface Capturing Algorithm for CFD in the Understanding\/Modeling of Autonomous Undersea Systems.\n- Complete research for Coherent Terrain Navigation.\n- Complete research on Multipath Signal Processing Cancellation Techniques for Mine Hunting.\n- Complete research for Optical Integration Algorithm for Global Positioning System (GPS).\n- Complete research for Flight Behavior and Surveillance for Unmanned Underwater Systems for Anti-Submarine Warfare (ASW) Mission.\n- Complete research for Full Spectrum Propagation Prediction.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and National Naval Responsibility initiatives in Ocean Acoustics and Undersea Weaponry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Complete FY 2011 initiated ILIR projects during FY 2013.\n- Complete Optical Propagation Studies for Non-Line-of-Sight (NLOS) Underwater Laser Communications. This project's objective investigated the fundamental propagation characteristics of \"broad beam\" or diffuses light sources for N-LOS optical links. N-LOS links provide the benefits of decreased pointing-and-tracking complexity, increased time for link closure and decreased sensitivity to obstructions. This project studied how the spatial distribution of light caused by scattering, or shaping of the initial source beam distribution, affects the propagation of modulated light in water and optimal source distributions matched to particular undersea environments.\n- Complete research for Turbulent Wake Characterization where understanding the details of complex turbulent flows around a submerged body is critical for analysis of a propulsor operating in its wake. The inflow characteristics to the propulsor have a significant impact on its performance. This project focuses on predicting the turbulent wake characteristics of a submerged appended model-scale body using Large Eddy Simulation (LES) techniques. Because the propulsor impacts the pressure field, it has an effect on its own inflow; therefore, the ultimate goal of this project will be to model a propulsor and appended a body in the same domain using LES.  \n- Complete research for Surface Piercing Strut Wake Signature Reduction.  Surface piercing struts in motion relative to water generate a fairly complex wave producing a rising bow wave in the front of the strut, a cavity on the sides and a wake behind. The size of this white water wake is a function of the strut shape, Reynolds number (Re), Froude number (Fr), water salinity, surfactants, etc. The objective of this effort is to understand the bubble generation and transport phenomena, ideally minimizing the bubble entrainment visual detection to a level comparable to the strut itself. Two approaches are investigated 1) an experimental method that providing insight to the physics of the flow field; 2) computational method that validating the existing results and test new concepts.\n- Initiate research for Littoral Mine Detection and Avoidance.\n- Initiate research for Compact Broad Band Low Frequency Sonar.\n- Initiate research for Advanced Obstacle Avoidance for Unmanned Systems.\n- Initiate ILIR projects that are intended to be approximately three years in length.  Based on historical trends approximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE TECHNOLOGY ENGINEERING AND MATH (STEM) EFFORTS AT NAVY LABS"
                                    },
                                    "Description": {
                                        "val": "This effort will support both Science and Engineering Apprenticeship Program (SEAP) and Naval Research Enterprise Intern Program (NREIP) summer programs to encourage participating students to pursue science and engineering careers, to further their education via mentoring by laboratory personnel and their participation in research, and to make them aware of DoN research and technology efforts, which can lead to employment within the DoN.  Participating students will spend eight to ten weeks during the summer doing research at approximately 19 to 20 DoN laboratories.  Participants will receive a stipend distributed by the Contractor.  The stipend is a monthly allowance paid to interns for their participation in the research efforts.\n\nThis activity is created starting in FY 2013 to highlight Science Technology Engineering and Math (STEM) efforts at Navy labs that were previously funded within the Ocean\/Space Sciences activity in this PE."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.285"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.285"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue Naval Research Enterprise Intern Program (NREIP) to support undergraduate and graduate students performing Navy-related research at Naval Warfare Centers under the supervision and mentorship of DON Scientists, thus exposing them to interesting and challenging work done at the centers. NREIP is a continuing Navy education program.\n- Initiate Science, Technology, Engineering and Mathematics (STEM) projects that are intended to be approximately three years in length.  Projects selected for STEM funding will focus on engaging and educating future Naval scientists and engineers and incorporating naval relevance, diversity, and STEM best practices.  These efforts will complement and support the ongoing independent research, education and outreach efforts taking place at the Naval laboratories."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The ILIR initiative seeks to improve the quality of defense research conducted predominantly through the Naval Warfare Centers\/Laboratories.  It also supports the development of technical intellect and education of engineers and scientists in disciplines critical to national defense needs through the development of new knowledge in a military laboratory environment.  Initial research focus is often conducted in an unfettered environment since it is basic research, but many projects focus on applying recently developed theoretical knowledge to real world military problems with the intention of developing new capabilities and improving the performance of existing systems.  Individual project metrics then become more tailored to the needs of specific applied research and advanced development programs.  The National Research Council of the National Academies of Science and Engineering's Congressionally directed \"Assessment of Department of Defense Basic Research\" concluded that the DoD is managing its basic research program effectively."
                        }
                    }
                }
            ]
        }
    }
}