{
    "id": "56056d5cee6837c48f54bd218e402c508f0d4272",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602618A"
        },
        "ProgramElementTitle": {
            "val": "BALLISTICS TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.595"
            },
            "CurrentYear": {
                "val": "59.121"
            },
            "BudgetYearOne": {
                "val": "60.823"
            },
            "BudgetYearOneBase": {
                "val": "60.823"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "60.568"
            },
            "BudgetYearThree": {
                "val": "62.011"
            },
            "BudgetYearFour": {
                "val": "69.703"
            },
            "BudgetYearFive": {
                "val": "69.416"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and evaluates materials and ballistic technologies required for armaments and armor that will enable enhanced lethality and survivability.  Project H80 focuses on applied research of lightweight armors and protective structures for the Soldier and vehicles; kinetic energy active protection;  crew and components protection from ballistic shock and mine-blast; insensitive propellants\/munitions formulations; novel multi-function warhead concepts; affordable precision munitions design; and physics-based techniques, methodologies, and models to analyze combat effectiveness of future technologies. Project H75 completed in FY11.    \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602105A (Materials Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602716A (Human Factors Engineering), PE 0603004A (Weapons and Munitions Advanced Technology), and PE 0603005A (Combat Vehicle Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.342"
                },
                "CurrentYear": {
                    "val": "59.214"
                },
                "BudgetYearOne": {
                    "val": "58.340"
                },
                "BudgetYearOneBase": {
                    "val": "58.340"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.595"
                },
                "CurrentYear": {
                    "val": "59.121"
                },
                "BudgetYearOne": {
                    "val": "60.823"
                },
                "BudgetYearOneBase": {
                    "val": "60.823"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.253"
                },
                "CurrentYear": {
                    "val": "-0.093"
                },
                "BudgetYearOne": {
                    "val": "2.483"
                },
                "BudgetYearOneBase": {
                    "val": "2.483"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.836"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.483"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.483"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "1.089"
                                },
                                "CurrentYear": {
                                    "val": "-0.093"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H80"
                    },
                    "ProjectTitle": {
                        "val": "Survivability and Lethality Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.595"
                        },
                        "CurrentYear": {
                            "val": "59.121"
                        },
                        "BudgetYearOne": {
                            "val": "60.823"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.823"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "60.568"
                        },
                        "BudgetYearThree": {
                            "val": "62.011"
                        },
                        "BudgetYearFour": {
                            "val": "69.703"
                        },
                        "BudgetYearFive": {
                            "val": "69.416"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates materials and design for armor\/anti-armor formulations that provide advanced protection through tailored terminal ballistic mechanisms.  Specific technology thrusts include: lightweight armors and protective structures; crew and component protection from ballistic shock and\/or mine-blast; insensitive high energy propellants\/munitions to increase lethality and reduce propellant\/munitions vulnerability to attack; novel kinetic energy (KE) penetrator concepts to maintain\/improve lethality; novel multi-function warhead concepts to enable defeat of a full-spectrum of targets (anti-armor, bunker, helicopter, troops); and physics-based techniques, methodologies, and models to analyze combat effectiveness of future technologies for improved ballistic lethality and survivability.   \n\nThis project sustains Army science and technology efforts supporting the Ground and Soldier portfolio.\n\nWork in this PE makes extensive use of high performance computing (HPC) and experimental validation and builds on research transitioned from PE 0601102A (Defense Research Sciences), project H42 (Materials and Mechanics) and project H43 (Ballistics); and utilizes emerging materials from PE 0602105A (Materials Technology) and applies it to specific Army platforms and the individual Soldier applications.  The work complements and is fully coordinated with efforts in PE 0602303 (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602786A (Warfighter Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle Advanced Technology), PE 063313 (Missile and Rocket Advanced Technology), and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Structural Armor"
                                    },
                                    "Description": {
                                        "val": "This effort conducts applied research to design advanced lightweight structural armor technologies, such as ceramic, metallic, transparent, and electromagnetic, for transition to current and future tactical as well as combat vehicle designers. The goal is to provide designs that reduce weight while improving ballistic protection and affording multifunctional capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated the performance of third generation armor concepts under realistic environmental conditions, through testing coupled with modeling and simulation with emphasis on ceramic-composite and encapsulated ceramic technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.840"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate third generation structural armor performance incorporating most promising ceramic-composite and encapsulated ceramic materials technologies; evaluate novel mechanisms against objective level future threats and transition validated concepts to the United States Army Tank Automotive Research, Development and Engineering Center (TARDEC) (PE 0602601A\/project C05); use modeling and simulation coupled with experimentation to validate emerging ballistic defeat mechanisms that couple structural materials with energy absorbing mechanisms against future threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.560"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.560"
                                            },
                                            "Text": {
                                                "val": "Will optimize weight and validate FY12 encapsulated and laminate ceramic armor technologies for future vehicle platforms; use HPC modeling and simulation tools coupled with experiments to validate emerging passive material concepts and investigate threat defeat mechanisms that provide higher mass efficiency against more aggressive KE threats expected to proliferate during the next decade."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine Blast Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools, techniques, and technologies for protection against mine\/IED blast threats, ballistic shock mitigation, and fuel\/ammunition fires to enable survivability of current and future platforms and the dismounted Soldier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed and computationally validated advanced mine protection concepts (to include active seating) at goal weights for threshold threat defeat, and proved performance under relevant environmental conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.407"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporate computationally representative energy absorbing seats and local soil characteristics into models and simulations of full-scale blast events in order to refine simulations for system design optimization by TARDEC in PE 0603005A; and experimentally validate the simulated results for mine blast events using data from live-fire  test events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.869"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.869"
                                            },
                                            "Text": {
                                                "val": "Will conduct characterization and model development of vehicular hull structural welds while providing further refinement of soil models for incorporation into simulations of full-scale blast events; and continue investigations of novel energy absorbing seat materials, restraints and structural designs with refined simulations for system design optimization by TARDEC in PE 0603005A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Precision Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort designs advanced components\/sub-systems to enable a broad spectrum of future affordable direct and indirect fire precision munitions. The focus is on a multi-disciplinary approach to munition systems design by coupling physics-based models of interior ballistics, launch dynamics, flight mechanics, and high-gravitational force guidance, navigation, and control (GN&C) technologies. The goal is smaller, cheaper and lighter munition components enabling low-collateral-damage precision munitions for future asymmetric operations in military operations on urban terrain (MOUT)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Showed feasibility of non-GPS guidance technologies.  Provided technology assessment of precision hit technology across munition size and domain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.833"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Combine reduced state GN&C methods, robust actuators novel guidance technologies, with understanding of interior and exterior ballistics to computationally and experimentally validate accuracy improvements for direct fire individual soldier and weapons platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.588"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.588"
                                            },
                                            "Text": {
                                                "val": "Will experimentally validate highly maneuverable direct and indirect fire munition concepts to extend range and increase terminal effects by continuing applied research of components for novel actuation concepts, low cost guidance technologies, smart structures, and develop coupled physics-based models to computationally support munition designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, evaluates, selects, and models propulsion and energetic materials and technologies to validate novel energetic materials concepts (such as nano-structural and insensitive) that exploit managed energy release required for improving the effectiveness and reducing the vulnerability of future gun\/missile systems and warheads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.025"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Studied green energetic material formulation and investigate feasibility of replacing Hexahydro-Trinitro-Triazine (RDX) in novel energetics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate ability to characterize energetic materials through multiscale modeling; and simulation; provide understanding of energetic material properties to synthesizers and formulators; support hypergolic propulsion demonstration at the U. S. Army Aviation and Missile Research Development and Engineering Center (AMRDEC) through insertion of green energetics into effort; and investigate solid rocket throttleable propulsion for extending missile range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.158"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.158"
                                            },
                                            "Text": {
                                                "val": "Will employ validated multi-scale models to conceive new energetic material compounds; design and improve affordable propellant coatings to manage temperature sensitivity and enhance insensitive munitions qualities; and develop and apply advanced, reacting-flow, multiphase, computational fluid dynamics methods incorporating advanced bi-propellant (liquids and solids) chemistry for future missile applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munitions and Lethality Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort identifies and models preferred options to reduce energy\/mass required to defeat emerging armor threats and to provide multi-purpose capabilities for revolutionary future lethality. In addition, this effort investigates technology options for scaling warhead lethality to enhance urban Warfighting capabilities including control of collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted assessments and documented advances in scalable effects on targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.094"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identify next level in lethality scalability, which expands past blast and fragmentation munitions and offers potential to concepts that defeat a range of threats with a single munition (i.e. collapse calibers); and conduct applied research and prove novel lethal mechanisms for defeat of expanding target set, which includes vehicles, buildings and Soldiers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.449"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.449"
                                            },
                                            "Text": {
                                                "val": "Will advance FY12 scalable lethality concepts that defeat a range of threats with a single munition; and develop small and medium caliber penetrator technologies and concepts to improve the performance of armor-piercing rounds against heavy body armors, lightweight vehicle armors, and against high-obliquity urban targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability\/Lethality Analyses"
                                    },
                                    "Description": {
                                        "val": "This effort devises state-of-the-art survivability\/lethality\/vulnerability methodologies to dynamically model the interaction of conventional ballistic threats against future weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.150"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed integration of ballistics effects into a system-of-systems context with other threat classes including electronic and information warfare; performed improvements to tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental army systems using new lethality and survivability technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.319"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop new methodologies for assessing soldier\/platform occupant injury probabilities in support of efforts to develop a new military specific anthropomorphic test device (WIAMan); conduct advanced experimentation and simulation to improve biofidelic characterization and injury correlation of helmet back face deformation; incorporate an enhanced shot-line viewer, virtual components, active protection systems and multiple threat functionalities to Modular UNIX-based Vulnerability Estimation Suite (MUVES) 3."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.373"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.373"
                                            },
                                            "Text": {
                                                "val": "Will improve vulnerability analysis methodologies for injury criteria and injury assessment to address crew protection and survivability for mine blast threats (WIAMan); and prepare for FY14 validation and verification of the MUVES 3 ballistic vulnerability and lethality code."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Threat Armor Formulations and Designs"
                                    },
                                    "Description": {
                                        "val": "This effort devised and matured multi-threat hybrid armor technologies incorporating both active and passive mechanisms for ground vehicle systems that are effective against future conventional weapons and evolving improvised threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined and refined candidate dual threat defeat armor solution candidates for maturation in PE 0602601A\/project C05; validated the assessment and computational tools that will be used to design and develop active and hybrid armors concepts and proved the feasibility of using a hybrid armor in a multi-threat scenario with component level proof of principle validation in relevant environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Downselect the most promising multi-threat armor concepts and transition technology to TARDEC (PE 0602601A\/project C05) for maturation; investigate advanced reactive and electromagnetic physics for defeat of multiple threat types to include development of algorithms that capture the symbiotic relationships between the mechanisms; develop multi-disciplinary physics-based modeling tools that connect impacts on personal protection technologies to Soldier biologic insult and damage; and develop experimentally validated constitutive material mechanics models that capture high-rate human tissue mechanics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.962"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.962"
                                            },
                                            "Text": {
                                                "val": "Will determine physics mechanisms to explore potential efficiencies against very large improvised threats and investigate fusion of best mechanisms with known technologies for conventional threat defeat; validate and exercise algorithms that capture the multi-physics aspects of the determined mechanisms and begin transition to TARDEC (PE 0602601A\/Project C05) technologies for defeat of very large improvised threats; and develop physics-based high-resolution anatomic computational model for the human legs and spine that accurately predicts critical injury mechanisms that may result from vehicular underbelly blast and other accelerative loading utilizing emerging data from the anthropomorphic Test Device (WIAMan) development effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Penetrator Lethality Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates effects of velocity and novel penetrator designs for future lethality applications across the spectrum of targets to include vehicles, buildings, and personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.005"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated effects on lethality of velocity - ranging from ordnance velocity to hypervelocity - and also the effect of novel penetrator designs; completed validation and assessment of benefits of novel penetrator effects at ordnance velocity; conducted initial validation of most promising novel penetrator designs at hypervelocity, and improved penetration and lethality models based on novel penetrator data; and investigated advanced propulsion system concepts to achieve velocities above current ordnance velocities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Prove benefit of novel penetrator technology at both ordnance and hyper-velocities and transition technology approaches to the Armament and Aviation and Missile RDECs for both gun and missile application; and validate concepts that overcome current propulsion technology limitation of muzzle pressure that enables use of next generation propellants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.864"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.864"
                                            },
                                            "Text": {
                                                "val": "Will determine penetration efficiency of full scale novel penetrators; perform modeling and simulation to define a guided projectile with novel lethal mechanisms and conduct experiments that validate concept projectile(s) can withstand launch environment; conduct lethality analysis (probability of kill given a hit) of novel concepts across the velocity spectrum; and investigate light weight composite sabot technology for rifled barreled guns."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}