{
    "id": "5621c00f624982c4905511aba000fc9fb5813c3f",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602307A"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED WEAPONS TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.542"
            },
            "CurrentYear": {
                "val": "20.002"
            },
            "BudgetYearOne": {
                "val": "25.999"
            },
            "BudgetYearOneBase": {
                "val": "25.999"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "22.862"
            },
            "BudgetYearThree": {
                "val": "21.076"
            },
            "BudgetYearFour": {
                "val": "19.976"
            },
            "BudgetYearFive": {
                "val": "20.314"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 funding increase to accomodate transfer from 0603004A L96 to mature laser technologies prior to demonstration."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates enabling technologies for High Energy Laser (HEL) weapons.  Project 042 develops component technologies such as efficient, high energy, solid state lasers, advanced beam control components, and lethality \/ effectiveness measurements that enable better models and simulations for future HEL weapon designs. \n  \nWork in this project is related to, and fully complements, efforts in PE 0602890F (HEL Research) and PE 0603924F (HEL Advanced Technology Program), PE 0605605A (DoD High Energy Laser Systems Test Facility (HELSTF)), PE 0602120A (Sensors and Electronic Survivability), and PE 0603004A (Weapons and Munitions Advanced Technology) Project L96, and is coordinated with PE 0603005A (Combat Vehicle and Automotive Advanced Technology) Project 441.     \n  \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan and the Army Modernization Strategy.   \n  \nWork is performed by the U.S. Army Space and Missile Defense Command (SMDC), in Huntsville, AL, the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC) in Huntsville, AL, and the High Energy Laser Systems Test Facility, at White Sands Missile Range, NM."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.190"
                },
                "CurrentYear": {
                    "val": "20.034"
                },
                "BudgetYearOne": {
                    "val": "21.377"
                },
                "BudgetYearOneBase": {
                    "val": "21.377"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.542"
                },
                "CurrentYear": {
                    "val": "20.002"
                },
                "BudgetYearOne": {
                    "val": "25.999"
                },
                "BudgetYearOneBase": {
                    "val": "25.999"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.648"
                },
                "CurrentYear": {
                    "val": "-0.032"
                },
                "BudgetYearOne": {
                    "val": "4.622"
                },
                "BudgetYearOneBase": {
                    "val": "4.622"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.542"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.622"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.622"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.106"
                                },
                                "CurrentYear": {
                                    "val": "-0.032"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "042"
                    },
                    "ProjectTitle": {
                        "val": "HIGH ENERGY LASER TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.542"
                        },
                        "CurrentYear": {
                            "val": "20.002"
                        },
                        "BudgetYearOne": {
                            "val": "25.999"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.999"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.862"
                        },
                        "BudgetYearThree": {
                            "val": "21.076"
                        },
                        "BudgetYearFour": {
                            "val": "19.976"
                        },
                        "BudgetYearFive": {
                            "val": "20.314"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient lasers with greater power output. This includes technologies to support development of alternate laser sources; precision optical pointing and tracking components; adaptive optics to overcome laser degradation due to atmospheric effects; and thermal management systems to remove excess heat.  In addition, this effort conducts laser lethality demonstrations and analysis against a variety of targets and investigates the impact of low-cost laser countermeasures.  Solid State Laser (SSL) efforts continue to leverage other funds provided by the HEL Joint Technology Office (JTO), the Air Force, and the Navy to develop multiple technical approaches that reduce program risk and maintain competition. \n\nThis project supports Army science and technology efforts in the Ground Portfolio.  \n \nWork in this project is related to, and fully coordinated with, efforts in PE 0602890F (HEL Research) and PE 0603924F (HEL Advanced Technology Program), PE 0605605A (DoD High Energy Laser Systems Test Facility (HELSTF)), PE 0602120A (Sensors and Electronic Survivability), PE 0603004A (Weapons and Munitions Advanced Technology) Project L96, and to PE 0603005A (Combat Vehicle and Automotive Advanced Technology) Project 441.   \n \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan and the Army Modernization Strategy.  \n \nWork is performed by the U.S. Army Space and Missile Defense Command (SMDC), in Huntsville, AL, the U.S. Aviation and Missile Research, Development, and Engineering Center (AMRDEC) in Huntsville, AL, and the HELSTF at White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solid State Laser (SSL) Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides the underlying data required to support system engineering designs, lethality analysis, and modeling and simulation (M&S) tools for laser weapon systems.  Beginning in FY13, this effort includes the operation of the Solid State Laser Testbed Experiment (SSLTE), which is a 100kW class laser testbed located at the HELSTF for conducting SSL effects experiments in an open air environment. Beginning in FY13, multiple SSLTE related project tasks were reorganized and are now captured in this planned program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined SSL effectiveness against targets of interest in both static and dynamic test scenarios to assess a broad spectrum of mission applications and validate M&S tools that support analysis of alternatives, HEL power levels, and associated ranges across multiple mission sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.948"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue static and dynamic evaluations at various power levels up to 100kW using the SSL at the High Energy Laser Systems Test Facility (HELSTF) against Rockets, Artillery, and Mortars (RAM) and Unmanned Aerial Systems (UAS) targets in conjunction with the other Services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.934"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct static and dynamic experiments using the SSLTE infrastructure to investigate SSL performance against RAM, UAS, and other selected targets; and use data from experiments to validate M&S codes to predict SSL weapon system effectiveness in operational scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SSL Development, Phase 3 - 100 kW"
                                    },
                                    "Description": {
                                        "val": "The goal of this Joint High Power Solid State Laser (JHPSSL) Phase 3 effort is to develop and demonstrate 100 kW-class, near-diffraction-limited diode-pumped solid-state lasers that have architectures favorable for tactical weapon applications.  This effort was completed in FY11 after two laboratory experiments successfully achieved >100kW power in the laboratory."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.945"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated potential mission applications, including Counter-RAM (CRAM), and explored performance of the HEL TD BCS; successfully completed the second JHPSSL 100kW laser demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Beam Control Component Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to enable lighter, more agile beam control systems that are robust enough to be used in Army ground platforms. This work is done in collaboration with the HEL JTO and other Services. Beginning in FY13, support activities were redistributed across all planned programs rather than solely captured in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.592"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and assembled advanced beam control components for integration into the light weight beam director to reduce size and weight and increase the effective range of the beam control system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.751"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coat optics, begin assembly, and conduct laboratory demonstrations of a lightweight beam director with the performance characteristics required for a tactical HEL weapon system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.184"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature components of a light weight beam director, including a shared aperture system and beam control algorithms to support the ability to precisely point a HEL through a beam control system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Efficiency Laser Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technologies that lead to increased SSL wall-plug efficiencies, which will lead to reductions in size and weight for multiple subsystems that greatly improve the ability to integrate SSL systems onto mobile Army weapon platforms. This work is done in collaboration with the HEL JTO and other Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began risk reduction for assembly and integration of two 25 kW high efficiency breadboards using alternative technical approaches; began the conceptual design of a 100 kW class high efficiency device; and continued to develop thermal management techniques specific to high efficiency lasers that minimize thermal distortions, alignment errors, and beam quality degradation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.489"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the design and risk reduction of the 25 kW high efficiency approaches, to include fabrication, integration, and evaluation of laser assemblies at 5 kW and 15 kW; complete the interim design of the 25 kW laboratory devices; complete the conceptual design of the 100 kW class device, to include thermal management techniques; and leverage small business innovation research efforts to complete eye-safe laser component demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.947"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.947"
                                            },
                                            "Text": {
                                                "val": "In concert with the HEL JTO and the other services, will evaluate and select one or more high efficiency laser approaches to mature the design, determine interface specifications, purchase hardware items, and begin assembly of a 25-50kW class robust electric laser that is compatible with the mobile HEL TD beam control system and vehicle payload weight and volume constraints; conduct experiments as components mature to validate performance and efficiency specifications; evaluate high efficiency laser technology approaches for ruggedness, reliability, and affordability; and investigate methods for using high efficiency lasers against sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEL Research and Development Laboratory"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing in-house expertise through SSL assessments. This work is done in cooperation with the Aviation and Missile Research Development and Engineering Center (AMRDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated new deformable mirror designs to identify those with lower cost and sufficient performance; and investigated causes of poor beam quality in SSLs to determine where investments can advance the technology for Army applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct modeling and simulation studies to characterize and optimize HEL system and component performance; and enhance state-of-the-art reflectance measurement capability and continue collecting reflectance data of threat targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.934"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments using AO components to develop and validate algorithms for correction of atmospheric distortions to improve effective range."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}