{
    "id": "57a26e550f9db9cb3331a4763bda7d5c798d2d39",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604641A"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL UNMANNED GROUND VEHICLE"
        },
        "R1LineItemNumber": {
            "val": "92"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "13.141"
            },
            "BudgetYearOneBase": {
                "val": "13.141"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementNote": {
            "val": "The Small Unmanned Ground Vehicle (SUGV) EMD effort will continue under an alternate contract. Funding in FY13 will continue under Tactical Unmanned Ground Vehicle (Small Unmanned Ground Vehicle) Program Element 0604641A Project DV7."
        },
        "ProgramElementMissionDescription": {
            "val": "One program is covered by the Tactical Unmanned Ground Vehicle Program Element 0604641A: The Small Unmanned Ground Vehicle (SUGV) platform. \n\nThe Small Unmanned Ground Vehicle (SUGV), designated as the XM-1216, is a lightweight (32 lbs), man-portable, DC powered UGV capable of conducting Military Operations in Urban Terrain (MOUT) to include tunnels, sewers, and caves. The SUGV provides an unmanned capability for those missions that are manpower intensive or high-risk such as Urban Intelligence, Surveillance, and Reconnaissance (ISR) missions in a MOUT environment, investigating Improvised Explosive Devices and Chemical\/Toxic Materials reconnaissance missions without exposing soldiers directly to the hazard. The SUGV will be used to obtain information on situational awareness at the squad level.\n\nSUGV Increment 1 XM1216:  The INC 1 SUGV is based on the IBCT Capability Production Document (CPD) threshold requirements. The SUGV INC 1 features a lightweight highly mobile SUGV platform with improved and tested reliability and an integrated Commercial off the Shelf (COTS) sensor head and radio.  In early FY10 the SUGV INC 1 platform underwent an Independent Verification Test (IVT) at Aberdeen Test Center (ATC) that provided the basis for many of the component reliability improvements that have been incorporated and validated in the FY11 Initial Qualification Test (IQT). Enhancements included improved seals on the drive motors, design changes to the drive motor themselves, Electromagnetic Interference (EMI) improvements to reduce the emissions and susceptibility of the SUGV platform and operator control unit enhancements. The XM1216 is currently conducting missions in support of units in OEF. \n\nSUGV Planned Product Improvements (Increment 1 Follow on) designated as the XM1216E1:  The SUGV configuration for Low Rate Initial Production (LRIP) moving to Full Rate Production (FRP) is based on the SUGV IBCT CPD Threshold Requirements. It will weigh 35 pounds and is capable of carrying up to 4 lbs of payload weight.  The SUGV will have the following capabilities: a hardened militarized Electro Optical\/Infrared (EO\/IR) sensor to meet stringent day & night detection of enemy personnel & systems, an National Security Agency (NSA) compliant radio from the Joint Tactical Radio system program, improved hand controller, the capability to provide grid location of the enemy, and the following capability to mount payloads: tether spooler, manipulator arm, Chemical, Biological, Radiological, Nuclear (CBRN) suite and Embedded-Tactical Engagement Simulation System (E-TESS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.141"
                },
                "BudgetYearOneBase": {
                    "val": "13.141"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.141"
                },
                "BudgetYearOneBase": {
                    "val": "13.141"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "13.141"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.141"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV7"
                    },
                    "ProjectTitle": {
                        "val": "Small Unmanned Ground Vehicle"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.141"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Small Unmanned Ground Vehicle (SUGV) EMD effort will continue under an alternate contract. Funding in FY13 will continue under Tactical Unmanned Ground Vehicle (Small Unmanned Ground Vehicle) Program Element 0604641A Project DV7."
                        },
                        "ProjectMissionDescription": {
                            "val": "One program is covered by the Tactical Unmanned Ground Vehicle Program Element 0604641A: The Small Unmanned Ground Vehicle (SUGV) platform. \n\nThe Small Unmanned Ground Vehicle (SUGV), designated as the XM1216, is a lightweight (32 lbs), man-portable, DC powered UGV capable of conducting Military Operations in Urban Terrain (MOUT) to include tunnels, sewers, and caves. The SUGV provides an unmanned capability for those missions that are manpower intensive or high-risk such as Urban Intelligence, Surveillance, and Reconnaissance (ISR) missions in a MOUT environment, investigating Improvised Explosive Devices and Chemical\/Toxic Materials reconnaissance missions without exposing soldiers directly to the hazard. The SUGV will be used to obtain information on situational awareness at the squad level.\n\nSUGV Increment 1 XM1216:  The INC 1 SUGV is based on the EIBCT Capability Production Document (CPD) threshold requirements. The SUGV INC 1 features a lightweight highly mobile SUGV platform with improved and tested reliability and an integrated Commercial off the Shelf (COTS) sensor head and radio.  In early FY10 the SUGV INC 1 platform underwent an Independent Verification Test (IVT) at Aberdeen Test Center (ATC) that provided the basis for many of the component reliability improvements that have been incorporated and validated in the FY11 Initial Qualification Test (IQT). Enhancements included improved seals on the drive motors, design changes to the drive motor themselves, Electromagnetic Interference (EMI) improvements to reduce the emissions and susceptibility of the SUGV platform and operator control unit enhancements. The XM1216 is currently conducting missions in support of units in OEF. \n\nSUGV Planned Product Improvements (Increment 1 Follow on) designated as the XM1216E1:  The SUGV configuration for Low Rate Initial Production (LRIP) moving to Full Rate Production (FRP) is based on the SUGV IBCT CPD Threshold Requirements. It will weigh 35 pounds and is capable of carrying up to 4 lbs of payload weight.  The SUGV will have the following capabilities: a hardened militarized Electro Optical\/Infrared (EO\/IR) sensor to meet stringent day & night detection of enemy personnel & systems, an National Security Agency (NSA) compliant radio from the joint tactical radio system program, improved hand controller, the capability to provide grid location of the enemy, and the capability to mount the following payloads: tether spooler: manipulator arm: Chemical, Biological, Radiological, Nuclear (CBRN) suite and Embedded-Tactical Engagement Simulation System (E-TESS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SUGV Product Improvement"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.141"
                                            },
                                            "Text": {
                                                "val": "Complete government IQT testing in the November 2012-April 2013 timeframe. TT\/FDTE\/LUT will be conducted in the April-August 2013 timeframe leading up to a Milestone C LRIP Decision in 4Q13. This effort will integrate and test SUGV product improvements that utilize a point-to-point datalink, provide increased ISR capability with the integrated militarized EO\/IR head, and also provide increased functionality in the form of a modular payload system that includes the fiber optic tether data link capability, manipulator arm, and ETESS. Conduct Contractor and Government testing on SUGV Pre-Production prototypes to evaluate performance: environments, platform mobility, radio performance for Latency and range, EO\/IR performance for personnel detection, payloads, shock\/vibration, RAM, Logistics and Training. Conduct LUT to assess operational utility and performance of the SUGV. The IQT and LUT testing will provide data to support the Production Decision that the fully integrated SUGV meets CDD requirements for mobility, payloads, EO\/IR detection and National Security Agency\/Information Assurance (NSA\/IAS) compliance. Develop and provide all documentation, technical manuals and training products to support logistics, supportability and training requirements required to field the SUGV."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "F00001"
                                    },
                                    "Title": {
                                        "val": "OPA BCT Unmanned Ground Vehicle"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.433"
                                        },
                                        "CurrentYear": {
                                            "val": "24.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "83.937"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "83.937"
                                        },
                                        "BudgetYearThree": {
                                            "val": "122.731"
                                        },
                                        "BudgetYearFour": {
                                            "val": "149.748"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.266"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604641A  Project FC4"
                                    },
                                    "Title": {
                                        "val": "RDTE  FCS Unmanned Ground Vehicles"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "200.000"
                                        },
                                        "CurrentYear": {
                                            "val": "35.966"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "235.966"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Funding continues engineering, manufacturing development follow-on ECP efforts leading to seven pre-production prototypes. End state leads to a Full Rate Production(FRP) decision. The FRP award will be accomplished through full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Small Unmanned Ground Vehicle (SUGV)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "iRobot Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Burlington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.141"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.141"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.141"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Incr 1 Production Delivery (Brigades 2-5)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Incr 1 Production Delivery (LRIP Brigades 6-7)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Follow On Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C Low Rate Initial Production Review (MSC\/LRIP REV)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV Follow On Initial Operational Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV Prototype Build\/Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV Testing (IQT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV Testing (LUT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV Follow On CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV EMD Bridging Effort Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SUGV EMD Follow on Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}