{
    "id": "61daf2d253ee9f5a4c651ecbcb40cf828841a5d3",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602750N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Applied Research"
        },
        "R1LineItemNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "162.417"
            },
            "BudgetYearOneBase": {
                "val": "162.417"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "164.205"
            },
            "BudgetYearThree": {
                "val": "180.237"
            },
            "BudgetYearFour": {
                "val": "194.138"
            },
            "BudgetYearFive": {
                "val": "189.043"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Applied Research associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are generated by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps.  \n\nThis is a new PE for FY 2013 that consolidates all Navy 6.2 FNC Program investments into a single Navy 6.2 PE.  Marine Corps FNC 6.2 investments are already consolidated in a single Marine Corps 6.2 PE (0602131M). In FY 2011 and FY 2012, Navy 6.2 FNC Program investments were spread across 7 separate 6.2 PEs:  0602114N, 0602123N, 0602235N, 0602236N, 0602271N, 0602747N and 0602782N.  The consolidation in this PE allows all investments to be viewed by FNC Pillar, Enabling Capability (EC) and Technology Product.  It greatly enhances the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single place."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "162.417"
                },
                "BudgetYearOneBase": {
                    "val": "162.417"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "162.417"
                },
                "BudgetYearOneBase": {
                    "val": "162.417"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "159.715"
                                },
                                "BudgetYearOneBase": {
                                    "val": "159.715"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.702"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.702"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "(U)Future Naval Capabilities Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "162.417"
                        },
                        "BudgetYearOneBase": {
                            "val": "162.417"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "164.205"
                        },
                        "BudgetYearThree": {
                            "val": "180.237"
                        },
                        "BudgetYearFour": {
                            "val": "194.138"
                        },
                        "BudgetYearFive": {
                            "val": "189.043"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "FNC investments are typically 3-5 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 3 or 4 to a TRL of 6.  All FNC products require BA2 and BA3 funded technology development, which is coordinated to ensure tangible technology products are delivered upon completion of each investment.  Each year the TOG refreshes the FNC Program by approving new ECs and technology products as older ones get delivered.  After transition to an acquisition program, FNC products are further engineered, integrated and ultimately, delivered to the warfighter. The development and delivery of each FNC product is guided by a Technology Transition Agreement (TTA) that is signed by the requirements and acquisition sponsors, as well as the S&T developer.\n\nThis project supports the naval pillars of Capable Manpower, Enterprise and Platform Enablers, Expeditionary Maneuver Warfare, Force Health Protection, Forcenet, Power and Energy, Sea Basing, Sea Shield and Sea Strike.  Each of these pillars is listed as a separate R-2 Activity as is FNC Management.  Under each R-2 Activity, the BA 6.2 accomplishments and plans for every Enabling Capability (EC) and Technology Product in the FNC Program are listed.  ECs are composed of one or more interrelated technology products, so for clarity, each product is shown under its EC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Capable Manpower (CMP) FNC pillar.  The CMP Pillar develops deliverable technologies that provide new capabilities in manpower and personnel management, training and education, and human-systems integration for more intuitive systems.  \n\nFY 2013 reflects the sum total of all FNC Program BA 6.2 CMP efforts.   All BA 6.2 CMP efforts were funded by PE 0602236N in FY 2011 and FY 2012.  Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Human Systems Design and Training Technologies R-2 Activities of PE 0602236N.  Starting in FY 2013, all BA 6.2 CMP efforts will be shown in this PE under this R-2 Activity to better convey exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  CMP-FY10-01 Information Architecture for Improved Decision Making\n- Continue Data Triage - Develop mission performance optimizations that encompass task centered design and advanced human performance modeling to achieve the requisite manning, both in numbers and capabilities, for the complex ships and systems of the future fleet.\n- Continue Display Information with Uncertainty - Improve the capability to fuse imaging, electronic warfare, and inorganic and acoustic sensor inputs into integrated, fused, and intuitive displays that enhance the presentation and command level understanding of uncertain information.\n\nEC:  CMP-FY10-02 Adaptive Training to Enhance Individual and Team Learning and Performance\n- Continue Adaptive Training for Combat Information Center Teams - Validate effective and adaptive training system components to enhance individual and team training for surface ship Combat Information Center (CIC) training.\n- Continue Adaptive Training for Submarine Navigation & Piloting Teams - Validate effective and adaptive training system components to enhance individual and team training for submarine navigation and piloting skills training.\n\nEC:  CMP-FY11-01 Naval Next-generation Immersive Technology (N2IT)\n- Continue Augmented Immersive Team Training (AITT) - Develop software and hardware to expand training architectures and enablers to enhance training in uncontrolled and uninstrumented locations.\n- Continue Perceptual Training Systems and Tools (PercepTs) - Identify the perceptual cues in urban and dense infrastructure environments to improve warfighter performance.\n\nEC:  CMP-FY11-02 Performance Shaping Functions for Environmental Stressors\n- Continue Performance Shaping Functions - Study the impact of incorporating environmental stressors for fatigue, motion, vibration and extreme temperatures into systems engineering tools for the development of complex Navy systems.\n\nEC:  CMP-FY12-01 Live, Virtual, & Constructive Training Fidelity\n- Continue Cognitive Fidelity Synthetic Environment - Develop optimal characteristics of virtual simulations to elicit the appropriate perceptual\/cognitive responses for Naval aviation training.\n- Continue Tactics & Speech Capable Semi-Automated Forces - Develop virtual constructive representations on live avionics displays.\n- Continue Virtual-Constructive Representations on Live Avionics Displays - Develop design guidelines for effective and safe representation of virtual and constructive assets on live displays, including developing the symbology used during experimentation and validation efforts.\n\nEC:  CMP-FY13-02 Simulation Toolset for Analysis of Mission, Personnel and Systems (STAMPS) \n- Initiate Manpower Planning and Optimization Toolset - Develop methods and models for manpower assessment and allocations.\n- Initiate Platform Design and Acquisition Toolset - Develop methods and models for manpower assessment and allocation in early platform design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Enterprise and Platform Enablers (EPE) FNC pillar.  The EPE Pillar develops cross-cutting, deliverable technologies that provide new capabilities for naval service platforms that lower acquisition, operations and maintenance costs, improve system safety and availability, and improve platform survivability.  \n\nFY 2013 reflects the sum total of all FNC Program BA 6.2 EPE efforts.  All FNC BA 6.2 EPE efforts were funded by PEs 0602123N, 0602236N and 0602271N in FY 2011 and FY2012.  Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Surface Ship and Submarine Hull Mechanical and Electrical (HM&E) R-2 Activity of PE 0602123N, the Advance Naval Materials, Cost Reduction Technologies and Littoral Combat R-2 Activities of PE 0602236N, and the Electronic and Electromagnetic Systems R-2 Activity of PE 0602271N.  Starting in FY 2013, all BA 6.2 EPE efforts will be shown in this PE under this R-2 Activity to better convey exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.405"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.405"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  EPE-FY09-01 Affordable Common Radar Architecture\n- Complete Affordable Common Radar Architecture - Develop software and components for a low cost surface radar replacement.\n\nEC:  EPE-FY09-03 Air Platforms Safety and Affordability Technologies\n- Complete Adaptive Expert System for the Autonomous Detection of Aviation Mishap Leading Indicators - Investigate adaptive expert systems to automatically and rapidly analyze aircrew performance to detect human factors related to mishap leading indicators.\n- Complete Advanced Rotor Blade Erosion Protection - Conduct materials research for developing robust erosion resistant systems for the MV-22 aircraft.\n\nEC:  EPE-FY09-07 Affordable Submarine Propulsion and Control Actuation\n- Complete Advanced Material Propeller - Conduct Applied Research to understand the effects of failure mechanisms, shock, and fluid-structure interaction on composite marine propellers.\n\nEC:  EPE-FY10-01 Advanced Shipboard Water Desalination\n- Continue Desalination System - Conduct Applied Research to understand fouling and maintenance issues for reverse osmosis systems and approaches to mitigate these problems.\n- Continue Pretreatment System - Conduct Applied Research to understand fouling and maintenance issues for pretreatment systems and operational approaches to mitigate these problems.\n\nEC:  EPE-FY10-02 Affordable Modular Panoramic Photonics Mast\n- Continue Compact Hyper-spectral Scanning Imager - Conduct Applied Research of shortwave infrared hyperspectral sensors to detect anomalies and targets.\n- Continue Compact Low Light Level Shortwave Infrared (SWIR) Video Camera - Develop highly sensitive shortwave infrared sensors to detect anomalies and targets.\n- Continue Modular Photonics Mast Housing - Develop technology to reduce the fabrication and life cycle costs of the SSN\/SSGN next generation photonics mast.\n\nEC:  EPE-FY10-03 Corrosion and Corrosion Related Signature Technologies for Increased Operational Availability\n- Continue Advanced Active Shaft Grounding System (ASGS)\/Shaft Current Sensor - Develop an advanced active shaft grounding system with integrated shaft current sensing and extremely low frequency electromagnetic control.\n- Continue Advanced-Robust Impressed Current Cathodic Protection (ICCP) Anodes and Reference Cells - Develop novel impressed current cathodic protection anodes, reference cells and sensors with high mean time between failure. \n- Continue Dual-Use Corrosion\/Signature Sensor for Ballast Tanks - Develop dual-use impressed current cathodic protection and novel sensor technology for corrosion-based maintenance and closed-loop deamping to extend hull-ballast coating longevity and reduce recalibration frequency. \n\nEC:  EPE-FY11-01 Flight Deck Thermal Management \n- Complete Advanced Thermal Management System - Develop materials and processes for a thermal management system.\n- Continue Integrated Thermal Management System Design - Finish large panel construction and initiation of a land-based demonstration of large thermal management system panels.\n\nEC:  EPE-FY12-01 Corrosion Mitigation Technologies and Design Integration \n- Continue Corrosion Resistant Surface Treatment - Determine interstitial hardening parameters for improved corrosion resistance and surface hardness to materials in erosion-corrosion environments.\n- Continue Sprayable Acoustic Damping Systems - Develop synthesis of sprayable acoustic damping resin systems for future application in submarine acoustic damping for reduced costs and maintenance.\n\nEC:  EPE-FY12-02 Integrated Hybrid Structural Management System (IHSMS)\n- Continue Distributed Structural Micro-Sensor Nodes - Conduct research in wireless energy harvesting sensors, architecture, and diagnostics for rotorcraft structural health management.\n- Continue Rotor - Hot Spot Sensors and Integration - Evaluate and optimize rotor-hot spot sensors and integration technologies that allow improved health assessment of rotating frame and selected structural hot spots.\n\nEC:  EPE-FY13-01 Towed Array System Reliability Improvement\n- Initiate Tools for Predicting Array Operational Loading & Distribution - Develop an analytical modeling tool for predicting the magnitude and distribution of forces on the array and cable as a function of system design and operational environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains the Navy funded Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Expeditionary Maneuver Warfare (EMW) FNC Pillar.  The EMW Pillar develops deliverable technologies that provide new capabilities in expeditionary maneuver warfare, including naval ground forces, with special emphasis on regular and irregular warfare in urban environments and combating terrorism.  \n\nFY 2013 reflects the sum total of all Navy FNC Program BA 6.2 EMW efforts.   Additional Marine Corps BA 6.2 EMW efforts are funded in PE 0602131M.  All Navy BA 6.2 EMW efforts were funded by PE 0602271N in FY 2012. There were no Navy funded BA 6.2 efforts in FY 2011.   Navy efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Electronic and Electromagnetic Systems R-2 Activity of PE 0602271N.  Starting in FY 2013, all Navy BA 6.2 EMW efforts will be shown in this PE under this R-2 Activity to better convey the Navy funded portion of exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.597"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.597"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  EMW-FY12-02 Future Joint Counter Radio-Controlled Improvised Explosive Devices (C-RCIED) Electronic Warfare (JCREW)\n- Continue Distributed C-RCIED - Develop advanced techniques for networking distributed counter-radio controlled Improvised Explosive Device (IED) resources.\n- Continue Integrated Counter-RCIED EW (ICEW) - Develop advanced techniques for defeating radio controlled Improvised Explosive Devices (IEDs) and achieving interoperable communications and electronic warfare capabilities.\n\nEC:  EMW-FY13-01 Azimuth and Inertial MEMS Navigation System\n- Initiate MEMS Inertial Navigation System - Characterize the operational limitations and shortcomings of the digital magnetic compass and optimize sensor performance of MEMS to reduce target location error in the navigation system of hand-held targeting systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FNC MANAGEMENT"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, includes the Science and Technology (S&T) analyses and studies required to take new Future Naval Capabilities (FNC) Program Enabling Capabilities (ECs) approved by the Technology Oversight Group and produce the detailed technology specifications and performance metrics needed to procure the component level technologies that must be developed and tested in order to deliver technology products to the acquisition community.  This activity includes development and implementation of innovative and dynamically changing technology management business processes required to manage FNC investments supporting the naval capability pillars.  \n\nFY 2013 reflects the sum total of all FNC Program FNC Management efforts.   All FNC Management efforts were funded by PE 0602236N in FY2011 and FY 2012.  Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Littoral Combat R-2 Activity of PE 0602236N.  Starting in FY 2013, all FNC Program FNC Management efforts will be shown in this PE under this R-2 Activity to better convey what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC Management\n- Continue Enabling Capability New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n- Continue Support\/Operations (OPS) Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Force Health Protection (FHP) FNC pillar.  The FHP Pillar develops deliverable technologies that provide new capabilities that provide Sailors and Marines with the best possible protection from operational threats by reducing morbidity and mortality when casualties occur.  \n\nFY 2013 reflects the sum total of all FNC Program BA 6.2 FHP efforts.   All BA 6.2 FHP efforts were funded by PE 0602236N in FY 2011 and FY 2012.  Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Medical Technologies R-2 Activity of PE 0602236N.  Starting in FY 2013, all BA 6.2 FHP efforts will be shown in this PE under this R-2 Activity to better convey exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  FHP-FY08-01 Casualty Prevention\n- Complete Models of Head and Cervical Spine - Conduct preclinical animal and post-mortem human specimen testing of tissue failure and strain rates.\n\nEC:  FHP-FY08-02 Advanced Forward Care\n- Complete Closed Loop Fluid Delivery System - Develop physiologically-based software algorithms to perform constant monitoring of patient condition and render the proper fluid resuscitation.\n- Complete Non-Pulmonary Oxygenation - Develop the requisite formulation of hydrogen-peroxide to produce a constant concentration of oxygen during a Casualty Evacuation (CASEVAC) scenario.\n\nEC:  FHP-FY08-03 Rapid Blood Treatment\n- Complete Hemostatic Agents - Conduct biochemical analysis of the efficacy of hemostatic materials as determined by platelet aggregation.\n- Complete Pharmacologic Resuscitation - Conduct feasibility testing of the use of low-volume resuscitation in severe hemorrhage models.\n\nEC:  FHP-FY08-04 Warfighter Restoration\n- Complete Hearing Loss Prevention and Treatment - Conduct data collection and determination of appropriate technologies for the purposes of noise dosimetry and personal protection from noise.\n- Complete Post Traumatic Stress Mitigation - Conduct research that will support the development of stress resilience technologies, including stress resilience, physiological markers of stress\/resilience, studies on the effects of fatigue, and pilot information on the effectiveness of interventions.\n- Complete Repetitive Neurotrauma Mitigation - Identify molecular markers of mild Traumatic Brain Injury (mTBI).\n- Initiate Wound Healing - Determine the optimal drug and delivery combination for restoring muscle and bone.\n\nEC:  FHP-FY10-01 Human Injury & Treatment Model\n- Continue Human Injury & Treatment Model - Develop a model for predicting outcomes of personnel exposure to shipboard damage.\n\nEC:  FHP-FY11-01 Multifunctional Blood Substitute (MFBS)\n- Continue Multifunctional Blood Substitute (MFBS) - Determine the optimal blood component mixture for a complete and shelf-stable resuscitation fluid.\n\nEC:  FHP-FY12-01 Automated Critical Care System (ACCS)\n- Continue Automated Critical Care System (ACCS) - Develop physiologically-based software algorithms to perform constant monitoring of 15 patient conditions and render the proper treatment for all conditions monitored during a 2-6 hour Casualty Evacuation (CASEVAC) scenario.\n\nEC:  FHP-FY12-02 Saving lives with Emergency Medical Perfluorocarbons in the Field (SEMPer Fi) for Sea, Air & Land Dysoxia.\n- Continue SEMPer Fi for Air Dysoxia - Conduct advanced preclinical to early clinical studies on safety, efficacy and dosing of therapeutics for the immediate treatment of pulmonary hypoxia\/hypoxemia.\n- Continue SEMPer Fi for Land Blast Kit - Conduct advanced preclinical to early clinical studies on safety, efficacy and dosing of targeted therapeutics or immediate treatment of blast overpressure, including injury to the brain and\/or internal organs.\n\nEC:  FHP-FY13-03 Extreme Operations: Mitigating Oxygen Imbalance at Altitude and at Depth \n- Initiate Hypoxia Alert and Mitigation System - Conduct cognitive assessment of performance under hypoxic conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Forcenet (FNT) FNC Pillar.  The FNT pillar develops deliverable technologies that provide new capabilities in Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), networking, navigation, sensors, decision support, cyber-space, intelligence, and space technologies that will provide the architectural framework for naval warfare in the information age.  \n\nFY 2013 reflects the sum total of all FNC Program BA 6.2 FNT efforts.   All BA 6.2 FNT efforts were funded by PEs 0602235N and 0602271N in FY 2011 and FY 2012.  Efforts in this PE that have been continued from FY12 into FY13 were previously funded in the Knowledge Superiority and Assurance R-2 Activity of PE 0602235N and the Electronic and Electromagnetic Systems R-2 Activity of PE 0602271N.  Starting in FY 2013, all BA 6.2 FNT efforts will be shown in this PE under this R-2 Activity to better convey exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.921"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.921"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  FNT-FY09-02 Dynamic Tactical Communications Networks\n- Complete Assured information exchange - Develop capabilities for strict priority queuing, adaptive routing and route control agent mechanisms.\n- Complete Self-Organizing Networks - Develop policy-based network management, mobile adhoc networking routing enhancements, radio-router interfaces, and dynamic routing across in-line network encrypters.\n\nEC:  FNT-FY09-04 Dynamic Command and Control (C2) for Tactical Forces and Maritime Operations Center (MOC)\n- Complete Dynamic C2 for Tactical Forces and Maritime Operations Center (MOC) - Conduct Applied Research for the timely and accurate sharing of information between Combat Systems and Tactical Command and Control through disconnected, intermittent, and limited communications.\n\nEC:  FNT-FY10-01 High-bandwidth Free-space Lasercomm\n- Continue Free-space Optical Terminal (FOT) - Develop free space optical terminal components supporting the development of an active optical communication system.\n- Continue Modulating Retro-reflector Unit (MRU) - Develop modulating retro-reflector components supporting the development of a passive optical communication system.\n\nEC:  FNT-FY10-02 Actionable Intelligence Enabled by Persistent Surveillance\n- Continue Autonomous UAV Collision Avoidance System (ACAS) - Develop light weight, low cost sensor components and autonomy algorithms to enable detection and avoidance of all classes of aircraft or unmanned aerial vehicles.\n- Continue Operational Adaptation Enterprise Services - Develop an information enterprise for the organization of contextual Resource Description Framework (RDF) statements for rapid association of data into meaningful graphs and of application services that could be orchestrated in near real-time for hybrid complex operations.\n- Continue Ultra Wide Field-of-View (FOV) Area Surveillance System - Develop unmanned aerial vehicle deployable Electro-Optic \/ Infrared (EO\/IR) sensor components for adaptable wide and narrow fields-of-view.\n\nEC:  FNT-FY10-03 SATCOM Vulnerability Mitigation\n- Continue Airborne Communications Suite (ACS) - Develop algorithms for fast switching phased arrays suitable for use on aircraft and radio architectures and prototype interim common data link radio units suitable for aircraft.\n\nEC:  FNT-FY11-01 Pro-Active Computer Network Defense and Information Assurance\n- Continue Common Operational Security Decision System - Develop a real-time network topology map and visualization model for identifying and displaying network activity.\n- Continue Next Generation Security and Security Management Protocols - Develop real-time system and autonomous control models for network security components.\n- Continue Next Generation Sensors and Gateways - Develop real-time malicious code detection and remediation algorithms for network data.\n\nEC:  FNT-FY11-02 Fast Magic\n- Continue Fast Magic Product 1 - Conduct Applied Research. (details classified)\n- Continue Fast Magic Product 2 - Conduct Applied Research. (details classified)\n\nEC:  FNT-FY11-05 NRL Space\n- Continue Multi-INT Tracking - Conduct Applied Research in the emerging area of vessel tracking.\n- Continue Tagging - Develop data tags based on key parametric values used in the Maritime environment.\n\nEC:  FNT-FY12-01 Advanced Tactical Data Link (ATDL)\n- Continue Mission Based Waveform Controls and Networking - Develop waveform controls and networking capabilities to support integrated systems.\n\nEC:  FNT-FY12-02 Autonomous Persistent Tactical Surveillance\n- Continue Autonomous Information-Based Surveillance Control - Develop algorithms for information based collection and planning.\n- Continue Contextual Enterprise Information - Conduct Applied Research to provide enterprise exploitation services for situation context between relevant theater sensor collections and exploitation products.\n- Continue Mobile Autonomous Intelligence Surveillance Reconnaissance (ISR) to Command and Control (C2) Synchronization - Conduct Applied Research to develop enterprise distributed software that will manage complex event processing and temporal modeling of the ISR to C2 time link budget.\n\nEC:  FNT-FY13-01 EW Battle Management for Surface Defense\n- Initiate Electronic Warfare Battle Management (EWBM) - Conduct Applied Research on the application of multi-variable discrete optimization for distributed surface platforms in support of electronic warfare battle management.\n\nEC:  FNT-FY13-04 ASW Detection and Fusion for Remote Sensors\n- Initiate Adaptive Multi-Int Correlation & Identification (AMICA) - Conduct Applied Research for the integration of emerging Information Operations (IO) and new sensors at the tactical level.\n- Initiate Detection & Classification Algorithms (DCA) - Begin development of detection and classification algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Power and Energy (P&E) FNC pillar.  The P&E Pillar develops deliverable technologies that provide new capabilities in energy security, efficient power and energy systems, high energy and pulse power.   \n\nFY 2013 reflects the sum total of all Navy FNC Program BA 6.2 P&E efforts.   Additional Marine Corps BA 6.2 P&E efforts are funded in PE 0602131M.  All Navy BA 6.2 P&E efforts were funded by PE 0602123N in FY 2011 and FY 2012.  Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Surface Ship and Submarine Hull Mechanical and Electrical (HM&E) R-2 Activity of PE 0602123N.  Starting in FY 2013, all Navy BA 6.2 P&E efforts will be shown in this PE under this R-2 Activity to better convey the Navy funded portion of exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  P&E-FY12-01 Renewable-Sustainable Expeditionary Power\n- Continue Renewable Thermal Engine - Conduct research of sustainable energy technologies for mobile tactical applications.\n\nEC:  P&E-FY12-03 Long Endurance Undersea Vehicle Propulsion\n- Continue Air Independent Propulsion System - Develop full-scale air independent energy system detailed design, technical-cost analysis, and initiate full-scale component procurements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING (BAS)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Basing (BAS) FNC pillar.  The BAS Pillar develops deliverable logistics, shipping and at-sea transfer technologies that provide new capabilities for projecting expeditionary force from the sea base and providing sea based joint operational independence through improved connector, at-sea transfer and shipboard logistical capabilities. \n\nFY 2013 reflects the sum total of all FNC Program BA 6.2 BAS efforts.   All BA 6.2 BAS efforts were funded by PE 0602236N in FY 2011 and FY 2012.  Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Sea Basing Technologies R-2 Activity of PE 0602236N.  Starting in FY 2013, all BA 6.2 BAS efforts will be shown in this PE under this R-2 Activity to better convey exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.848"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.848"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  BAS-FY08-03 Sense and Respond Logistics\n- Complete Common Operating Picture Logistics Decision Support Tool - Develop software to perform human cognitive functions for logistics planning decision support.\n\nEC:  BAS-FY11-01 Connectors and the Sea Base\n- Continue Advanced Mooring System - Construct vacuum mooring and motion control components.\n- Continue Environmental Ship Motion Forecasting - Conduct research on sensing and wave and ship motion sensing and forecasting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Shield (SHD) FNC pillar.  The SHD Pillar develops deliverable technologies that provide new capabilities in theater air and missile defense, anti-submarine warfare, mine countermeasures, defensive surface warfare, global defensive assurance, anti-terrorism, and fleet\/force protection.  \n\nFY 2013 reflects the sum total of all Navy FNC Program BA 6.2 SHD efforts.   Additional Marine Corps BA 6.2 SHD efforts are funded in PE 0602131M.  All Navy BA 6.2 SHD efforts were funded by PEs 0602123N, 0602271N, 0602747N and 0602782N in FY 2011 and FY 2012.  Navy Efforts in this R-2 Activity that have been continued from FY12 into FY13 were previously funded in the Fleet Force Protection and Defense against Undersea Threats and Missile Defense (MD) R-2 Activities of PE 0602123N, the Electronic and Electromagnetic Systems R-2 Activity of PE 0602271N, the Anti-Submarine Warfare (ASW) Surveillance, Anti-Submarine Warfare (ASW) Performance Assessment, Anti-Submarine Warfare (ASW) Distributed Search and Undersea Weaponry R-2 Activities of PE 0602747N, and the Mine\/Obstacle Detection R-2 Activity of PE 0602782N.  Starting in FY 2013, all Navy BA 6.2 SHD efforts will be shown in this PE under this R-2 Activity to better convey the Navy funded portion of exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  SHD-FY09-01 Operation of ASW Active Distributed Systems\n- Complete Mobile System Placement, Source Control, and Pattern Keeping Algorithm - Develop algorithms used to coordinate the search and track capability between mobile, low frequency active Anti-Submarine Warfare (ASW) systems.\n\nEC:  SHD-FY09-06 Countermeasure Technologies for Anti-Ship Missile Defense (ASMD)\n- Complete Enhanced SEWIP Transmitter - Conduct a final test of the enhanced Surface Electronic Warfare Improvement Program (SEWIP) transmit array in the anechoic chamber.\n\nEC:  SHD-FY09-08 Four-Torpedo Salvo Defense\n- Complete Anti Torpedo Torpedo (ATT) for Surface Ship Defense against Complex Salvo - Develop software encoded algorithms for the anti-torpedo torpedo sensor and controller enabling engagement of torpedo salvoes of up to four attacking units.\n\nEC:  SHD-FY10-01 Anti-Ship Missile Defense Technologies (Hardkill)\n- Continue Enhanced Lethality Guidance Algorithms (ELGA) - Design and model STANDARD Missile guidance algorithms for advanced maneuvering missile threats.\n- Continue Enhanced Maneuverability Missile Airframe (EMMA) - Design and model STANDARD Missile motor and control techniques for advanced maneuvering threats.\n\nEC:  SHD-FY10-02 High Fidelity Active Sonar Training\n- Continue ASW Command Level Training - Develop algorithms for training ASW Commanders by utilizing human cognitive factors and evaluate them in the laboratory for performance improvement.\n- Continue Operator Training - Develop algorithms to enhance the realism of simulated submarine targets, environmental clutter and reverberation, and evaluate their laboratory performance.\n\nEC:  SHD-FY10-03 Advanced Sonar Technology for High Clearance Rate Mine Countermeasures (MCM)\n- Continue Integrated Forward Looking Sonar - Dual Frequency Synthetic Aperture Sonar (FLS-DFSAS) - Develop autonomy, automatic target recognition and real-time change detection, including conducting laboratory\/pond data collection.\n- Continue Long Range Low Frequency Broad Band (LFBB) Sonar (Autonomous Underwater Vehicle (AUV) Platform Option) - Conduct long range acoustics experiments and develop classification algorithms.\n- Continue Very Shallow Water (VSW) Acoustic Color\/Imaging Sonar - Develop acoustic color\/synthetic aperture sonar imaging algorithms and performance of controlled data collection.\n\nEC:  SHD-FY10-04 Next Generation Countermeasure Technologies for Ship Missile Defense\n- Continue Next Generation Countermeasure Technologies for Ship Missile Defense - Develop distributed resource optimization and coordinated electronic attack techniques for ship missile defense.\n\nEC:  SHD-FY10-05 Affordable Vector Sensor Towed Array and Signal Processing\n- Continue Vector Sensor Towed Array - Develop component level technology for use in a thin-line Vector Sensor Towed Array and develop a physics-based performance model.\n- Continue Vector Sensor Towed Array Signal Processing - Develop the noise reduction and passive signal processing algorithms unique to a thin line Vector Sensor Towed Array.\n\nEC:  SHD-FY11-01 Torpedo Common Hybrid Fuzing System\n- Continue Torpedo Common Hybrid Fuzing System - Conduct developmental simulation and testing.\n\nEC:  SHD-FY11-02 Integrated Hardkill-Softkill\n- Continue Integrated Active and Electronic Defense (IAED) - Design and model optimized response combinations of kinetic and non-kinetic anti-ship missile defenses.\n\nEC:  SHD-FY12-01 Force Level Radar Resource Management for Integrated Air and Missile Defense (IAMD)\n- Continue Radar Resource Manager for Integrated Air & Missile Defense (IAMD) - Design and model algorithms for management and coordination of force level AEGIS radar resources.\n\nEC:  SHD-FY12-03 Sonar Automation\n- Continue Active Sonar Automation - Identify and evaluate in lab performance of algorithms to improve active sonar operator performance in detecting submarines while reducing false contact rates.\n- Continue Passive Sonar Automation - Identify and evaluate in laboratory performance of algorithms that improve passive sonar operator performance against quiet submarines in the presence of clutter.\n\nEC:  SHD-FY12-04 Detection and Neutralization of Near-Surface Drifting-Oscillating Mines\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Develop target recognition algorithms.\n\nEC:  SHD-FY13-01 Cooperative Networked Radar\n- Initiate Cooperative Networked Radar - Develop software and algorithms to integrate multiple shipboard radars.\n\nEC:  SHD-FY13-02 Ground Based Air Defense On-the-Move (GBAD-OTM)\n- Initiate GBAD-OTM High Energy Laser Demonstrator - Conduct Applied Research supporting development of a radar-cued high energy laser system capable of detecting low radar cross section threats and perform soft and hard kills of unmanned aerial systems while on-the-move.\n\nEC:  SHD-FY13-05 High Altitude ASW (HAASW) from the P-8\n- Initiate Next Generation Multistatic Active Capability (NGMAC) - Identify and evaluate transducer source level improvements and conduct early development work on algorithms capable of providing state estimation for use in multi-static active coherent buoys. \n- Initiate Unmanned Targeting Air System (UTAS) - Identify and evaluate magnetic sensors and algorithms for use on an unmanned aerial vehicle for localization of a submarine.\n\nEC:  SHD-FY13-07 USV Payloads for Single Sortie Mine Countermeasures\n- Initiate Drifting Mine Neutralization Technology - Develop low-cost sensing solutions, algorithm development, and associated autonomy.\n- Initiate MCM Payload Automation - Develop command and control, planning and recognition algorithms and models.\n- Initiate Single Sortie MCM Detect-to-Engage Payload - Develop architecture, command and control, planning algorithms and design options for hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, new for FY13, contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE.  The Sea Strike (STK) FNC pillar develops deliverable technologies that provide new capabilities in power projection and deterrence, precise and persistent offensive power, weapons, aircraft, and expeditionary warfare.  \n\nFY 2013 reflects the sum total of all FNC Program BA 6.2 STK efforts.   All BA 6.2 STK efforts were funded by PEs 0602114N, 0602123N, and 0602271N in FY 2011 and FY 2012. Efforts in this PE that have been continued from FY12 into FY13 were previously funded in the Strike and Littoral Combat Technologies R-2 Activity of PE 0602114N, the Fleet Force Protection and Defense against Undersea Threats R-2 Activity of PE 0602123N, and the Electronic and Electromagnetic Systems R-2 Activity of PE 0602271N.  Starting in FY 2013, all BA 6.2 STK efforts will be shown in this PE under this R-2 Activity to better convey exactly what the Office of Naval Research intends to deliver to acquisition programs over the next several years."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  STK-FY08-04 Next Generation Airborne Electronic Attack\n- Complete Next Generation Airborne Electronic Attack - Develop advanced broadband, high-power active arrays, digital and photonics based beamformers and ultra wide band digital techniques generators.\n\nEC:  STK-FY08-06 Increased Capability Against Moving and Stationary Targets\n- Complete Direct Attack Seeker Head automatic target recognition algorithm development and low cost optics enhancements.\n\nEC:  STK-FY09-03 Enhanced Weapons Technologies\n- Complete High Speed Components - Investigate radome manufacturing methodologies to improve product through-put.\n- Continue Counter Air Defense Improvements - Investigate materials and design concepts, and develop high temperature resin-fiber and high temperature, oxidative-exhaust resistant materials with associated design implementations.\n\nEC:  STK-FY09-05 Advanced Threat Aircraft Countermeasures\n- Complete Countermeasures for Advanced Imaging Infrared (I2R) - Develop final techniques and advanced component designs for countermeasures to advanced imaging infrared sensors.\n- Complete Countermeasures for millimeter wave - Bench test decoy power supply and power amplifier modules.\n\nEC:  STK-FY10-02 Multi-Target Track and Terminate (MTTT)\n- Continue Multi-Target Laser Designator (MTLD) - Develop, fabricate and test advanced optical techniques to enable multiple simultaneous target designations in order to defeat multiple targets (e.g., Swarm attacks).\n\nEC:  STK-FY11-01 Strike Accelerator\n- Continue Strike Accelerator - Develop and understand advanced airborne capability to accurately identify targets using Advanced Target Recognition.\n\nEC:  STK-FY11-02 Radar Electronic Attack Protection (REAP)\n- Continue Identification and Defeat of EA Systems (IDEAS) - Conduct Applied Research in support of algorithm development.\n- Continue Network \"Sentric\" Electronic Protection (EP) - Develop software and algorithms for electronic protection solutions.\n\nEC:  STK-FY12-01 Submarine Survivability - Electronic Warfare\n- Continue Coherent Electronic Attack for Submarines (CEAS) - Develop electronic attack waveforms and techniques to counter advanced coastal radars.\n\nEC:  STK-FY12-02 High Energy Spectrally Beam Combined (SBC) Fiber Laser System\n- Continue High Energy Fiber Laser System - Investigate and understand high energy laser, beam control and other technologies to enable a high energy laser weapons system.\n\nEC:  STK-FY13-02 Hostile Fire (HF) Suppression\n- Initiate Hostile Fire Suppression System - Develop efficient, low weight, multi-band HF suppression system components and fire detection (flash tracking) algorithms.\n\nEC:  STK-FY13-04 AIM-9X Enablers (AXE)\n- Initiate Future IR Enhancement (FIRE) - Design and model an advanced aerodynamic dome and corrective optics for the AIM-9X Sidewinder missile.\n- Initiate Sidewinder Mission Optimized Kinematic Enhancement (SMOKE) - Design and model an advanced rocket motor, warhead, and safe-arm device for the AIM-9X Sidewinder missile."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of FNC technology products within this PE.  In all cases, these technology products support the Department of the Navy FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs) that control the naval pillars of Sea Shield, Sea Strike, Sea Basing, Forcenet, Naval Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, Power and Energy, Capable Manpower, and Force Health Protection.  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                }
            ]
        }
    }
}