{
    "id": "64416f90ccf53c76fdd9cf82b4011aa5829ef5a5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "94.557"
            },
            "CurrentYear": {
                "val": "122.458"
            },
            "BudgetYearOne": {
                "val": "54.858"
            },
            "BudgetYearOneBase": {
                "val": "54.858"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "57.749"
            },
            "BudgetYearThree": {
                "val": "65.577"
            },
            "BudgetYearFour": {
                "val": "67.369"
            },
            "BudgetYearFive": {
                "val": "68.770"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nActivities and efforts in this Program Element (PE) address technologies critical to enabling the transformation of discrete functions to network centric warfare capabilities which simultaneously perform Radar, Electronic Warfare (EW), and Communications and Network functions across platforms through multiple, simultaneous and continuous communications\/data links.  The Electromagnetic Systems Advanced Technology program addresses Radio Frequency (RF) technology for Surface and Aerospace Surveillance sensors and systems, EW sensors and systems, RF Communication Systems, Multi-Function sensor systems, and Position, Navigation and Timing (PNT) capabilities.  Within the Naval Transformational Roadmap, this investment offers affordable options for the transformational capabilities required by the Sea Shield (Theater Air and Missile Defense), Sea Strike (Persistent Intelligence, Surveillance, and Reconnaissance), and ForceNet (Communications and Networking) SeaPower 21 Naval Warfighting Pillars. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "82.143"
                },
                "CurrentYear": {
                    "val": "102.535"
                },
                "BudgetYearOne": {
                    "val": "102.498"
                },
                "BudgetYearOneBase": {
                    "val": "102.498"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.557"
                },
                "CurrentYear": {
                    "val": "122.458"
                },
                "BudgetYearOne": {
                    "val": "54.858"
                },
                "BudgetYearOneBase": {
                    "val": "54.858"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "12.414"
                },
                "CurrentYear": {
                    "val": "19.923"
                },
                "BudgetYearOne": {
                    "val": "-47.640"
                },
                "BudgetYearOneBase": {
                    "val": "-47.640"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.077"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "20.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.240"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "10.680"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-45.237"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-45.237"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.403"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.403"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.506"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2913"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "80.457"
                        },
                        "CurrentYear": {
                            "val": "102.458"
                        },
                        "BudgetYearOne": {
                            "val": "54.858"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.858"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "57.749"
                        },
                        "BudgetYearThree": {
                            "val": "65.577"
                        },
                        "BudgetYearFour": {
                            "val": "67.369"
                        },
                        "BudgetYearFive": {
                            "val": "68.770"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project emphasizes near to mid-term transition opportunities by developing and demonstrating technologies which enable affordable options for transformational capabilities required by the Sea Shield, Sea Strike, and ForceNet pillars.  Work in this project addresses cost-effective RF technology for Surface and Aerospace Surveillance sensors and systems, EW sensors and systems, RF Communication Systems, Multi-Function sensor systems, and Position, Navigation and Timing (PNT) capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ELECTRONIC AND ELECTROMAGNETIC SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop, test, and demonstrate communications, electronic attack (EA), electronic surveillance (ES), electronic warfare (EW), and radar functions.  This activity also includes development of affordable wideband, high performance Advanced Multifunction Radio Frequency (AMRF) apertures.  A portion of this PE is devoted to mid-term technology development in close concert with acquisition programs of record.  The products of these efforts are expected to transition at the end of their schedule into the associated acquisition program of record.  In this PE, these Future Naval Capability (FNC) Enabling Capabilities (ECs) span across Electronics, EW, Radar, and Communications technology areas.  This activity also appears in PE 0602271N.  For ECs receiving funding from both PEs, the PE 0602271N portion is generally focused on component design and development while the funding from this PE is focused on integration and demonstration.\n\nThe Navy assumed responsibility for Joint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3 S&T by Congressional Mandate.  In FY 2012, JCREW EC program will support JCREW 3.3 Acquisition Program Increment 2 Blocks 1 and 2 and will develop an advanced multi-function communications and EW architecture with supporting component technologies to support prototype development.\n\nThe major objectives of this activity are:\n\na) Affordable Common Radar Architecture (ACRA) - Develop a scalable, open radar architecture that addresses affordability challenges for 5 different radars.\n\nb) Low Cost Over The Horizon (OTH) Communication, SATCOM and Line Of Sight (LOS) Apertures - Provide apertures, link electronics and programmable terminal components that are suitable for multiple platforms.\n\nc) SATCOM Vulnerability Mitigation - Develop a diverse, multi-tier communications networking capability for Naval strike forces.\n\nd) Long Range Detection and Tracking - Ability to detect, track and identify (ID) future anti-ship ballistic missiles, advanced cruise missiles, aircraft and Unmanned Air Vehicles (UAVs).\n\ne) Affordable Electronically Scanned Array Technology for Next Generation Naval Platforms - Develop and demonstrate affordable components in beamforming element chains for efficient S- and X-Band radar, and EA using highly efficient digital solid state electronics components covering the RF and microwave frequencies.\n\nf) Countermeasure Technologies for Anti-Ship Missile Defense (ASMD) - Improve ship survivability by disrupting the terminal engagement phase of hostile Anti-Ship Cruise Missiles\/ Anti-Ship Ballistic Missiles (ASCM\/ASBM), including improvements to both onboard Surface Electronic Warfare Improvement Program (SEWIP) and offboard Nulka RF EA systems.\n\ng) Next Generation Countermeasure Technologies for Ship Missile Defense - Develop and demonstrate the fundamental technologies required to conduct next generation, persistent EW in support of ship, sea base, and littoral force missile defense operations in a distributed, coordinated manner across the entire battlespace.\n\nh) Next Generation Airborne Electronic Attack - Develop and demonstrate advanced capability Airborne Electronic Attack (AEA) sub-systems (e.g., broadband exciters, power amplifiers, and transmit arrays) that provide Suppression of Enemy Air Defenses (SEAD), deliver Non-Kinetic Fires, counter Integrated Air Defense Systems (IADS), and provide suppression of Command, Control & Communications (C3) links and data networks.\n\ni) Data Exfiltration Nanosatellite Innovative Space Enabler (DENISE)(formerly known as Global Applications for Data Exfiltration(GLADEX)) - Develop a capability for monitoring and relay of unattended sensor data for global situational awareness.  Benefits include security through encryption, reduced dependence on commercial systems, and reduced collection needs by manned and unmanned in-area assets.  It addresses a shortfall to monitor shipping in territorial waters and the open ocean to combat terrorism, and, enforce criminal law.\n\nj) Radar Electronic Attack Protection (REAP) - Develop single platform precision passive Electronic Support Measure (ESM) and Electronic Protection (EP) techniques and technology to counter hostile use of modern Electronic Attack (EA) self protection jammers.\n\nk) Joint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3 - Develop integrated RF communications and RF jammer capability that addresses the electromagnetic interference (EMI) issue to enable interoperability.\n\nl) Submarine Survivability- Electronic Warfare - Develop and demonstrate technologies that will provide submarines an EA capability against surveillance radar systems through EW payloads integrated with submarine masts, as well as networked offboard platforms.  These capabilities will improve the submarine's survivability in a hostile RF environment by providing a non-kinetic strike capability against enemy Intelligence, Surveillance and Reconnaissance (ISR) sensors.\n\nm) Electronic Warfare (EW) Roadmap - Develop classified advanced electronic warfare technology in support of current and predicted capability requirements. \n\nn) Azimuth and Inertial MEMS Navigation System -  Develop an accurate, lightweight, handheld Micro-Electro-Mechanical Systems (MEMS) inertial navigation system with azimuth accuracy of 1 mil within 60 seconds in all environmental conditions.\n\no) Cooperative Networked Radar-  Develop radar techniques to enhance sensitivity, improve electronic protection, expand intercept geometries, and save costs for advanced radars.\n\np) Long Range RF Find, Fix, and ID- Develop radar techniques and algorithms for airborne identification.\n\nq) Hostile Fire (HF) Suppression- Develop an effective non-lethal suppression against current and future non-guided threats through application of a visible laser with closed-loop power management to cause temporary loss of visual acuity to the weapon operator sufficient to defeat the weapon engagement.\n\nThe increase of funding from FY 2011 to FY 2012 is the result of increased investment and initiation of Advanced Technology research supporting Electronic Attack capabilities for Submarine.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 Activity to a new FNC R2 activities titled, Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, FORCEnet, Sea Shield, and Sea Strike.  Efforts in this R2 Activity have been continued from FY 2012 to FY 2013 in the new R2 Activities to support all FNC program EC investments and the objective of EW Roadmap is the only effort remains in this R-2 activity effective FY 2013.  \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.735"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Affordable Common Radar Architecture (ACRA):\n- Continued the ACRA effort by defining interface specifications. This effort is developing a radar architecture which moves the digital conversions as close to the antenna as possible for substantial performance and supportability improvements. \n\nLow Cost Over The Horizon (OTH) Communication, SATCOM and Line Of Sight (LOS) Apertures:\n- Completed  H-60 Tactical Common Data Link (TCDL) project. This effort develops a scalable, low cost, light weight, low drag multichannel Jam Resistant (JR) Tactical Common Data Link (TCDL) relay and networking terminal.\n- Completed Low cost SATCOM-on-the-Move array for Marine Corps. This effort develops a low cost, scalable SATCOM on-the-move communication system for both High Data Rate (HDR) and Low Data Rate (LDR) Marine Corps vehicular communications.\n- Completed nested, coplanar array\/Modular Integrated Link Electronics System (MILES) design and integration. This effort develops a communications array which will provide Ultra High Frequency (UHF) LOS functionality and Ku-Band communications for Naval Tactical Networking (NTN).\n\nSATCOM Vulnerability Mitigation:\n- Continued development of hardware and software appliques that implement waveforms, protocols, and techniques to significantly increase the data throughput on High Frequency (HF) communications channels. \n- Continued development of multi-link, UHF, millimeter wave, air-to-air, air to ground and SATCOM terminals for networking airborne platforms with other airborne assets.\n\nLong Range Detection and Tracking:\n- Continued FNC EC Long Range Detection and Tracking. Capture and extend the prototype development that occurred under Advanced Electronic Sensor Systems for Missile Defense, this project delivers an affordable, open-architecture Digital Array Radar (DAR) single face Advanced Development Model (ADM). This effort demonstrates the ability to perform simultaneous full volume radar coverage of contacts at long ranges and in dense contact environments.\n\nAffordable Electronically Scanned Array Technology for Next Generation Naval Platforms:\n- Continued to develop and demonstrate affordable components in beamforming element chains for efficient S- and X-Band radar, and EA using highly efficient digital solid state electronics components covering the RF and microwave frequencies.\n\nCountermeasure Technologies for Anti-Ship Missile Defense (ASMD):\n- Continued the Enhanced Nulka Payload FNC effort by starting system architecture design. This effort develops an affordable and extremely compact RF payload for the Nulka offboard decoy with an Electronically Scanned Array (ESA) transmitter, compact receiver chain, and advanced isolation materials.\n- Continued the Enhanced Surface Electronic Warfare Improvement Program (SEWIP) Transmitter FNC effort by starting system architecture design and Low Voltage Gallium Arsenide (GaAs) High Power Amplifier (HPA) Monolithic Microwave Integrated Circuit (MMIC) purchases.  This effort develops affordable and reliable solid state transmitter technologies to engage anti-ship cruise and ballistic missile RF seekers.\n\nNext Generation Countermeasure Technologies for Ship Missile Defense:\n- Continued the development of technologies to demonstrate effective EW countermeasures for ship missile defense operations in a distributed coordinated manner across the entire battlespace.\n\nNext Generation Airborne Electronic Attack:\n- Continued the Next Generation Airborne Electronic Attack FNC effort by demonstrating critical subsystems operating in the RF low- and mid-bands. This effort develops and demonstrates advanced capability Airborne Electronic Attack (AEA) sub-systems (e.g., broadband exciters, power amplifiers, and transmit arrays) that provide suppression of enemy air defenses (SEAD), deliver non-kinetic fires, counter integrated air defense systems (IADS), and provide suppression of C3 links and data networks.\n\nData Exfiltration Nanosatellite Innovative Space Enabler (DENISE): \n- Developed a nano-satellite bus. This effort provides for the development, integration, and demonstration of a nano-sat satellite bus with all its requisite structural, power, thermal, control, and separation subsystems.\n- Developed a nano-satellite compatible payload and transportable ground terminal. This effort will provide for development, integration, and demonstration of a nano-sat compatible payload and ground terminal for monitoring and relay of unattended sensor data for global situational awareness.\n\nRadar Electronic Attack Protection (REAP):\n- Identified and Defeat of Electronic Attack Systems (IDEAS) FNC effort by developing single platform precision passive electronic support measure (ESM) and electronic protection (EP) techniques and technology to counter hostile use of modern EA self protection jammers.\n\nJoint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3:\n- Developed JCREW 3.3 component development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.382"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Affordable Common Radar Architecture (ACRA): \n- Continue all efforts of FY 2011. \n\nSATCOM Vulnerability Mitigation: \n- Continue all efforts of FY 2011. \n\nLong Range Detection and Tracking:\n- Complete FNC EC Long Range Detection and Tracking. Capture and extend the prototype development that occurred under Advanced Electronic Sensor Systems for Missile Defense.  This project delivers an affordable, open-architecture DAR single face ADM. This effort demonstrates the ability to perform simultaneous full volume radar coverage of contacts at long ranges and in dense contact environments.\n\nAffordable Electronically Scanned Array Technology for Next Generation Naval Platforms: \n- Complete development and demonstration of affordable components in beamforming element chains for efficient S-and X-Band radar, and EA using highly efficient digital solid state electronics components covering the RF and microwave frequencies.\n\nCountermeasure Technologies for Anti-Ship Missile Defense (ASMD): \n- Continue all efforts of FY 2011 less those noted below as complete. \n- Complete the Enhanced Nulka Payload FNC effort.\n\nNext Generation Countermeasure Technologies for Ship Missile Defense: \n- Continue all efforts of FY 2011.\n\nNext Generation Airborne Electronic Attack:\n- Continue all efforts of FY 2011.\n\nData Exfiltration Nanosatellite Innovative Space Enabler (DENISE): \n- Continue all efforts of FY 2011.\n\nRadar Electronic Attack Protection (REAP): \n- Continue all efforts of FY 2011.\n\nJoint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3: \n- Continue all efforts of FY 2011.\n- Distribute Counter-RCIED FNC effort through algorithm development and assessment.\n- Integrate Counter-RCIED EW (ICEW) FNC effort by starting component design and integration plans.\n\nSubmarine Survivability - Electronic Warfare:\n- Distribute Coherent Electronic Attack for Submarines (CEAS) FNC effort by commencing development of the compact EA payload and techniques for the multi-mission mast (MMM).\n- Distribute Coherent Electronic Attack for Submarines (D-CEAS) FNC effort by commencing an assessment of current capabilities.\n\nElectronic Warfare (EW) Roadmap: \n- Develop classified advanced electronic warfare technology in support of current and predicted capability requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GLOBAL POSITIONING SYSTEM (GPS) & NAVIGATION TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using either GPS systems, non-GPS navigation devices, or atomic clocks.  This activity will increase the operational effectiveness of U.S. Naval units.  The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost, Inertial Navigation Systems (INS).\n\nThe major objectives of this activity are:\n\na) GPS Anti-Jam Antennas and Receivers - Integrate and demonstrate anti-jam antennas and antenna electronics for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats; to integrate and demonstrate anti-spoofer\/anti-jam processors for the purpose of providing precision navigation capabilities in the presence of emergent threats. \n\nb) Precision Time and Time Transfer - Integrate and demonstrate tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time; to integrate and demonstrate the capability of transferring GPS-derived time via radio frequency links for the purpose of providing GPS-independent precision time. \n\nc) Non-GPS Navigation Technology - To integrate and demonstrate inertial navigation systems for the purpose of providing an alternative means of providing precision navigation for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals; to integrate and demonstrate a correlation navigation technique using earth maps of high precision (including bathymetric, magnetic and gravimetric data) for navigation for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals.\n\nThe increase of funding from FY 2011 to FY 2012 is the result of increased investment and initiation of Advanced Technology research supporting GPS Anti-Jam Antennas and Receivers.\n\nThe following are non-inclusive examples for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers:\n- Completed Adaptive Temporal Suppression of Structured Interference.\n- Completed Anti-spoof Antenna Electronics using Electronic Support Measures (ESM) and tracking.\n- Developed Small Antenna Based Anti-spoofing project.\n- Developed Advanced Spoofer Tracking.\n- Developed Next Generation Global Positioning Satellite System - Situational Awareness (XGPSS-SA) Challenged Environment.\n\nPrecision Time and Time Transfer:\n- Continued the development of algorithms for distributed time scaling; developed architectures necessary to establish a Navy Global Coordinated Time Scale; tested the algorithms via both simulation and using actual clock data provided by the U.S. Naval Observatory (USNO).\n- Developed and Distributed Time-frequency Device.\n- Developed Rb 3-cc Tactical Grade Atomic Clock (TGAC).\n\nNon-GPS Navigation Technology:\n- Continued the development of a small, lightweight Micro-Electro-Mechanical Systems (MEMS) Accelerometer for navigation systems; and fabricated an Electro-Optic Accelerometer.\n- Continued the Optically Transduced MEMS Inertial Navigation System project.\n- Continued the Sub-harmonic Lateral Mode MEMS Inertial Navigation System project.\n- Continued the Two-Axis Gyro-compass Fiber Optic Inertial Navigation System project.\n- Completed 5-cc Accelerometer with Embedded GPS Inertial (EGI) System for aircraft avionics applications.\n- Completed MEMS Gyro-cluster INS for Tactical Platforms project.\n- Completed Precision Celestial Navigation System (PCNS) project.\n- Completed Dead Reckoning Advanced Tight Coupling (DRATC) project.\n- Completed navigation grade Inertial Navigation System (INS) using MEMS gyro project.\n- Completed development of the Sonar Aided Bathymetric Navigation Technology.\n- Developed Wavewinds project.\n- Developed Small Unmanned Underwater Vehicle - Sonar Aided Inertial Navigation Technology (UUV-SAINT) project.\n- Developed Portable PCNS project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.439"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers:\n- Continue all efforts of FY 2011 less those noted as complete.  \n- Modernize Receiver for RF Challenged Environments.\n- Develop Simulation GPS Signals in a Stressed Environment.\n- Complete Accurate Cooperative Geolocation System.\n- Develop Self Calibrating GPS AJ Antennas for Electronic Support.\n\nPrecision Time and Time Transfer:\n- Continue all efforts of FY 2011.\n\nNon-GPS Navigation Technology:\n- Complete the development of a small, lightweight Micro-Electro-Mechanical Systems (MEMS) Accelerometer for navigation systems; and fabricated an Electro-Optic Accelerometer.\n- Complete the 5-cc accelerometer with the Embedded GPS Inertial (EGI) System for aircraft avionics applications.\n- Complete the Dead Reckoning Advanced Tight Coupling (DRATC) project.\n- Develop Superconducting Magnetometer On-Board Navigation (SIMON) System.\n- Develop Alternative Navigation Over Unstructured or Featureless Terrain."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.311"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.311"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers:\n- Continue all efforts of FY 2012.  \n- Engage in the Application of National Airspace Air Traffic Control (ATC) Automatic Dependant Surveillance Broadcast (ADS-B) project.\n- Engage Cognitive Modernized GPS User Equipment (MGUE) for GPS-Denied Environments project.\n\nPrecision Time and Time Transfer:\n- Continue all efforts of FY 2012.  \n- Engage in the Ultra-Precise Timing Using GPS (UPTUG) Project.\n\nNon-GPS Navigation Technology:\n- Continue all efforts of FY 2012 less those noted as complete."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTEGRATED TOPSIDE (INTOP) INNOVATIVE NAVAL PROTOTYPE (INP)"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of the INTOP INP is to develop and demonstrate a set of prototypes that integrate RF functionality (EW, Radar, Communications, Navigation) into a common set of multi-function apertures electronics and software through an architecture that is modular, scalable across all platforms, and open at the RF as well as computer and software level.  The apertures are capable of providing multiple simultaneous, independent beams which can together perform any of the above functions.\n\nThe major objectives of this activity are:\n\na) Submarine SATCOM Array - Develop wide-band SATCOM array capable of supporting EW for submarines.\n\nb) Electronic Warfare (EW)\/Information Operations (IO)\/Line of Sight (LOS) Communications (Comms) for Surface Combatants - Develop wide-band array to support EW capability and other functions, including but not limited to IO and LOS Comms, for surface combatants with potential application to other platforms.\n\nc) Architecture, Standards and Devices - Develop architecture and standards for wide-band multi-beam, multi-band arrays and below deck systems and the technology and electronic devices needed to make integrated array systems affordable.\n\nd) Surface Combatant Communication Array - Develop wide-band surface combatant communication array capable of supporting other RF functions.\n\ne) Resource Allocation Manager - Develop enterprise common Resource Allocation Manager.\n\nf) Digital Radar - Develop an all digital radar to demonstrate advanced concepts for coherent radar networking and control, which will increase radar coverage and provide new levels of electronic protection (EP), while maximizing radar resources and reducing cost.\n\nThe increase from FY 2011 to FY 2012 is due to the fact that the majority of the Surface EW\/IO\/Comms System build will take place starting in FY 2012.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Submarine SATCOM Array: \n- Continued prototype array development.\n- Completed SATCOM Array technical designs.\n- Developed prototype build.\n\nEW\/IO\/Comms for Surface Combatants:\n- Continued design of EW\/IO\/Comms prototype.   \n- Began developing prototype capability.\n\nArchitecture, Standards and Devices:\n- Continued IDAARS, a multi-function RF topside aperture prototype covering approximately 200MHz to 22 GHz and provide the appropriate control and synergy of the functionality such that the RF functions automatically support one another providing improved operational capability. Additionally, demonstrate reductions in size, weight, and power as well as cost (both acquisition and life cycle) by reducing the number of topside apertures needed for communication, electronic warfare, and some radar functions. A critical tenet of the prototype will be the demonstration of an open architecture so that not only can different companies supply the major components such as a given receive or transmit aperture, but even down to the subarray and lower component level throughout the life cycle to ensure continuing competition for maintenance and replacement parts.\n- Continued development of architecture and interfaces and their application to wide-band SATCOM arrays for submarines.\n- Continued development of deckhouse and platform integration strategies and concepts.\n\nSurface Combatant Communication Array:\n- Completed studies of array concepts.\n\nResource Allocation Manager:\n- Continued development of functional queue management software.\n- Continued development of control interface software for the resource allocation manager.\n\nDigital Radar:\n- Developed concept studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Submarine SATCOM Array:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete prototype array development.\n- Develop integration and test program.\n\nEW\/IO\/Comms for Surface Combatants:\n- Continue all efforts of FY 2011. \n- Complete design of EW\/IO\/Comms for Surface Combatants. \n- Develop building of prototype.\n\nArchitecture, Standards and Devices:\n- Continue all efforts of FY 2011.\n\nSurface Combatants Communications Array:\n- Develop design effort.\n\nResource Allocation Manager:\n- Continue all efforts of FY 2011.\n\nDigital Radar:\n- Complete concept studies.\n- Develope design effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Submarine SATCOM Array:\n- Continue all efforts of FY 2012 less those noted as complete above.\n- Complete prototype build.\n\nEW\/IO\/Comms for Surface Combatants: \n- Continue all efforts of FY 2012 less those noted as complete above.\n\nArchitecture, Standards and Devices:\n- Continue all efforts of FY 2012.  \n\nSurface Combatants Communications Array:\n- Continue all efforts of FY 2012. \n\nResource Allocation Manager:\n- Continue all efforts of FY 2012.  \n\nDigital Radar:\n- Continue all efforts of FY 2012 less those noted as complete above."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Advanced Electronic Sensor Systems for Missile Defense and Long Range Detection and Tracking ECs are aligned to the Navy's Advanced Cruiser (CG(X)) plans and closely coordinated with Naval Sea Systems Command Integrated Warfare Systems (PEO IWS 2.0). Other performance metrics are discussed within the R-2a."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2933"
                    },
                    "ProjectTitle": {
                        "val": "Wide Focal Planar Array Camera S&T"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.100"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.100"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new Overseas Contingency Operations (OCO) project."
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort develops technology to support the maturation and demonstration of sensing and analysis capabilities that can enhance wide area tactical situational awareness and generate actionable intelligence."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Wide Focal Planar Array Camera S&T"
                                    },
                                    "Description": {
                                        "val": "This effort develops technology to support the maturation and demonstration of sensing and analysis capabilities that can enhance wide area tactical situational awareness and generate actionable intelligence. \n\nThe major objectives of this activity are: \n\nA) Wide Focal Plane Array Camera (WFPAC) sensor - Develop an airborne sensor payload for a Group two-third form factor and procurement of a limited quantity of payloads in support of Unmanned Aerial Vehicle (UAV) integration and field user evaluation.  Effort will also develop an advanced Mid Wavelength Infrared (MWIR) focal plane array in order to enable a night Group two-third wide area airborne payload and support Navy UAV integration effort as required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nFY 2011 OCO Plans: \n- Completed effort to complete development, testing, integration and initial procurement of a Wide Focal Plane Array Camera (WFPAC) sensor for the RQ-7 \"Shadow\" Unmanned Aerial System (UAS), also referred to as the Marine Corps Tactical Unmanned Aerial System (MCTUAS), in support of OEF-Afghanistan. \n- Completed development of a 59 megapixel WAAS payload in a shadow form factor by maturing the data link, adding color and a dual field of view for the purposes of field user technology and CONOPs evaluation, fabricate a limited number of sensors (4). \n- Completed maturation for the design of a 64 megapixel mid range IR focal plan array."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Successful development of a sensor to provide a 16 square kilometers persistent field of view with a .5m resolution at 10 frames per second (fps), which would allow real time for up to 10 local Common Data Link transceivers while also being stored for post-mission exploitation and forensics at two fps."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "20.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Adv Radar Innovation Fund - S&T (Cong)"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Accelerate future capabilities for innovative technologies that show promise for capability enhancements and affordability to enhance current sensor platforms and prepare for future technological advances in a manner that is affordable and flexible."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}