{
    "id": "6482e387ca9f58cecaa20731b045d22911c08d30",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA5_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605018N"
        },
        "ProgramElementTitle": {
            "val": "(U)Navy Integrated Mil Human Res Sys(N-IMHRS)"
        },
        "R1LineItemNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.965"
            },
            "CurrentYear": {
                "val": "55.017"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "69.982"
            }
        },
        "ProgramElementNote": {
            "val": "The correct title for the Program is Future Personnel and Pay Solution (FPPS) vice Navy Integrated Military Human Resource System (N-IMHRS).\nThe FPPS program has been restructured beginning in FY13. Funding for Project 3034 has been transferred from PE 0605018N 3034 to PE 0605013N Project 2905 (BUPERS IT Modernization) beginning in FY13 to reflect the Navy's new strategy on the modernization of integrated personnel and pay systems. This transfer realigns the funds to the responsible organization required to execute the strategy approved by the DON Executive Advisory Board (EAB) in July, 2011. This strategy includes Business Process Re-engineering (BPR) defined requirements, modernization\/risk reduction of current personnel\/pay systems centered around the Navy's Standard Integrated Personnel System (NSIPS), and development of a future pay engine.  The effort will now be known as Integrated Personnel and Pay Systems - Navy (IPPS-N)."
        },
        "ProgramElementMissionDescription": {
            "val": "Funding supports design, development and modernization efforts. The mission is to develop economical and efficient solutions allowing the Navy to respond rapidly to warfighter personnel and pay information needs.\nThe following programmed activities support the mission:  \na.\tAnalyze and develop risk reduction activities \nb.\tAnalyze  interfaces, data, and  reports between current core Human Resources Personnel functions,  Navy Standard Integrated Personnel System, and other Government Off the Shelf solutions  \nc.\tContinue data structure mapping and management activities for Authoritative Data Warehouse to eventually warehouse Navy authoritative data\nd.\tDevelop architecture that aligns with OSD Business Enterprise Architecture and the Navy Department of Defense Architectural Framework \ne.\tContinue development and management of prototype lab environment for system blueprinting activities\nf.\tConduct functionality analysis of legacy systems to deploy into prototype lab"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.444"
                },
                "CurrentYear": {
                    "val": "55.050"
                },
                "BudgetYearOne": {
                    "val": "76.912"
                },
                "BudgetYearOneBase": {
                    "val": "76.912"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.965"
                },
                "CurrentYear": {
                    "val": "55.017"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.479"
                },
                "CurrentYear": {
                    "val": "-0.033"
                },
                "BudgetYearOne": {
                    "val": "-76.912"
                },
                "BudgetYearOneBase": {
                    "val": "-76.912"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.033"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.400"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-76.912"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-76.912"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.079"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-12.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3034"
                    },
                    "ProjectTitle": {
                        "val": "Future Personnel and Pay Solution"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.965"
                        },
                        "CurrentYear": {
                            "val": "55.017"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "69.982"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The correct name of the program is Future Personnel and Pay Solution (FPPS).\nThe FPPS program has been restructured beginning in FY13.  Funding for Project 3034 has been transferred from PE 0605018N 3034 to PE 0605013N Project 2905 (BUPERS IT Modernization) beginning in FY13 to reflect the Navy's new strategy on the modernization of integrated personnel and pay systems.  This transfer realigns the funds to the responsible organization required to execute the strategy approved by the DON Executive Advisory Board (EAB) in July, 2011.  This strategy includes Business Process Re-engineering (BPR) defined requirements, modernization\/risk reduction of current personnel\/pay systems centered around the Navy's Standard Integrated Personnel System (NSIPS), and development of a future pay engine."
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding supports design, development and modernization efforts.  The mission provides development, integration, engineering, and test support of future personnel and pay system capabilities, including the modernization and consolidation of existing pay and personnel systems re-using the Defense Integrated Military Human Resources System (DIMHRS) core software to the maximum extent practical.  Specific goals include: (1) development of specifications and design of solutions to consolidate Navy legacy personnel systems, (i.e. development of a single operational data store of personnel data and development and modernization of legacy interfaces that must remain beyond the consolidation effort); (2) replacement of the pay capability provided by the Defense Joint Military Pay System (DJMS), providing for Navy specific requirements for pay and personnel management and develop external interfaces as required to support pay management for the Navy; (3) development and modernization support from the functional organization; and (4) operational test and evaluation support for the selected future personnel and pay solution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Personnel and Pay Solution"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.965"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Conducted analysis of the software maturity and capabilities provided in the DIMHRS core software baseline.\n-  Conducted Navy Performance Appraisal Reporting System (NPARS) Analysis of Alternatives (AoA), made recommendations, and began implementation of identified solution.\n-  Developed Integrated Personnel & Pay Systems- Navy Concept of Operations (IPPS-N CONOPS).\n-  Conducted analysis to identify risk reduction activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.017"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Continue to analyze and develop risk reduction activities.\n-  Perform analysis of interfaces, data, and reports between Reserve Headquarters System (RHS) and Navy Standard Integrated Personnel System (NSIPS).\n-  Conduct data structure mapping and management activities for Authoritative Data Warehouse (ADW) to eventually warehouse RHS authoritative data.\n-  Develop architecture that aligns with Office of Secretary (OSD) Business Enterprise Architechture (BEA) and the Navy Department of Defense Architecture Framework (DoDAF).\n-  Create a prototype lab environment for system blueprinting activities.\n-  Conduct migration and integration of legacy functionality into lab test systems (prototype).  This will support risk reduction activities by providing analysis of legacy functionality with respect to data structure mapping and design.  The lab environment will also support OSD Authoritative Data Warehouse(ADW) activities by providing a testing environment for interfacing the OSD Enterprise Information Warehouse (EIW) to the Navy ADW.\n-  Conduct development of lab test systems to support multiple versions of target software environment (PeopleSoft, SAP, SAS)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Navy began the transition to the development and modification of Future Personnel and Pay System (FPPS) in FY 2010.  The acquisition strategy consists of an incremental migration of Reserve Headquarters System (RHS), Officer Personnel Information Systems (OPINS), Navy Enlisted System (NES) and Inactive Manpower and Personnel Management Information System (IMAPMIS) into Navy Standard Integrated Personnel System (NSIPS).  This strategy also includes development of an Authoritative Data Warehouse which occurs concurrently with the migration of legacy systems."
                        },
                        "PerformanceMetrics": {
                            "val": "1. Demonstrate the feasibility of at least one technical architecture approach for FPPS.\t\t\t\n2. A 20% reduction in the number of redundant transactional systems for personnel and pay.\n3. A 15% reduction in system interfaces.\n4. Documented plan and preliminary design for the consolidation of legacy personnel systems.\n5. Develop a Navy Authoritative Data Warehouse for data standardization."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Unknown"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Unknown"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.200"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "42.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "51.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "51.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Architechture"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC NOLA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "New Orleans, LA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Tools and License"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Unknown"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Unknown"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.400"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Unknown"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Unknown"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.217"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.217"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9.217"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Authoritative Data"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC NOLA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "New Orleans, LA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.365"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.365"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.365"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}