{
    "id": "6a2af17e5657e8c04f012a2a6b24c9d792a27ecb",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DLA_JustificationBook_Defense_Logistics_Agency_PB_2013.zzz_unzipped_JustificationBook_Defense_Logistics_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603720S"
        },
        "ProgramElementTitle": {
            "val": "Microelectronics Technology Development and Support  (DMEA)"
        },
        "R1LineItemNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "26.484"
            },
            "CurrentYear": {
                "val": "59.895"
            },
            "BudgetYearOne": {
                "val": "72.234"
            },
            "BudgetYearOneBase": {
                "val": "72.234"
            },
            "BudgetYearTwo": {
                "val": "83.170"
            },
            "BudgetYearThree": {
                "val": "83.924"
            },
            "BudgetYearFour": {
                "val": "80.242"
            },
            "BudgetYearFive": {
                "val": "82.021"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Microelectronics Activity (DMEA) provides a vital service as the joint Department of Defense (DoD) Center for microelectronics acquisition, adaptive operations and support - advancing future microelectronics research, development, technologies and applications to achieve the Department’s strategic and national security objectives.  An important part of the DMEA mission is to research current and emerging microelectronics issues with a focus on warfighters’ needs.  To this end, DMEA is integrally involved in the development of capabilities and resultant products based on technologies whose feasibility has been demonstrated but which have yet to be applied to real-world and military applications.\n\nDMEA resolves microelectronics technology issues in weapon systems by quickly developing and executing appropriate solutions to not only keep a system operational but elevate it to the next level of sophistication or to meet new threats.  DMEA provides critical microelectronics design and fabrication skills to ensure that the DoD is provided with systems capable of ensuring technological superiority over potential adversaries. DMEA provides critical, quick turn solutions for DoD, intelligence, special operations, cyber and combat missions as well as microelectronic components that are unobtainable in the commercial market.  DMEA’s knowledge of varying military requirements across a broad and diverse range of combatant environments and missions—along with its unique technical perspective—allows it to develop, manage and implement novel microelectronic solutions to enhance mission capability.  DMEA can then use these cutting-edge technology capabilities and products in the solutions it develops for its military clientele.  After many years of performing analogous efforts, the technical experience, mission knowledge, and practical judgment that are gained from preceding efforts are often incorporated into subsequent technology maturation projects.\n\nMicroelectronics technology is a vital and essential technology for all operations within the DoD.  DMEA operates the DoD’s only microelectronic foundry—a “flexible foundry”—with a unique business model that incorporates industry partnership to serve the DoD where industry, alone, has not.  A microelectronic foundry is the factory that takes raw silicon and produces an integrated circuit or “chip.”  The fabrication of an integrated circuit consists of multiple processing steps to form and connect many transistors and other circuit components to form the desired function.  Each type of chip requires a different “recipe” (process) in the foundry.  Semiconductor companies spend great amounts of time and resources developing proprietary recipes.  They abandon these and develop new recipes as new generations of smaller and more powerful microelectronic components are needed. \n\nThe DMEA mission focuses on providing DoD systems with microelectronics components that are no longer provided by industry—called “legacy” components.  Most domestic semiconductor foundries will discontinue low-volume, high-mix integrated circuits in as little as two years because, by then, there is little or no profit margin left; but the DoD requires an assured supply chain for its systems for 20 years or more.  Working alongside industry, DMEA has created a model partnership that provides this capability for the DoD.  DMEA’s unique flexible foundry supports the DoD with a wide variety of integrated circuits using various processes that were developed by commercial manufacturers and which are now assured to remain in one location for as long as they are needed.  To obtain these processes, DMEA works closely with U.S. semiconductor industry partners to acquire process licenses.  These Government-held licenses allow for the transfer to DMEA of industry-developed intellectual property (IP) and the related processes for DoD needs.  These licenses ensure no commercial conflicts by including industry’s first right of refusal.  DMEA always looks to industry first to see if it can provide the required components.  If not, only then does DMEA provide the necessary prototypes and low volume production.  A critical element required to make this business model work effectively is protection of the industry partners’ valuable IP and processes.  DMEA is Government owned and operated, providing the structure and confidence that an industry partner’s IP is protected from potential competitors.  This strategic and cooperative industry partnership approach allows DMEA to use industry-developed IP and processes by acquiring, installing, and applying them toward meeting the immediate and long-term needs of the DoD. This unique capability is essential to all major weapon systems, combat operations, and support needs.  As such, DMEA serves the DoD, other US Agencies, industry and Allied nations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.157"
                },
                "CurrentYear": {
                    "val": "91.132"
                },
                "BudgetYearOne": {
                    "val": "81.651"
                },
                "BudgetYearOneBase": {
                    "val": "81.651"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.484"
                },
                "CurrentYear": {
                    "val": "59.895"
                },
                "BudgetYearOne": {
                    "val": "72.234"
                },
                "BudgetYearOneBase": {
                    "val": "72.234"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.673"
                },
                "CurrentYear": {
                    "val": "-31.237"
                },
                "BudgetYearOne": {
                    "val": "-9.417"
                },
                "BudgetYearOneBase": {
                    "val": "-9.417"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-30.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.279"
                    },
                    "CurrentYear": {
                        "val": "-1.075"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.013"
                                },
                                "CurrentYear": {
                                    "val": "-0.162"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.137"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civilian Pay Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.229"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.322"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.322"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Efficiency Initiatives SSC Reduction (OSD Withhold)"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.015"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "EA-08 Non-Pay, Non-Fuel Purchase Inflation"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.905"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.905"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "ASD (R&E) Directed S&T Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-10.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013 Enhancements 90nm Next Generation Foundry Program: $20.000M\n\nThe increase to the FY 2013-2017 Research, Development, Test and Evaluation (RDT&E) budget for PE0603720S is due to a newly-approved Program issue, the 90nm Next Generation Foundry Program, which is fully funded with offsets from ASD(R&E) programs.\n\nFY2012 FFRDC(f) Reduction: -$0.162 million\n\nFY2012 SBIR\/STTR Transfer (Reduction): -$1.075 million\n\n\nFY2013 Departmental Fiscal Guidance: $0.583 million\n\n\nFY2013 ASD (R&E) S&T Directed Reduction (Taken from 90nm Next Generation Foundry Program): -$10.000 million"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.484"
                        },
                        "CurrentYear": {
                            "val": "26.291"
                        },
                        "BudgetYearOne": {
                            "val": "27.415"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.415"
                        },
                        "BudgetYearTwo": {
                            "val": "27.844"
                        },
                        "BudgetYearThree": {
                            "val": "28.171"
                        },
                        "BudgetYearFour": {
                            "val": "28.463"
                        },
                        "BudgetYearFive": {
                            "val": "29.116"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Microelectronics Technology Development and Support funds provide the resources to design, develop, and demonstrate microelectronics concepts, technologies and applications to extend the life of weapon systems and solve operational problems (e.g., reliability, maintainability, performance, and assured supply).  This includes researching current and emerging microelectronics issues with a focus on warfighters’ needs and providing for the development and long-term support structure necessary to ensure rapid prototyping, insertion, and support of microelectronics technologies into fielded systems, particularly as the technologies advance.  DMEA maintains critical microelectronics design and fabrication skills to ensure that the DoD is provided with systems capable of ensuring technological superiority over potential adversaries.  These funds provide an in-house technical staff of skilled and experienced microelectronics personnel working in state-of-the-practice facilities providing technical and application engineering support for the implementation of advanced microelectronics research technologies from reverse engineering through design, fabrication, test, assembly, integration and installation.  DMEA provides an in-house capability to support these strategically important microelectronics technologies within the DoD with distinctive resources to meet DoD’s requirements across the entire spectrum of technology development, acquisition, and long-term support.  This includes producing components to meet the DoD’s requirements for ultra-low volume, an extended availability timeframe, and a trusted, assured, and secure supply of microelectronics.  DMEA’s capabilities make it a key resource in the intelligent and rapid application of advanced technologies to add needed performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems.  DMEA will comply with DoD Strategic Objective 3.5-2D for any demonstration programs at DMEA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Development Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.484"
                                            },
                                            "Text": {
                                                "val": "DMEA designed, developed, and demonstrated microelectronics concepts, advanced technologies, and applications to solve operational problems.  DMEA applied advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems.  DMEA accredited trusted sources and the ARMS foundry provided a contingency means to ensure DoD can acquire critical trusted integrated circuits in a variety of process technologies and geometry node-sizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.291"
                                            },
                                            "Text": {
                                                "val": "DMEA will continue to design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems.  DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.415"
                                            },
                                            "Text": {
                                                "val": "DMEA will continue to design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems.  DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "90nm Next Generation Foundry"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.000"
                        },
                        "BudgetYearThree": {
                            "val": "20.000"
                        },
                        "BudgetYearFour": {
                            "val": "15.000"
                        },
                        "BudgetYearFive": {
                            "val": "15.327"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) requires the ability to develop semiconductor technologies down to 90 nanometer (nm) node sizes with the Defense Microelectronics Activity (DMEA) low-volume production-capable foundry capability.  This is a critical, time-sensitive requirement to support the DoD's strategy to provide an assured (always available) and trusted source of integrated circuits for critical weapon systems, sensors, and specialized electronic equipment.  The capability enhancement to DMEA’s existing microelectronics foundry will cover a multitude of feature sizes down to 90nm and will be the only assured supply in the world to satisfy critical DOD and US Government program issues for the foreseeable future.\n\nMarket demand for more advanced technology drives the need to make microelectronics with more capabilities in smaller sizes.  The way this size is measured is called “node size”.  In addition to utilizing various processes, industry constantly develops newer processes with ever smaller node sizes.  The pace of this progress follows what is known as “Moore's Law”: the transistor density of integrated circuits doubles every two years.\n\nMost domestic semiconductor foundries will discontinue low-volume, high-mix integrated circuits in as little as two years because there is little or no profit margin left.  90nm is a key node size for defense applications but industry forecasts show that the commercial industry will substantially decrease the production of 90nm chips by 2014, thereby making acquisition of this essential technology extremely difficult or impossible in the future.  To keep 90nm technology available, DMEA must immediately begin to extend its current capability to 90nm to allow sufficient time to buy equipment, get the processes in place, transfer IP, etc., and ensure the DoD’s ability to use this technology by then.  This will also allow DMEA to purchase used equipment at extremely low prices from commercial sources that are closing or have already closed their 90nm process lines.  Without enhancing the existing foundry at DMEA to 90nm, in four years the DoD will be without a trusted and assured source for repeatable procurement of the state-of-the-practice integrated circuits that comprise a vast majority of the U.S. arsenal’s microelectronics.  This, in turn, will severely impact real-world operations.  In the meantime, if a Trusted Supplier is available to make a requested component, DMEA will utilize that source of supply first.  This enhancement of DMEA capabilities is absolutely necessary to provide assured and secure microelectronics design and fabrication for trusted microelectronics systems and semiconductor components to ensure DOD technological superiority over potential adversaries.\n\nThe current DMEA foundry capability will accommodate node sizes down to 180nm.  Due to physical limitations in the current DMEA lithography and fabrication equipment, the state-of-the-practice processes down to 90nm that need to be incorporated require an expansion in equipment and facilities to handle the smaller node sizes as well as the larger silicon wafers.  This Project will fund expenses associated with planning and implementing the 90nm capability.  Initial costs will include design and trade studies, costs associated with implementing force protection standards, floor plan layout and planning activities. Further, it will fund the outfitting of the selected property with the required force protection standards, infrastructure, tenant improvements, furniture, and equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DMEA 90nm Next Generation Foundry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N \/ A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N \/ A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "DMEA will install the acquired equipment, acquire additional equipment and begin its installation, acquire process licenses for process technologies specific to the new facility, begin to process test wafer and initialization lots."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Trusted Foundry"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "33.604"
                        },
                        "BudgetYearOne": {
                            "val": "34.819"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.819"
                        },
                        "BudgetYearTwo": {
                            "val": "35.326"
                        },
                        "BudgetYearThree": {
                            "val": "35.753"
                        },
                        "BudgetYearFour": {
                            "val": "36.779"
                        },
                        "BudgetYearFive": {
                            "val": "37.578"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) and National Security Agency (NSA) require uninterruptible access to state-of-the-art design and manufacturing processes to produce custom integrated circuits designed specifically for military purposes.  Under DODI 5200.39, Application Specific Integrated Circuits (ASICs) in critical\/essential systems need to be procured from trusted sources in order to avoid counterfeit, tampered, or sabotaged parts.  Worldwide competition from foreign, state-subsidized manufacturing facilities (foundries) is making fabless semiconductor companies the norm in the U.S.  Sophisticated off-shore design and manufacturing facilities with economic incentives of state subsidies and engineering labor rates vastly less than engineering rates in the U.S. have resulted in outsourcing of electronics components and integrated circuits.  These trends threaten the integrity and worldwide leadership of the U.S. semiconductor industry by eliminating many domestic on-shore suppliers and reducing access to trusted fabrication sources for advanced technology.  These trends are of acute concern to the defense and intelligence community.  Secure communications and cryptographic applications depend heavily upon high performance semiconductors where a generation of improvement can translate into a significant force multiplier and capability advantage.  Important defense technology investments and demonstrations carry size, weight, power, and performance goals that can only be met through the use of the most sophisticated semiconductors.\n\nThe Trusted Foundry program provides DoD and NSA with trusted state-of-the-art microelectronics design and manufacturing capabilities necessary to meet the performance and delivery needs of their customers.  The program will also provide the Services with a competitive cadre of trusted suppliers that will meet the needs of their mission critical\/essential systems for trusted integrated circuit components.  NSA, in their role as the Trusted Access Program Office, has successfully looked to commercial sources to satisfy their requirements.  Access to trusted suppliers is imperative to ongoing and future DoD\/NSA systems, and most centrally, Trusted Foundry access is absolutely necessary to meet secure communication and cryptographic needs for state-of-the-art semiconductor technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trusted Foundry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The Trusted Foundry project was not assigned to DMEA in FY 2011.  Under OSD PE 0605140D8Z, the program performed the following:  Established a cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems.  Enhanced Trusted Foundry products to include key specialty processes requested by DoD programs, such as high voltage, extreme environments, and embedded non-volatile memory.  Enhanced trusted design activities to encompass new processing capabilities.  The program was funded in FY 2011 at $34.512M."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.604"
                                            },
                                            "Text": {
                                                "val": "Begin to develop a capability for the reverse engineering of application-specific integrated circuits (ASICs) and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes.  Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems.  Enhance Trusted Foundry products to include key specialty processes requested by DoD programs, such as high voltage, extreme environments, and embedded non-volatile memory.  Enhance trusted design activities to encompass new processing capabilities.  Establish a line of trusted catalog components that can be purchased by Defense contractors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.819"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.819"
                                            },
                                            "Text": {
                                                "val": "Award a new contract to provide Trusted access to state-of-the-art microelectronics technologies for DoD and NSA needs.  Continue the development of a capability for the reverse engineering of application-specific integrated circuits (ASICs) and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes.  Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems.  Enhance Trusted Foundry products to include key specialty processes requested by DoD programs, such as high voltage, extreme environments, and embedded non-volatile memory.  Enhance trusted design activities to encompass new processing capabilities.  Expand a line of trusted catalog components that can be purchased by Defense contractors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}