{
    "id": "6ee6283454df3ee9ecdb3608310c104dc3a884ad",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DISA_JustificationBook_Defense_Information_Systems_Agency_PB_2013.zzz_unzipped_JustificationBook_Defense_Information_Systems_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208045K"
        },
        "ProgramElementTitle": {
            "val": "C4I Interoperability"
        },
        "R1LineItemNumber": {
            "val": "192"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "71.459"
            },
            "CurrentYear": {
                "val": "72.403"
            },
            "BudgetYearOne": {
                "val": "72.574"
            },
            "BudgetYearOneBase": {
                "val": "72.574"
            },
            "BudgetYearTwo": {
                "val": "73.597"
            },
            "BudgetYearThree": {
                "val": "73.533"
            },
            "BudgetYearFour": {
                "val": "73.824"
            },
            "BudgetYearFive": {
                "val": "74.215"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Information Systems Agency (DISA) Major Range and Test Facility Base (MRTFB) includes over 1,084 military, civilian, and contractor personnel and nearly 140,274 square feet of Command, Control, Communications, Computing and Intelligence (C4I)\/Global Information Grid (GIG) testing laboratories.   Under DISA’s Test and Evaluation (T&E) Executive, the Joint Interoperability Test Command (JITC) serves as the only joint element of the Department of Defense’s (DoD’s) MRTFB, which is a national asset that is sized, operated, and maintained primarily for DoD test and evaluation support missions.  \n\nJITC is the sole interoperability certifier for all Information Technology\/National Security Systems (IT\/NSS) for DoD.  Additional core missions include testing of DoD terrestrial, space, and tactical communications capabilities, supporting warfighters on technical IT\/NSS issues, and assisting Combatant Command to Coalition partner interoperability.  JITC, as the only Joint Operational Test Agency (OTA), plans and conducts operational tests and evaluations (OT&E) for DISA, the National Security Agency (NSA), Defense Intelligence Agency (DIA), military services, and other DoD agencies.  JITC supports agile acquisition and rapid fielding of net-centric capabilities by improving test, evaluation, and certification (TE&C) processes and gaining efficiencies, investigating innovative methodologies and tools, and continuously enhancing the posture of the T&E infrastructure for its customers.  \n\nIn FY 2013, to ensure its relevancy to DoD and the warfighter community, JITC will continue to manage and maintain its current capability base to provide efficient, responsive TE&C services, as well as continue to: \n \n• Integrate evolving web-based, cloud and virtual information technology capabilities and designing, implementing and maintaining the Net-Ready Key Performance Parameters (NR-KPP) as part of the core DoD interoperability certification process.  These serve as pillars to the TE&C methodology and use operationally realistic test concepts which reduce risk and offer efficiencies across the DoD Enterprise. \n•  Expand test infrastructure and operations to allow for rapid, on-demand provisioning, federation across the DoD and integration with enterprise environments by implementing cloud and virtualized computing concepts in support of Joint\/Coalition and Service unique certifications at minimum cost.\n• Coordinate and manage functional area products required for Joint T&E of Intelligence, Warfighting, and Business capabilities supporting Joint and Coalition warfighting efficiencies and effectiveness.\n• Provide consistent, repeatable test methodologies that ensure DISA and other DoD Service\/Agency acquired capabilities are operationally effective, suitable, and secure; certifying Joint Warfighter systems are interoperable with each other.\n• Provide T&E guidance\/oversight to nearly 130 DISA programs, creating synergy and efficiencies across the large IT portfolio within DISA, gaining insight in new technologies and commercial best practices. \n• Operate, manage, and maintain DISA’s state-of-the-art test infrastructure and facility to ensure the DISA and JITC missions are executed, while optimizing support to their Service\/Agency\/Coalition customers. \n• Evolve IT test policies and processes to proactively support the DoD’s migration towards more agile development and acquisition of IT\/NSS capabilities in support of Section 804 Acquisition Reform.  \n•  Implement Design of Experiments (DOE) and Science-Based Test Design (SBTD) approaches, concepts, and strategies in T&E methodologies to support the Director, Operational Testing and Evaluation and the Under Assistant Secretary of Defense for Developmental T&E guidance to increase the emphasis on scientific test design and statistical rigor in T&E."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "74.023"
                },
                "CurrentYear": {
                    "val": "72.403"
                },
                "BudgetYearOne": {
                    "val": "72.153"
                },
                "BudgetYearOneBase": {
                    "val": "72.153"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "71.459"
                },
                "CurrentYear": {
                    "val": "72.403"
                },
                "BudgetYearOne": {
                    "val": "72.574"
                },
                "BudgetYearOneBase": {
                    "val": "72.574"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.564"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.421"
                },
                "BudgetYearOneBase": {
                    "val": "0.421"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.564"
                                },
                                "BudgetYearOne": {
                                    "val": "0.421"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.421"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2011 decrease of -$2.564 was realigned to support higher agency priorities. \n\nThe FY 2013  increase of +$0.421 is the result of an internal Agency re-allocation for the reduction in contracting services to support the SECDEF initiative on improving DoD operations and adjustment for inflation in FY13."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T30"
                    },
                    "ProjectTitle": {
                        "val": "Test and Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.768"
                        },
                        "CurrentYear": {
                            "val": "16.540"
                        },
                        "BudgetYearOne": {
                            "val": "16.226"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.226"
                        },
                        "BudgetYearTwo": {
                            "val": "15.067"
                        },
                        "BudgetYearThree": {
                            "val": "15.128"
                        },
                        "BudgetYearFour": {
                            "val": "15.256"
                        },
                        "BudgetYearFive": {
                            "val": "15.284"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Interoperability Test Command (JITC), as the only Joint Operational Test Agency, conducts Operational Test and Evaluations (OT&E) to determine the operational effectiveness, suitability, interoperability, and survivability of systems.  As the sole DoD joint interoperability test certification authority, the JITC conducts lifecycle testing, evaluation, and certification (TE&C) of the DoD National Information Technology\/National Security Systems (IT\/NSS) that are acquired, assigned, or managed by the Defense Information Systems Agency (DISA), Military Services and other Agencies.  \n\n•  Provides direct interoperability support to Combatant Commanders during exercises and contingency operations to ensure joint interoperability throughout the lifecycle of DoD IT\/NSS, and ensures successful combined operations with Allies and Coalition partners.  Provides funding for direct test support to Combatant Command (COCOM) operations in theater; as well as technical 24x7 Warfighter Command, Control, Communications, Computing and Intelligence (C4I) Hotline support to the COCOMs and Services.\n•  Conducts five annual distributed Joint Tactical Data Link hardware-in-the-loop interoperability test events to evaluate Service and Agency warfighting capabilities.  \n•  Plans, conducts, analyzes and reports for three annual DoD Interoperability Communications Exercises (DICE) which provide a distributed Joint Task Force (JTF) network to support agile, responsive, and efficient testing and rapid deployment of Joint Warfighting communications capabilities.  \n•  Provides a sustaining capability to support engineering, development, and operational evaluation of current and future IT\/NSS.  Ensures the success of DoD's Global Information Grid (GIG)-enabling programs throughout their entire lifecycle.  These capabilities are available to the DoD community to verify their own net-centric C4I warfighting capabilities.\n•  Support the warfighter with enterprise messaging test and evaluation (T&E) of Navy strategic and tactical systems by verifying the ability of systems to interoperate in a joint environment through the conduct of interoperability and functional assessments, independent verification and validation testing, requirements review, pre-test planning, data collection and analysis, and post-test reporting.  \n•  Develops, implements, and maintains the Major Range and Test Facility Base’s (MRTFB’s) interoperability testing tools to provide DoD with a Center of Excellence for testing Joint Warfighting capabilities in a realistic operational environment.  As an MRTFB facility, these capabilities and mission are considered a national asset."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.360"
                                            },
                                            "Text": {
                                                "val": "JITC conducted operational test and evaluations of GIG-enabling capabilities and of DISA IT\/NSS acquisition Programs of Record (PoRs) to determine if the systems met user requirements and to support capability fielding decisions.  Also provided operational test and evaluation support to Combatant Commanders, Services Components, and DoD Agencies including the National Security Agency (NSA), Defense Logistics Agency (DLA), and Business Transformation Agency (BTA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.360"
                                            },
                                            "Text": {
                                                "val": "Efforts focus on improving core capabilities, OT&E policy, operational evaluation, and centralized data management.  OT&E policy defines processes and procedures, and provides OT&E-specific training to test action officers.  Operational evaluators ensure adherence of policy to test programs, consistent development of integrated evaluation strategies and mission-based analysis structures, application of agile test methodologies, and application of statistical rigor to data collection and analysis.  Data management provides a persistent suite of automated data management tools and support personnel to provide data collection, storage, authentication, trouble reporting, and analysis of test data.  Implementing these core capabilities ensures consistency and commonality across test programs, enabling sharing of test results for acquisition decisions, shortening test reporting cycles, and reducing duplicative test efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.334"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.334"
                                            },
                                            "Text": {
                                                "val": "JITC will conduct operational test and evaluations of GIG-enabling capabilities and DISA IT\/NSS acquisition PoRs to determine system's operational effectiveness, suitability, security, and interoperability.  This information informs decision makers in support of acquisition fielding decisions.  JITC will also provide operational test and evaluation support to Combatant Commanders, Services Components, and DoD Agencies.  Efforts will continue to focus on improving core capabilities, OT&E policy, operational evaluation, centralized data management, and agile test methodologies. \n \nThe decrease of -$0.026 in funding between FY 2012 and FY 2013 is the result of an internal Agency re-allocation of the reduction in contracting services to support the SECDEF initiative on improving DoD operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Interoperability Testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.268"
                                            },
                                            "Text": {
                                                "val": "JITC conducted several interoperability test events to support agile, responsive, and efficient testing and rapid deployment of Joint Warfighting communications capabilities.  JITC provided test related services for Acquisition Category (ACAT) I programs and issued interoperability testing and certification related products.  JITC supported other Joint Staff initiatives, such as the review of Test Exemption, Information Support Plan (ISP), and Legacy Waiver requests and processed Interim Certificate to Operate (ICTO) requests for the Military Communications Electronics Board (MCEB) Interoperability Test Panel (ITP).  Focus was more on evaluation of systems at the enterprise level in a net-centric environment, which required JITC to test in a distributed manner using dedicated test networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.155"
                                            },
                                            "Text": {
                                                "val": "JITC is conducting and participating in test activities involving a wide range of DoD systems.  JITC is providing test related services for ACAT I programs and issuing interoperability testing and certification related products.  JITC is also supporting other Joint Staff initiatives, such as the review of Test Exemption, ISP, and Legacy Waiver requests and processing ICTO requests for the MCEB ITP.  \n\nThe increase of +$4.887 in funding between FY 2011 and FY 2012 is due to reallocation of FY11 funds to higher agency priorities and the effect of FY11 decreases from execution of funds planned as Project: T30 (Direct)  in Project: T40 (Institutional)  to accommodate civpay adjustments and urgent infrastructure requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.924"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.924"
                                            },
                                            "Text": {
                                                "val": "To advance our existing interoperability certification process, JITC will bring more operational realism to our joint testing services by introducing various mission threads from real life contingencies.  Further, as the entire DoD IT systems and capabilities are developed at the enterprise level, JITC will conduct more assessments at that level, requiring more complex tools and employing more virtualization capabilities.  JITC will strengthen its ability to conduct distributed testing using complex tools and real life scenarios and continue to evolve its test policies and processes to proactively support the DoD’s migration towards more agile development and acquisition of IT capabilities.  \n\nThe decrease of -$0.231 in funding between FY 2012 and FY 2013 is the result of an internal Agency re-allocation of the reduction in contracting services to support the SECDEF initiative on improving DoD operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support to Warfighter"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.140"
                                            },
                                            "Text": {
                                                "val": "JITC responded to Hotline calls from across the DoD and other federal agencies, supported Command and Control Interoperability Boards (CCIBs), COCOM sponsored exercises, contingency operations, Combined Interoperability Tests (CITs), North Atlantic Treaty Organization (NATO) tactical data link tests, and provided on-site liaison officer support to the COCOMs.  In addition, JITC participated in Afghanistan Mission Network (AMN) development, Coalition Network migration, and United States\/Coalition communications equipment testing to ensure successful combined operations with our Allies and Coalition partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.025"
                                            },
                                            "Text": {
                                                "val": "JITC continues to respond to Hotline calls from across the DoD and other federal agencies, support  CCIBs, COCOM sponsored exercises, contingency operations, CITs, NATO tactical data link tests, and provide on-site liaison officer support to the COCOMs.  JITC is participating in AMN development, Coalition Network migration, and United States\/Coalition communications equipment testing to ensure successful combined operations with our Allies and Coalition partners. \n\nThe increase of +$1.885 in funding between FY 2011 and FY 2012 is the result of FY11 decreases from execution of funds planned as Project: T30 (Direct)  in Project: T40 (Institutional)  to accommodate civpay adjustments and urgent infrastructure requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.968"
                                            },
                                            "Text": {
                                                "val": "JITC will continue to provide unparalleled support to the warfighter while aggressively accelerating its engagement programs.  These programs will include on-demand rapid response contingency support to Regional COCOMs, enhanced assessment support for the three largest COCOM interoperability exercises across Europe, Africa, and the Pacific, and final development and deployment of the Global Communications Interoperability Program, a cloud-based service that will revolutionize coalition C4 planning.  JITC will continue to improve the velocity at which Hotline requests are successfully resolved in support of customers across the DoD and other federal agencies.  JITC will broaden its support to the Joint Staff and functional COCOMs with a multitude of new value-added consultation and interoperability assessment services providing support across the entire interoperability spectrum.\n\nThe decrease of -$0.057 in funding between FY 2012 and FY 2013 is the result of an internal Agency re-allocation of the reduction in contracting services to support the SECDEF initiative on improving DoD operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Three prime contracts, with multiple sub-contracts, support this project.  These competitively-awarded, non-personal services contracts provide maximum flexibility and allow for expansion and contraction of staff years as workload expands and contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance is tracked through measures of support to the warfighter\/acquisition communities.  In FY 2011, JITC responded to nearly 300 Hotline calls from across the DoD, other federal agencies and commercial sector.  JITC participated in ten CCIBs; one COCOM sponsored exercise, three contingency operations, two CITs, two NATO tactical data link tests, and provided two on-site liaison officers who supported four COCOMs.  JITC conducted three DICE events, in which annual participation included over 14 systems\/capabilities and resulted in approximately nine system\/capability assessments or certifications and four support, training and technology demonstrations.  JITC supported 676 test activities involving over 576 DoD systems and 84 ACAT I programs.  JITC issued over 567 interoperability testing and certification related products.  In addition, JITC supported other Joint Staff initiatives, such as the review of over 108 Test Exemption, ISP, and Legacy Waiver requests.  JITC also processed approximately 187 ICTO requests for the MCEB ITP.  Planned success metrics include:  published test methodologies are timely, accurate, readily available, and support the needs of T&E and Program Executive Office (PEO) communities; percentage of test events that are completed with a reduced cycle time while meeting technical rigor requirements; percentage of resolved Hotline calls that meet the warfighters’ technical and timeliness requirements; and percentage of positive responses from customers in terms of cost, schedule, and performance."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman Mission System"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.271"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.271"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.271"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Interop Joint Venture"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "40.754"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "40.754"
                                                    },
                                                    "TargetValue": {
                                                        "val": "40.754"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman Information Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.371"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "24.371"
                                                    },
                                                    "TargetValue": {
                                                        "val": "24.371"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.007"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.007"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Information Systems Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.029"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.390"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.219"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.219"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Provide Operational Test & Evaluation (OT&E) of DISA acquired systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct joint interoperability test and certification on DoD C4I systems using the Joint Family of Tactical Data Links (TDL)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Plan and conduct the Defense Interoperability Communications Exercise (DICE)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Navy Message Legacy Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Navy Tactical Message Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operate 24\/7 Interoperability Hotline & Publish quarterly Lessons Learned reports"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Provide Joint\/Combined Interoperability Test support to Combatant Commanders"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "Major Range Test Facility Base"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "61.691"
                        },
                        "CurrentYear": {
                            "val": "55.863"
                        },
                        "BudgetYearOne": {
                            "val": "56.348"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.348"
                        },
                        "BudgetYearTwo": {
                            "val": "58.530"
                        },
                        "BudgetYearThree": {
                            "val": "58.405"
                        },
                        "BudgetYearFour": {
                            "val": "58.568"
                        },
                        "BudgetYearFive": {
                            "val": "58.931"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Provides institutional funds for the Defense Information Systems Agency’s (DISA’s) Joint Interoperability Test Command (JITC).  JITC serves as the only joint element of the Department of Defense’s (DoD’s) Major Range and Test Facility Base (MRTFB), which is a national asset that is sized, operated, and maintained primarily for DoD test and evaluation support missions.  As an MRTFB facility, JITC’s global reach extends to the entire spectrum of the DoD, Federal government, private industry, and allies in support of command and control, intelligence, and defense reform initiatives.  This includes commercial entities, which allows JITC to coordinate directly with vendors to obtain critical pre-acquisition test results.  This early involvement enables rapid delivery of enhanced military capabilities at lower cost.\n\n•  Fully enables JITC mission capability, thus making DISA capable of executing its Information Technology\/National Security System (IT\/NSS) interoperability test and evaluation (T&E) mission mandated in the Chairman of the Joint Chief of Staff Instruction (CJCSI) 6212 and DoD policies.  \n•  Provides the necessary test capabilities and facilities infrastructure, process tracking and reporting systems, as well as hardware and software maintenance to enable direct test support to DoD’s major IT\/NSS acquisitions (e.g., Net-centric core services, Defense Readiness Reporting System (DRRS), B-52 Combat Network Communications Technology (CONECT), Global Combat Support System (GCSS), etc.) as well as Joint Tactical Data Links (TDL), command and control, global, terrestrial, satellite and tactical communications systems, evolving to hand held and wireless technologies.  Supports DISA’s mandated mission to serve as an MRTFB by providing for and maintaining the DISA\/JITC IT infrastructure.  The environments and test tool enhancements allow testing efforts to keep pace with the rapid change in technology and improve the testing methodologies and timelines for DoD IT\/NSS acquisitions.\n•  From an IT\/NSS perspective, DISA acquisition and the T&E support coupled with infrastructure of the Global Information Grid (GIG) serve as the DoD's corollary information technology capability.  \n•  Includes working with industry consortiums on best practices, investing in process based modeling and simulation, evolving standards based frameworks to support testing and analysis as a service, and evolving and virtualizing the laboratories to meet future technology changes and enhancements in hardware and testing software with an emphasis on unified communications requirements, and interactive web enabled capabilities.  \n•  Enables the DISA MRTFB to continue implementing Net Readiness Capabilities Resources (NRCR), which provide DoD with a lifecycle support capability for DoD’s tactical and strategic networks and their interfaces, as well as build communications and test environments for the current and future Converged Real-time Internet Protocol (IP) Services for voice, data and video, Software as a Service (SaaS), NCES, and core services in preparation to conduct agile, on-demand test services for the department.\n•  Continues efforts to provision a Joint Test and Evaluation network through the convergence of current test networks that meets the infrastructure requirements to support the entire spectrum of DoD acquisition process life cycle needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Test Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "61.691"
                                            },
                                            "Text": {
                                                "val": "Funds were used for civilian pay costs for the Test and Evaluation Executive and JITC operations, DISA MRTFB institutional efforts, as well as the development of virtual communications capabilities; TestForge.mil capability development; T&E infrastructure support to sustain DISA programs across the GIG; establish Defense Research and Engineering Network (DREN) connections to support testing globally; enhanced laboratory upgrades; and to develop, implement, and maintain the MRTFB’s enterprise testing tools necessary to provide DoD with a Center of Excellence for testing of net-centric systems in a realistic operational environment.  Laboratory and testing software enhancements allowed testing efforts to keep pace with the rapid change in technology.  This initiative requires, at a minimum, refreshing on a periodic basis (approximately every two years).  Identified and acquired a power management system to support the Federal Data Center Consolidation Initiative (FDCCI) resulting in a 20 percent non-peak hour power reduction.  These initiatives improved the infrastructure and created efficiencies through the use of virtual and federated concepts to provide optimal flexibility in a dynamic IT laboratory environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.863"
                                            },
                                            "Text": {
                                                "val": "Maintain and operate base operations, multi-purpose testbed infrastructures, contract management, award fee costs, communications, automation support, operating expenses, T&E standards, policies, and procedures.  Fund the associated civilian pay costs for all functions at Indian Head, MD, Fort Huachuca, AZ, and Fort George G. Meade, MD, as well as maintain the virtual communications capability and enhanced laboratory upgrades.  Develop, implement, and maintain the MRTFB’s enterprise testing tools necessary to provide DoD with a Center of Excellence for testing of net-centric systems in a realistic operational environment.  Continue to enhance laboratory and testing software to keep pace with the rapid changes in technology.\n\nThe decrease of -$5.828 between FY 2011 and FY 2012 is the effect of FY11 decreases resulting from execution of funds planned as Project: T30 (Direct) in Project: T40 (Institutional) to accommodate civpay adjustments and urgent infrastructure requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.348"
                                            },
                                            "Text": {
                                                "val": "JITC will continue to emulate IT\/NSS operational infrastructures in its test facilities, ensuring interoperability issues around the globe can be reconstructed and addressed remotely and enhance its laboratory and testing hardware and software to keep pace with the rapid changes in technology.  The Command will continue to: maintain and operate base operations, communications, automation support, operating expenses, T&E standards, policies and procedures; fund the associated civilian pay costs for all functions at Indian Head, MD, Fort Huachuca, AZ, and Fort George G. Meade, MD.  JITC will continue to maintenance of virtual communications capabilities and enhanced laboratory upgrades; develop, implement, and maintain the MRTFB’s enterprise testing tools necessary to provide DoD with a Center of Excellence for testing of net-centric systems in a realistic operational environment.  \n\nThe increase of +$0.485 from FY 2012 to FY 2013 is the result of the aggregate effect of an internal Agency re-allocation of the reduction in contracting services to support the SECDEF initiative on improving DoD operations and adjustment for inflation in FY13."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Three prime contracts, with multiple sub-contracts, support this project.  These competitively-awarded, non-personal services contracts provide maximum flexibility and allow for expansion and contraction of staff years as workload expands and contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "The ability to meet DoD’s joint warfighting capabilities test and evaluation requirements, thus meeting the Department’s mission requirements of fielding interoperable joint warfighting capabilities. Ability to operate and maintain the MRTFB supported by 1,084 military, civilians, and contractor personnel, and nearly 140,274 square feet of C4I\/GIG testing laboratories in the development of standard T&E methods and practices, availability of testbeds, testing software enhancement and testing facilities for customer testing requirements while controlling indirect mission cost.  Planned success metrics: Percentage of time test and evaluation networks are available to support core mission areas."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman Mission System"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "63.927"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "63.927"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Interop Joint Venture"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "87.143"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "87.255"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman Information Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.329"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "44.329"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "34.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "34.659"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "34.659"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Information Systems Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.391"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.703"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.689"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.689"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Develop and Implement Interoperability test systems to support warfighters"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}