{
    "id": "708e34a067ee75e5866517abd06b3e0e9c05e2db",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605790D8Z"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovation Research (SBIR)\/Small Business Technology Transfer (STTR) Administration"
        },
        "R1LineItemNumber": {
            "val": "159"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.116"
            },
            "CurrentYear": {
                "val": "1.854"
            },
            "BudgetYearOne": {
                "val": "1.857"
            },
            "BudgetYearOneBase": {
                "val": "1.857"
            },
            "BudgetYearTwo": {
                "val": "1.899"
            },
            "BudgetYearThree": {
                "val": "1.938"
            },
            "BudgetYearFour": {
                "val": "2.570"
            },
            "BudgetYearFive": {
                "val": "2.616"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "(U) This Program Element (PE) provides funding for the administration of the Department of Defense (DoD) Small Business Innovation Research (SBIR) Program and the Small Business Technology Transfer (STTR) Program.  The SBIR\/STTR Program funds over one billion dollars annually in mission oriented research and development projects at small technology companies. The purpose of the program is to stimulate technological innovation, increase private sector commercialization of Federal R&D, increase small business participation in Federally funded R&D, foster participation by minority and disadvantaged firms in technological innovation, and foster cooperative research & technology transfer between small business and research institutions. The SBIR\/STTR Program is codified in 15 USC 638. The SBIR\/STTR Program competitively funds scientific and technical innovation to specifically address the needs of participating DoD components.\n\n(U) DoD components participating in the SBIR Program include the: Army, Navy, Air Force, Defense Advanced Research Projects Agency (DARPA), Missile Defense Agency (MDA), Defense Threat Reduction Agency (DTRA), U.S. Special Operations Command (SOCOM), Joint Science & Technology Office for Chemical & Biological Defense (CBD), National Geospatial-Intelligence Agency (NGA), the Defense Logistics Agency (DLA), the Defense Microelectronics Activity (DMEA) and the Office of Secretary of Defense (OSD) through the Assistant Secretary of Defense for Research & Engineering. DoD components participating in the STTR Program include the: Army, Navy, Air Force, DARPA, MDA, and OSD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.189"
                },
                "CurrentYear": {
                    "val": "1.854"
                },
                "BudgetYearOne": {
                    "val": "1.880"
                },
                "BudgetYearOneBase": {
                    "val": "1.880"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.116"
                },
                "CurrentYear": {
                    "val": "1.854"
                },
                "BudgetYearOne": {
                    "val": "1.857"
                },
                "BudgetYearOneBase": {
                    "val": "1.857"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.073"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.023"
                },
                "BudgetYearOneBase": {
                    "val": "-0.023"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.019"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.054"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.023"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P518"
                    },
                    "ProjectTitle": {
                        "val": "SBIR\/Challenge Admin"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.116"
                        },
                        "CurrentYear": {
                            "val": "1.854"
                        },
                        "BudgetYearOne": {
                            "val": "1.857"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.857"
                        },
                        "BudgetYearTwo": {
                            "val": "1.899"
                        },
                        "BudgetYearThree": {
                            "val": "1.938"
                        },
                        "BudgetYearFour": {
                            "val": "2.570"
                        },
                        "BudgetYearFive": {
                            "val": "2.616"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) The SBIR\/STTR Program is executed in three phases. The purpose of Phase I is to determine, insofar as possible, the scientific technical and commercial merit, and feasibility of ideas submitted under the SBIR\/STTR Program. Phase II awards are made to firms that have been awarded a Phase I contract on the basis of the results of their Phase I effort and the scientific, technical, and commercial merit of the Phase II proposal. Phase II is the principal research or research and development effort and is expected to produce a well-defined deliverable prototype. Phase III SBIR\/STTR efforts derive from, extend or conclude Phase I or Phase II efforts, and are not funded with SBIR\/STTR funds. Under Phase III, companies participating in the SBIR\/STTR Program are expected to obtain funding from the private sector and\/or non-SBIR\/STTR government sources to develop the prototype into a viable product or non-R&D service for sale in military and\/or private sector markets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR\/Challenge Admin"
                                    },
                                    "Description": {
                                        "val": "(U) Public law mandating the SBIR\/STTR Programs prohibits the use of the SBIR\/STTR budget to fund administrative costs of the program, therefore program element (PE) 0605790D8Z is the only source of funds for the coordination, administration and execution of the Department's SBIR\/STTR Programs. In addition to funding costs for program administration, coordination and execution, PE 0605790D8Z funds essential elements of the SBIR\/STTR Program that are required by law including: (a) the development of technical topics, preparation SBIR\/STTR R&D solicitations, and receipt of proposal responses; (b) the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; (c) outreach to small technology companies, potential investors in such companies, SDBs WOSBs HBCU\/MIs and others, to facilitate participation in the SBIR\/STTR Programs; (d) oversight and reporting of Phase III technology transition in support of the DoD SBIR Commercialization Pilot Program (CPP)(section 252 of the NDAA for FY 2006); and (e) preparing reports required for the SBIR\/STTR Programs as mandated by law and policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.116"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2011 accomplishments included program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, managed the execution of the FY 2011 DoD SBIR\/STTR budget between 11 DoD Components to include:\n1) Coordinated and executed the administrative portions of the DoD SBIR\/STTR Programs - administered the online topic development tool, developed five SBIR\/STTR solicitations (including 697 technical topics), and received and distributed 11,885 SBIR\/STTR proposals;  \n2) Maintained and modified automated processes across the entire SBIR\/STTR lifecycle - maintained systems included topic development, proposal submission, company commercialization, awards, commercialization pilot program, and data exchange;\n3) Implemented an aggressive outreach program - developed and implemented outreach materials, hosted a three-day training workshop (over 350 attendees),  hosted a three-day Beyond Phase II Conference and Technology Showcase (over 400 attendees); maintained a help desk that responded to over 5,000 inquiries, maintained an online desk reference manual, administered an SBIR\/STTR Interactive Topic Information System (SITIS) responding to 1,664 questions, and maintained mailing lists (ListServ) targeting specific outreach groups; \n4) Coordinated oversight, collected results, tracked execution and reported on Phase III technology transition and the DoD SBIR Commercialization Pilot Program (CPP) (section 252 of the NDAA for FY 2006) - maintained database to document over $30B in commercialization activity and developed CPP Report for Congress; and \n5) Prepared all reports required for the SBIR\/STTR Programs as mandated by law and policy - Annual SBIR\/STTR Report, Energy Independence and Security Act Report, Nanotechnology Report, and Encouraging Innovation in Manufacturing Report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.854"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2012 plan includes program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, manage the execution of the FY 2012 DoD SBIR\/STTR budget between 11 DoD Components to include:\n1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs;  \n2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle; \n3) Implement an aggressive outreach program; \n4) Coordinate oversight, collect results, track execution and provide reporting of Phase III technology transition management and support of the DoD SBIR Commercialization Pilot Program (CPP) (section 252 of the NDAA for FY 2006); and \n5) Prepare all reports required of the SBIR\/STTR Programs as mandated by law and policy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.857"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.857"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2013 plan includes program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, manage the execution of the FY 2013 DoD SBIR\/STTR budget between 11 DoD Components to include:\n1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs;  \n2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle; \n3) Implement an aggressive outreach program; \n4) Coordinate oversight, collect results, track execution and provide reporting of Phase III technology transition management and support of the DoD SBIR Commercialization Pilot Program (CPP) (section 252 of the NDAA for FY 2006); and \n5) Prepare all reports required of the SBIR\/STTR Programs as mandated by law and policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "(U) Performance is in support of the administration of the program and compliance with statutory requirements.  \n\n(U) For PE 0605790D8Z, management and administration of the DoD SBIR\/STTR Programs, the following measures have been established to meet requirements as mandated by law:  1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs; 2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle; 3) Develop and conduct an aggressive outreach program; 4) Coordinate oversight, collect results, track execution and provide reporting of Phase III technology transition management and support of the DoD SBIR Commercialization Pilot Program (CPP) (section 252 of the NDAA for FY 2006); and 5) Prepare all reports required of the SBIR\/STTR Programs as mandated by law and policy."
                        }
                    }
                }
            ]
        }
    }
}