{
    "id": "70a8987b779c9d0a622f3c772681c9f7eeaf1c12",
    "meta": {
        "filename": "dod-2013_RDTE_2013_TJS_JustificationBook_The_Joint_Staff_PB_2013.zzz_unzipped_JustificationBook_The_Joint_Staff_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0607828J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integration & Interoperability"
        },
        "R1LineItemNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "5.013"
            },
            "BudgetYearOneBase": {
                "val": "5.013"
            },
            "BudgetYearTwo": {
                "val": "4.997"
            },
            "BudgetYearThree": {
                "val": "5.040"
            },
            "BudgetYearFour": {
                "val": "5.004"
            },
            "BudgetYearFive": {
                "val": "4.832"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0607828D8Z."
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integration & Interoperability (JI&I) Program Element underwrites the Department’s core joint Command and Control (C2) efforts for military needs development and validation, for development of associated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF), and for operational assessment of materiel solutions proposed and delivered by the Defense acquisition enterprise.  Funds from the JI&I Program are used to address joint capabilities including, but not limited to operational through tactical level joint integration of the following capabilities: Common Operational and Tactical Pictures; Combat Identification; Situational Awareness; Adaptive Mission Planning and Rehearsal; Interoperability among Service\/ Agency intelligence systems; Interoperable Joint Fires, Maneuver, and Intelligence; and Integrated Joint Battle Management Command and Control.  Activities funded by the JI&I Program aim to:\n\n- Identify, and\/or develop mission capable solutions for COCOM interoperability and integration capability shortfalls with emphasis on non-materiel elements;\n- Assess operational suitability and sufficiency of materiel solutions identified by the Defense acquisition enterprise in response to validated joint C2 needs;\n- Provide Combatant Commanders with interoperable combat identification and situational awareness capabilities among United States Interagencies, and Allied and Coalition Forces in support of Overseas Contingency Operations;\n- Develop joint requirements supporting C2-intensive joint missions such as Joint Close Air Support and Joint Fires;\n- Develop joint integrated architectures that guide service capability mapping to achieve joint interoperability; \n- Establish fundamental joint data standards and cross domain solutions to facilitate future system interoperability and integration; and,\n- Undertake other activities to resolve emergent operational and tactical needs associated with joint C2."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.013"
                },
                "BudgetYearOneBase": {
                    "val": "5.013"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.013"
                },
                "BudgetYearOneBase": {
                    "val": "5.013"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "PE transfer to the Joint Staff"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.013"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.013"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P818"
                    },
                    "ProjectTitle": {
                        "val": "Joint Integration & Interoperability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.013"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.013"
                        },
                        "BudgetYearTwo": {
                            "val": "4.997"
                        },
                        "BudgetYearThree": {
                            "val": "5.040"
                        },
                        "BudgetYearFour": {
                            "val": "5.004"
                        },
                        "BudgetYearFive": {
                            "val": "4.832"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0607828D8Z."
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Integration and Interoperability Program (JI&I) funds efforts to identify critical characteristics of joint military capabilities and synchronize Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) capability elements into a coherent package for employment by joint commanders.\n\nThe JI&I Program provide resources for a wide range of efforts to define, refine, and deploy integrated joint capabilities.  JI&I-funded endeavors aim to improve US and coalition capabilities to conduct coordinated operations.  Necessarily, JI&I-funded projects most frequently address Command & Control (C2) and Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) - the capstone capabilities for integrating disparate elements of military force for joint and coalition operations.  The JI&I Program supports tasks and projects associated with integration & interoperability of the C2 Portfolio including coordination of C2 operational architectures, standards, and policies. Likewise, JI&I partially funds integration and decision support activities associated with DOD executive level C4 management and oversight.  \n\nThe JI&I Program deliver outcomes conforming to joint integration missions:\n- In concert with the separately funded Joint Systems Integration Command (JSIC) and Joint Fires Integration Interoperability Team (JFIIT), JI&I resources investigate joint C2\/C4ISR shortfalls and ascertain characteristics of DOTMLPF remedies to meet mission requirements. The remedies are then pursued through partnerships with Component force development authorities and acquisition sponsors. \n- Consistent with the role as operational sponsor for joint C2, JI&I underwrites Joint Combat Capability Developer (JCCD) activities compiling operational requirements for C2\/C4ISR capability development and integrated testing. \n- Delivers assessment and recommendations for improvement of interoperable Combat Identification (CID) and Situational Awareness (SA) capabilities among United States forces, interagency organizations, and allied\/coalition forces;\n- Establishes joint data standards and cross domain solutions to facilitate future system interoperability and integration. Joint Integration and Interoperability Program (JI&I) funds efforts to identify critical characteristics of joint military capabilities and synchronize Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) capability elements into a coherent package for employment by joint commanders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Integration and Interoperability"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.013"
                                            },
                                            "Text": {
                                                "val": "Effort transfers to the Joint Staff in FY 2013."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "Interoperability and Integration:\n• Develop coordinated joint C4 operational assessments, tests and evaluations to identify, prioritize and document interoperability deficiencies that produce Component plans and actions to reduce or eliminate identified deficiencies\n• Provide mission capable solutions for joint interoperability and integration capability shortfalls to influence and resource joint C2 solutions in the POM\n\nJoint Fires:\n• Provide situational awareness and cooperative \/ non-cooperative identification capabilities that enable U.S., NATO \/ coalition warfighters to identify friendly, enemy and neutral forces for “shoot\/don’t shoot” decisions\n• Synchronize Service testing, acquisition and fielding of Mode 5 IFF capability, with an Initial Operating Capability (IOC) in 2014 and Full Operational Capability (FOC) in 2020\n• Complete Definition Package for Block 2 of Digitally Aided Close Air Support (DACAS) coordinated implementation in conjunction with participating Service programs of record\n• Conduct Accreditation Biennial Visits for 6 Joint Terminal Attack Controller (JTAC) and 2 Joint Fires Observer (JFO) Schoolhouses\n• Monitor compliance for Mode 5 IOC in FY14 and FOC in FY20 \n\nCombat Capability Development:\n• Develop annual JROC approved plan to identify prioritized and synchronized capabilities sufficient for near-term development and fielding to warfighters  (12-18 month delivery)\n• Develop annual assessment of POM impacts on GCCS Joint & Service Family of Systems ($350M+ annual portfolio) to determine mission impacts in the geographic AORs\n• Develop, as required, JROC requirements documentation (ICDs, CDDs, CPDs, CDPs, CONOPs, MOEs\/MOPs) sufficient for  agile\/flexible use by the acquisition community\n\nArchitectures:\n• Continue development of reusable architecture products to provide capability developers an upfront, operational\/systems view at the enterprise level to support of capability acquisition, requirements generation, development, and testing.\n\nData\n• Establish common C2 data and service standards and enables access to authoritative data assets in order to provide the warfighter timely access to critical information."
                        }
                    }
                }
            ]
        }
    }
}