{
    "id": "718aef866ff6cd7840a8e1ecde61123fde91863c",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605718A"
        },
        "ProgramElementTitle": {
            "val": "Army Modeling & Sim X-Cmd Collaboration & Integ"
        },
        "R1LineItemNumber": {
            "val": "152"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.787"
            },
            "CurrentYear": {
                "val": "3.415"
            },
            "BudgetYearOne": {
                "val": "1.545"
            },
            "BudgetYearOneBase": {
                "val": "1.545"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "1.283"
            },
            "BudgetYearThree": {
                "val": "1.555"
            },
            "BudgetYearFour": {
                "val": "1.510"
            },
            "BudgetYearFive": {
                "val": "1.638"
            }
        },
        "ProgramElementNote": {
            "val": "Funds realigned to higher priority requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "\"Army Modeling and Simulation Cross-Command Collaboration and Integration (M&SC3I)\" promotes the Army's goal to achieve affordable, interoperable and networked Modeling and Simulation (M&S) capabilities.  In support of Army operations, Generating-Force functions and institutional processes, M&S Cross-Command Collaboration and Integration addresses analytical efforts underlying decision making, capability development, and life-cycle costs by capitalizing on M&S technologies (accomplished through collaborative efforts of the training\/operations and acquisition communities).  The RDTE component of M&SC3I encompasses efforts that (1) develop\/improve new\/existing models and simulations to reduce time, resources and risks associated with operational\/institutional decision making and the acquisition process and (2) advance the following disciplines: M&S research, analysis and experimentation; simulation technology; and M&S tools and services.  M&SC3I applies to development of tactics and doctrine, experimentation and exercises, traditional weapon system development, and assessment and transition of advanced technologies to operational capabilities.  The overarching goal of M&SC3I is to reduce the time and cost of providing improved capabilities to the war fighter.  Emerging information-age technologies continue to revolutionize the Army's ability to collaborate among all stakeholders using data descriptions, digital representations, and virtual prototypes to improve understanding of required capabilities, shorten procurement time, reduce procurement and sustainment costs, and, ultimately, reduce total life-cycle cost.  M&SC3I advocates the use of advanced technologies to enable future capabilities through improved understanding of operational requirements, collaborative analyses of emerging technologies, and cross-domain participation in experiments and exercises.  The following are discussions of efforts under the three projects of PE 0605718.  Under the project \"HQDA Decision Support Tools and Services, HQDA and its agencies develop new analytical M&S tools and\/or obtain commercially available analytical M&S tools and services that provide rapid and reliable decision support to Army staff and field operating agencies assigned to Headquarters, Department of the Army. \" Under the project \"Analysis M&S Tools and Services\" the Army develops M&S tools and services (e.g., hardware, software, infrastructure) for the Army's analysis community.  The primary users of these tools and services are the Training and Doctrine Command Analysis Center (TRAC), the Army Materiel Systems Analysis Activity (AMSAA), and the Center for Army Analysis (CAA).  Efforts focus on (1) development of analysis tools that will enable assessment of emerging technologies during concept exploration and (2) development of infrastructure and enabling technologies to support the Current and Future Force.  These critical efforts are required for 1) analysis-of-futures work to justify Army requirements, 2) assessment of alternative approaches to satisfy those requirements, 3) development of current and emerging war fighting doctrine from the tactical to the operational levels of warfare and 4) the closing of closing capability gaps in the areas of irregular warfare, M&S data and standards, cyberspace operations, army network modeling, and non-lethal weapons.  Under the project \"Army Simulation Technology (SIMTECH),\" the Army enhances force effectiveness by inducing research organizations on a short-term basis to conduct high-priority, promising simulation research initiatives that are outside the scope of Small Business Innovative Research (SBIR) and Army Science and Technology (S&T) programs.  SIMTECH focuses simulation research initiatives on short-term Army needs and serves as a catalyst for technology breakthroughs in embedded simulation, rapid prototyping, commercial innovation and related simulation technology."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.926"
                },
                "CurrentYear": {
                    "val": "3.420"
                },
                "BudgetYearOne": {
                    "val": "3.499"
                },
                "BudgetYearOneBase": {
                    "val": "3.499"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.787"
                },
                "CurrentYear": {
                    "val": "3.415"
                },
                "BudgetYearOne": {
                    "val": "1.545"
                },
                "BudgetYearOneBase": {
                    "val": "1.545"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.139"
                },
                "CurrentYear": {
                    "val": "-0.005"
                },
                "BudgetYearOne": {
                    "val": "-1.954"
                },
                "BudgetYearOneBase": {
                    "val": "-1.954"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.116"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.954"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.954"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1,"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.023"
                                },
                                "CurrentYear": {
                                    "val": "-0.005"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S02"
                    },
                    "ProjectTitle": {
                        "val": "HQDA DECISION SUPPORT TOOLS & SERVICES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.466"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The project \"HQDA Decision Support Tools and Services\" enables HQDA and its agencies to develop new analytical M&S tools and\/or obtain commercially available analytical M&S tools and services that provide rapid and reliable decision support to Army staff and field operating agencies assigned to Headquarters, Department of the Army.  The project emcompasses the following efforts: Cross-Command Collaboration Effort (3CE); enhanced ARFORGEN Synchronization Tool (AST) (ARFORGEN = Army Force Generation); 3D Crew Injury Visualization; Network Traffic Load Stimulator; and Visual Intelligence, Reconnaissance, Surveillance (ISR) Re-Tasking Tool.  The 3CE is a cross-command modeling and simulation data environment for design, development, integration and testing of capabilities, systems and prototypes across the life cycle of a program. The AST, directed in the Army Campaign Plan, is the only tool in operation under ARFORGEN that is capable of synchronizing readiness requiremetns.  Three-dimension Crew Injury Visualization provides a virtual means to assess expected crew injuries resulting from live-fire testing.  Network Traffic Load Stimulator provides real-world electro-magnetic spectrum configurations that permit a robust test scenario for communications and electronic warfare systems. The Visual ISR Re-tasking Tool assists planners in synchronizing ISR collection operations with changes in the operational battle plan within Army Mission Command systems such as Distributed Common Ground System - Army (DCGS-A), Force XXI Battle Command, Brigade-and-Below (FBCB2) and Command Post of the Future (CPOF)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network Traffic Load Stimulator"
                                    },
                                    "Description": {
                                        "val": "The Network Traffic Load Stimulator creates real-world electro-magnetic sprectrum configurations that provide a robust test senario for communications and electronic warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 Funds permitted accelerated development of the Network Load Stimulator."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M&S Visualization Tools"
                                    },
                                    "Description": {
                                        "val": "1. 3D Crew Injury Visualization Tool -- a virtual means to access expected crew injuries resulting from live-fire testing.  2. Visual Intelligence, Surveillance, Reconnaissance (ISR) Re-Tasking Tool -- assists planners in synchronizing ISR collection operations with changes in the operational battle plan within Army Mission Command Systems such as Distributed Common Ground System - Army (DCGS-A); Force XXI Battle Command Battle Command, Brigade-and-Below (FBCB); Command Post of the Future (CPOF)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 Funds permitted accelerated development of theh 3D Crew Injury Visualization Tool and the Visual IRS Re-Tasking Tool."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S03"
                    },
                    "ProjectTitle": {
                        "val": "Analysis M&S Tools and Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.917"
                        },
                        "CurrentYear": {
                            "val": "1.950"
                        },
                        "BudgetYearOne": {
                            "val": "1.424"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.424"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.159"
                        },
                        "BudgetYearThree": {
                            "val": "1.438"
                        },
                        "BudgetYearFour": {
                            "val": "1.392"
                        },
                        "BudgetYearFive": {
                            "val": "1.520"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Under the project \"Analysis M&S Tools and Services\" the Army develops Modeling and Simulation (M&S) tools and services (e.g., hardware, software, infrastructure) for the Army's analysis community.  The primary users of these tools and services are the Training and Doctrine Command Analysis Center (TRAC), the Army Materiel Systems Analysis Activity (AMSAA), and the Center for Army Analysis (CAA).  Efforts focus on (1) development of analysis tools to enable assessment of emerging technologies during concept exploration, (2) development of infrastructure and enabling technologies to support the Current and Future Force, and (3) application of M&S capabilities to One Semi-Automated Forces (OneSAF) that increase over all use of the OneSAF software and hence reduce Army life-cycle costs.  These critical efforts are required for four essential purposes: analysis-of-futures work to justify Army requirements; assessment of alternative approaches to satisfy those requirements; development of current and emerging war fighting doctrine from the tactical to the operational levels of warfare; and the closing of capability gaps in the areas of irregular warfare, M&S data and standards, cyberspace operations, army network modeling, and non-lethal weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "M&S Concepts and Global Employment of the Force (GEF)"
                                    },
                                    "Description": {
                                        "val": "The Army represents in simulation the emerging M&S concepts that will become an essential part of the Global Employment of the Force (GEF)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 efforts enabled the Army to represent in simulation the emerging M&S concepts that will become an essential part of the Global Employment of the Force (GEF)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Modeling and Simulation Data Strategy"
                                    },
                                    "Description": {
                                        "val": "Army M&S data strategy is directed toward collection, storage and dissemination of M&S data required for the development and use of M&S tools and services (e.g., hardware, software, infrastructure) for the Army's analysis community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 efforts enabled the M&S community to collect, store and disseminate data worldwide."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Gaps Identified by Army Modeling and Simulation (M&S) Specialists"
                                    },
                                    "Description": {
                                        "val": "Army M&S specialists conduct HQDA-directed research to develop solutions for high priority M&S objectives that impact current warfigting capabilities.  M&S specialists focus, first and foremost, on areas that have near-term operational impact or have been difficult to model but are, nonetheless, critical to closing capability gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 efforts enabled the Army to find M&S solutions to capability gaps in irregular warfare, non-lethal technologies, social networks, cyberspace operations, battle command systems, counter-insurgency operations, and other areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Irregular Warfare"
                                    },
                                    "Description": {
                                        "val": "Modeling for irregular warfare will put the Army on the path toward achieving its strategic objectives through indirect means with the same degree of dominance it employs in major combat operations.  Military operations associated with irregular warfare are foreign internal defense, stability operations, counterinsurgency, combating terrorism, unconventional warfare, and application of the dynamics of cultural and human behavior."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.582"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts are in the area of modeling for the following operations associated with irregular warfare: foreign internal defense, stability operations, counterinsurgency, combating terrorism, unconventional warefare, and application of the dynamics of cultural and human behavior.  The goal is to ensure the Army will retain the ability to conduct major combat operations while expanding the capabilities for irregular warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "..FY13 efforts will be in the area of modeling for one or more of the following operations associated with irregular warfare: foreign internal defense, stability operations, counterinsurgency, combating terrorism, unconventional warefare, and application of the dynamics of cultural and human behavior.  The goal will be to ensure the Army will retain the ability to conduct major combat operations while expanding the capabilities for irregular warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M&S Data and Standards"
                                    },
                                    "Description": {
                                        "val": "M&S data and standards allow the Army M&S community to acquire an improved, robust data collection process; a robust data mining process; and an accessible data repository to enable more responsive, credible modeling (especially for current operating and generating environments).  These improvements will enable the Army to close current gaps in its ability to provide M&S support to the decision-making, concept development, operational assessment, and training processes."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts pertain to development of M&S data and standards to allow the Army M&S community to acquire an improved, robust data collection process; a robust data mining process; and an accessible data repository to enable more responsive, credible modeling (especially for current operating and generating environments).  Specific projects are selected by way of a request for proposals to the Army M&S community.  The request is issued by the Army Modeling and Simulation Office."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "..FY13 efforts will pertain to development of M&S data and standards to allow the Army M&S community to acquire an improved, robust data collection process; a robust data mining process; and an accessible data repository to enable more responsive, credible modeling (especially for current operating and generating environments).  Specific projects will be selected by way of a request for proposals to the Army M&S community.  The request will be issued by the Army Modeling and Simulation Office."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace Operations"
                                    },
                                    "Description": {
                                        "val": "Cyberspace operations are defined as the employment of cyber capabilities for the purpose of achieving objectives in and through cyberspace.  M&S cyberspace operations are directed toward computer network operations and operation\/defense of the Global Information Grid (GIG).  Cyberspace is a global domain within the information environment consisting of the interdependent networks of information technology infrastructures.  These include telecommunications networks, computer systems, and embedded processors and controllers."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.176"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts pertained to simulation enhancements for Extended Air Defense Simulation (EADSIM) cyber modeling and cyber operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Network Modeling"
                                    },
                                    "Description": {
                                        "val": "The Army Network is an enhanced, interoperable communications network that assists leaders in making timely, informed decisions and promotes organizational agility, lethality and sustainability.  The network links soldiers on the battlefield with space-based and aerial sensors, robots and command posts.  These systems provide situational awareness and control by locating the enemy, friendly forces and civilian populations; by revealing weapon-system availability at any given time; and by enabling the application of precise lethal fires."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.292"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 activities cover modeling for the Army Network to maximize the effectiveness and accuracy of systems (spaced-based and aerial sensors, robots, and command posts) that provide situational awareness and control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "..FY13 activities will cover modeling for the Army Network to maximize the effectiveness and accuracy of systems (spaced-based and aerial sensors, robots, and command posts) that provide situational awareness and control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Lethal Weapons"
                                    },
                                    "Description": {
                                        "val": "Current M&S activities in the field of non-lethal weapons focus on two areas -- development of methodologies for establishing priority non-lethal weapons and enhancement of non-lethal weapon simulations now in operation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 activies pertain to development of methodologies for establishing priority non-lethal weapons and enhancement of non-lethal weapon simulations now in operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Application of Modeling & Simulation (M&S) Capabilities to One Semi-Automated Forces (OneSAF)"
                                    },
                                    "Description": {
                                        "val": "Application of M&S capabilities to OneSAF increases overall use of the OneSAF software to reduce Army life-cycle costs.  Increasing OneSAF capabilities leads to the goal of implementing ONE TIME (rather than through the use of multiple software products) updates and changes associated with transformation, modernization and operations across the simulation life cycle.  The reduction of reduncies; i.e., multiple software products with similar or interchangable features, is an esstential outcome of the expanded OneSAF domain.  Current efforts: threat-jamming precision-guided weapons in OneSAF; micro-satellite BF SIGINT capabilities; set of web-based XML services to support integrated initialization of simulation-based mission rehearsal, planning and training with C2 standards, C2 Core and JC3IEDM.    XML = Extensible Markup Language.  BF SIGINT =  Blue-Force Signals Intelligence.  C2 = Command and Control.  JC3IEDM = Joint Command, Control and Consultation Information Exchange Data Model."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.524"
                                            },
                                            "Text": {
                                                "val": "..FY13 efforts will enable the application of new capabilities to the OneSAF software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S05"
                    },
                    "ProjectTitle": {
                        "val": "SIMULATION TECHNOLOGY (SIMTECH) PROGRAM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.404"
                        },
                        "CurrentYear": {
                            "val": "1.465"
                        },
                        "BudgetYearOne": {
                            "val": "0.121"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.121"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.124"
                        },
                        "BudgetYearThree": {
                            "val": "0.117"
                        },
                        "BudgetYearFour": {
                            "val": "0.118"
                        },
                        "BudgetYearFive": {
                            "val": "0.118"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Army Simulation Technology (SIMTECH) program enhances force effectiveness by assisting Modeling and Simulation (M&S) research agencies and organizations in conducting low-cost, promising simulation technology research that is outside the scope of the Small Business Innovative Research (SBIR) and the Army science and technology programs.  The SIMTECH program provides a source of competitive funds to Army research agencies and organizations to stimulate high quality, innovative M&S research with significant opportunity for payoff in Army war fighting capability.  The SIMTECH program focuses simulation technology research initiatives on immediate short-term Army capability requirements by including a theme in the annual call for proposals.  The SIMTECH program serves as a vehicle for major M&SC3I-related technology breakthroughs in war gaming, embedded simulation, collaboration capability, rapid prototyping, commercial innovation and related simulation technology.  (M&SC3I = Modeling and Simulation Cross-Command Collaboration and Integration.)  Performers of SIMTECH activities are the Army Materiel Command, the Army Corps of Engineers, the Army Research and Development Centers (ARDECs), the Army Research Institute, the Army Training and Doctrine Command Analysis Center (TRAC), the Program Executive Office for Simulation, Training and Instrumentation (PEO-STRI), White Sands Missile Range, Space and Missile Defense Command (SMDC), Natick Soldier Research Development and Engineering Center (NSRDEC), Edgewood Chemical and Biological Center (ECBC), and other Army agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobility Common Operational Picture (MCOP); geo-Battlefield Management Language (geoBML); and integrated use of common geo-environmental, maneuver, and command and control behaviors."
                                    },
                                    "Description": {
                                        "val": "To meet the information needs of operational commmanders, data and services available in the Global Information Grid are designed to create a Common Operating Picture (COP).  The COP is defined as a single identical display of relevant information shared by more than one command.  The COP facilititates collaborative planning and situational awareness.  One area of the COP of particular interest to land warfare decision-makers is representation of the ground mobility characteristics of the battle space from which war fighters can assess the ability of forces to achieve maneuver dominance in a variety of regions under multiple environmental conditions and tactical situations.  The unified knowledge space for supporting such mobility planning is the Mobility Common Operational Picture (MCOP).  A Battlefield Management Language (BML) is an unambiguous language intended to provide for (1) command and control of simulated and live forces conducting military operations and (2) situational awareness and a shared, common operational picture.  GeoBML is an extension of BML to the geospatial\/environmental arena."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 efforts enabled the Army to improve commonality and consistency in the simulation results of an operations plan (OPLAN) during mission rehearsal."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GIS-Enabled Modeling and Simulation (GEMS)  (GIS = Geospatial Information Systems)"
                                    },
                                    "Description": {
                                        "val": "Current C4ISR* and simulation systems use a variety of tools and formats for generating and storing geospatial information.  C4ISR systems tend to use GIS for geospatial information, while simulation systems use proprietary terrain database formats that are generated from a number of different tools.  This leads to problems in the sharing of geospatial information between systems, making mission planning or embedded training difficult, as well as problems maintaining geospatial information as it is updated.  GEMS provides a common geospatial database that can be generated with a single set of tools and shared across applications, thereby allowing a higher integration of diverse military systems.  *C4ISR=Command, Control, Commuications, Computers, Intelligence, Surveillance, Reconnaisance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 efforts provided interoperability of M&S and C4ISR systems within GEMS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improvement of the various components of Modeling and Simulation (M&S) in accordance with M&S focus areas established within the SIMTECH program."
                                    },
                                    "Description": {
                                        "val": "SIMTECH projects are selected at the beginning of (and executed during) each fiscal year in accordance with the M&S focus areas of that fiscal year.  Project selections reflect the critical needs of the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.504"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY11 activities were the following: correlation of visual systems for simulators, automated modeling and simulation standards ontology, modeling image compression effects on target acquisition performance, enhancements of terrain generation through night vision imaging, and representation of the effects of civilian\/military operations on the civilian population ."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts consist of a variety of projects aimed at improving the various components of M&S.  Projects are selected in accordance with the M&S focus areas for FY12.  Projects are requested by the Army M&S community; e.g., TRADOC Research and Acquisiton Center (TRAC); US Army Research Lab; Army Research, Development & Engineering Centers, via data calls and councils of colonels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "..FY13 efforts will consist of a variety of projects aimed at improving the various components of M&S.  Projects will be selected in accordance with the M&S focus areas for FY13.  Projects will be requested by the Army M&S community; e.g., TRADOC Research and Acquisiton Center (TRAC); US Army Research Lab; Army Research, Development & Engineering Centers, via data calls and councils of colonels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulation Technology Program (SIMTECH) in Support of Advanced Technologies"
                                    },
                                    "Description": {
                                        "val": "The SIMTECH program accelerates advanced technologies to ensure battlefield superiority by enhancing force effectiveness through research and development of innovative, low-cost Modeling and Simulation (M&S).  The program provides funds to organizations for low-cost, promising simulation technology research initiatives that are outside the scope of the Small Business Innovative Research Program (SBIR) and Army Technology Objectives (ATOs).  SIMTECH projects provide high payoff opportunities in warfighting simulation capabilities such as a portable COA\/wargaming development and analysis tool, collaboration capability, embedded training, rapid prototyping, commercial innovation, and correlation of visual systems for simulators.  (COA = Course of Action.)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts consist of a variety of SIMTECH projects selected by way of request for proposals to the Army M&S community and research agencies.  The request for proposals is issued by the Army Modeling and Simulation Office (AMSO).  AMSO selects SIMTECH projects that promise innovative M&S research with significant opportunity for payoff in Army war fighting capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}