{
    "id": "72a33936ca0bbb0e7384859f112f852aacb62984",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604828D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Fires Integration & Interoperability"
        },
        "R1LineItemNumber": {
            "val": "105"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.068"
            },
            "CurrentYear": {
                "val": "9.008"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Fires Integration & Interoperability Team (JFIIT) funded by this program is a compact cell of unique Joint fires experts adding value to much larger Service investments in force elements delivering kinetic and non kinetic effects supporting ground operations. Services, Joint, and Combatant Commanders and their Staffs proactively seek JFIIT advice and assistance to improve the execution of combat fires applied in complex coalition and joint environments.   \n\nPrior to Fiscal Year 2007, funding to support the JFIIT Program originated in the Navy's Research, Development, Test and Evaluation (RDT&E) Program Element 0603857N.  Subsequent realignment brought the JFIIT Program into oversight by Assistant Secretary of Defense for Research and Engineering (ASD R&E) and converted the program element into a Defense-wide account. \n\nJoint Requirements Oversight Council Memorandum (JROCM) 183-4, dated 8 October 2004, directed United States Joint Forces Command (USJFCOM) to establish a Joint Fires Support Organization.  JROCM 241-05, dated 3 November 2005, validated the JFIIT mission.  USJFCOM Directive Number 5170.2 dated 30 November 2007, Charter for JFIIT, assigns JFIIT responsibility to improve Joint fires planning, training and execution as a critical capability for deployed joint warfighters.  \n\nThe JFIIT mission is to improve the integration, interoperability, and operational effectiveness of Joint fires.  JFIIT takes a holistic approach to improving Joint fires by providing solutions that produce effective target acquisition, command and control, and interoperable firing systems, thereby reducing fratricide and collateral damage.  This results in not only near-term tactical identification of issues and solutions, but also informs and provides a foundation for short and long-term operational and tactical capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.637"
                },
                "CurrentYear": {
                    "val": "9.290"
                },
                "BudgetYearOne": {
                    "val": "8.180"
                },
                "BudgetYearOneBase": {
                    "val": "8.180"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.068"
                },
                "CurrentYear": {
                    "val": "9.008"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.569"
                },
                "CurrentYear": {
                    "val": "-0.282"
                },
                "BudgetYearOne": {
                    "val": "-8.180"
                },
                "BudgetYearOneBase": {
                    "val": "-8.180"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.368"
                    },
                    "CurrentYear": {
                        "val": "-0.220"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.055"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.180"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.180"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.061"
                                },
                                "CurrentYear": {
                                    "val": "-0.062"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.085"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P857"
                    },
                    "ProjectTitle": {
                        "val": "Joint Fires Integration & Interoperability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.068"
                        },
                        "CurrentYear": {
                            "val": "9.008"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Fires Integration & Interoperability Team (JFIIT) funded by this program is a compact cell of unique Joint fires experts adding value to much larger Service investments in force elements delivering kinetic and non kinetic effects supporting ground operations. Services, Joint, and Combatant Commanders and their Staffs proactively seek JFIIT advice and assistance to improve the execution of combat fires applied in complex coalition and joint environments.   \n\nPrior to Fiscal Year 2007, funding to support the JFIIT Program originated in the Navy's Research, Development, Test and Evaluation (RDT&E) Program Element 0603857N.  Subsequent realignment brought the JFIIT Program into oversight by Assistant Secretary of Defense for Research & Engineering (ASD R&E) and converted the program element into a Defense-wide account. \n\nJoint Requirements Oversight Council Memorandum (JROCM) 183-4, dated 8 Oct 2004, directed United States Joint Forces Command (USJFCOM) to establish a Joint Fires Support Organization.  JROCM 241-05, dated 3 November 2005, validated the JFIIT mission.  USJFCOM Directive Number 5170.2 dated 30 November  2007, Charter for JFIIT, assigns JFIIT responsibility to improve Joint fires planning, training and execution as a critical capability for deployed joint warfighters. \n\nThe JFIIT mission is to improve the integration, interoperability, and operational effectiveness of Joint fires.  JFIIT takes a holistic approach to improving Joint fires by providing solutions that produce effective target acquisition, command and control, and interoperable firing systems, thereby reducing fratricide and collateral damage.  This results in not only near-term tactical identification of issues and solutions, but also informs and provides a foundation for short and long-term operational and tactical capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Fires Integration & Interoperability  (JFIIT) Assessments and Evaluations"
                                    },
                                    "Description": {
                                        "val": "Employ scientific methods to research, investigate, test, assess, and evaluate current and emerging Joint fires capabilities.  These activities identify shortfalls and root cause, verify recommended solutions, and validate joint capabilities.  The resultant empirical outcomes influence Joint Capability development in areas such as Joint Tactics, Techniques and Procedures; integration of service capabilities; and digital interoperability, and can inform acquisition decisions.\n\nThe emphasis of JFIIT Assessment efforts is the evaluation of Joint fires and combat identification to provide Services and Agencies findings and recommendations based on quantifiable data in order to improve Joint fires.  JFIIT collects and analyzes data and provides observations, findings, conclusions, and recommendations to identify Joint doctrine, training, and material solutions and products that promote capability improvement.  Accurate data is necessary to effectively develop solutions to identified problems.  JFIIT provides a truth-based data collection capability to support a holistic approach to the overall improvement of Joint fires.  Evaluations range from small, single-focus events to large, multi event\/ venue exercises.\n\nJFIIT conducts assessments in conjunction with Service and Combatant Command (COCOM) exercises, experiments, and test & evaluation events.  The emphasis of this JFIIT effort is assessing Joint fires and combat identification capabilities to ensure that Services and Agencies field interdependent and interoperable systems and training.  JFIIT Assessment efforts include verifying an accurate Joint environment is provided for realistic training that exercises one or more Joint tasks, assessing Joint context and Joint task execution while addressing the effectiveness of a Joint training program and identifying the need for continued support of Joint fires tactics, techniques and procedures (TTP) and doctrine.  JFIIT assessments provide input to acquisition processes and enhance Joint development as programs are funded and developed.\n\nThe primary outputs and efficiencies include:\n- Improvement in the Services’ ability to employ Joint Fires.\n- Improved Joint Intelligence, Surveillance, and Reconnaissance (ISR) and integrated Air to Ground training at Home Station and the Combat Training Centers.\n- An enhanced Joint operational environment at the Combat Training Centers that supports the execution of Joint tasks during service training and enhances JFIIT’s ability to conduct assessments.\n- Recommended solutions integrated within the Joint Staff Joint Capabilities Integration Development System (JCIDS) and OSD Joint C2 Capability Portfolio Manager (JC2 CPM) processes.\n- Identification of specific key performance parameters (KPPs) and key system attributes (KSAs) for new systems that meet Joint warfighter operational requirements to ensure Services and Agencies field interdependent and interoperable systems.\n- Published doctrine and Joint Tactics, Techniques and Procedures (TTP) to efficiently and effectively employ Joint forces at the tactical level.\n- Increased effectiveness and confidence in combat identification and a reduction in fratricide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.576"
                                            },
                                            "Text": {
                                                "val": "- Developed Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF) recommendations and proposals for changes to unit Standard Operating Procedure and improvements to Brigade Combat Team pre-deployment training based on observations and analysis throughout the process.  Benefits include better trained service members, improved Joint TTP, and improved pre-deployment training.\n\n- In support of, US Army Forces Command (FORSCOM) and US Air Force Air Combat Command (ACC), continued improvement of the tactical application of Joint ISR and the integration of Air to Ground Operations at the National Training Center, Fort Irwin, CA, and Green Flag West, Nellis AFB, NV. Conducted assessments of Joint training through collection and analysis of data on Universal Joint Tasks. Conducted trend analysis of assessments to form recommendations for improvements to Joint training.  Assisted in development and implementation of architectures for integration and interoperability of systems. Provided feedback to exercise participants, observer trainers\/controllers, and venue support staff during designated training rotations.  Provided a post-event debrief to the venue staff and an Exercise Summary Report.  Benefits include improved ability to execute joint tasks at service training venues and an improved Joint operational environment and Joint context at a Service Combat Training Center.\n\n- In support of USA FORSCOM and USAF ACC, continued improvement of the tactical application of Joint ISR and the integration of Air to Ground Operations at the Joint Readiness Training Center, Fort Polk, LA, and Green Flag East, Barksdale AFB, LA. Conducted assessments of Joint training through collection and analysis of data on Universal Joint Tasks.  Conducted trend analysis of assessments to form recommendations for improvements to Joint training.  Assisted in development and implementation of architectures for integration and interoperability of systems.  Provided feedback to exercise participants, observer trainers\/controllers, and venue support staff during designated training rotations.  Provided a post-event debrief to the venue staff and an Exercise Summary Report.  Benefits include improved ability to execute joint tasks at service training venues and an improved Joint operational environment and Joint context at a Service Combat Training Center.\n\n- In support of USA Training and Doctrine Command (TRADOC) and US Air Forces Europe (USAFE), continued improvement of the tactical application of Joint ISR and the integration of Air to Ground Operations at the Joint Multi-National Readiness Center, Hohenfels, Germany.  Conducted assessments of Joint training through collection and analysis of data on Universal Joint Tasks.  Conducted trend analysis of assessments to form recommendations for improvements to Joint training.  Assisted in development and implementation of architectures for integration and interoperability of systems.  Provided feedback to exercise participants, observer trainers\/controllers, and venue support staff during select training rotations.  Provided a post-event debrief to the venue staff and an Exercise Summary Report.  Benefits include improved ability to execute joint tasks at service training venues and an improved Joint operational environment and Joint context at a Service Combat Training Center.\n\n- In support of USMC Marine Air-Ground Task Force – Training Command (MAGTF-TC) continued improvement to the tactical application of Joint ISR and the Integration of Air to Ground Operations at the Marine Corps Air Ground Combat Center, Twenty-Nine Palms, CA. Conducted assessments of Joint Training through collection and analysis of data on Universal Joint Tasks.  Conducted trend analysis of assessments to form recommendations for improvements to Joint training.  Assisted in development and implementation of architectures for integration and interoperability of systems. Provided feedback to exercise participants, observer trainers\/controllers, and venue support staff during Spartan Advance and Spartan Resolve training exercises.  Provided a post event debrief to the venue staff and an Exercise Summary Report.  Continued efforts to define training support to Marine Corps Tactics and Operations Group (MCTOG). Benefits include improved ability to execute joint tasks at service training venues and an improved Joint operational environment and Joint context at a Service Combat Training Center.\n\n- In support of USN Naval Surface Warfare Center (NSWC), provided analytical support to netted sensor assessments conducted to determine how to integrate world-wide sensors on a Global Information Grid (GIG) to allow for a common operational picture.  Also provided instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings.  Benefits include improved integration of world-wide sensors and improved Joint interoperability.\n\n- Continued support of the Coalition Combat Identification Advanced Combat Identification Demonstration (CCID ACTD) Bold Quest events.  Provided analytical support to a Military Utility Assessment of coalition and US Combat Identification Systems.  Provided instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings.  Benefits include improved ability to assess various participating coalition and US systems, improved joint task execution, and an effective Military Utility Assessment of US Combat Identification systems while greatly reducing the timeline required to provide fact-based recommendations.\n\n- Continued support to USAFCENT and the various Air Support Operations Groups (ASOGs) in their training of Joint Terminal Attack Controllers (JTACs) and Joint Fires Officer (JFOs) teams.  Provided planning and execution support, assessment of training capabilities, and feedback to the training audience and trainers.  Benefits include increased combat readiness of JTACs and JFOs as well as Air Support Operations Squadron (ASOS) personnel.\n\n- In support of the Joint Integrated Missile Defense Organization (JIAMDO), provided analysis support to assess technology integration and interoperability during JIAMDO Joint Sensor Integration event.  Benefits include improvements in Joint Sensor Integration to provide an Integrated Air and Missile Defense Common Operational Picture.\n\n- In support of the Joint Fires Support Executive Steering Committee, conducted an airspace control interoperability analysis.  Benefits include recommendations for airspace control Tactics, Techniques, and Procedures in the areas of standardization and digital interoperability and development of associated Universal Joint Tasks to standardize airspace control training.\n\n- Continued support to OUSD AT&L Joint Integration and DASD C3S2 by providing direct support to the Engineering Change Implementation Group (ECIG) in the continuing Digitally-Aided Close Air Support Coordinated Implementation (DACAS CI) effort.  Continued Block 1 improvement efforts and assisted in the development of Block 2 engineering change proposals and Block 2 test and assessment documentation"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- JFIIT Mission transitions to Joint Fires Capability Assessments in FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Fires Integration & Interoperability  (JFIIT) Capabilities Development"
                                    },
                                    "Description": {
                                        "val": "The emphasis of the JFIIT Capabilities Development effort is continued development of Joint Fires and combat identification capabilities.  JFIIT focuses on current and emergent Joint fires capabilities such as tactics, techniques, and procedures (TTP), Systems, and System of Systems.  JFIIT is working with the Combat Training Centers to enhance Joint training for evolving Joint fires issues identified during the rotational units pre-deployment exercises as the basis to develop tactical level recommendations to address the operational gaps and seams.  To support Service and Component Command (COCOM) capability development efforts, JFIIT develops Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF) Change Recommendations; improvements in coordinating fires, command and control, and firing systems interoperability resulting in increased effectiveness and efficiency; and provides technical expertise in identifying Joint solutions to capability gaps.\n\nThe primary outputs and efficiencies include:\n- Validated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF) Joint fires recommendations.\n- Improvements in Joint Terminal Attack Controller (JTAC) and Joint Fires Observer equipment and Tactics, Techniques and Procedures (TTP).\n- Appraisals of service venues joint context and ability to support joint training.\n- Resolution of Combat Identification and Joint Close Air Support Action Plan issues.\n- Publication of Tactical Leader’s Joint Intelligence, Surveillance & Reconnaissance (ISR) Handbook.\n- Accreditation\/certification for Joint fires context and training capability of service venues.\n- Recommendations for tactical Joint fires improvement solutions.\n- Recommendations for system integration and interoperability.\n- Optimum utilization of currently fielded systems as evidenced through feedback from deployed forces.\n- Ability to include Joint context during new system acquisition or development.\n- New system capability that meets current Joint operational requirements.\n- Proposed Joint fires related TTP and doctrine.\n- Increased effectiveness and confidence in combat identification as evidenced through feedback from deployed forces.\n- Reduced collateral damage and decreased number of fratricide incidents across the force.\n- Improved capabilities to train forces in a Joint environment.\n- Development of Joint fires related Universal Joint Tasks (UJT).\n- Updates and revisions to Joint fires related doctrine, TTP, and other Joint publications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.492"
                                            },
                                            "Text": {
                                                "val": "- Continued to refine and enhance support to pre-deployment mission rehearsal exercises as requested by the Services and Combatant Commands.  Joint fires issues identified during the rotational units pre-deployment exercises formed the basis for tactical level recommendations to address operational gaps and seams.\n\n- Continued to develop the Joint Intelligence, Surveillance, and Reconnaissance (ISR) Integration at the Combat Training Centers (CTC) integrated training initiatives.  Provided Joint fires, Joint ISR, and network subject matter expertise to assist synchronization of joint tasks, facilitate joint mission thread execution, and training development and mentoring to Combat Training Center staff and observer controllers.  These activities promoted the synergistic application of Joint capabilities to effectively conduct Joint fires.\n\n- Provided planning, execution, and analysis support for USAFCENT Atlantic Strike exercises increasing the combat readiness of Joint Terminal Attack Controllers (JTACs), Joint Fires Observers (JFOs) and Air Support Operations Squadron (ASOS) personnel.\n\n- Provided Joint fires subject matter expertise to the Joint Command and Control Capability Portfolio Manager to develop joint guidance, assessment, and analysis to proactively shape Service to achieve systems interoperability in Joint Fires related tasks.\n\n- Continued Joint Windows-based Warfare Assessment Model (JWinWAM) software development to support JFIIT assessment activities and the efforts of other government agencies as directed.\n\n- Supported the Joint National Training Capability (JNTC) certification, accreditation, and mitigation program and execution of Joint fires related JNTC exercises.\n\n- Developed Universal Joint Task (UJT) Additional Task Detail (ATD) for TA 3.3.2 Control Tactical Airspace, TA 3.2.2 Conduct Close Air Support (CAS), TA 3.2.1 Conduct Fire Support, and TA 2 Share Intelligence. \n\n- Continued development of the Tier 1 Joint CAS and Joint Fires Joint Mission Threads (JMTs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- JFIIT Mission transitions to Joint Fires Capability Assessments in FY 2012.  \n                                                              \n- Updates and revisions to Joint fires related doctrine, TTP, and other Joint publications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Fires Integration & Interoperability (JFIIT)- Joint Fires Capability Assessments"
                                    },
                                    "Description": {
                                        "val": "Employ scientific methods to research, investigate, test, assess, and evaluate current and emerging Joint fires capabilities.  These activities identify shortfalls and root cause, verify recommended solutions, and validate joint capabilities.  The resultant empirical outcomes influence Joint Capability development in areas such as Joint Tactics, Techniques and Procedures; integration of service capabilities; and digital interoperability, and can inform acquisition decisions.\n\nThe emphasis of JFIIT Assessment efforts is the evaluation of Joint fires and combat identification to provide Services and Agencies findings and recommendations based on quantifiable data in order to improve Joint fires. JFIIT collects and analyzes data and provides observations, findings, conclusions, and recommendations to identify Joint doctrine, tactics, techniques, and procedures (TTP) and material solutions and products that promote capability improvement. Evaluations range from small, single-focus events to large, multi event\/ venue exercises.\n\nJFIIT conducts assessments in conjunction with Service and Combatant Command (COCOM) exercises, experiments, and test & evaluation events. The emphasis of this JFIIT effort is assessing Joint fires and combat identification capabilities to ensure that Services and Agencies field interdependent and interoperable systems. \n\nThe primary outputs and efficiencies include:\n- Improvement in the Services’ ability to employ Joint fires.\n- Recommendations for system integration and interoperability.\n- Ability to include Joint context during new system acquisition or development. \n- Development of Joint fires related Universal Joint Tasks (UJT).\n- Updates and revisions to Joint fires related doctrine, TTP, and other Joint publications.\n- Development and refinement of analytical tools (i.e. Data Collection Architecture for Analytical Feedback (DCAAF), Joint Windows-based Warfare Assessment Model (JWinWAM)).\n- Recommended solutions integrated within the Joint Staff Joint Capabilities Integration Development System (JCIDS) and OSD Joint C2 Capability Portfolio Manager (JC2 CPM) processes.\n- Identification of specific key performance parameters (KPPs) and key system attributes (KSAs) for new systems that meet Joint warfighter operational requirements to ensure Services and Agencies field interdependent and interoperable systems.\n- Increased effectiveness and confidence in combat identification and a reduction in fratricide."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.008"
                                            },
                                            "Text": {
                                                "val": "- Provide analytical support to a Military Utility Assessment of coalition and US Combat Identification Systems.  Provide instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings. Benefits will include improved ability to assess various participating coalition and US systems, improved joint task execution, and an effective Military Utility Assessment of US Combat Identification systems while greatly reducing the timeline required to provide fact-based recommendations.\n\n- Provide analytical support to assess technology integration and interoperability during Joint Sensor Integration events.  Benefits will include improvements in Joint Sensor Integration to provide a Common Operational Picture to battlespace managers.\n\n- In support of the Joint Fires Support Executive Steering Committee, conduct an airspace control interoperability analysis.  Benefits will include recommendations for airspace control Tactics, Techniques, and Procedures in the areas of standardization and digital interoperability and development of associated Universal Joint Tasks to standardize the airspace control training.\n\n- Provide support to Joint Integrated Sensor testing with data collection, analysis and display using JFIIT developed collection and analysis tools. \n- Continue Joint Windows-based Warfare Assessment Model (JWinWAM) software and development to support JFIIT assessment activities and the efforts of other government agencies as directed.\n\n- Continue to develop the tactical Universal Joint Task (UJT) for airspace management (TA 3.3.2 Control Tactical Airspace) and associated Additional Task Detail (ATD) that decomposes and amplifies the UJT.  This UJT and the ATDs have been posted to the Joint Doctrine, Education, & Training Information System (JDEIS).\n\n- Continue to refine ATDs for TA 3.2.2 Conduct Close Air Support (CAS), TA 3.2.1 Conduct Fire Support, and TA 2 Share Intelligence.\n\t\n- Continue development of the Tier One Joint Close Air Support (CAS) Joint Mission Thread (JMT) and beginning of the Tier One Joint Fires JMT."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transferred to Joint Staff Accounts"
                                    },
                                    "Description": {
                                        "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "JFIIT delivers Joint solutions for tactical forces deployed to Combatant Commands (COCOMs).  Deliverables may include: discrete improvements to training processes; doctrine; Tactics, Techniques, & Procedures (TTPs); and\/or technical system performance specifications and standards; validated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF) Joint fires recommendations; timely delivery of quality feedback to exercise participants; or improvements to Joint context of a training venue.  JFIIT works with USD AT&L\/ASD R&E, Services and COCOMs to approve the annual agenda of work and validate results."
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Operational Test & Planning, Publications"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}