{
    "id": "733268178b634c17d483bbd4bd3481652379ebc5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602211A"
        },
        "ProgramElementTitle": {
            "val": "AVIATION TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.869"
            },
            "CurrentYear": {
                "val": "44.539"
            },
            "BudgetYearOne": {
                "val": "51.607"
            },
            "BudgetYearOneBase": {
                "val": "51.607"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "53.663"
            },
            "BudgetYearThree": {
                "val": "50.111"
            },
            "BudgetYearFour": {
                "val": "41.338"
            },
            "BudgetYearFive": {
                "val": "47.859"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 funding increase for enhancements to Aviation Survivability research"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) conducts rotary wing vehicle component design, fabrication and evaluation to enable Army aviation transformation.  Emphasis is on developing rotary wing platform technologies to enhance manned and unmanned rotary wing vehicle combat and combat support operations for attack, reconnaissance, air assault, survivability, logistics and command and control missions.  Project 47A researches and evaluates components and subsystems for air vehicles in the areas of aviation and aircraft weapons technology.  Project 47B researches and evaluates components and subsystems for air vehicles in the areas of propulsion and structures.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. This PE supports the National Rotorcraft Technology Center (NRTC), a partnership of government, industry, and academia.  \n\nWork in this PE contributes to the Army S&T air systems portfolio and is fully coordinated with efforts in PE 0603003A (Aviation-Advanced Technology), PE 0602624A (Weapons and Munitions Technology) and PE 0602303A (Missile Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.\nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), located at Redstone Arsenal, AL; Fort Eustis, VA; Moffett Field, CA; and Hampton, VA, and at the Army Research Laboratory (ARL), located at Adelphi, MD; Hampton, VA; and Cleveland, OH."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.476"
                },
                "CurrentYear": {
                    "val": "44.610"
                },
                "BudgetYearOne": {
                    "val": "45.123"
                },
                "BudgetYearOneBase": {
                    "val": "45.123"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.869"
                },
                "CurrentYear": {
                    "val": "44.539"
                },
                "BudgetYearOne": {
                    "val": "51.607"
                },
                "BudgetYearOneBase": {
                    "val": "51.607"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.607"
                },
                "CurrentYear": {
                    "val": "-0.071"
                },
                "BudgetYearOne": {
                    "val": "6.484"
                },
                "BudgetYearOneBase": {
                    "val": "6.484"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.479"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.484"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.484"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.128"
                                },
                                "CurrentYear": {
                                    "val": "-0.071"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "47A"
                    },
                    "ProjectTitle": {
                        "val": "AERON & ACFT WPNS TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.564"
                        },
                        "CurrentYear": {
                            "val": "38.972"
                        },
                        "BudgetYearOne": {
                            "val": "45.898"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.898"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "47.460"
                        },
                        "BudgetYearThree": {
                            "val": "43.597"
                        },
                        "BudgetYearFour": {
                            "val": "34.539"
                        },
                        "BudgetYearFive": {
                            "val": "40.947"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs and evaluates rotary wing vehicle technologies for manned and unmanned Army\/ Department of Defense (DoD) aircraft to increase strategic and tactical mobility\/deployability, improve combat effectiveness, increase aircraft and crew survivability; and improve combat sustainability.  Areas of research address desired characteristics applicable to all aviation platforms, such as enhanced rotor efficiencies, improved survivability, increased structure and airframe capability, improved engine performance, improved sustainability, improved mission avionics performance, and reduced cost.  This project supports the National Rotorcraft Technology Center (NRTC), a partnership of government, industry, and academia.  This project leverages work accomplished in collaboration with the National Aeronautics and Space Administration (NASA).  Technologies within this project transition to advanced technology development programs with application to future, as well as current, Army\/DoD aircraft systems.  \n  \nWork in this project is fully coordinated with PE 0603003A (Aviation Advanced Technology) and work in this project related to aircraft weapons integration is also fully coordinated with PE 0602624A (Weapons and Munitions Technology) and PE 0602303A (Missile Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aero-Flight Dynamics Directorate of the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), (located at the NASA Ames Research Center, Moffett Field, CA; and the NASA Langley Research Center, Hampton, VA); and the Aviation Applied Technology Directorate, Fort Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Rotorcraft Technology Center (NRTC)"
                                    },
                                    "Description": {
                                        "val": "The goal of the NRTC is to focus government, US rotorcraft industry and academia resources on pre-competitive, high priority, military focused technology development to maintain U.S. preeminence in rotorcraft capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated metal matrix composite structural elements as replacements for titanium elements; incorporated new dynamic stall model, based on a hybrid computational approach, into a comprehensive code and validated the new model by comparison with test data; and validated physics-based analysis methodology predictions for hub drag reductions with available test data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct an icing evaluation of a spinning rotor in the NASA Icing Research Tunnel (IRT) to validate prediction tools; conduct hover stand evaluation of rotor with Miniature Trailing-edge Effector (MiTE) actuation system; perform validation testing of an in-flight acoustic detection footprint prediction system and in-cockpit display; and validate analytic predictions with UH-60 wind tunnel and flight test data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.912"
                                            },
                                            "Text": {
                                                "val": "Will conduct static and cyclic testing to validate thick laminate delamination propagation prediction tools applicable to composite structures; evaluate composite material coupons to determine the effect of nano-particles on strength and weight properties; systematically investigate severe maneuvers using high-fidelity computational fluid dynamic\/structural analyses with tight coupling for a UH-60 design pull-up maneuver and diving turns; investigate autonomous autorotation landing on a fixed-base simulator; develop an automatic overset grid generation tool to support the use of the Army\/NASA Navier-Stokes aerodynamic code for rotorcraft analyses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotor Technology"
                                    },
                                    "Description": {
                                        "val": "Evaluate performance enhancements gained from advanced rotor technologies, including on-blade controls.  This effort continues in FY13 under the Rotors & Vehicle Management Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.104"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Acquired high quality interactional aerodynamics measurements for a high speed active flow control rotor configuration; executed active on-blade control evaluation; and utilized high quality UH-60 rotor measurements to assess rotorcraft modeling and simulation tools for rotor structural loads, deflections and flowfield measurements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply advanced, high performance computing tools, simulating UH-60 rotor measurements, to assess accuracy of computed rotor structural loads, deflections and flowfield measurements; perform pre-test computations and participate in international evaluation of an active twist rotor; and apply aeromechanics analysis tools to rotorcraft configurations for improved performance in support of PE 0603003A, Project 313."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Controls"
                                    },
                                    "Description": {
                                        "val": "Develop advanced rotor and aircraft flight control architectures as well as control laws to permit enhanced vehicle performance over expanded and more challenging flight envelopes.  This effort continues in FY13 under the Rotors & Vehicle Management Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.537"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Defined control system architectures for emerging rotorcraft configurations based on initial dynamic simulation models and in-flight simulation experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.119"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate integrated control of large rotorcraft using feedback of rotor state, external loads, and structural measurements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and investigate advanced airfoil and rotor blade technologies, including active control elements, to support goals of increased hover and cruise efficiency.  Design and evaluate advanced flight control and vehicle management component technologies to support goals of increased maneuverability, reliability, and reduced weight and cost.  This effort consolidates and continues efforts initiated prior to FY13 under the Rotor Technology effort and the Flight Controls effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.429"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.429"
                                            },
                                            "Text": {
                                                "val": "Will assess advanced computational methods for prediction of helicopter main rotor and pylon aerodynamic interaction with fixed tail surfaces; perform post-test computations for international active twist rotor experiment; continue to analyze rotorcraft configurations for improved performance; complete new software that includes the ability to model full vehicle interactional aerodynamics including main-rotor, fuselage and tail-rotor interaction; and initiate flight mechanics modeling and handling qualities criteria development for advanced aircraft configurations, including compounds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft and Occupant Survivability Technologies (previously titled Survivability Technologies)"
                                    },
                                    "Description": {
                                        "val": "Investigate advanced technologies to reduce susceptibility and vulnerability of aircraft to damage from threats or accidents, as well as technologies to defeat small arms, rocket and missile threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.766"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated crashworthy systems\/subsystems, evaluated, and correlated test results with models previously developed; and integrated optic laser fiber and optical parametric oscillator (OPO) component technologies into a complete multi-function IR and visual laser countermeasure system, and transitioned to PE 0603003A, Project 313 effort for flight evaluation on a threat range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.083"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin design of advanced infra-red(IR)\/electro-optical (EO) signature control materials; and develop improved materials and airframe structural configurations that provide threat protection against non-conventional weapons, to include directed energy, blast\/overpressure, and high velocity low mass fragments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.147"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.147"
                                            },
                                            "Text": {
                                                "val": "Will continue research into advanced IR\/EO signature control materials to counter current and emerging threat sensors; continue investigation and validation of improved materials and airframe structural configurations that provide threat protection against conventional and nonconventional weapons, to include directed energy, blast\/overpressure, and high velocity low mass fragments; and design and validate active crash energy management subsystems; and evaluate and validate fuel containment technologies that provide self-sealing capability independent of fuel type."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engine Technologies (previously titled Advanced Engines)"
                                    },
                                    "Description": {
                                        "val": "Design and evaluate advanced turboshaft engine component technologies to support goals of reduced fuel consumption, engine size, weight, cost, as well as improved reliability and maintainability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For a cargo sized aircraft, completed advanced combustor design for improved engine performance and structural life; completed fabrication of advanced compressor for improved engine performance and reduced weight; and completed evaluation of gas generator turbine to validate improved engine performance and durability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For a cargo sized aircraft, complete advanced mechanical systems fabrication for improved engine performance and structural life; complete evaluation of advanced compressor for improved engine performance and reduced weight; and transition technologies to engine advanced development efforts under PE 0603003A, Project 447."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.049"
                                            },
                                            "Text": {
                                                "val": "Will complete component testing of advanced mechanical systems technology in a dynamic laboratory environment for improved engine performance and structural life; complete fabrication of advanced combustor design for reduced size, weight, and cost; and complete design of advanced power turbine design for improved performance and operational capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Concepts Studies"
                                    },
                                    "Description": {
                                        "val": "Enables new rotorcraft configurations by evaluating critical advanced technology using design and analysis methods with greater modeling fidelity.  Introduces high fidelity methodology for improved performance and design predictions earlier in the development and acquisition process.  This effort continues in FY13 under the Platform Design & Structures Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhanced\/extended the fidelity of the integrated analysis and design environment to increase prediction accuracy as well as investigated techniques for rigorous optimization of the rotorcraft design in full flight envelope simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.055"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete small scale wind tunnel test to validate performance predictions and document requirements for multi-role configuration technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Technologies"
                                    },
                                    "Description": {
                                        "val": "Enables new rotorcraft configurations by evaluating critical advanced aviation technologies using design and analysis methods with greater modeling fidelity.  Introduces high fidelity methodology for improved performance and design predictions earlier in the development and acquisition process. Prior to FY13, efforts were exhibited under System Concept Studies, Network Operations and System Integration(advanced rotary wing concept), and Durability & Sustainment Technologies(platform durability & damage tolerance)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.735"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.735"
                                            },
                                            "Text": {
                                                "val": "Will update advanced technology representations at the component level for design codes used for joint vertical lift aircraft concept size, weight, and performance estimation; assess modeling and simulation methods for rotorcraft application, including rotor hubs, airfoils, blades, and interactional aerodynamics of rotors and fuselage with focus on performance improvements; and apply modeling and simulation technologies developed to inform Joint Multi-Role and future aircraft designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Operations and System Integration"
                                    },
                                    "Description": {
                                        "val": "Perform feasibility, operations, and concept studies to identify promising candidate technologies for improved and new platform capabilities.  The human\/machine interface work of this effort continues in FY13 under the Unmanned and Optionally Manned Technologies effort.  The advanced rotary wing weapons integration concept  work of this effort continues in FY13 under the Aircraft Weapon & Sensor Technologies effort.  The advanced rotary wing concepts work of this effort continues in FY13 under the Platform Design and Structures Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.307"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated use of Umnanned Aerial Systems (UAS) supervisory techniques in Manned-Unmanned Teaming flight evaluations; developed\/evaluated interface technologies for rapid immersion of UAS operators into remote environments; integrated a lightweight, distributed sensor array into a UAS test-bed platform to evaluate autonomous pilotage and collision avoidance techniques; developed\/evaluated virtual interface technologies for rapid virtual immersion of UAS operators into UAS operating environment; extended supervisory control techniques to airborne control station applications; continued assessment of low space, weight and power wide field of view sensor systems for local situational awareness; and completed ground based evaluation of autonomous sniper system with fire control upgrades."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.128"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate UAS supervisory control techniques applied in relevant tactical operations through flight evaluation; investigate integration of advanced lethality concepts for application to manned and unmanned aviation assets, addressing energy storage, system pointing accuracy, stabilization, and incapacitation effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and develop collaboration and cooperation algorithms to support goal of intelligent teaming for manned-unmanned operations.  Design and develop advanced unmanned aerial system (UAS) components to support goal of improved small UAS performance.  Prior to FY13, human\/machine interface work was exhibited in the Network Operations and System Integration effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.278"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.278"
                                            },
                                            "Text": {
                                                "val": "Will validate UAS Supervisory control techniques from the cockpit for manned-unmanned teaming in high fidelity simulation.  Complete UH-60 flight test of symbology sets for degraded visual environment and integrated forward perspective displays for improved flight path and landing precision."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Weapon & Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and develop innovative approaches for integrating advanced weapons and sensors on aircraft platforms, including smart dispensers, data transfer, and post-launch weapon communication.  Prior to FY13, the advanced rotary wing weapons integration concept work was exhibited in of the Network Operations and System Integration effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.521"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.521"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced lethality concepts to include on-the-move fire control for improved hit probability and reduced collateral damage and apply concepts to inform future system level demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Technologies (previously titled Durability and Sustainment Technologies)"
                                    },
                                    "Description": {
                                        "val": "Develop prognostic and system health assessment technologies to enable transition to a Condition Based Maintenance supportability structure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed prognostic capabilities for more chaotic, nonlinear dynamic failure modes of mechanical systems; developed improved probabilistic methods for prediction of failure initiation and progression; evaluated nano-sensing technology for real-time integrity monitoring; and implemented improved design and analysis criteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.445"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop prognostic algorithms for predicting remaining life of engine controls, sensors and lubrication systems; perform evaluation of data fusion of structural integrity algorithms for extending component time on wing and damage tolerance; and develop algorithms to assess rotor component health and vehicle control systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.827"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.827"
                                            },
                                            "Text": {
                                                "val": "Will develop prognostic technologies for predicting and isolating failures within aircraft electrical wiring systems; validate algorithms for engine controls, sensors, and lubrication systems; develop a multi-functional sensor to provide improved bearing prognostics and reduce system weight; and develop a combined crack and corrosion detection sensor for improved accuracy and validate on airframe structural components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability For Degraded Visual Environment Operations"
                                    },
                                    "Description": {
                                        "val": "Will research advanced sensor and cockpit display technologies to provide ability to maintain terrain situational awareness during degraded visual environments caused by dust and snow particulates (brown-out & white-out)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Characterizatize sensor transmission as a function of wavelength, particulate size and volumetric density.  Define required: spatial resolution for safe pilotage; scan rates for terrain updates; and sensor transmission relative to operational dust and snow volumetric densoties.  Investigate multi-band sensor fusion techniques to enhance performance.  Investigate cockpit display technology (heads-up and heads-down) to provide terrain representation to aircrew."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "47B"
                    },
                    "ProjectTitle": {
                        "val": "VEH PROP & STRUCT TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.305"
                        },
                        "CurrentYear": {
                            "val": "5.567"
                        },
                        "BudgetYearOne": {
                            "val": "5.709"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.709"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.203"
                        },
                        "BudgetYearThree": {
                            "val": "6.514"
                        },
                        "BudgetYearFour": {
                            "val": "6.799"
                        },
                        "BudgetYearFive": {
                            "val": "6.912"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates engine, drive train, and airframe enabling technologies such as multifunctional materials, fluid mechanics and high temperature, high strength, low cost shaft materials.\n\nWork in this project complements and is fully coordinated with PE 0603003A (Aviation Advanced Technology). \n \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Research Laboratory (ARL) at the NASA Glenn Research Center, Cleveland, OH, the NASA Langley Research Center, Hampton, VA, and the Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rotor and Structure Technology"
                                    },
                                    "Description": {
                                        "val": "Devise improved tools and methodologies to more accurately design for improved component reliability and durability, resulting in platforms that are lighter in weight and less costly to acquire and maintain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.983"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed a series of analytical and validation studies, including in-flight evaluations conducted jointly with the Federal Aviation Administration and other Research, Development and Engineering Center field elements, to enhance analytical tools and methodologies for structural damage detection and condition-based maintenance of key structural components. Completed fabrication of six 1\/4-scale high-performance active-twist rotor blades based on Apache baseline performance characteristics. Conducted parametric wind-tunnel evaluations of two sets of advanced active-twist rotor configurations, one of which was optimized for rotor performance improvements. Completed analytical comparison study with data validation to document benefits of high-performance active designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete wind-tunnel evaluation of high performance ATR blades and validate prognostics and diagnostics technologies and framework for computation of remaining useful life of vehicle structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.043"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.043"
                                            },
                                            "Text": {
                                                "val": "Will use enhanced damage tolerance analysis and analytical methods to support the Army joint multi-role aircraft development; conduct flight studies using an unmanned aircraft vehicle, as a cost effective surrogate for full scale manned and unmanned rotorcraft, equipped with a health and usage monitoring system to assess and validate advanced sensors for prognostics and diagnostics; assess structural health monitoring methods to optimize sensing strategies for reducing Army maintenance labor; validate a modeling and simulation capability for the study of improved rotor system performance; and investigate nanosecond pulsed plasma actuators for on-blade separated flow control to increase the performance of rotor systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engine and Drive Train Technology (previously titled Propulsion and Drive Train Technology)"
                                    },
                                    "Description": {
                                        "val": "Investigate high temperature materials, advanced models for flow physics and improved methods for predicting propulsion system mechanical behavior to increase fuel efficiency and reduce propulsion system weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analyzed joining technologies to enable the fabrication and integration of ceramic fuel injectors for improved combustion process design, and investigated a coupled engine and drive train dynamic model that will enhance the accuracy of mechanical behavior predictions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate the feasibility of fabricating hybrid ceramic\/metal turbine engine components for future air platforms.."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.666"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.666"
                                            },
                                            "Text": {
                                                "val": "Will complete evaluation of the potential for variable speed power turbines to enable efficient operation of gas turbine engines at reduced power operating conditions to enable faster rotorcraft vehicles; and characterize the dynamics of a pericyclic variable transmission (PVT) for use in rotorcraft applications to reduce transmission weight."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}