{
    "id": "74c9d05e3a3bc7b91f34946675bbe1ec860f3cae",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604771D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Information Distribution System (JTIDS)"
        },
        "R1LineItemNumber": {
            "val": "120"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.253"
            },
            "CurrentYear": {
                "val": "16.780"
            },
            "BudgetYearOne": {
                "val": "20.688"
            },
            "BudgetYearOneBase": {
                "val": "20.688"
            },
            "BudgetYearTwo": {
                "val": "21.250"
            },
            "BudgetYearThree": {
                "val": "19.966"
            },
            "BudgetYearFour": {
                "val": "17.855"
            },
            "BudgetYearFive": {
                "val": "18.280"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "As a Department efficiency the ASD(NII) has been disestablished.  Starting in FY 2013 the funding in ASD(NII) PE 0604771D8Z and PE 0305199D8Z supporting acquisition related functions has been transferred to OUSD(AT&L).\n\nThis funding provides resources for acquisition support and management oversight of critical command, control, communications (C3) and non-intelligence space capabilities as the Department continues its transition to netcentric operations. Funds will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and effect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations. Resources will be allocated for architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3 and non-intelligence space systems. They will also be used to provide expertise required for exercising technical direction over design, performance and cost parameters of key systems and their dependencies. The goal of this funding is to eliminate redundancy, reduce time to the field, evaluate projects and concepts for adherence to net-centric guidelines, minimize performance and operational risk of developing and fielding complex major systems which rely on networks and supporting applications, ensure program dependencies are documented and included in acquisition decisions and address interoperability requirements, gaps and required technical solutions. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies and technical and policy guidance directives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.954"
                },
                "CurrentYear": {
                    "val": "17.395"
                },
                "BudgetYearOne": {
                    "val": "17.296"
                },
                "BudgetYearOneBase": {
                    "val": "17.296"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.253"
                },
                "CurrentYear": {
                    "val": "16.780"
                },
                "BudgetYearOne": {
                    "val": "20.688"
                },
                "BudgetYearOneBase": {
                    "val": "20.688"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.701"
                },
                "CurrentYear": {
                    "val": "-0.615"
                },
                "BudgetYearOne": {
                    "val": "3.392"
                },
                "BudgetYearOneBase": {
                    "val": "3.392"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.701"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.252"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.252"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.116"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "SBIR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.440"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "STTR Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.059"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Disestablishment of ASD(NII) Efficiency"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.644"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.644"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011:  Includes Studies Contracts Efficiency – 1.740 million, Service Support Contracts Efficiency -0.531.  Program adjustment -0.701 million.\nFY 2012:  FFRDC Reduction -0.116 million, SBIR Reduction -0.440 million, STTR Reduction -0.059 million.\nFY 2013:  Previous Presidents budget position was in ASD (NII).  The  Disestablishment of ASD(NII) Efficiency - Transfers from ASD(NII) acquisition related functions from ASD (NII) PE 0604771D8Z  8.603 million  and PE 0305199D8Z Net Centricity 12.337 million, PE 0604771D8Z ownership transfers to AT&L with this new balance, Program adjustment  -0.252 million.\n\nStudies contract efficiencies will be realized by reducing the number of studies that we participate in while still supporting enterprise-wide information technology goals critical to DoD Mission.\nService Support Contract efficiencies will be realized by reducing the reliance on DoD Service Support Contractors by utilizing in-house government support in a constrained personnel and resource environment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "771"
                    },
                    "ProjectTitle": {
                        "val": "Link-16 Tactical Data Link (TDL) Transformation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.253"
                        },
                        "CurrentYear": {
                            "val": "16.780"
                        },
                        "BudgetYearOne": {
                            "val": "20.688"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.688"
                        },
                        "BudgetYearTwo": {
                            "val": "21.250"
                        },
                        "BudgetYearThree": {
                            "val": "19.966"
                        },
                        "BudgetYearFour": {
                            "val": "17.855"
                        },
                        "BudgetYearFive": {
                            "val": "18.280"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As a Department efficiency the ASD(NII) has been disestablished.  Starting in FY2013 the funding in ASD(NII) PE 0604771D8Z and PE 0305199D8Z supporting acquisition related functions has been transferred to OUSD(AT&L).\n\nThis funding provides resources for acquisition support and management oversight of critical command, control, communications (C3) and non-intelligence space capabilities as the Department continues its transition to netcentric operations. Funds will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and effect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations. Resources will be allocated for architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3 and non-intelligence space systems. They will also be used to provide expertise required for exercising technical direction over design, performance and cost parameters of key systems and their dependencies. The goal of this funding is to eliminate redundancy, reduce time to the field, evaluate projects and concepts for adherence to net-centric guidelines, minimize performance and operational risk of developing and fielding complex major systems which rely on networks and supporting applications, ensure program dependencies are documented and included in acquisition decisions and address interoperability requirements, gaps and required technical solutions. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies and technical and policy guidance directives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Joint Tactical Information Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.253"
                                            },
                                            "Text": {
                                                "val": "– Joint Aerial Layer Network (JALN) Analysis of Alternatives (AoA):  A JALN AoA study was performed with Service, COCOMs, JCS, and OSD member participation to look at future alternatives to address aerial communications to augment possible limitations to SATCOM in a representative range of scenarios. The study recommended capabilities in the 2012-2020 timeframe with existing systems in the 2012-2015 timeframe, modified and possibly new systems in the 2015-2020 timeframe, and recommendations for future promising technologies 2020+.\n– Joint Initiatives: Advanced Tactical Data Link (ATDL) Assessment Updates: reviewed DoD efforts to develop and test an ATDL with greater system throughput and performance in a jammed environment; assessed Service plans to field aircraft and other platforms with an ATDL; assessed the plan to field gateways to allow aircraft on ATDL to remain interoperable with aircraft that won’t be upgraded, within DoD and Allies; and assessed Allied participation alternatives for ATDL networks.\n– Joint TDES migration: Technical assessment, planning and coordination of joint TDL interoperability and transformation including:  Continued the expansion of the TDES community participation including the incorporation of the ATDL with the associated gateway efforts and the enhanced Joint and Allied partnership within the JTMP process.\n– Net Centric Engineering:  Created the necessary Net Centric architecture and capabilities definition documents to include the following: 1) update Net Centric Architectures to reflect developments in waveform, enterprise services, information assurance, and knowledge management; 2) verify proper network performance; 3) Complete Information FSA analysis;\n– High Data Rate Airborne Terminal (HDRAT) Analysis:  Completed HDRAT analysis.  Conducted SATCOM loading Analysis and ISR Effectiveness Analysis; assess cost and performance of Technical Alternatives. Synthesize findings.\n– Systems Engineering:  Used the Net-Centric Integrated Architecture and modeling and simulation to provide Net Centric input to the Future Force Development Guidance and provide a dynamic behavior of the architecture.  Refined, developed, analyzed future capabilities for advanced waveforms and data links for terrestrials (line-of-sight) and satellite (beyond line-of-sight) systems.  This included detailed engineering analysis of technology alternatives and interoperability.\n– Joint and  International engineering:  Modeled and simulated various coalition aerial networks, showing interoperability between US aircraft in US-only nets, US aircraft in coalition networks, and allied aircraft.\n– Joint Interoperability Enhancement Process (IEP):  Implemented in the Joint community and standardize within Service processes the policy, directives and  the analytic evaluation process to define and plan : 1) expansion of TDES technologies to include tactical information integration and configuration  management 2)  continued to develop policy-based network management preferred system concept and methodology for enterprise situational awareness\n– Data Link Migration Engineering Support:  1) Updated 2010 TDES migration plan 2) developed modeling and simulation capability to support data link technical and operational capability assessments including  integration to other components of the GIG\n– GIG Engineering support:  Developed analytic tools to support technical and performance analysis including :1)  model and simulate various conflict scenarios, showing network performance when transitioning between aerial layer of network and GIG; 2)Updated the IMS to reflect all airborne both manned and UAV platforms as well as ground mobile  networking systems; 3) conducted analysis to verify development of CDL backbone and IA technologies permit rapid, seamless exchange of large ISR data files from tactical edge to GIG and back.\n– Command and Control (C2) Data and Services Strategy Technical Development and Implementation Analysis: Stood up the Adaptive Planning and Execution (APEX) Technical Integration Team. Determined APEX data requirements and sources.\n– C2 Studies and Analysis: Completed the Joint C2 Capability Analysis of Alternatives and gained approval for the Joint C2 Objective Architecture, the  Joint C2 Implementation Plan and the Joint C2 Modernization Plan\n– Strategic Space Environment:  Provided analysis in support of decisions affecting DoD and IC space portfolios.\n– Space Portfolios:  Conducted analysis on emerging and existing technologies used for the space protection technology roadmap and investment strategy. \n– Space Access Technology Roadmap and Investment Strategy:  Provided analysis on emerging and existing technologies used to implement the national space access strategy and the development of Space Protection investment strategy on emerging and existing technologies.\n– Environmental Monitoring Roadmap\/Architecture:  Continued to develop a “Day without Weather” deliverable focusing on impacts to DoD operations with the loss of environmental monitoring capabilities.\n– Space Control Architecture Framework:  Completed the framework to convey current, mid and far-term space control architectures, trades and investments. \n– PNT Mission Assurance (MA) Analysis of Alternatives (AoA):  Provided analysis, assessments and policy formulation towards the development, acquisition, procurement, deployment\/fielding, and operation of all DoD GPS PNT and Navwar systems.\n– Wideband SATCOM Synchronization:  Provided analysis of waveform applications (including High Performance Waveform (HPW), Digital Data Link (DDL), MAINGATE, and 3rd generation Waveforms) and made disposition recommendations; built and maintained approved waveform specification database (SIPR), and applied technical analysis in waveform policy oversight, and develop, coordinate, and maintained Waveform Roadmap.\n– Bandwidth and Spectrum Requirements:  Developed process to evaluate whether proposed programs adequately consider the requirements. \n– Network Management:  Provided technical analysis to include cyber and spectrum issues and develop and network management strategy roadmap and DoD policy.\n– Wireless Architecture and Advanced Technologies:  Conducted analysis, provided communications policy recommendations, applied technical analysis in waveform policy oversight, and developed COMSEC\/TRANSEC guidance for spectrum dependent systems.\n– Common Data Link (CDL) Interference:  Conducted analysis for CENTCOM theater; conducted L-band Interference assessment; and developed Spectrum Technology Radar Roadmap.\n– Strategy Roadmap: Developed roadmap for the integration of spectrum technologies into Spectrum Ten Year Plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.780"
                                            },
                                            "Text": {
                                                "val": "– Line of Sight (LOS) Radio Deep Analysis: Systems engineering support for JTRS and WIN-T evaluations, technical risk assessments and recommendations regarding waveform implementations (WNW, SRW, SINCGARS, HNW), and ground force IP routing network architecture. JNAT modeling and simulation to improve tool performance for predicting LOS network performance and assessing impacts of introductions of new technologies (waveform, apertures, routing protocols)\n– Cyber warfare: Assess technical and operational risks in cyber warfare acquisitions.  Develop DoD acquisition guidance for cyber acquisitions.\n– Advanced Ground\/Air\/ Space Development and Assessment: Support SATCOM architecture analysis, planning and assessments to include Resilient Basis for Satellite Communications in Joint Operations AOA, EA4S Architectures, end to end performance assessments of SATCOM systems in scintillated and anti-jam conditions for different military campaigns and scenarios; Requirements, SWAP, platform integration assessments for eXtended Data Rate (XDR) terminals; strategies, system engineering and design approaches for reducing space and terminal costs.\n– Aerial communications architectures, waveforms, planning: assess efforts to include an assessment of performance in anti-jam Anti-access Area Denial (A2AD) environments; Performance and resilience of aerial networks, and tactical data links for air-sea missions. Program acquisition structure and system engineering approaches for Joint Aerial Layer Network (JALN) programs. Enhance ability to predict performance of network architectures and potential technologies.\n– ALES M&S tool:  Improve tool to capture availability of UAS nodes, UAS body blocking factors, and directional waveforms.\n– Directional apertures:  Assess performance of directional apertures and identify technologies with potential to improve LPI\/LPD and AJ performance and achieve affordable unit production costs. Continue effort  in understanding communications diversity across ground\/air\/space, including network architecture\n– Integrated Master Schedule environment (IMSe) Development & Maintenance:  Manage integrated master schedule to analyze portfolio capability delivery schedules, and key dependencies between programs and architectures. Track key acquisition events - IIPT\/OIPTs, DAES reviews -- and evaluate the impacts of delays in key milestones, test events, production decisions on capability deliveries. Identify key technology dependencies\/opportunities for future capabilities\/requirements\/cost analyses.\n– SATCOM Analysis & Optimization:  Assess SATCOM programs, define new guidance, and perform cost analysis of ongoing SATCOM programs. Recommend commercial technologies and system architectures for opportunities to significantly reduce cost, simplify designs and improve MILSATCOM capabilities. Recommend commercial space vehicle acquisition practices and business models with potential applicability to improve DoD's acquisition practices.\n– Enterprise Services to the Tactical Edge: Characterize  current general performance (BW, latency, jitter, persistence) of Disadvantaged Intermittent Low bandwidth (DIL) tactical links based on measured Soldier Radio Waveform (SRW) and narrowband SATCOM performance. Identify applications and design approaches to deliver useful application experiences over DIL links. Identify security access and identity management solutions suitable to the tactical environment. Provide reports and case studies to support the creation of acquisition guidance for developing\/acquiring applications for the tactical edge environment.   \n– Ground System Networking & Analysis: S upport IIPT\/OIPTs, quarterly assessments, dependencies, performance, requirements and cost analysis, for the Joint Tactical Radio System (JTRS) programs;  provide performance, schedule, and cost analysis of the Mobile User Objective System (MUOS); evaluate the Army's NET Warrior Program.\n– DOD Cyber:  Develop and enhance methodologies for prioritizing requirements, investments, test procedures and acquisition oversight practices for DoD cyber warfare capabilities; Establish and monitor 933 process for conducting cyber program reviews and assessments; Monitor specific cyber threats directed at portfolio programs and ensure adequate cyber defenses are factored into acquisition strategies, system architectures and CONOPS.\n– Net Centric Engineering:  Define the necessary NC architecture and capabilities definition documents. Update NC Architectures to reflect developments in waveform, enterprise services, information assurance, and knowledge management;  Verify proper network performance; Refine Information FSA analysis.\n– GIG Engineering support: Enhance analytic tools to support technical and performance analysis.  Continue to model and simulate various conflict scenarios, showing network performance when transitioning between aerial layer of network and GIG; Update the IMS as programs mature through the acquisition cycle to reflect all airborne both manned and UAV platforms as well as ground mobile networking systems; Conduct additional analysis to validate the development of CDL backbone and IA technologies.\n– System Engineering and Integration Assessment:  Continue to use the NC Integrated Architecture and modeling and simulation to provide NC input to the Future Force Development Guidance and provide a dynamic behavior of the architecture.  This assessment will support aerial layer studies and support to related AoAs. \n– C2 Data and Services Strategy Technical Development and Implementation Analysis: Establish tracking mechanisms to assess C2 data implementation cost and progress; develop process\/metrics to assess value of implementing C2 Core for Joint C2 and APEX; Establish guidance and actionable way ahead to address secure data tagging to support Joint C2 and APEX. Conduct technical\n– studies and analyses to enable development of policy guidance and refinement of specific approaches for implementing the DoD Net-Centric Data and Services Strategies for DoD C2 capabilities.  \n– Command and Control (C2) Enterprise Transition Framework and Technical Reference Model:  Develop a comprehensive data model to support APEX ; Identify and coordinate the tagging and exposure of data to support APEX capabilities.\n– C2 Studies and Analysis: develop appropriate Plan of Action and Milestones (POA&M) to identify necessary steps to implement recommendations from the Joint C2 Capability Analysis of Alternatives (AoA).  That POA&M shall include necessary functional activities, responsible agencies, offices and organizations, timelines for accomplishment, and deliverables. Following completion of the POA&M, ITAC shall assign activities from the POA&M in support of the development of a comprehensive, authoritative Implementation Plan for recommendations from the Joint C2 Capability AoA.  \n– C2 Capability Planning and Implementation Analysis:  Develop a plan of action for implementing the Joint C2 AoA recommendations. The plan of action shall address development of a Joint C2 Management and Governance construct; identification of the Joint C2 Family of Programs and development of a Joint C2 Modernization Plan.    \n– DoD C2 Capability Planning (C2 Capability Delivery Increment (CDI)Technical Development and Analysis):  Develop C2 Capability metrics and mechanisms. Support the C2 Strategic Plan view of C2 Capability Development Increments (CDIs), conduct technical analysis and  develop an interactive data model that converges the currently incompatible data resident in the C2 Registry, Information Support Plans (ISPs), Joint Common Systems Function. Establish Adaptive Planning and Execution (APEX) capabilities-based and technical reference architectures;\n– Space Control and C2 Space Portfolio:  Provide technical, programmatic, and acquisition oversight for portfolio.  Evaluate cost and schedule progress of each program and recommend programmatic changes to increase efficiency. Refine processes under the new acquisition oversight guidelines for space. Develop materials in support of major program milestones and reviews.\n– Space SATOPS and Operationally Responsive Space (ORS) Enterprise Strategy Development and Analysis: Develop DoD SATOPS & ORS Enterprise Strategies. \n– Space Access Technology Roadmap and Investment Strategy: Conduct technical analysis on emerging and existing technologies that could be utilized to implement the national space access strategy and develop technology roadmaps and investment strategy.  \n– Environmental Monitoring Roadmap\/Architecture:  Develop a \"Day without Weather\" Phase II.  Examine the impacts to DoD operations given the loss of different tiers of EM\/METOC capabilities or the failure to continue future development in support of evolving warfighting doctrine and capabilities. \n– DoD Launch Operations Enterprise Strategy Development and Analysis: Develop the DoD Launch Operations Enterprise Strategy. \n– PNT Mission Assurance (MA) Analysis of Alternatives (AoA):  Conduct review of GPS modernization plans and new developments in positioning, navigation and tracking; analyze GPS modernization plan and alternative signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.688"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.688"
                                            },
                                            "Text": {
                                                "val": ") Tool Research.  Investigate using cyber data to improve prediction of future network performance and behavior.  Conduct research into using  live network traffic collected as part of cyber situational awareness monitoring in M&S efforts.  Determine feasibility of data collection and import process.  Evaluate and estimate potential improvements in quality of M&S predicted results.  Develop metrics and techniques for better characterizing resilience in DoD networks.\n– MILSATCOM Planning:  Analyze gaps in space segment, ground segment and terminal rollout schedules.  Evaluate impacts of crypto modernization requirements  Incorporate new technologies assessments into MILSATCOM Planning, Provisioning & Gateway Modernization Roadmap to enable more rapid reprovisioning and geographic centralization of baseband facilities.  Analyze Mobile User Objective System (MUOS) SATCOM system technical challenges and provide independent technical review of terminal and end-to-end network performance specifications.  Develop architectures and technology insertion plans to support move to IP networking in wideband SATCOM systems.\n– Aerial Layer Networking Capabilities:  Inventory and assess most current industry technology developments in directional and anti-jam aerial advanced tactical data links.  Update aerial layer roadmap that addresses JALN AoA recommendations with status and results of RDT&E efforts supporting satellite surrogate connectivity and Anti-jam Anti-Access Aerial Denial (A2AD) communications capabilities.\n– Line of Sight (LOS) Terrestrial Networks:  Produce waveform technology development strategy that incorporates commercial processor update cycles and identifies strategic inflection points where the Department should introduce new waveforms into ground radio systems.\n– Tactical Common Computing Platform Roadmap:  Develop a roadmap that addresses common computing approaches suitable for Disconnected, Intermittent and Long latency (DIL) networking environment.  Reduce unnecessary complexity in tactical computing environments.  Identify common client frameworks, programming models, storage and computational services that can support C2 and Intelligence application programs in DIL situations.  Provide schedules for technology and standards development strategies that produce sufficient technical specificity to be incorporated into acquisition strategies and guidance. \n– DOD Cyber:  Analyze emerging cyber threats in the joint tactical networking space with potential to impede, alter or destroy information being exchanged or stored on connected weapons platforms.  Research and identify improvements to modeling and simulation tools to better characterize network impacts from cyber intrusions and attacks.\n– Joint Command and Control:  Develop Joint Command and Control architecture to enable transition of Global Command and Control Family of Systems to support net-centric joint C2 capability. Provide studies and analysis of the Command and Control (C2) Joint Capability Area (JCA) in response to objectives codified in the DoD C2 Strategic Plan and C2 Implementation Plan. Analyze approaches, potential costs and schedules to establish net-centric C2 capabilities.\n– Adaptive Planning and Execution (APEX): Lead Department effort to manage and integrate APEX acquisition activities. Continue to develop APEX tools, technologies and data roadmap necessary to achieve APEX capabilities.\n– System Engineering and Integration Assessment:  Continue to use the NC Integrated Architecture and modeling and simulation to provide NC input to the Future Force Development Guidance, and provide a dynamic behavior of the architecture.  This assessment will support newly funded air layer programs.\n– Strategic Space Environment:  Continue to provide analysis in support of decisions affecting DoD and IC space portfolios \n– Space Portfolio:  Continue to conduct analysis  on emerging and existing technologies used for the space protection technology roadmap and investment strategy\n– Space Access Technology Roadmap and Investment Strategy:  Continue to conduct analysis on emerging and existing technologies used to implement the national space access strategy and the development of Space Protection investment strategy.  \n– Environmental Monitoring Roadmap\/Architecture:  Continue the development of a “Day without Weather” deliverable focusing on impacts to DoD operations in the event of loss of environmental monitoring capabilities.\n– PNT Mission Assurance (MA) Analysis of Alternatives (AoA):  Continue to provide the analysis, assessments, and policy formulation towards the development, acquisition, procurement, deploy\/fielding, and operation of all DoD GPS PNT and Navwar systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In executing JTDL tasking, existing cost-plus contracts will be utilized.\n-Driven reviews in support of the JCIDS, acquisition and PPBE processes."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Alignment:  Accelerate DoD information age transformation to increase the effectiveness and efficiency of the warfighting, intelligence and business missions.\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Instantiation of enterprise-wide system engineering for the Global Information Grid across DoD\n\n\nPortfolio Management:  Provide for the timely and effective delivery of key Net-Centric capabilities through portfolio management\nMeasures:\n-  Key milestones completed for major net-centric acquisitions \n-  Number of major systems through net-centric event"
                        }
                    }
                }
            ]
        }
    }
}