{
    "id": "762d3c63aedc0f9bdee58066208d398d341f7503",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DISA_JustificationBook_Defense_Information_Systems_Agency_PB_2013.zzz_unzipped_JustificationBook_Defense_Information_Systems_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303153K"
        },
        "ProgramElementTitle": {
            "val": "Defense Spectrum Organization"
        },
        "R1LineItemNumber": {
            "val": "212"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.112"
            },
            "CurrentYear": {
                "val": "28.908"
            },
            "BudgetYearOne": {
                "val": "24.278"
            },
            "BudgetYearOneBase": {
                "val": "24.278"
            },
            "BudgetYearTwo": {
                "val": "17.980"
            },
            "BudgetYearThree": {
                "val": "18.095"
            },
            "BudgetYearFour": {
                "val": "18.057"
            },
            "BudgetYearFive": {
                "val": "18.275"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Electromagnetic Spectrum Management enables information dominance through effective spectrum operations.  In direct support of Combatant Commanders, Assistant Secretary of Defense for Networks and Information Integration (ASD\/NII), Military Services, and Defense Agencies, the Defense Spectrum Organization (DSO), a component of DISA, provides a full array of electromagnetic spectrum services and capabilities, ranging from short notice on-the-ground operational support at the forward edge, to long range planning in pursuit of national strategic objectives.  The DSO is the center of excellence for electromagnetic spectrum analysis and the development of integrated spectrum plans and strategies to address current and future needs for DoD spectrum access.  In addition, DSO serves as DoD's spectrum advocate at national and international forums and conducts extensive outreach to both industry and government.  DSO also implements enterprise spectrum management capabilities to enhance spectrum efficiency and agility to improve spectrum-dependent capabilities in support of United States and Coalition operations.  This includes acquiring, implementing and sustaining the Global Electromagnetic Spectrum Information System (GEMSIS) which provides an integrated catalog of joint net-centric spectrum management tools and services."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.991"
                },
                "CurrentYear": {
                    "val": "29.154"
                },
                "BudgetYearOne": {
                    "val": "24.037"
                },
                "BudgetYearOneBase": {
                    "val": "24.037"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.112"
                },
                "CurrentYear": {
                    "val": "28.908"
                },
                "BudgetYearOne": {
                    "val": "24.278"
                },
                "BudgetYearOneBase": {
                    "val": "24.278"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.879"
                },
                "CurrentYear": {
                    "val": "-0.246"
                },
                "BudgetYearOne": {
                    "val": "0.241"
                },
                "BudgetYearOneBase": {
                    "val": "0.241"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.246"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.879"
                                },
                                "BudgetYearOne": {
                                    "val": "0.241"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.241"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2011 decrease of -$1.879 reflects administrative efficiencies and supports higher Agency priorities.\n\nThe FY 2012 decrease of -$0.246 is due to reprioritizing resources to support higher Agency priorities.\n\nThe FY 2013 increase of +$0.241 reflects inflationary adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "JS1"
                    },
                    "ProjectTitle": {
                        "val": "Joint Spectrum Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.112"
                        },
                        "CurrentYear": {
                            "val": "28.908"
                        },
                        "BudgetYearOne": {
                            "val": "24.278"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.278"
                        },
                        "BudgetYearTwo": {
                            "val": "17.980"
                        },
                        "BudgetYearThree": {
                            "val": "18.095"
                        },
                        "BudgetYearFour": {
                            "val": "18.057"
                        },
                        "BudgetYearFive": {
                            "val": "18.275"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Spectrum Organization’s (DSO) Joint Spectrum Center (JSC) designs, develops, and maintains DoD automated spectrum management systems, evaluation tools, and databases.  The JSC databases are the prime sources of information for DoD use of the Electromagnetic (EM) spectrum.  The JSC provides technical measurement and analysis in support of DoD spectrum policy decisions to ensure the development, acquisition, and operational deployment of systems are compatible with other spectrum dependent systems operating within the same EM environment.  Additional focus is centered on improving future warfighter EM spectrum utilization through technological innovation accomplished by researching, studying, and steering the direction of research and development (R&D) emerging technology efforts from a spectrum perspective.  \n\nDSO’s Global Electromagnetic Spectrum Information System (GEMSIS) is a net centric capability that will provide commanders with an increased common picture of spectrum situational awareness of friendly and hostile forces while transparently deconflicting competing mission requirements for spectrum use.  This capability will enable the transformation from the current preplanned and static assignment strategy into autonomous and adaptive spectrum operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JSC Data and Data Software (formally called Spectrum Knowledge Resources)"
                                    },
                                    "Description": {
                                        "val": "The JSC Data and Data Software (JDADS) program supports development of spectrum modeling and simulation capabilities, spectrum database development, and spectrum data transformation and standardization. This program provides the Combatant Commands and Military Services with the spectrum management tools and associated databases to manage spectrum resources at the strategic and operational level.  It also provides the DoD acquisition community with tools to conduct Electromagnetic Environmental Effects (E3) evaluations and spectrum supportability risk assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.660"
                                            },
                                            "Text": {
                                                "val": "In FY 2011, a version of Joint Data Access Web Server (JDAWS) was developed to improve data sharing with NATO.  This effort implemented interface enhancements to accommodate evolving DoD and NATO spectrum data standard changes.  Also included was the development and initial deployment of the SPECTRUM XXI Online (SXXIO) infrastructure to spectrum managers in the Military Departments (MILDEPs) and COCOMs.  SXXIO capabilities provided a set of enhanced frequency nomination and assignment algorithms and associated default data that affords the opportunity to make more spectrally efficient assignments while precluding co-channel and adjacent signal interference."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.952"
                                            },
                                            "Text": {
                                                "val": "FY 2012 resources are migrating capabilities to new hardware and operating environments and implementing the evolving DoD and NATO spectrum data standard in other aspects of the JDADS program.  Additional background environment data sources are being developed and the program is implementing enhanceed monitoring transactions with Military Departments’ (MILDEPs) systems.  All developed capabilities are being documented and tested by subject matter users before being hosted at a Defense Enterprise Computing Center (DECC) site.  SXXIO continues to be enhanced and deployed to spectrum managers in Combatant Commands (COCOMS).  \n\nThe decrease between FY 2011 and FY 2012 of -$0.708 is due to the reprioritizing of resources to support higher Agency priorities as well as administrative effiecies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.037"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.037"
                                            },
                                            "Text": {
                                                "val": "DoD spectrum data sharing services will be enhanced through implementation of additional regulatory compliance checks and data quality enhancements and improved workflow for data capture.   GEMSIS will continue to build out its suite of spectrum management capabilities with the incorporation of improved assignment and data services.  Improvements to the spectrum supportability risk assessment tool will include user upgrades to the scenario editing capability, “Wizards” to assist novice users with scenario development, and secure remote access by connection to the SIPRNET. \n\nThe increase of $0.085 between FY2012 and FY2013 is an adjustment for inflationary projections."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DoD E3 Program"
                                    },
                                    "Description": {
                                        "val": "The DoD Electromagnetic Environmental Effects (E3) Program supports the Joint Capabilities Integration and Development System (JCIDS) process and the The DoD Electromagnetic Environmental Effects (E3) Program supports the Joint Capabilities Integration and Development System (JCIDS) process and the DoD acquisition process to ensure that E3 control and Spectrum Supportability (SS) are incorporated into the development, testing, and procurement of information technology and National Security Systems. The E3 Program also supports the development of the Joint Ordnance E3 Risk Assessment Database (JOERAD) and Hazards of Electromagnetic Radiation to Ordnance (HERO) electromagnetic environmental effects (EME) surveys in support of the COCOMS and Joint Task Forces (JTF). JOERAD develops algorithms and provides analytical capabilities to perform real-time risk assessments to evaluate platform\/system safety and identify equipment limitations in the operational EM environment. JOERAD enables operators to make critical decisions about the hazards associated with the use of ordnance within complex EM environments. A Spectrum Supportability Risk Assessment (SSRA) is performed by program managers (PMs) and materiel developers (MATDEVs) on all programs that are acquiring or incorporating spectrum-dependent (S-D) systems or equipment per DoDI 4650.1.  The assessment is accomplished with due consideration to regulatory, technical, and operational spectrum and E3 issues and assigned risks.  FY 2012 funds will initiate establishment of a software tool to evaluate electromagnetic environmental effects (E3) and assess spectrum supportability risks of spectrum dependent systems in a realistic operational environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.358"
                                            },
                                            "Text": {
                                                "val": "FY 2011 resources continued the conversion of JOERAD to a network-connected capability, JOERAD 10.0, incorporating data improvements. Three shipboard installations, training and validation of CONUS based emitter complement for JOERAD were also completed in FY 2011 along with HERO Impact Assessments and forward deployed EME surveys. DSO executed approximately 400 critical research\/analysis efforts supporting DoD acquisitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "FY 2012 resources are completing development of JOERAD 10.0 and development of an improved ordnance safety database.  JOERAD 10.0 is undergoing testing prior to deployment and training.  DSO continues to conduct CONUS base emitter surveys for ordnance safety database validation.  DSO is developing enhanced Ordnance radio frequency (RF) safety requirements for DoD. DSO is conducting approximately 400 critical research\/analysis efforts supporting DoD acquisitions.  \n\nThe decrease of -$0.158 between FY 2011 and FY 2012 is the result of administrative effieciences being realized. \n\nThis funding supports DSO initiation of development of the Initial Operational Capability (IOC) version of the E3 Evaluation and Spectrum Supportability Risk Assessment Tool.  This will provide acquisition program managers with the ability to identify and assess an acquisition’s potential to affect the required performance of the newly acquired system or other existing systems within the operational EME.  The IOC version of the SSRA tool is based on Release 3.x of the spectrum modeling and simulation testbed developed under the Spectrum Technology Testbed Initiative (STTI).  These improvements will include developmental efforts focusing on improving the Graphical User Interface (GUI) and the ease of use, improving the mapping tools, and enhancing system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.234"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.234"
                                            },
                                            "Text": {
                                                "val": "FY 2013 resources will support ordnance susceptibility data gathering and improvements to feed automated tools to guide ordnance handling and storage.  DSO will conduct CONUS base emitter surveys for ordnance safety database validation.  DSO will update ordnance radio frequency (RF) safety requirements for DoD.  DSO will execute approximately 400 critical research\/analysis efforts supporting DoD acquisitions.  In FY 2013, DSO will enhance the SSRA tool.  Planned improvements include user requested upgrades to the scenario editing capability, “Wizards” to assist novice users with scenario development, and secure remote access via connection to the SIPRNET.  [Note: SIPRNET access depends on the accreditation of the connection at the ITT Bowie facility.  SIPRNET access will also require a DIACAP accreditation and Authority to Operate. \n\nThe increase of +$0.034 between FY2012 and FY2013 is an adjustment for inflationary projections."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emerging Spectrum Technologies (EST)"
                                    },
                                    "Description": {
                                        "val": "DSO has the responsibility to investigate emerging spectrum related technologies and evaluate their applicability to improve future warfighter EM spectrum utilization through technological innovation.  The goal of the EST program is to identify the opportunities and risks associated with emerging spectrum-related technologies in the early stages of the technology development, influence and lead technology development in order to maximize DoD spectrum utilization, and ensure that spectrum policies incorporate optimal technology to meet DoD mission requirements.  Within EST there has been an increased focus on Dynamic Spectrum Access (DSA).  DSA is realized through wireless networking architectures and technologies that enable wireless devices to dynamically adapt their spectrum access according to criteria such as policy constraints, spectrum availability, propagation environment, and application performance requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.272"
                                            },
                                            "Text": {
                                                "val": "FY 2011 funds focused DSA research on spectrum sharing techniques and interference mitigation approaches in general, and specific to advanced radar systems.  DSA research efforts initiated in FY 2010 were completed.  DSO developed a framework and technical parameters to demonstrate the effective coexistence of DSA enabled radios with legacy systems.  DSO also began developing extensions to evolving DoD and NATO spectrum data standards allowing for control of DSA capable systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.228"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, DSO, in coordination and collaboration with the MILDEPs and the National Telecommunications and Information Administration (NTIA), is initiating development of the revised spectrum certification process for DSA capable systems, including procedures for demonstrating the ability to effectively coexist with legacy systems.  DSO is expanding the coordination between the various entities developing tools for spectrum and network management to ensure that capabilities needed to effectively manage DSA enabled systems are available within those tools. \n\nThe increase of +$2.956 between FY 2011 and FY 2012 supports DSO research into utilizing advanced situational-aware technologies to enable expanded spectrum sharing with commercial systems to mitigate potential impacts from the national broadband expansion, and unlock under-utilized spectrum as recommended in the President’s wireless broadband memo.  DSO continues to track emerging technologies and will publish two Technology Tracking Reports describing spectrum technology implications to DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.169"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.169"
                                            },
                                            "Text": {
                                                "val": "In FY 2013 the DSO EST efforts will identify technology applications and associated transition initiatives to facilitate spectrum sharing in increasingly congested and contested environments, develop requirements for advanced spectrum management-related capabilities to optimize spectrum access through use of ESTs.  DSO will evaluate the implications of EST on existing policy and regulatory paradigms and develop recommendations for changes to promote the use of emerging technologies to make required changes to those paradigms. \n\nThe decrease of -$0.059 between FY 2012 and FY 2013 is due to reduction contractor services in the technology monitoring area."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Data Sharing Capability"
                                    },
                                    "Description": {
                                        "val": "FY 2011 funds initiated establishment of an authoritative data source for the Department’s spectrum management (SM) information and an automated spectrum data capture and quality control process.  The spectrum data enhancement initiated development of the long-term data sharing solution to US Central Command’s (USCENTCOM) Joint Urgent Operational Need (JUON) 06-53745201-00, Radio Frequency Spectrum Management.  This enhancement will:  provide accurate data for automated Counter Radio Electronic Warfare (CREW) deconfliction and spectrum inventory calculation; enable automated data capture; automate data access capabilities; provide business process engines of oversight and quality control; and enable interoperability with NATO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.357"
                                            },
                                            "Text": {
                                                "val": "FY 2011 resources planned and contracted for enhancements to the Spectrum Data Capture tool, Stepstone, to include upgrades to the evolving DoD and NATO spectrum data standard and began to develop a transactional data repository for equipment parameters.  A statistical assessment capability was planned and contracted for the Data Quality Assessments (DQA) capability, federation of E-Space data assets and emerging Global Force Management with common query and service interface capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "During FY 2012 contracts are being executed for the Spectrum Data Capture tool, the Data Quality Assessments (DQA) capability, and federation of external data sources (E-SPACE and GFM).  In addition, funds are transitioning Stepstone to a capability to be hosted on the SIPRNET at a DECC site, and the Joint Spectrum Data Repository (JSDR) Service Interface (SI) is being updated to import data directly from Stepstone to the JSDR.  Business process management work flow is being planned and coordinated with the Service FMOs to manage and track Stepstone records.  Under the DQA effort, the FY 2011 prototype statistical assessment capability is being expanded and a prototype assessment capability is being developed along with supporting Service Interface for Stepstone.  A data default Service Interface is being developed for SXXI-O.  Under the ABAC effort, a prototype implementation of the spectrum ABAC is being pursued in coordination with other DISA elements for application to Stepstone and JSDR to augment the current AKO Single Sign On (SSO) method and provide role based access.  A prototype ABAC attribute database and maintenance capabilities will be developed.  All developed capabilities are tested by subject matter users before being hosted at a DECC site. \n\nThe increase of +$3.143 between FY 2011 and FY 2012 is for the expansion of the prototype statistical assessment capability and expansion of the service interface for Stepstone."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.539"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.539"
                                            },
                                            "Text": {
                                                "val": "The spectrum data capturing tool will continue development to enhance the editor and improve spectrum supportability workflow management capabilities.  Implementation of additional regulatory compliance checks and data quality enhancements across all DSO spectrum database products is also planned.  The Joint Data Access Web Server (JDAWS) tool will implement enhanced query capabilities, as well as, leverage additional DoD and Federal spectrum database sources.  The DoD and NATO spectrum data standard will continue to evolve adding new spectrum data sharing elements of interest to the EW and intelligence communities.  Antiquated manual methods will not keep pace with required op-tempo.\n\nThe decrease of -$1.961 from FY 2012 to FY 2013 is the programmed decrease is planned due to less development effort required."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Electromagnetic Spectrum Information System (GEMSIS)"
                                    },
                                    "Description": {
                                        "val": "The Global Electromagnetic Spectrum Information System (GEMSIS) is a net centric capability that will provide commanders with an increased common picture of spectrum situational awareness of friendly and hostile forces while transparently deconflicting competing mission requirements for spectrum use.  This capability will enable the transformation from the current preplanned and static assignment strategy into autonomous and adaptive spectrum operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.465"
                                            },
                                            "Text": {
                                                "val": "In FY 2011, DSO finalized the GEMSIS Catalog of Services architecture and infrastructure standards and prepared for Milestone B or C for GEMSIS Increment 2.  DSO developed, tested, and deployed HNSWDO version 3.1.5 which allowed transition of HNSWDO to a DECC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.528"
                                            },
                                            "Text": {
                                                "val": "The focus in FY 2012 is on providing Block 1 identified capabilities to provide for an initial Integrated Spectrum Desktop, a net-centric spectrum management capability and access to the Joint Spectrum Data Repository.  \n\nThe increase of +$5.063 in FY 2012, is due to DSO implementing the Increment 2 recommended material alternatives to transition, modify and upgrade, integrate, test, and field to Services, COCOMs and DoD Agencies.  Increment 2 will provide increased capabilities beyond Increment 1 and will significantly enhance the ability to provide end-to-end seamless integration of standardized capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.299"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.299"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, DSO will expand on Increment 2 by implementing Block 2 capabilities which include an improved Integrated Spectrum Desktop, enhanced frequency assignment and spectrum management tools, expand Joint Spectrum Data Repository capabilities and access to web services from the Afloat Electromagnetic Spectrum Operations Program.  \n\nThe decrease of -$2.229 between FY 2012 and FY 2013 is due to completion of initial integration efforts tying functional capabilities into the Integrated Spectrum Desktop."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Common Operating Picture (SCOP)"
                                    },
                                    "Description": {
                                        "val": "Spectrum Common Operating Picture (SCOP) will provide an automated end-to-end capability to pull together all of the spectrum and other related data sets currently used to support spectrum planning and operations, and layer this data to provide a clear visualization of the spectrum environment, similar to how a Geographic Information System (GIS) layers geospatial and related data.  There is no comprehensive automated tool or service available today that allows decision makers to set priorities with the benefit of a common display of timely and relevant spectrum information.  The proposed capability would provide operational and tactical planners and commanders in the field with a comprehensive layered picture of spectrum use through a Service Oriented Architecture-based web service tied to a GIS driven by robust, accurate information.  Current manual and time intensive data gathering, correlation and visualization methods are not responsive to operational requirements and place undue risk to warfighters and mission accomplishment. SCOP will substantially reduce analysis and presentation time, from weeks\/days to minutes\/seconds.  That situational awareness will enable real time decisions based on the area of operation and mission planning factors, resulting in more effective mission planning for the spectrum management community as well as for operations planners, electronic warfare planners, and intelligence collection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "FY 2011 resources completed software development efforts that enhanced the SCOP prototype into a more operationally focused tool.  Efforts addressed development of the visualization engine and web application.  Funds also supported information assurance tasks and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, DSO is deploying the Initial Operational Capability (IOC) version of SCOP to DoD’s spectrum operational community.  \n\nThe decrease of -$0.500 between FY 2011 and FY 2012 is due to reduced software development which will address enhancements required to achieve the Full Operational Capability (FOC) version of SCOP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M, DW\/PE 0303153K"
                                    },
                                    "Title": {
                                        "val": "O&M, DW"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.424"
                                        },
                                        "CurrentYear": {
                                            "val": "41.579"
                                        },
                                        "BudgetYearOne": {
                                            "val": "42.879"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "42.879"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "44.457"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.299"
                                        },
                                        "BudgetYearFour": {
                                            "val": "45.859"
                                        },
                                        "BudgetYearFive": {
                                            "val": "42.607"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Engineering support services for DSO are provided by the use of a contract.  No in-house government capability exists, nor is it practical to develop one that can provide the expertise necessary to fulfill the mission and responsibilities of DSO.  Full and open competition was used for the acquisition of the current contract with ITT Industries, Inc.  GEMSIS' acquisition approach is to obtain capabilities by adopting existing capabilities, buying commercial products, or developing new capabilities by delivering incrementally within the context of a streamlined and adaptive acquisition approach."
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Formal Earned Value Measurement System (EVMS) measures will be applied to large software development efforts\n2.  On-time software version releases\n3.  Software development PCRs closed on schedule\n4.  On-time deployments to users\n5.  Number of spectrum data sources added\n6.  Percent quality improvement of spectrum data\n7.  Percent increase of user access to spectrum data via web services"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ITT Industries, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bowie, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "80.068"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "27.602"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.525"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.525"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services 2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.505"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.345"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.355"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.355"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.212"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.490"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.661"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.998"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.998"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Spectrum XXI Online (SXXIO) Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SXXIO Version Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Joint Ordnance E3 Risk Assessment Database (JOERAD) Version 10.0 Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dynamic Spectrum Access (DSA) Research Projects"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Spectrum Data Sharing Capability Deployments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEMSIS Host Nation Spectrum Worldwide Database Online (HNSWDO) Version 3.1.5 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEMSIS Coalition Joint Spectrum Management Planning Tool (CJSMPT) Version 2.1.2 Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment Two GEMSIS Event"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}