{
    "id": "7712d5e1ac1adc53276b285a55bef3c28c59538d",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA4_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603308A"
        },
        "ProgramElementTitle": {
            "val": "Army Space Systems Integration"
        },
        "R1LineItemNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.845"
            },
            "CurrentYear": {
                "val": "9.763"
            },
            "BudgetYearOne": {
                "val": "9.876"
            },
            "BudgetYearOneBase": {
                "val": "9.876"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "11.648"
            },
            "BudgetYearThree": {
                "val": "11.163"
            },
            "BudgetYearFour": {
                "val": "9.988"
            },
            "BudgetYearFive": {
                "val": "16.115"
            }
        },
        "ProgramElementNote": {
            "val": "Funds stated in the \"Previous President's Budget (FY 2012)\" row in column \"Base FY 2013\" should be 9868 rather than the 23336.  Actual delta placed in \"Adjustments to Budget Years\" row in Column \"Base FY 2013\" should be amended to reflect  -8 rather than -13460.\n\nFunds realigned to higher priority requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "The program element funds space systems integration efforts performed by the US Army Space and Missile Defense Command\/ Army Forces Strategic Command (USASMDC\/ARSTRAT) and the Program Executive Office for Intelligence, Electronic Warfare, and Sensors (PEO IEW&S).\n\nUSASMDC\/ARSTRAT:  Headquarters, Department of the Army General Order Number 37, dated 16 October 2006, designated USASMDC\/ARSTRAT as the Army proponent for space and ground-based midcourse defense (GMD), the Army integrator for global missile defense, and the Army Service Component Command of U.S. Strategic Command (USSTRATCOM).  As such, USASMDC\/ARSTRAT is responsible to develop warfighting concepts, conduct warfighting experiments to validate those concepts, identify capabilities needed to implement the validated concepts, and develop Doctrine, Organization, Training, Material, Leadership & Education, Personnel and Facilities (DOTMLPF) solutions to realize those space related capabilities.  Army Regulation (AR) 10-87 Army Commands, Army Service Component Commands, and the Direct Reporting Units, dated 4 September 2007 and AR 5-22 The Army Force Modernization Proponent System dated 19 August 2009 designates USASMDC\/ARSTRAT as the Army specified proponent for Global Missile Defense and Space\/High Altitude Capabilities.\n\nProject #990 funds USASMDC\/ARSTRAT to integrate warfighting concepts and technologies, validate concepts, and identify capabilities need to implement the validated concepts, and develop DOTMLPF solutions to realize those space and high altitude related capabilities.  Sustains Joint Friendly Force Tracking (J-FFT) Mission Management Center and its associated testbed for both operations and spiral development for 24\/7 Friendly Force Tracking integration into a real-time common operating picture for Combatant Commanders, Joint Task Force Commanders (JTF) and Coalition partners.  The MMC injects real-time J-FFT information into the Common Operating Picture for COCOMs, JTFs and Coalition partners.  USSTRATCOM, in accordance with CJCSI 3910.01 (reference V.4.) is designated one of three coordinating agencies for J-FFT within DoD.  CJCSI 3910.01 directs eight specified tasks to USSTRATCOM.  USSTRATCOM SI 534-5 (reference V.6.) and annually published USSTRATCOM operations orders have designated USASMDC\/ARSTRAT as the lead USSTRATCOM component command for FFT."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.551"
                },
                "CurrentYear": {
                    "val": "9.612"
                },
                "BudgetYearOne": {
                    "val": "23.336"
                },
                "BudgetYearOneBase": {
                    "val": "23.336"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.845"
                },
                "CurrentYear": {
                    "val": "9.763"
                },
                "BudgetYearOne": {
                    "val": "9.876"
                },
                "BudgetYearOneBase": {
                    "val": "9.876"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.294"
                },
                "CurrentYear": {
                    "val": "0.151"
                },
                "BudgetYearOne": {
                    "val": "-13.460"
                },
                "BudgetYearOneBase": {
                    "val": "-13.460"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.178"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.641"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-13.460"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-13.460"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.243"
                                },
                                "CurrentYear": {
                                    "val": "0.151"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "978"
                    },
                    "ProjectTitle": {
                        "val": "SPACE CONTROL"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.614"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2011-2015 funding for the Long Endurance Multi-Intelligence Vehicle (LEMV) was moved from program element (PE) 0603308A to 0305205A.\n\nFY12-16 funding for Space Control Project 978 moved to PE 0604131, Project DT1"
                        },
                        "ProjectMissionDescription": {
                            "val": "Tactical Data Terminals (Space), a Program Office assigned to the PEO for Intelligence, Electronic Warfare, and Sensors (PEO IEW&S)  is developing a mobile, ground-based, tactically-centric space information superiority capability to meet Joint Requirements and validated Training and Doctrine Command (TRADOC) capability gaps.  The system is a forward-deployed platform to generate, receive, monitor, analyze and store satellite communications in direct support of the ground force Commander.  The system is centered on a Modular and Open System Approach (MOSA) that will enhance (less time, less cost) future upgrades to meet emerging space capabilities.  System mobility (using government-off-the-shelf (GOTS) tactical vehicles such as the potential Joint Light Tactical Vehicle (JLTV) or the Mine Resistant Ambush Protected (MRAP)) will enable the system to move to positions of geographical advantage to establish and maintain assured space data access and information superiority in support of Brigade tactical operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Control - Technology Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.614"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed risk reduction and technology maturation of competitive system prototypes to Technology Readiness Level 6. Completed Request for Proposal and prepare to openly compete the Engineering and Manufacturing Development Phase contract.  Funds also were used for Program Management Office support and Security."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Product entered the Technology Development (TD) Phase in 3QFY09 following a successful Material Development Decision and Milestone A.  The Program Office leveraged a Small Business Set Aside Competition to award two competitive prototype contracts.  The Program is managing the competitive prototype contracts and leveraging Army and Other Government Agency Science & Technology efforts to retire maximum risk (cost, schedule, and performance) prior to competing and awarding a contract in support of the Engineering and Manufacturing Development (EMD) Phase.  \n\nIn FY12, the Product Office will complete Developmental Testing for the TD Phase (proving Technology is at TRL 6) and finalize documentation and entry criteria to support a subsequent Milestone B decision.  Intent of the Acquisition Strategy is to capitalize on Open competition for the EMD contract with a goal of maximizing fixed price incentive firm (FPIF) contracts for post Milestone B efforts and firm-fixed-pricing (FFP) for production."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Control - Program and Security Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program Management and Security Oversight"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.271"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Control - Perform design, Development and sub-system integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Competitive Prototypes"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CO, FL, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.723"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Space Control - Perform sub-sytem risk reduction, testing, and validation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "2 X Competitive"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Prototypes: CO, FL, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.277"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Control - Government support and support contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFPLOE"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program Management Office Functions"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AL, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.562"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Control - Test & Evaluation Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Developmental and Operational Testing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.809"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "990"
                    },
                    "ProjectTitle": {
                        "val": "Space and Missile Defense Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.231"
                        },
                        "CurrentYear": {
                            "val": "9.763"
                        },
                        "BudgetYearOne": {
                            "val": "9.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.876"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.648"
                        },
                        "BudgetYearThree": {
                            "val": "11.163"
                        },
                        "BudgetYearFour": {
                            "val": "9.988"
                        },
                        "BudgetYearFive": {
                            "val": "16.115"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 990 funds United States Army Space and Missile Command\/Army Strategic Command (USASMDC\/ARSTRAT) efforts to develop, analyze and mature warfighting concepts, and conduct warfighting experiments for space and high altitude capabilities.  The program also funds development and integration of new data sources and data services into the Joint Friendly Force Tracking Mission Management Center.  The Mission Management Center (MMC) injects real-time Joint Friendly Force Tracking (J-FFT) information into the Common Operating Picture for Combatant Commands (COCOMs), Joint Task Forces (JTFs) and Coalition partners.  USASMDC\/ARSTRAT is the proponent for space \/ high altitude capabilities and is responsible for determining and integrating Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) for the Army. \n\nUSSTRATCOM, in accordance with CJCSI 3910.01 (reference V.4.) is designated one of three coordinating agencies for J-FFT within DOD.  CJCSI 3910.01 directs eight specified tasks to USSTRATCOM.  USSTRATCOM SI 534-5 (reference V.6.) and annually published USSTRATCOM operations orders have designated USASMDC\/ARSTRAT as the lead USSTRATCOM component command for J-FFT."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Architecture Development, Wargames and Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.723"
                                            },
                                            "Text": {
                                                "val": "Continue to plan, develop, and execute architectures and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems.  Represent Army positions and defend Army equities relative in Joint\/DoD and inter-Service activities; e.g., Executive Agent for Space Program Assessments, etc.  Participate and provide support to wargames and experiments where space, high altitude, and missile defense capabilities and technologies can be integrated and evaluated in the most realistic operating environment possible.  This is necessary to ensure that space and high altitude capabilities gaps are identified and capabilities are correctly represented, so that the Army uses of these capabilities are explored.  Develop space modernization strategies and sponsor exploration of future space, high altitude, and missile defense warfighting concepts.  The Future Warfare Center (FWC) will continue efforts to enhance the resiliency and effectiveness of critical space-based assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and High Altitude System Integration and Experimentation"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue experimentation in support of operational responsive space. Complete migration of Space Operations System capabilities to both classified and unclassified Distributed Common Ground System - Army (DCGS-A) variants.  The Future Warfare Center will continue efforts to enhance the resiliency and effectiveness of critical space-based assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concept Development, Wargames and Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.231"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Participated in updates to Army Capstone, Operational and Functional Concepts involving Army systems and operations.  Participated and provided support to all Unified Quest wargames and experiments to ensure that Space and High Altitude capabilities are correctly represented, and those issues with the Army's use of these capabilities are explored."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.240"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to plan, develop, and execute concepts and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems.  Represent Army positions and defend Army equities relative in Joint\/DoD and inter-Service activities; e.g., National Security Space Architect (NSSA) Program Assessments, etc.  Participate and provide support to all Unified Quest and other wargames and experiments to ensure that space and high altitude capabilities gaps are identified and capabilities are correctly represented, so that the Army use of these capabilities are explored. Develop space modernization strategies and sponsor exploration of future space, high altitude, and missile defense warfighting concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technolgy Program Support"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical assistance and evaluation of integrated technologies and collection of lethality data with the Solid State Laster Testbed Experiment (SSLTE) against a variety of static and dynamic targets of interest to the Army, Navy, Air Force and Office Secretary of Defense (OSD), and develop tactics, techniques, and procedures (TTPs) in support of future fielding of High Energy Laser (HEL) weapon systems.  Assist with the integration and evaluation of HEL technologies beginning with Option 1 phase (25-50 kW hardware fabrication and test) of Robust Electric Laser Initiative (RELI) for integration onboard the High Energy Laser Mobile Demonstrator (HELMD) vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Friendly Force Tracking (J-FFT) Testbed"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The J-FFT Testbed will support specific task as directed by STRATCOM.  These tasks include integrating new data sources, hardware and software devices, and data services into the J-FFT Mission Management Center (MMC).  Continue to develop Friendly Force Tracking FFT capabilities for deployed and collation forces including Afghan National Forces.  The Joint Friendly Force Tracking Division coordinates and executes USSTRATCOM-directed FFT tasks in order to assure continuous 24\/7 FFT data services support to authorized users to include the Combatant Commands, the Services, agencies, allies, and coalition partners in order to improve their situational awareness (SA), enhance command and control (C2), and reduce fratricide in combat, homeland defense, civil and contingency operations. Additionally the J-FFT will be used to provide special tracking capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.368"
                                            },
                                            "Text": {
                                                "val": "As enhancements are made to network-enabled command and control systems and other systems are integrated into Combat Commanders friendly force tracking requirements the J-FFT Testbed will be used to integrate hardware and software prior to its deployment to the field.  The FWC will continue to support development of FFT capabilities for deployed and collation forces.  The Joint Friendly Force Tracking Division coordinates and executes USSTRATCOM-directed FFT tasks in order to assure continuous 24\/7 FFT data services support to authorized users to include the Combatant Commands, the Services, agencies, allies, and coalition partners in order to improve their situational awareness (SA), enhance command and control (C2), and reduce fratricide in combat, homeland defense, civil and contingency operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this effort.\n\nE. Performance Metrics\n\nBasic research projects lined to operations concepts or needs.\nSMDC\/ARSTRAT is developing critical enabling technologies.\nLegacy or emerging systems have interoperability solutions identified.\n\n\nF. Major Performer \n \nBAE is under contract to develop software to support integration of new tracking data services into the J-FFT and support special tracking capabilities.  This ensures 24\/7 J-FFT data is available to support Combatant Commanders as coalition forces and technology change."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Enhancement of J-FFT"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Colorado Springs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.029"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.400"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.529"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GOVT SUPPORT & SUPPORT CONTRACTS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various in Colorado Springs CO, Washington DC, and Huntsville AL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "92.940"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.663"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.476"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.476"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Development\/synchronization of Army space and BMD DOTMLPF solutions."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Provide 24\/7 support to Friendly Force Tracking."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}