{
    "id": "7847c3ea865d1a0d2670a1448ce27dcb7ef99549",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineItemNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "41.388"
            },
            "CurrentYear": {
                "val": "46.277"
            },
            "BudgetYearOne": {
                "val": "21.966"
            },
            "BudgetYearOneBase": {
                "val": "21.966"
            },
            "BudgetYearTwo": {
                "val": "22.407"
            },
            "BudgetYearThree": {
                "val": "22.913"
            },
            "BudgetYearFour": {
                "val": "23.610"
            },
            "BudgetYearFive": {
                "val": "23.963"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense-wide Manufacturing Science and Technology (DMS&T), established within the Manufacturing Technology Program directed in Title 10 USC Section 2521, provides the Department with a comprehensive manufacturing program to achieve the strategic goals of focused technology, improved acquisition across the life cycles, and cost-effective logistics.  By designing for manufacturability early in development, anticipated results will have an impact on increasing reliability and decreasing the life cycle burden of weapon systems. The mission to anticipate and close gaps in defense manufacturing capabilities and drive significant system life cycle affordability benefits makes DMS&T an increasingly important leveraging tool in the current budget environment.\n\t\t\t\nDMS&T will: 1) address manufacturing enterprise game-changing initiatives that are beyond the scope of any one Military Department or Defense Agency or platform and, 2) establish and mature cross-cutting manufacturing processes required for transitioning emerging technologies which impact the time lines, affordability, and productivity of acquisition programs and shorten the deployment cycle times.\n\t\t\t\nThe DMS&T program is fundamental to a coordinated development process.  Concurrent development of manufacturing processes with the S&T development enables the use of emerging technologies.  Key technical areas for investment for DMS&T include Advanced Electronics and Optics Manufacturing, Advanced Materials Manufacturing, and Enterprise and Emerging Manufacturing.  Advanced Electronics and Optics addresses advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Advanced Materials addresses advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include the industrial information infrastructure, advanced design\/qualification\/cost tools, supply network integration technologies and management practices, direct digital (or additive) manufacturing, machining; robotics, assembly, and joining."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.916"
                },
                "CurrentYear": {
                    "val": "17.888"
                },
                "BudgetYearOne": {
                    "val": "22.234"
                },
                "BudgetYearOneBase": {
                    "val": "22.234"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.388"
                },
                "CurrentYear": {
                    "val": "46.277"
                },
                "BudgetYearOne": {
                    "val": "21.966"
                },
                "BudgetYearOneBase": {
                    "val": "21.966"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "22.472"
                },
                "CurrentYear": {
                    "val": "28.389"
                },
                "BudgetYearOne": {
                    "val": "-0.268"
                },
                "BudgetYearOneBase": {
                    "val": "-0.268"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.375"
                    },
                    "CurrentYear": {
                        "val": "-0.320"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "30.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.147"
                    },
                    "CurrentYear": {
                        "val": "-1.291"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional add: Industrial Base Innovation Fund"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "24.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Efficiency - Reports, Studies, Boards, and Commissions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Efficiency - Contractor Staff Support"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustments and Other"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                },
                                "BudgetYearOne": {
                                    "val": "0.177"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.177"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "-10% FY 2013-2017"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.445"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.445"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Defense Efficiency – Report, Studies, Boards and Commissions.  As part of the Department of Defense reform agenda, reflects a reduction in the number and cost of reports, studies, DoD Boards and DoD Commissions below the aggregate level reported in the previous budget submission.\n\nDefense Efficiency – Contractor Staff Support.  As part of the Department of Defense reform agenda, reduces funds below the aggregate level reported in the previous budget submission for contracts that augment staff functions.  \n\n-10% FY 2013-2017"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.388"
                        },
                        "CurrentYear": {
                            "val": "46.277"
                        },
                        "BudgetYearOne": {
                            "val": "21.966"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.966"
                        },
                        "BudgetYearTwo": {
                            "val": "22.407"
                        },
                        "BudgetYearThree": {
                            "val": "22.913"
                        },
                        "BudgetYearFour": {
                            "val": "23.610"
                        },
                        "BudgetYearFive": {
                            "val": "23.963"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DMS&T program has a two-pronged approach: 1) technology initiatives and 2) specific single projects.  Technology initiatives, in collaboration with the Joint Defense Manufacturing Technology Panel (JDMTP) and industry, identify and develop investment strategies to advance the manufacturing processes needed to support the specific technology.  Above-the-shop-floor investments focus on new manufacturing processes that have potential to significantly improve manufacturing efficiencies. Single specific projects address investment opportunities not associated with selected technology initiatives and enable the program to respond to urgent, compelling manufacturing needs and provide seed funding to more high risk-high payoff technologies.\n \t\t\t\nData calls are launched through two methods to identify technology initiatives and single specific issues requiring investment.  One method is through the JDMTP.  The JDMTP is comprised of the ManTech Directors from the Services, Defense Logistics Agency, and Office of Secretary of Defense (OSD).  The call is distributed through the ManTech Directors to the four JDMTP sub panels: Metals Processing and Fabrication Subpanel, Composites Processing and Fabrication Subpanel, Electronics Processing and Fabrication Subpanel and Advanced Manufacturing Enterprise Subpanel. Potential candidates are evaluated by the JDMTP based on criteria set forth in the call and announcements and down-selected for further development prior to final selection.  The other method is through Broad Agency Announcements to industry.  Priority is given to investments that support affordability and producibility of critical enabling manufacturing technologies that cut across multiple platforms.  Investments also balance defense priorities in specialty materials, electronics, propulsion and power, and manufacturing processes including \"above the shop floor\" (lean and business technologies facilitating interoperable manufacturing).  Final projects are selected by the OSD ManTech Director, considering input from the JDMTP and Director of Manufacturing, and as approved by Deputy Assistant Secretary of Defense, Manufacturing and Industrial Base Policy (MIBP).  Technology initiatives and projects are executed at the Component level."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Industrial Base Innovation Fund"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "23.878"
                                        },
                                        "Text": {
                                            "val": "Program investments in manufacturing technology that: address urgent operational needs; expand domestic manufacturing capacity; and address concerns over limited competition or reliance on foreign sources for certain defense products.  The IBIF programs all serve to address key defense-wide manufacturing science and technology issues, with the additional requirements of addressing surge and\/or diminishing material source issues.  In addition, these programs have a clear transition path with implementation on a current platform or one undergoing acquisition targeted to be within 2-3 years of project completion.  The following areas of investment were selected for funding and enable advanced manufacturing production improvements for transparent armor, stealth technology, targeting systems and other key joint defense technologies:\n\n•Adaptive Machining – to develop part measurement technology for direct measurement on the tool surface and\/or during machining \n•Automation of Non-destructive Evaluation – to develop automated analysis methods for assessing part quality at reduced labor time and cost\n•Electro-optical Targeting System Producibility – to develop automated technology for the production of a targeting system, reducing cost and hand labor\n•Low Observable Producibility – manufacturing scale-up for stealth technology materials\n•Metals Direct Digital Manufacturing – to advance direct digital manufacturing for metallic structures, reducing lead times for critical parts\n•Optical Windows – to improve manufacturing capabilities for large aluminum oxynitride (ALON) structures for transparent armor and airborne sensors \n•Supply chain Technical Data Package – to increase the ability for smooth operation of the defense industrial base supply chain\n•Connecting American Manufacturing – to create a national-level, integrated framework to enable rapid, high-density, multi-sector brokering between buyers and US suppliers\n\nMultiple platforms will benefit from these programs including joint light tactical vehicles (JLTV), mine resistant ambush protected (MRAP) vehicles, F-35, and the Zumwalt class destroyer (DDG-1000).\n\nBroad agency announcements and requests for proposals sent to industry for the IBIF topics.  Most projects are in the final stages of procurement or have been awarded."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Program investments in manufacturing technology that: address urgent operational needs; expand domestic manufacturing capacity; and address concerns over limited competition or reliance on foreign sources for certain defense products.  The IBIF programs all serve to address key defense-wide manufacturing science and technology issues, with the additional requirements of addressing surge and\/or diminishing material source issues.  In addition, these programs have a clear transition path with implementation on a current platform or one undergoing acquisition targeted to be within 2-3 years of project completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Body Armor"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing:\nWhile current body armor is effective, it is too heavy for some threats, environments, and operations. Even a 10% reduction in system weight would significantly increase warfighter acceptance, mobility, agility, and endurance.  This effort will leverage prior DoD investments to mature three complimentary manufacturing technologies that will reduce body armor weight by 10% - 15% while improving ballistic performance and flexibility. Cost will be reduced 5% - 10% and cycle time will be reduced by 10X-20X. The project will mature three manufacturing technologies for lighter weight armor from a capability to produce the technologies in a laboratory to a capability to produce them in an environment representative of a production facility. The three technologies are: 1) Dissimilar Material Assembly Technology to integrate ceramic, polymer adhesives, composites, and other organic and inorganic constituents into a unified body armor system. 2) Co-consolidation processing, to reduce cost and cycle time for the production of composite material enabling 10% lighter armor while maintaining ballistic performance. 3) Multi-scale modification of ballistic ceramics and associated processes, which will include new additive processes and metallic substrates to improve ballistic integrity and manage adverse shock events due to ballistic impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.145"
                                            },
                                            "Text": {
                                                "val": "Began the optimization of process parameters and developed next-generation tooling.  Planned integration of materials and manufacturing processes into systems for the targeted applications. Processed three nanocomposite batches and evaluated properties."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.149"
                                            },
                                            "Text": {
                                                "val": "Conduct ballistic testing, integrate the most successful technologies, and scale-up to low rate initial production (LRIP) capacity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.588"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.588"
                                            },
                                            "Text": {
                                                "val": "Conduct interlayer materials bonding and assembly.  Develop evaluation parameters and complete ballistic and related testing. Process down select and integration.  Enable LRIP process development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced RF Packaging"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics Manufacturing:  \nThis effort will apply an existing radar system already in production to satisfy a low-cost, open-architecture radar requirement for the Littoral Combat Ship (LCS) program. This program will reduce the cost of the current radar system by ~20% and fit into the existing TRS-3D top side and below decks available footprint. The open architecture configuration will allow upgrades for new technologies over the lifetime of the program as well as offer lower cost via open competition for the radar’s building blocks. Finally, the plastic packaging effort as a part of this program will have a direct impact on the Volume Search Radar (VSR) on CVN-79 – creating an additional $1M\/hull cost savings for the Navy (a total of $51M). Manufacturing technology improvements will have a direct impact on the rate and quantity of this capability delivered to current operations. This effort will provide the Navy with the first truly open architecture radar solution that will be able to accommodate different MMIC technologies, Line Replaceable Unit (LRU) technologies, processor, and power supplies from multiple vendors.  The system will use fiber optics to enhance radar performance, resulting in faster antenna rotation rates (enabling more exposure of targets) and greater flexibility in location of below-desks equipment (allowing a lower center of gravity and thus improved ship stability)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.444"
                                            },
                                            "Text": {
                                                "val": "Yield performance of higher levels of integration for the LRU were evaluated. Focus was on the radar’s open architecture and low cost manufacturing and assembly processes. Initiated development of a Model Based Enterprise (MBE) consisting of integrated “smart models” to ensure supportability and technology refresh. Continued the systems requirements definition phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.992"
                                            },
                                            "Text": {
                                                "val": "Initiate development of a Model Based Enterprise (MBE) consisting of integrated “smart models” to ensure supportability and technology refresh. Continuing the systems requirements definition phase.  At the conclusion of the requirements review, conduct land-based integration and testing of the low-cost radar using the manufacturing technology developed, enhancing the open architecture achievements. Continue to advance the MBE effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.381"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.381"
                                            },
                                            "Text": {
                                                "val": "Complete the land-based integration and testing. Initiate the sub-array string testing. Continue the MBE effort into FY14."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chip Scale Atomic Clock"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics Manufacturing:  \nCommand, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems require precise timekeeping even if the Global Positioning System (GPS) is unavailable. The size, weight, power, and cost components of conventional atomic clocks are too high for tactical applications. Chip Scale Atomic Clock (CSAC) provides improved long-term frequency stability that gets integrated into long-term time accuracy. The focus of this project is to leverage DARPA investments in the CSAC technology to reduce operational costs and transition beyond custom fabrication of the current CSAC.  Objectives include improving the existing batch manufacturing processes such as atomic cell filling, cell sealing, physics package assembly, and sub-system testing to reduce the “touch hours” required for CSAC assembly and testing. Development of a network of multiple vendors to foster competition and ensure a viable supply base is a complementary goal. Current manual assembly processes can produce CSAC in small quantities with low yield at high cost ($8,000 \/ unit).  The DMS&T funding will enable producibility at an affordable cost ($100 – 300 \/ unit). Successful performance will enable an environment of continued operation of critical C4ISR systems, regardless of the presence or absence of GPS. The ability to rapidly reacquire GPS military code in a hostile Electro Magnetic Interference (EMI) environment is an additional targeted benefit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.405"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a production-ready manufacturing process for resonance cell and physics package fabrication on chip scale atomic clocks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.109"
                                            },
                                            "Text": {
                                                "val": "Advance the manufacturing process toward an automated assembly phase, achieving an end-of-project objective of a TRL7 and MRL8. Conduct laboratory testing in relevant environments at the end of each phase, sending samples for system integration and system-level testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.493"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.493"
                                            },
                                            "Text": {
                                                "val": "Complete development of the physics package fabrication process (batch processes\/automated assembly). At completion of Phase II (Jul-Aug 2013), the contractors will each deliver 100 CSACs demonstrating their pilot line capability and validating their readiness for low-rate initial production (MRL 8). CSAC in LRIP quantities will be available to system integrators for DoD products. Implement a transition to the GPS Wing, PEO Command, Control, Communications – Tactical (C3T), PEO Intelligence, Electronic Warfare, and Sensors (IEW&S) and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fiber Placement of Out of Autoclave Composites"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing:\nAn alternative to the traditional use of autoclaves in the production of large carbon fiber composites is Out-of-autoclave (OOA) processing, which uses far less expensive ovens.  Fabrication of large carbon fiber composite parts is limited by the small number of existing large autoclaves that are currently tied up with Boeing 787 and F-35 production.  In addition, the high capital cost of buying large autoclaves is prohibitive.  The ability to use less expensive ovens, coupled with the use of resins at lower cure temperatures, will allow more suppliers to enter the market and fabricate a greater number of larger carbon fiber composite parts at lower costs.  The initial phase of this project focused on the development of the fiber placement process.  The goal is to demonstrate the lay down rates required to meet projected fabrication rates of quality laminates with autoclave-equivalent mechanical performance.  Candidate aircraft for this technology are: Air Force\/Army Joint Future Theatre Lift (C-130 successor) – 180’ wingspan and 140’ fuselage; National Aeronautics and Space Administration (NASA) Ares V - 33’ diameter; Navy P-8 Raked Wing Tip."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.377"
                                            },
                                            "Text": {
                                                "val": "Methods of fabricating out of autoclave composite components via fiber placement were defined for commercially available domestic fiber placement machines; methods were demonstrated on representative aerospace parts.  Techniques were published and distributed throughout the composites supplier base. Contractors completed the analysis of the parts and are continuing to review data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Assisted Sintering Technology"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing:\nThis effort addresses limitations of conventional sintering processes.  Conventional sintering takes from hours to days in a sintering oven, and the beneficial characteristics of nano-structured materials are lost when the material is sintered.  Field Assisted Sintering Technology (FAST) is a new technology that has the potential to dramatically reduce cycle time and manufacturing costs, and to maintain the beneficial characteristics of nano-structured materials. The FAST process passes a pulsed direct current through the part while it is pressed in a die, and the combination of rapid heating and compressive loading results in fine grained, fully dense materials in short processing times that are not possible with conventional sintering processes. Many parts that are made with a powder press and sinter process are candidates for FAST, but this project will focus on ceramic body and vehicle armor, tungsten kinetic energy penetrators, infrared windows, heat sinks for electromagnetic propulsion cooling, and hypersonic and high temperature for enhanced performance jet propulsion. The project will mature the technology, resulting in reduced cost and cycle times for conventional materials, and higher performance for nano-structured materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.722"
                                            },
                                            "Text": {
                                                "val": "Fabricated EFPs (explosively formed penetrators) and components, ballistic tiles, and functional components. Demonstrated experimentally the benefit of WC (Tungsten Carbide) additives for minimizing grain growth in both Ta (Tantalum) and W (Tungsten). Began sintering study on WC-12%Co. Designing molds for mass production by FAST."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.630"
                                            },
                                            "Text": {
                                                "val": "Implement process for full scale components, document material and process specifications, support transition to industry for selected components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.571"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.571"
                                            },
                                            "Text": {
                                                "val": "Fabrication of automated sample handling system, implementation\/testing of automation, optimization of automation system, document process efficiency\/cost savings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Hardening"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics Manufacturing:  \nCurrent F-35 Electro-Optical Targeting System (EOTS) and Electro-Optical Distributed Aperture System (EODAS) focal plane arrays (FPAs) are vulnerable to jamming and damage from enemy lasers.  In addition, these FPAs are suffering manufacturing yield and cost issues.  This effort will leverage prior and concurrent DoD investments to make manufacturing improvements that incorporate laser protection technology into the FPA’s Read-Out Integrated Circuits (ROICs) while concurrently reducing ROIC defects and cost, and increasing size and yield.  The TRL will increase to 6 and the program will demonstrate the capability to produce a prototype in a production environment. The goal is to transition laser-hardened FPAs in time for the F-35 Block 5 Upgrade.  These technologies are applicable to any Medium Wavelength Infrared detector, including those on tactical and reconnaissance sensor systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.080"
                                            },
                                            "Text": {
                                                "val": "Completed the initial MRA. Continued efforts to address FPA damage through enhancement of the ROIC detector, incorporating design changes simultaneously with wafer scale-up to increase manufacturability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.409"
                                            },
                                            "Text": {
                                                "val": "Continue wafer size enhancements and defect reduction work. Initiate an FPA production scale-up effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.953"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.953"
                                            },
                                            "Text": {
                                                "val": "Conclude FPA production scale-up activities, achieving a TRL6\/MRL6 level by 4Q-FY13. Make available a Hardened EOTS FPA (by Q2-FY13) and a Hardened EODAS FPA (Q4-FY13). Continue a systems engineering study on targeting and warning. Conduct transitional activities in preparation for the F-35 Block 5 Upgrade decision point (scheduled for FY14)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Large Affordable Substrates"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics Manufacturing:  \nHigh performance infrared (IR) focal plane arrays (FPAs) are grown on Cadmium Zinc Telluride (CZT) substrates that are currently only available in relatively small wafer sizes (6cm x 6cm) from a single foreign source. This effort will leverage prior and concurrent Department of Defense (DoD) investments to enable a domestic source to manufacture 12cm x 12cm CZT substrates. The results will be reduced cost and assured availability of CZT substrates that will enable affordable, high performance ground and air IR sensor systems with rapid wide area search, long range ID, and dual band multispectral aided target detection capability against difficult targets while on-the-move.  Large, affordable CZT substrates from a domestic source will initially transition on FPAs for the 3rd Gen FLIR Engine Engineering Manufacturing Development program, to be followed by multiple transitions to other DoD weapon systems including the Army’s Common Sensor Payload, Air Force’s High Stare, Missile Defense Agency’s SM-3 Programs, and also rapid Prototype Systems (LRAS3) to be deployed in theatre."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.675"
                                            },
                                            "Text": {
                                                "val": "Conducted tradeoffs, selected initial process improvement targets for boule growth and substrate surface finish, and completed baseline lots through array fabrication. Supplied a 5x5 cm substrate for fabrication of an adaptable focal plane array.  Initiated processing to increase boule diameters to 125 mm. Applying detector architecture and sensor chip assembly concepts to develop a camera system to be employed in lab\/flight testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.039"
                                            },
                                            "Text": {
                                                "val": "Complete boule growth process improvements and initial surface finish. Complete baseline lots through FPA testing. Enhance wafer sizes to 9x9 cm from 125 mm diameter boules. Continue efforts toward a TRL\/MRL target of 6\/7 and commencement of low rate production in FY13."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.635"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.635"
                                            },
                                            "Text": {
                                                "val": "Complete boule yield (diameters to 150 mm) and polishing yield initiatives. Fabricate 9x9 cm wafers from 150 mm boules.  Initiate a Low Rate Production status. Conduct a final demonstration of the product. Obtain a TRL6\/MRL7 level. Participate in a 3rd Gen Forward Looking Infrared Radar - Software Development and Demonstration build (in 3Q- FY13), using substrates from the 150 mm boules."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Manufacturing of Aerospace Structures"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing:\nThere is a strong need to fabricate timely and affordable aerospace structures in a production environment for rapid fielding of materials and systems to serve the defense manufacturing base.  An example of a system that could benefit from direct part manufacturing (DPM) is one in which there are multiple, complex, embedded systems, such as air flow control actuators within an inlet duct.  This demonstration will involve design, fabrication, testing and analysis of performance, manufacturability and maintainability.  Other designs such as conformal lattice structures, with high strength and low mass, are highly advantageous for micro air vehicle designs, but may only be successfully manufactured using methods such as direct digital manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.513"
                                            },
                                            "Text": {
                                                "val": "Advanced process stability and demonstrated improved process control and material properties.  Software development was completed for easy design and fabrication of conformal lattice structures.  A fuselage and wings for a small remotely piloted aircraft was fabricated.  An inlet duct for a remotely piloted vehicle (RPV) with active flow control components was designed.  Active flow control inserts were fabricated using selective laser sintering and fused deposition modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.627"
                                            },
                                            "Text": {
                                                "val": "Further iterations of demonstration articles will continue to validate the ability of rapid manufacturing techniques to fabricate timely affordable structural components.  The full composite inlet duct with active flow control will be fabricated and tested."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Carbon Nanotube Cable"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing:\nThere are increasing demands on platform electric power generation and distribution, and issues with copper current limits, weight, and thermal management. Efficient and lightweight power generation and transmission are required for megawatt directed energy weapons and electric launch systems. Seeking the solution will provide reduced weight in signal and power cables, enable increased use of ISR sensors, enable higher frequency power systems, which are inherently lighter weight.  Increase throughput of CNT wire and sheet systems through in-situ quality controls, enable rail gun and directed energy systems, and enable long distance power distribution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.488"
                                            },
                                            "Text": {
                                                "val": "The high-throughput CNT furnace underwent qualification testing.  Pure CNT conductors ranging from 0.125” to 0.5” were produced from CNT sheet material.  Samples were electroplated on each end and tested at increasing current loads.  Accomplished multiple manufacturing process improvements including an in-situ, non-contact conductivity gauge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics and Optics"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics is a series of efforts addressing advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  These efforts will provide significant productivity and efficiency gains in the defense manufacturing base.  These manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nOne significant issue is the need to move toward lead-free electronics.  However, current methods to produce lead-free solder create further issues such as the formation of unwanted tin whisker structures, which can cause electronics to short out.  The Tin Whisker Mitigation project will demonstrate controlled grain structure in soldered joints and plated surfaces.  The objective is to show significantly reduced or completely prevented tin whisker growth, while maintaining the original performance characteristics of the test components.\n\nAnother emerging manufacturing technology undergoing development is for Silicon Carbide High Efficiency Power Switches to enable a new class of power electronics that allows flexible new architectures at higher voltages, higher frequencies, less volume \/ weight, higher temperatures, higher efficiency (reduced fuel consumption), and better power quality for PEO GCS and the AMDR Radar Power Conversion Module.\n\nFuture efforts will focus on advances in fuel cells, radars, conformal sensors, and solder free electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.264"
                                            },
                                            "Text": {
                                                "val": "Studies of advanced manufacturing needs in electronics to permit efficient execution of FY12 Silicon Carbide High Efficiency Power Switches efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.315"
                                            },
                                            "Text": {
                                                "val": "Award the Tin Whisker Mitigation and the Silicon Carbide High Efficiency Power Switches programs.  Perform feasibility tests on the lead-free joints and plates to demonstrate elimination of tin whiskers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.762"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.762"
                                            },
                                            "Text": {
                                                "val": "Develop manufacturing technologies to Increase throughput and decrease cost of SiC power devices through enhanced material growth and high-yield device fabrication processes"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing is a series of efforts addressing advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  These efforts will provide significant productivity and efficiency gains in the defense manufacturing base.  These manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nEmerging manufacturing technologies undergoing development include:  Large Scale Demonstration of Fiber Placement for Out of Autoclave Composites to enable the manufacture of very large composite parts for mobility aircraft without the need for an autoclave; Cast Eglin Steel to enable the MRAP current steel hull underbody to meet the objective threat; Net Shape Field Assisted Sintering to enable fully dense ultra high temperature ceramics for non-eroding dual pulse nozzles for future missiles and leading edges for hypersonic vehicles; and Cold Spray deposition of metal alloys to enable repair instead of replacement magnesium components for helicopters; rapid and precise application of thermoplastic materials for filling of fasteners applied via ultrasound or hot melt (near term benefit to JSF).\n\nFuture efforts will focus on manufacturing of materials for ballistic survivability and manufacturing of materials for rapid fabrication of structural components."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.180"
                                            },
                                            "Text": {
                                                "val": "Award programs in Cast Eglin Steel, Net Shape Field Assisted Sintering, and Fastener Fill."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.875"
                                            },
                                            "Text": {
                                                "val": "Award programs in Cold Spray deposition.  Establish the material specification limits for Cast Eglin steel in accordance with these applications.  Begin demonstrations of Net Shape Field Assisted Sintering with refractory rare earth materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise and Emerging Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Enterprise and Emerging Manufacturing is a series of efforts addressing advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include direct digital (or additive) manufacturing, advanced manufacturing enterprise, machining, robotics, assembly, and joining.  These manufacturing technologies and enterprise business practices will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nEmerging manufacturing technologies undergoing development include:  Hybrid Direct Digital Manufacturing which combines conventional polymer deposition processes such as selective laser sintering with direct write methods to create embedded components, such as antenna or sensors; Advanced Manufacturing Enterprise projects such as Technical Data Package for the Digital Enterprise, which seeks to develop the methods for exchange of 3D official technical data throughout the supply chain and between government and contractors.\n\nFuture efforts will focus on advances in direct digital manufacturing for polymers, metals, and electronics; and joining of dissimilar materials for a variety of DoD applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.397"
                                            },
                                            "Text": {
                                                "val": "Requirements Based Cost Modeling System"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.827"
                                            },
                                            "Text": {
                                                "val": "Award programs in Hybrid Direct Digital Manufacturing, Adaptive Digital Manufacturing, and Advanced Manufacturing Enterprise"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.708"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.708"
                                            },
                                            "Text": {
                                                "val": "Begin fabrication and testing of hybrid direct digital manufacturing test specimens, develop initial processes to integrate electronic elements and sensors into thin film transistor arrays. Establish critical information needed for data exchange between supply chain members for the fabrication of components for defense systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680F"
                                    },
                                    "Title": {
                                        "val": "Air Force ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7)  0708045A"
                                    },
                                    "Title": {
                                        "val": "Army ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011N"
                                    },
                                    "Title": {
                                        "val": "Navy ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011S"
                                    },
                                    "Title": {
                                        "val": "DLA ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item. Outyear data for \"Other Program Funding\" is contained within the Service budgets."
                        },
                        "PerformanceMetrics": {
                            "val": "The majority of project performance metrics are specific to each effort and include measures identified in the project plans.  The metrics include items such as target dates from project work break down schedules, production measures, production goals, production numbers and demonstration goals and dates. In addition, generic performance metrics applicable to the Manufacturing Science and Technology (MS&T) program includes attainment of previous administration goal, \"Speed technology transition focused on warfighting needs\".  The metrics for this objective and the objective of MS&T is to transition 30% of completing demonstrations program per year.  Due to the relatively new time frame of the MS&T program, transition rates for completed efforts for this new project are not available yet."
                        }
                    }
                }
            ]
        }
    }
}