{
    "id": "7c0aeb24632948de59735bdddef69766a3a193ff",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603287E"
        },
        "ProgramElementTitle": {
            "val": "SPACE PROGRAMS AND TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "88.777"
            },
            "CurrentYear": {
                "val": "97.541"
            },
            "BudgetYearOne": {
                "val": "159.704"
            },
            "BudgetYearOneBase": {
                "val": "159.704"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "232.546"
            },
            "BudgetYearThree": {
                "val": "234.308"
            },
            "BudgetYearFour": {
                "val": "225.308"
            },
            "BudgetYearFive": {
                "val": "194.186"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential attacks, a proliferation of assets to provide robustness against attack, ready access to space, the ability to neutralize man-made space environments, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space allows the delivery of defensive systems and replenishment supplies to orbit.  An infrastructure to service the mission spacecraft allows defensive actions to be taken without limiting mission lifetime.  In addition, developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing processes; precision control of multi-payload systems, and payload isolation and pointing systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.130"
                },
                "CurrentYear": {
                    "val": "97.541"
                },
                "BudgetYearOne": {
                    "val": "138.704"
                },
                "BudgetYearOneBase": {
                    "val": "138.704"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.777"
                },
                "CurrentYear": {
                    "val": "97.541"
                },
                "BudgetYearOne": {
                    "val": "159.704"
                },
                "BudgetYearOneBase": {
                    "val": "159.704"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.353"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "21.000"
                },
                "BudgetYearOneBase": {
                    "val": "21.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.499"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-8.328"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.526"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "21.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "21.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Decrease reflects reductions for the Section 8117 Economic Adjustment, the SBIR\/STTR transfer and rescissions offset by internal below threshold reprogrammings. \nFY 2013:  Increase reflects expansion of space programs addressing access, domain awareness and new servicing technologies."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SPC-01"
                    },
                    "ProjectTitle": {
                        "val": "SPACE PROGRAMS AND TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "88.777"
                        },
                        "CurrentYear": {
                            "val": "97.541"
                        },
                        "BudgetYearOne": {
                            "val": "159.704"
                        },
                        "BudgetYearOneBase": {
                            "val": "159.704"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "232.546"
                        },
                        "BudgetYearThree": {
                            "val": "234.308"
                        },
                        "BudgetYearFour": {
                            "val": "225.308"
                        },
                        "BudgetYearFive": {
                            "val": "194.186"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential attacks, a proliferation of assets to provide robustness against attack, ready access to space, the ability to neutralize man-made space environments, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space allows the delivery of defensive systems and replenishment supplies to orbit.  An infrastructure to service the mission spacecraft allows defensive actions to be taken without limiting mission lifetime.  In addition, developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing processes; precision control of multi-payload systems, and payload isolation and pointing systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System F6"
                                    },
                                    "Description": {
                                        "val": "The objective of the System F6 program is to demonstrate the feasibility and benefits of a satellite architecture wherein the functionality of a traditional \"monolithic\" spacecraft is replaced by a cluster of wirelessly-interconnected spacecraft modules.  Each such \"fractionated\" module would contribute a unique capability, for example, computation and data handling, communications relay, guidance and navigation, payload sensing, or it can replicate the capability of another module.  The fractionated modules would fly in a loose, proximate cluster orbit capable of semi-autonomous reconfiguration or a rapid defensive scatter\/re-gather maneuver.  Critical to this architecture is a robust, system-level approach to ensuring security, integrity, and availability, while implementing authentication and non-repudiation.  While delivering a comparable mission capability to a monolithic spacecraft, System F6 significantly enhances architectural and programmatic adaptability and robustness-reducing risk through the mission life and spacecraft development cycle, enabling incremental deployment of the system, and enhancing survivability.  The System F6 architecture provides valuable options to decision makers throughout the life cycle development of future space systems that are absent in present-day monolithic architectures.\n\nThe System F6 program will culminate in an on-orbit demonstration of a multi-module space system incorporating the F6 Technology Package (F6TP) - a suite of technologies, components, and algorithms that enables semi-autonomous multi-body cluster flight and secure, distributed, real-time sharing of various spacecraft resources at the cluster level.  Multiple versions of the F6 Technology Package will be developed on the basis of open-source interface standards, software, and reference designs termed the F6 Developer's Kit.  The on-orbit demonstration will be capable of accommodating one or more spacecraft payload modules supplied by a third-party mission partner.  Residual capability to support future payloads with the existing on-orbit infrastructure will also remain following the demonstration, and the infrastructure can be upgraded for a perpetual on-orbit resource capability.  The utility of the F6 architecture in low earth orbit (LEO) is significantly enabled by persistent broadband connectivity to the ground which allows resource sharing between space-based modules and terrestrial network nodes.  A solution to enable high-availability, low-latency, persistent, high-bandwidth communications with LEO spacecraft will be developed in the course of the F6 program.  The anticipated transition partner is the Air Force, though the architecture will have the ability to simultaneously accommodate payloads from multiple other partners including the Army and Navy.  The resultant architecture is expected to significantly lower the barrier to entry and enhance competiveness of the national security space industrial base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed a series of value-centric satellite architecting wargames comparing traditional DoD acquisition processes vs. new analytic tools and metrics.\n-  Continued development of open-source interface standards, software, and reference hardware models for the F6 Developer's Kit (FDK).\n-  Conducted Preliminary Design Review for the persistent broadband terrestrial connectivity solution for LEO fractionated clusters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete parametric model analyses and review of initial standards.\n-  Commence development of the F6 Tech Package (F6TP).\n-  Complete FDK software development and fabrication of prototype wireless transceivers.\n-  Release beta version of the FDK.\n-  Conduct preliminary design review for the F6TP.\n-  Release solicitation for demonstration spacecraft buses and launch vehicles.\n-  Perform end-to-end hardware-in-the-loop testing of the persistent broadband terrestrial connectivity solution for LEO fractionated clusters.\n-  Conduct Critical Design Review (CDR) for the persistent broadband terrestrial connectivity solution for LEO fractionated clusters.\n-  Take delivery of engineering model of the persistent broadband terrestrial connectivity solution for LEO fractionated clusters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete final release of the FDK.\n-  Complete a fully-functional, polished, well-documented, user-friendly design tool for adaptable fractionated space systems.\n-  Conduct CDR for the F6 Technology Package.\n-  Take delivery of the engineering development unit of the F6TP.\n-  Take delivery of flight unit of the persistent broadband terrestrial connectivity terminal for LEO fractionated clusters.\n-  Initiate procurement of spacecraft buses for F6 on-orbit demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airborne Launch Assist Space Access (ALASA)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Horizontal Launch\n\nThe goal of the Airborne Launch Assist Space Access (ALASA) program is to mature and demonstrate technologies for cost effective, routine, reliable, horizontal access to low earth orbit (LEO).  ALASA seeks improvements in cost, responsiveness, flexibility, and resilience with a single approach.  ALASA will enable small satellites to be deployed to orbit from an airborne platform, allowing performance improvement, reducing range costs, and flying more frequently, which drives cost per pound down.  The ability to relocate and launch from virtually any major runway around the globe reduces the time needed to deploy a satellite system.  Launch point offset permits essentially any possible orbit direction to be achieved without concerns for launch direction imposed by geography.  Finally, launch point offset allows the entire operation to be moved should a particular fixed airfield become unavailable due to natural phenomena or other issues.  Challenges include, but are not limited to: in-air separation of aircraft and orbit-insertion launch stages, development of alternatives to current range processes, control of weight and margin under a hard gross weight limit, and achieving a cost of $1 million, including range support costs, to deploy satellites on the order of 100 lb.  The anticipated transition partner is the U.S. Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted market\/business case analysis for horizontal launch concepts.\n-  Analyzed alternative infrastructure options including cost considerations.\n-  Determined preliminary mission architecture and technology trade space to enable horizontal launch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform conceptual design of selected architecture focusing on key technology gaps.\n-  Initiate preliminary design.\n-  Develop and mature related enabling and enhancing technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial test plans for flight demonstrator.\n-  Complete risk management plan.\n-  Conduct preliminary design review and select enabling and enhancing technologies for incorporation into system concepts.\n-  Conduct critical design review and initiate detailed design.\n-  Integrate selected enabling and enhancing technologies on launch assist aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Domain Awareness (SDA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Space Domain Awareness (SDA) program is to develop and demonstrate an operational framework and responsive defense application to enhance the availability of vulnerable space-based communications resources.  SDA will investigate revolutionary technologies in two areas: 1) advanced space surveillance sensors to better detect, track, and characterize space objects, with an emphasis on deep space objects, and 2) space surveillance data processing\/data fusion to provide automated data synergy, to increase space domain awareness, overall space safety of flight, and ultimately to allow space operators to make informed, timely decisions.  Current space surveillance sensors cannot detect, track, or determine the future location and threat potential of small advanced technology spacecraft in deep space orbits, where a majority of DoD spacecraft are located.  Additionally, servicing missions to geosynchronous (GEO) orbits will require exquisite situational awareness, from ultra high-accuracy debris tracking for mission assurance at GEO orbits to high resolution imaging of GEO spacecraft for service mission planning.  The SDA program will leverage data fusion and advanced algorithms developed under the Space Surveillance Telescope (SST) program, as well as seek to exploit new ground-breaking technologies across the electromagnetic spectrum and utilize already existing sensor technology in non-traditional or exotic ways, to bring advanced capabilities to the space domain.  SDA will correlate a wide range of operational support and space system user data to rapidly identify threat activities, propose mitigating countermeasures, and verify the effectiveness of selected responses.  Critical technologies include accessing disparate sources of relevant data, model-based situational awareness, and candidate response generation and evaluation.  Particular emphasis will be placed on the ability to continuously adapt to changes in defended system components and usage patterns as well as validation of system integrity.  The potential transition customer is the Air Force.\n\nEfficient collection of data for SDA is crucial to controlling costs.  SDA will demonstrate new approaches to collection of data utilizing a variety of collection modalities, ranging from fusion of observations from amateur astronomers, to evaluation of sparse aperture imaging techniques.  The first sparse aperture demonstration is Galileo.  This effort will develop technology to image a Geosynchronous Earth Orbit (GEO) satellite from the ground.  Galileo will utilize fixed mobile telescopes, each with adaptive optics and a guide star, to create multiple baselines that can be used to reconstruct the image through an inverse Fourier transform.  The concept is similar to existing astronomic interferometers, except Galileo will extend the basic interferometric technology to utilize fiber optic transport of light between each telescope to match the optical path length instead of the traditional evacuated light tubes.  Technical challenges include: controlling thermal effects and disperation within the fiber to properly interfere the light from the two telescopes, and precisely measuring the distance between the fixed and mobile telescope systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Surveyed existing systems and identified critical technology gaps.\n-  Initiated data fusion modeling effort to determine limitations of currently developed algorithms.\n-  Completed investigations into using a dynamic track graph algorithmic approach to achieve timely cataloging of breakups and collisions.\n-  Evaluated high resolution passive imaging of GEO satellites using incoherent intensity correlation imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct intensity correlation imaging study final review.\n-  Develop prototype next-generation collaborative space information fusion center to provide a revolutionary approach to integrating, collaborating and visualizing complex space system and environmental data, enabling operators to make informed decisions to protect critical space capabilities; concepts to be explored include intuitive applications and adaptive understanding.\n-  Develop architecture for low cost space situational awareness (SSA) data sources.\n-  Develop additional SSA data integration algorithms to incorporate cyber initiatives into the space information fusion center.\n-  Expand the concept of dynamically tasked sensors so that the entire SSA network is continuously optimized and capable of responding to any highlighted space threat.\n-  Develop requirements and designs for the Galileo mobile telescope and fiber control system.\n-  Develop plans to integrate the Galileo mobile telescope and fiber control into a single proof-of-concept demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the advantages of a having a collaborative network of users with access to data from numerous distributed sensors over the traditional sensor-centric architecture.\n-  Demonstrate intuitive applications and adaptive understanding capabilities of the next-generation space information fusion center.\n-  Build, test, and deploy the Galileo mobile telescope system.\n-  Build, test, and deploy the Galileo fiber control system.\n-  Integrate the Galileo systems and perform an imaging campaign for a 10cm spatial resolution image of an 11 Mv GEO satellite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Surveillance Telescope (SST)"
                                    },
                                    "Description": {
                                        "val": "The Space Surveillance Telescope (SST) program will develop and demonstrate an advanced ground-based optical system to enable detection and tracking of faint objects in space, while providing rapid, wide-area search capability.  A major goal of the SST program is to develop the technology for large curved focal surface array sensors to enable an innovative telescope design combining high detection sensitivity, short focal length, wide field of view, and rapid step-and-settle to provide orders of magnitude improvements in space surveillance.  This capability will enable ground-based detection of un-cued objects in deep space for purposes such as asteroid detection and space defense missions.  The Air Force will participate in the DARPA funded developmental testing of SST and then take over operation of SST as a sensor in the Air Force Space Surveillance Network.  A  memorandum of agreement  has been established with Air Force Space Command (AFSPC) for transition.  The program is also investigating expanding the demonstration of the telescope to explore detection and tracking of broader classes of space objects under different orbital regimes, and the impact of observations from different environments. \n\nIn addition, the program will investigate data fusion and advanced algorithms for correlation of unknown objects.  SST is expected to generate a large number of uncorrelated targets (UCTs), and new methods will need to be employed to rapidly characterize and attribute the new objects.  Furthermore, the program will investigate methods which combine observations from disparate sensors (such as optical and radar installations) to more rapidly, accurately, and completely provide knowledge about UCTs, as compared to the existing system where no data fusion is employed.  Where appropriate, SST will investigate new concepts which would provide complementary or further advances in ground-based deep space object detection and characterization.  This data fusion effort is called Ibex."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.840"
                                            },
                                            "Text": {
                                                "val": "-  Finished optics integration on site.\n-  Completed integration of sensor subsystem into telescope.\n-  Integrated camera and data processing subsystems at site.\n-  Completed initial alignment of full SST system (\"First Light\").\n-  Completed site acceptance testing of telescope.\n-  Integrated facilities control software for fine focus and alignment.\n-  Investigated data processing algorithms to enhance contribution of SST data to space situational awareness (SSA).\n-  Investigated data fusion capabilities to enhance SSA through use of multiple optical sensors for multi-static observations and track handoffs.\n-  Commenced packaging of available imagers to construct backup wide field camera for the system.\n-  Developed UCT handling procedure with AFSPC to convey SST search results to the Space Surveillance Network in timely and useable manner."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.041"
                                            },
                                            "Text": {
                                                "val": "-  Complete final technical demonstration of SST system performance; evaluate demonstration activities and SST mission functionality. \n-  Conduct systems requirement review for the Ibex data fusion effort.\n-  Conduct Ibex preliminary and critical design reviews.\n-  Develop initial Ibex capability packages.\n-  Perform first of two Ibex capability demonstrations.\n-  Conduct preliminary investigation of locating the SST in more operationally relevant location in order to perform a more in-depth demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.204"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.204"
                                            },
                                            "Text": {
                                                "val": "-  Refine Ibex capability packages.\n-  Conduct second Ibex demonstration.\n-  Transition Ibex services to users.\n-  Complete investigation and planning for optimal SST location."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Phoenix*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Manned Geostationary Earth Orbit Servicing (MGS)\n\nTo date, servicing operations have not been conducted on spacecraft beyond low earth orbit (LEO).  A large number of national security and commercial space systems operate at GEO altitudes, furthermore, many end-of-life or failed spacecraft drift without control through portions of the GEO belt, creating a growing hazard to operational spacecraft.  Technologies for servicing of spacecraft with the expectation such servicing would involve a mix of highly autonomous and remotely (i.e., ground-based) teleoperated robotic systems have been previously pursued.  The Phoenix servicing program will build upon these legacy technologies, tackling the more complex GEO environment.  The program seeks to repurpose high value long life components on existing satellites in GEO, in full collaboration and cooperation with existing satellite owners, utilizing commercial ridealong capability to send small packaged systems into GEO for use in upgrading, fixing, repairing, and enhancing  the repurposed components.  Key challenges include transportation and orbital maneuvering, robotic systems and integration, and extravehicular tool requirements.  The anticipated transition partner is the U.S. Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Identified and evaluated flight\/ground servicing experience, satellite failures, and candidate servicing missions.\n-  Defined preliminary mission architecture and technology trade space to enable robotic GEO servicing missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Perform conceptual mission design and feasibility studies.\n-  Perform conceptual design of selected demonstration mission, focusing on system architecture and key technology gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.000"
                                            },
                                            "Text": {
                                                "val": "- Prepare preliminary design of robotic servicing system.\n- Develop payload orbital delivery systems (PODS) designs for commercial satellite ridealong.\n- Initiate flight scale build of first PODS.\n- Initiate development and build of robotic servicing components.\n- Initiate six degree of freedom testbed on ground; begin virtual system testing.\n- Build first prototype of sensor suite for guidance and control on servicer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SeeMe*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Single Wafer Integrated Femto Satellites (SWIFT)\n\nThe U.S. Army, U.S. Air Force, intelligence community, and other potential users require affordable support to the tactical warfighter via space.  The goal of the \"SeeMe\" program is to demonstrate the ability to get near-real-time, i.e., no older than ~90 minutes, images directly to individual users' handheld devices from space.  This will be accomplished via a very low cost constellation of inexpensive, disposable small satellites routinely and inexpensively put in orbit through low cost horizontal (airborne) launches.  The current methodology for satisfying imagery needs from space is to build multipurpose systems with very high reliability and long life, at very high costs, and launch them on expensive vertical launch boosters. In most cases, commercial or military, the time to deliver an already built space Intelligence, Surveillance, Reconnaissance (ISR) system suitable to meet tactically desired ground sample distance is on the order of 20+ months, and the data delivery mechanism is typically more than several days (and up to weeks) to the end user.  SeeMe intends to radically shorten the entire cycle: ground development time, launch cadence, and on-orbit request-to-image-delivery time.  The anticipated transition partner is the U.S. Air Force and the U.S. Army."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade study of available technologies and investment opportunities.\n-  Initiate concept design.\n-  Perform detailed system trade between a low cost launch alternative and metrics associated with constellation size and altitude.  \n-  Evaluate technologies for direct satellite to handheld device capabilities.\n-  Perform evaluation of a multitude of manufacturing processes and technologies from non-aerospace disciplines to achieve 10x cost reduction.\n-  Select specific satellite architecture for hardware instantiation as prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Execute technical integration options for hardware level development.\n-  Demonstrate applicability to commercial production environment.\n-  Begin to show prototype functionality in actual hardware.\n-  Validate a high quantity low cost production run for a representative constellation that would support ISR capability directly to the warfighter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Membrane Optic Imager Real-Time Exploitation (MOIRE)"
                                    },
                                    "Description": {
                                        "val": "The Membrane Optic Imager Real-Time Exploitation (MOIRE) program enabled the technology for very large aperture optics for space platforms.  MOIRE's diffractive optics significantly reduced the optical tolerances required to create images, enabling very large optical elements to be created.  MOIRE demonstrated the manufacturability of large membranes, large structures to hold the optics tight and flat, and also demonstrate the secondary optical elements needed to turn a diffractive optic (such as fresnel zone plate) into a wide bandwidth imaging device.  MOIRE ended with a technology demonstration that significantly reduces the risk of using these types of optics for flight development.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.400"
                                            },
                                            "Text": {
                                                "val": "-  Conducted payload preliminary design review for a 10 m demonstration system.\n-  Conducted system concept design review for a 10 m demonstration at geo-synchronous orbit.\n-  Defined the requirements for brassboard development for ground testing of a 5m diffractive lens system.\n-  Completed optics specifications for procurement for the 5m lens system.\n-  Finished integration and test of a small scale (20cm) diffractive optical element for an on-orbit demonstration.\n-  Launched and demonstrated the deployment and on-orbit imaging performance of a risk reducing small scale (20cm) diffractive optical element."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "XTIM"
                                    },
                                    "Description": {
                                        "val": "XTIM examined exploiting X-ray pulsars for navigation and time uses independent of, and supplemental to, GPS.  The program studied using these sources to calculate position and absolute time, and then broadcasting this information to users either on the ground or in space as a method to enhance navigation solutions.  This reference data could also be used to update the GPS constellation ephemerides and timing with limited or no ground support, and could provide an alternative timing source as a checksum for GPS receivers to insure detection of spoofing or sophisticated jamming attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.537"
                                            },
                                            "Text": {
                                                "val": "-  Designed a geosynchronous orbit demonstration mission to be launched aboard an evolved expendable medium class launch vehicle.\n-  Performed an X-ray beam line test of the brass board design to demonstrate feasibility of X-ray detection and timing.\n-  Performed an electron background rejection measurement of the brass board design to demonstrate feasibility of the geosynchronous background mitigation concept."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Front-end Robotics Enabling Near-term Demonstration (FREND)"
                                    },
                                    "Description": {
                                        "val": "The Front-end Robotics Enabling Near-term Demonstration (FREND) program developed and demonstrated robotic manipulator technologies designed to allow interaction with geosynchronous orbit-based military and commercial spacecraft, extending their service lives and permitting satellite refueling, repair, refurbishment, repositioning or retirement.  The program also examined possible solutions for classes of debris in low earth orbit (LEO)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted technology and utility trade studies to model the LEO debris problem, identify significant risks to operational assets, and determine possible technological solutions.\n-  Developed debris remediation conceptual designs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}