{
    "id": "82b0f8169fb5a80a0e2147d7eff83cb4b121e45e",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601120D8Z"
        },
        "ProgramElementTitle": {
            "val": "National Defense Education Program (NDEP)"
        },
        "R1LineItemNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "90.696"
            },
            "CurrentYear": {
                "val": "83.577"
            },
            "BudgetYearOne": {
                "val": "87.979"
            },
            "BudgetYearOneBase": {
                "val": "87.979"
            },
            "BudgetYearTwo": {
                "val": "78.690"
            },
            "BudgetYearThree": {
                "val": "82.250"
            },
            "BudgetYearFour": {
                "val": "82.595"
            },
            "BudgetYearFive": {
                "val": "84.098"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The purpose of the National Defense Education Program (NDEP) is to inspire, develop, and attract the current and future generations of science, technology, engineering, and mathematics (STEM) talent.  This program ensures that the Department of Defense (DoD) delivers innovative solutions to meet DoD and national security challenges.  \n\nNDEP addresses the DoD’s need for STEM talent and develops the current and future workforce to strengthen the Department’s scientific and technological capabilities.  NDEP’s focus is to develop a continuum of high quality, experiential STEM engagements for DoD from K-12 students through world-class researchers. \n\nNDEP consists of three components: a) Science, Mathematics and Research for Transformation (SMART); b) the National Security Science and Engineering Faculty Fellowship (NSSEFF); and c) K-12.\n\nSMART awards highly competitive scholarships to undergraduate and graduate students in 19 STEM disciplines and moves them directly into DoD's workforce following graduation.  Since its inception as a pilot program in 2005, SMART has supported ~1150 students from bachelor to doctoral levels and ~380 have transitioned into the workforce.  SMART ensures that DoD has a steady infusion of newly educated and high caliber U.S. technical talent ready to fulfill its mission. \n \nNSSEFF supports 29 world-class researchers (NSSEFF Fellows) in areas of critical importance to DoD and ensures the proliferation of future and exceptional talent.  Approximately 100 undergraduate students, ~200 graduate students and ~100 post-doctoral scholars at academic institutions work with the NSSEFF Fellows.  Three cohorts of NSSEFF Fellows, with the first selected in 2008, have provided critical connections between academia and the DoD science and engineering enterprise.  Fellows’ work spans all seven DoD Science and Technology (S&T) priorities and the six high interest basic science areas, often in cutting-edge areas at the intersection of these areas.\n\nNDEP K-12 leverages the DoD’s STEM expertise as one of its most valuable assets, creating engagement opportunities for schools, students, teachers, and public sector and industry partners with DoD subject matter experts (SMEs) especially in communities adjacent to DoD laboratories and bases.  Since 2007, NDEP K-12 has increased the number of DoD facilities that directly engage their local education communities to: 1) build student interest in STEM fields and disciplines and in careers specific to the Department, 2) develop science, engineering and mathematics skills important to the DoD, and 3) fulfill DoD’s future demand for highly skilled STEM professionals.  Through after-school learning opportunities, DoD STEM professionals teach key audiences about DoD’s current and future real-world S&T applications.  DoD STEM professionals also serve as role models, mentors, content experts and competition judges."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "109.911"
                },
                "CurrentYear": {
                    "val": "101.591"
                },
                "BudgetYearOne": {
                    "val": "93.310"
                },
                "BudgetYearOneBase": {
                    "val": "93.310"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "90.696"
                },
                "CurrentYear": {
                    "val": "83.577"
                },
                "BudgetYearOne": {
                    "val": "87.979"
                },
                "BudgetYearOneBase": {
                    "val": "87.979"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-19.215"
                },
                "CurrentYear": {
                    "val": "-18.014"
                },
                "BudgetYearOne": {
                    "val": "-5.331"
                },
                "BudgetYearOneBase": {
                    "val": "-5.331"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.475"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.302"
                    },
                    "CurrentYear": {
                        "val": "-2.436"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-15.600"
                                },
                                "CurrentYear": {
                                    "val": "-15.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.479"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.333"
                                },
                                "CurrentYear": {
                                    "val": "-0.578"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.026"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.331"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.331"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P120"
                    },
                    "ProjectTitle": {
                        "val": "National Defense Education Program (NDEP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "90.696"
                        },
                        "CurrentYear": {
                            "val": "83.577"
                        },
                        "BudgetYearOne": {
                            "val": "87.979"
                        },
                        "BudgetYearOneBase": {
                            "val": "87.979"
                        },
                        "BudgetYearTwo": {
                            "val": "78.690"
                        },
                        "BudgetYearThree": {
                            "val": "82.250"
                        },
                        "BudgetYearFour": {
                            "val": "82.595"
                        },
                        "BudgetYearFive": {
                            "val": "84.098"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The purpose of the National Defense Education Program (NDEP) is to inspire, develop, and attract the current and future generations of science, technology, engineering, and mathematics (STEM) talent.  This program ensures that the Department of Defense (DoD) delivers innovative solutions to meet DoD and national security challenges.  \n\nNDEP addresses the DoD’s need for STEM talent and develops the current and future workforce to strengthen the Department’s scientific and technological capabilities.  NDEP’s focus is to develop a continuum of high quality, experiential STEM engagements for DoD from K-12 students through world-class researchers. \n\nNDEP consists of three components: a) Science, Mathematics and Research for Transformation (SMART); b) the National Security Science and Engineering Faculty Fellowship (NSSEFF); and c) K-12.\n\nSMART awards highly competitive scholarships to undergraduate and graduate students in 19 STEM disciplines and moves them directly into DoD's workforce following graduation.  Since its inception as a pilot program in 2005, SMART has supported ~1150 students from bachelor to doctoral levels and ~380 have transitioned into the workforce.  SMART ensures that DoD has a steady infusion of newly educated and high caliber U.S. technical talent ready to fulfill its mission.  \n\nNSSEFF supports 29 world-class researchers (NSSEFF Fellows) in areas of critical importance to DoD and ensures the proliferation of future and exceptional talent.  Approximately 100 undergraduate students, ~200 graduate students and ~100 post-doctoral scholars at academic institutions work with the NSSEFF Fellows.  Three cohorts of NSSEFF Fellows, with the first selected in 2008, have provided critical connections between academia and the DoD science and engineering enterprise.  Fellows’ work spans all seven DoD Science and Technology (S&T) priorities and the six high interest basic science areas, often in cutting-edge areas at the intersection of these areas.\n\nNDEP K-12 leverages the DoD’s STEM expertise as one of its most valuable assets, creating engagement opportunities for schools, students, teachers, and public sector and industry partners with DoD subject matter experts (SMEs) especially in communities adjacent to DoD laboratories and bases.  Since 2007, NDEP K-12 has increased the number of DoD facilities that directly engage their local education communities to: 1) build student interest in STEM fields and disciplines and in careers specific to the Department, 2) develop science, engineering and mathematics skills important to the DoD, and 3) fulfill DoD’s future demand for highly skilled STEM professionals.  Through after-school learning opportunities, DoD STEM professionals teach key audiences about DoD’s current and future real-world science and technology applications.  DoD STEM professionals also serve as role models, mentors, content experts and competition judges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Science, Mathematics And Research for Transformation (SMART) Defense Education Program"
                                    },
                                    "Description": {
                                        "val": "SMART is a scholarship-for-service program that provides support to high-performing U.S. graduate and undergraduate students in 19 academic Science, Technology, Engineering and Mathematics (STEM) disciplines identified as areas of future workforce need by the Department of Defense (DoD).  \n\nThe disciplines align with the Department’s seven Science and Technology (S&T) priorities and the six high interest basic science research areas.  The disciplines are: Aeronautical and Astronautical Engineering; Biosciences; Chemical Engineering; Chemistry; Civil Engineering; Cognitive, Neural, and Behavioral Sciences; Computer Science; Electrical Engineering; Geosciences; Industrial and Systems Engineering; Information Sciences; Materials Science and Engineering; Mathematics; Mechanical Engineering; Naval Architecture and Ocean Engineering; Nuclear Engineering; Oceanography; Operations Research; and Physics.  Upon completion of their degree, students fulfill a service commitment to the DoD on a one-to-one payback per year of education funded.\n\nManagement of the SMART program falls under the Research Directorate (RD) within the Office of the Assistant Secretary of Defense for Research and Engineering (OASD(R&E)).  Two types of individuals participate in the program: retention scholars who are current DoD employees, and recruitment scholars who are college students enrolled in undergraduate and graduate programs and who represent new talent for the Department.\n\nSince 2005, ~1,150 students have participated in SMART at ~160 sponsoring facilities and several other DoD components.  As of September 17, 2011, ~380 SMART scholars of the ~1,150 have transitioned into the service commitment phase.  To date, scholars have transitioned into the following DoD components: ~140 at Air Force facilities, ~120 at Army, ~105 at Navy, and ~10 at other DoD components.  Among those who transitioned to employment, 92 had completed their service commitment.  Of these, 82% continue to serve beyond their commitment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.789"
                                            },
                                            "Text": {
                                                "val": "• Emphasized outreach to eligible applicants from underrepresented groups such as women and minorities, veterans, and individuals separating from the Services.  From 2010 to 2011, the number of female applicants increased by 21 percent.  From 2010 to 2011, the number of minority applicants (Hispanic, Black or African American, American Indian\/Alaskan Native, and Native Hawaiian\/Pacific Islander) increased by 32 percent.\n• Increased the number of eligible applicants from Historically-Black Colleges and Universities and Minority-Serving Institutions (HBCU\/ MSIs).\n• Increased the number of reviewers from HBCU\/MSIs.  In 2011, the number of reviewers from HBCUs\/MSIs increased by more than 100 percent.\n• Developed and instituted best practices for mentoring and workforce development initiatives for current participants.\n• Transitioned approximately 240 SMART participants into the DoD workforce.\n• Selected 290 new participants.\n• Began transition of the administration of the SMART program from the Naval Postgraduate School to the Office of the Assistant Secretary of Defense for Research and Engineering\/Research Directorate (OASD(R&E)\/RD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.271"
                                            },
                                            "Text": {
                                                "val": "• Successfully transition the administration of the Science, Mathematics And Research for Transformation (SMART) program from the Naval Postgraduate School to OASD(R&E)\/RD. \n• Increase transparency and effectiveness of the program through the engagement of Senior Level Service agencies and benchmarking across Department of Defense (DoD) components.\n• Examine the effectiveness of efforts to increase the number of eligible applicants from underrepresented groups such as women and minorities, veterans, and individuals separating from the Services.\n• Continue to increase the number of eligible applicants as well as application reviewers from Historically-Black Colleges and Universities and Minority-Serving Institutions (HBCU\/ MSIs).\n• Assess the mentoring and workforce development initiatives for current participants using effective practices from successful mentors and facilities.\n• Assess the effectiveness of the transition process through data analysis and implementation of direct hiring authority.\n• Transition approximately 200 participants into the DoD Science, Technology, Engineering and Mathematics (STEM) workforce.\n• Select new participants based on available funding.\n• Create efficiencies through the streamlining of processes and development of Web portals and information management systems.\n• Collect data on the impact of the SMART investment on the DoD and facilities (e.g., patents, publications and other outputs) as a way of “crowdsourcing” research and networking DoD programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "46.867"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "46.867"
                                            },
                                            "Text": {
                                                "val": "• Continue to examine the effectiveness of efforts to increase the number of eligible applicants from underrepresented groups such as women and minorities, veterans, and individuals separating from the Services.\n• Continue to streamline processes and improve Web portals and information management systems.\n• Continue to assess the mentoring and workforce development initiatives for current participants and the effectiveness of the transition process.\n• Transition approximately 100 participants into the DoD workforce.\n• Select new participants based on available funding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Security Science and Engineering Faculty Fellowship (NSSEFF)"
                                    },
                                    "Description": {
                                        "val": "NSSEFF helps to ensure that DoD has an active, long-term and aggressive research portfolio that attracts the foremost creative, innovative, and productive university researchers and their students.  Objectives of the program are to:\n• Support scientific research that may lead to extraordinary outcomes for the DoD.\n• Educate and train outstanding student and post-doctoral researchers for the DoD and national security workforce.\n• Foster long-term relationships between outstanding university researchers and the DoD.\n• Familiarize select university researchers and their students with DoD’s current and future scientific and technical challenges.\n• Increase the number of exceptionally talented technical experts that are contributing to DoD’s mission and upon whom DoD may draw to serve on advisory boards, panels, and groups.\n\nThe program funds distinguished university researchers at our Nation’s leading universities to conduct innovative basic research in areas of interest to DoD.  Ensuring that students are actively engaged in conducting research funded by the DoD is an important priority.  In addition, NSSEFF Fellows forge research partnerships with DoD labs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.721"
                                            },
                                            "Text": {
                                                "val": "• Identified additional opportunities to engage students with DoD scientific and technical professionals.\n• Integrated NSSEFF Fellows’ research activities and outcomes into DoD’s research community through participation in presentations, symposia, and program reviews.\n• Implemented a revised NSSEFF strategic communication plan to further promote Fellows and students as points of expertise and strengthen the bridge between the DoD and academia.\n\nNSSEFF Fellows reported on the following interactions with DoD:\n• 27 fellows reported 132 different interactions with DoD.\n• 13 fellows served on 33 DoD panels or committees or spoke at DoD events.\n• 5 fellows hosted 9 DoD scientists’ or engineers’ visits to universities.\n• 4 fellows brought students and\/or post-docs to DoD facilities.\n• 2 fellows placed students in internships at DoD facilities.\n• 16 fellows collaborated with DoD scientists and engineers.\n• 51 NSSEFF students and post-docs were supported for conferences and visits to corporate labs.\n\nNSSEFF Fellows’ reports also reported:\n• 1,028 presentations, including 418 international\n• 329 peer-reviewed publications\n• 39 patents (filed or received)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "• Support will continue for current NSSEFF Fellows.\n• Engage undergraduate students through post-doctoral students with DoD scientists and engineers to strengthen their understanding of topic areas of importance to DoD.\n• Continue to foster engagement opportunities for students and Fellows with DoD’s scientific and technical community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.930"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.930"
                                            },
                                            "Text": {
                                                "val": "• Support will continue for current NSSEFF Fellows."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "K-12"
                                    },
                                    "Description": {
                                        "val": "As the demand for highly skilled science and technical workers continues to grow, sustaining Department of Defense (DoD) operations and local economic growth depends on a diverse Science, Technology, Engineering and Mathematics (STEM) talent pool.  Growing competition from the private sector and other countries and economies for talent, and a current STEM workforce that is nearing retirement eligibility underscores the Department’s need to invest in K-12 informal education and outreach.  NDEP K-12 leverages the DoD’s STEM expertise as one of its most valuable assets, creating engagement opportunities for schools, students, teachers, and public sector and industry partners with DoD subject matter experts (SMEs) especially in communities adjacent to DoD laboratories and bases.  The DoD is reinvesting in and strengthening these local communities by enhancing student awareness and understanding of STEM careers and improving student education and teacher capabilities by providing support for informal STEM opportunities that support current and future local economic growth."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.186"
                                            },
                                            "Text": {
                                                "val": "• Built the interest of more than 180,000 K-12 students in 28 states in STEM fields, disciplines and careers of importance to the DoD.\n• More than 2,500 DoD SMEs partnered with and educated more than 8,000 teachers in 28 states.\n• Piloted a college-level engineering mathematics course in high schools in Maryland and Washington, D.C. to encourage student interest in advanced degrees in engineering and to build mathematics skills.\n• Highlighted scientific and technological research conducted by DoD laboratories and the DoD enterprise.  \n• Increased the number of community-based partnerships among higher education institutions and K-12 school systems to obtain grants for enhancing STEM learning pathways rather than one-time experiences.\n• Continued to support after-school programs, summer camp and national competition opportunities for students and teachers by providing DoD SMEs as role models, mentors and competition judges.\n• Increased the number of sustainable partnerships among higher education institutions and K-12 school systems to decrease the amount of funding required from NDEP and to build capacity for long-term sustainability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.306"
                                            },
                                            "Text": {
                                                "val": "• Increase the quality and duration of interventions led by DoD SMEs in local communities near DoD laboratories and bases.\n• Establish system-wide evaluation and assessment measures to accurately determine effective practices and opportunities to expand engagement with students, teachers, schools, the public sector and industry community partners, and national organizations.\n• Build upon existing, sustainable partnerships among higher education institutions and K-12 schools systems to decrease the level of funding required from NDEP and to build capacity for long-term sustainability.\n• Build upon existing, sustainable partnerships between NDEP K-12 and DoD laboratories and bases to identify effective engagement practices and work to build long-term sustainability and institutionalization of K-12 informal education and outreach.\n• Expand partnerships across the Department to maximize DoD’s investments in K-12 learning to leverage all available funding and to build a future Science, Technology, Engineering and Mathematics (STEM) workforce capacity for the Department, the federal government and the Nation.\n• Participate in the 2012 U.S.A. Science and Engineering Festival Expo and the Real World Design Challenge.\n• Distribute more than 5,000 copies of the “Engineering – Go For It” magazine for middle school youth.\n• Expand the college-level engineering and mathematics course for high school students."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.182"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.182"
                                            },
                                            "Text": {
                                                "val": "• Increase the quality and duration of interventions lead by Department of Defense (DoD) subject matter experts (SMEs) in local communities near DoD laboratories and bases.\n• Establish system-wide evaluation and assessment measures to accurately determine effective practices and opportunities to expand engagement with students, teachers, schools, public sector and industry community partners, and national organizations.\n• Build upon existing, sustainable partnerships among higher education institutions and K-12 schools systems to decrease the level of funding required from NDEP and to build capacity for long-term sustainability.\n• Build upon existing, sustainable partnerships between NDEP K-12 and DoD laboratories and bases to identify effective engagement practices and work to build long-term sustainability and institutionalization of K-12 informal education and outreach. \n• Expand partnerships across the Department to maximize DoD’s investments in K-12 learning to leverage all available funding and to build a future STEM workforce capacity for the Department, the federal government and the Nation. \n• Expand the college-level engineering and mathematics course for high school students.\n• Maximize the NDEP K-12 investment through the implementation of effective practices for the engagement of local partners with DoD SMEs.\n• Strengthen the sustainability and institutionalization of NDEP K-12 informal education and outreach conducted by DoD laboratories and bases."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1) Increase the number of STEM undergraduates and graduates that are transitioned into the DoD workforce.\n2) Increase directly and indirectly the connectivity of NDEP participants with DoD."
                        }
                    }
                }
            ]
        }
    }
}