{
    "id": "844dacd55f371f8ca04059f0480e7baedd9bf4bd",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602709A"
        },
        "ProgramElementTitle": {
            "val": "NIGHT VISION TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.131"
            },
            "CurrentYear": {
                "val": "55.116"
            },
            "BudgetYearOne": {
                "val": "53.244"
            },
            "BudgetYearOneBase": {
                "val": "53.244"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "43.426"
            },
            "BudgetYearThree": {
                "val": "36.899"
            },
            "BudgetYearFour": {
                "val": "36.920"
            },
            "BudgetYearFive": {
                "val": "37.188"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) conducts applied research and investigates core night vision and electronic sensor components and software to improve the Army's capability to operate in all battlefield conditions.  Technologies pursued in this PE have the potential to provide the Army with new, or enhanced, capabilities to detect and identify targets farther on the battlefield, operate in obscured conditions, and maintain a higher degree of situational awareness (SA).  Project H95 advances infrared (IR) Focal Plane Array (FPA) technologies, assesses and evaluates sensor materials, designs advanced multi-function lasers for designation and range finding, and develops modeling and simulation for validating advanced sensor technologies.  In FY11 through FY16 the Army investment in advanced IR FPA technologies is augmented to ensure a world-wide technological and competitive IR sensor advantage for the United States. \n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602705A (Electronics and Electronic Devices), PE 0602712A (Countermine Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "40.228"
                },
                "CurrentYear": {
                    "val": "57.203"
                },
                "BudgetYearOne": {
                    "val": "53.704"
                },
                "BudgetYearOneBase": {
                    "val": "53.704"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.131"
                },
                "CurrentYear": {
                    "val": "55.116"
                },
                "BudgetYearOne": {
                    "val": "53.244"
                },
                "BudgetYearOneBase": {
                    "val": "53.244"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.097"
                },
                "CurrentYear": {
                    "val": "-2.087"
                },
                "BudgetYearOne": {
                    "val": "-0.460"
                },
                "BudgetYearOneBase": {
                    "val": "-0.460"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.581"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.460"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.460"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.516"
                                },
                                "CurrentYear": {
                                    "val": "-2.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.087"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H95"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision and Electro-Optic Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.131"
                        },
                        "CurrentYear": {
                            "val": "55.116"
                        },
                        "BudgetYearOne": {
                            "val": "53.244"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.244"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "43.426"
                        },
                        "BudgetYearThree": {
                            "val": "36.899"
                        },
                        "BudgetYearFour": {
                            "val": "36.920"
                        },
                        "BudgetYearFive": {
                            "val": "37.188"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and develops component technologies that enable improved Reconnaissance, Surveillance, Target Acquisition (RSTA) and situational awareness (SA) at an affordable price.  Component technologies include novel focal plane arrays (FPAs), processing and electronics improvements, and modeling and simulation to predict performance and to determine operational effectiveness.  This research focuses on dual band infrared (IR) FPAs necessary to search, identify and track mobile targets in all day\/night visibility and battlefield conditions and to improve standoff detection in ground-to-ground and air-to-ground operations.  This project designs, fabricates and validates very large format IR FPAs needed for sensors to simultaneously provide wide area coverage and the high resolution for situational awareness, persistent surveillance and plume\/gunflash detection.  In addition this project develops multispectral and hyperspectral algorithms for on-chip hyperspectral functionality, which offer the ability to perform detection, identification, and signature identification at extended ranges as well as the ability to detect targets in \"deep hide\".  Reducing size, weight and power (SWaP) is a key research objective for all efforts. In FY11 through FY16 the Army investment in advanced IR FPA technologies is augmented to ensure a world-wide technological and competitive IR sensor advantage for the United States. \n\nThis project supports Army science and technology efforts in the Command Control and Communications, Soldier, Ground and Air portfolios.  \n\nWork in this project is fully coordinated with PE 0602705A (Electronics and Electronic Devices), PE 0602712A (Countermine Technology), and PE 0603710A (Night Vision Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Aided Target Recognition (AiTR) Evaluation Center of Excellence"
                                    },
                                    "Description": {
                                        "val": "This effort researches a Defense-wide virtual\/distributed capability to interactively process both real and generated 3-Dimension multispectral scenes from sensor simulations.  Automatic target recognition (ATR) and aided target recognition (AiTR) algorithms are evaluated against realistic operational scenarios in aided or fully autonomous reconnaissance, surveillance, and target acquisition (RSTA) missions to include roadside threats\/explosively formed projectiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.253"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched, investigated and developed algorithms for the autonomous detection and tracking of mounted and dismounted targets\/threats for distributed aperture systems, targets of focus are those that emerge from hiding\/defilade in an urban combat arena."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.323"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate the Aided Target Recognition (AiTR) algorithm evaluation process for multiple sensor modalities including threat explosive detection; evaluate AiTR algorithms in order to quantify performance against established figures of merit using real data of threat explosives in urban environments to differentiate threat explosives from clutter; evaluate AiTR algorithms using real world scenario data including urban environments, threat explosive targets, and hard targets in order to further populate AiTR algorithm performance databases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.533"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.533"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate adaptable target tracking algorithms for their ability to perform target handoff\/distribution from one sensor system to another without losing a target; investigate new processing techniques for developing target detection and tracking algorithms that will allow for less processing power for smaller processors in SWAP constrained platform environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Modeling and Simulation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, verifies and validates engineering models, measurement techniques, and realistic simulations concurrently with the development and transition of core sensor technologies.  The goals of sensor modeling and simulation technology is to improve the fidelity and adaptability of in-house simulation capabilities for the purposes of 1) Warfighter training 2) sensor system analysis 3) identifying and addressing phenomenology associated with imaging technologies and 4) perception lab-based model target task calibration of imaging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.916"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and implemented new sensor measurement models to include visible and short wave infrared (IR) bands and systems with nonlinear image processing; conducted analysis to define the next generation of cooled IR technology; began the development of next generation simulations to support wargames and engineering tradeoff studies; developed and validated models to represent color or visible electro-optical (EO) IR sensors and distributed aperture systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.187"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine and complete development and validation of complex search and persistent surveillance models and simulations incorporating the next generation cooled Infrared (IR) technology; incorporate the ability to effectively model and simulate moving targets and platforms in a full spherical (180 degrees by 180 degrees) sensor simulation; continue development of next generation sensor simulations to support wargames and engineering tradeoff studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.242"
                                            },
                                            "Text": {
                                                "val": "Will incorporate, research and validate an integrated engineering sensor model that includes the capability to predict the performance of multiple imaging systems such as multi-waveband image fusion, hyperspectral sensing, polarization sensing, active-passive image fusion (including laser radar), real-time image processing, and models against stationary and moving targets or platforms; refine and complete development of a capability to more accurately assess combatant\/non-combatant sensor performance criteria."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Multifunction Laser Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technology for a new class of multi-wavelength laser modules which will replace multiple laser systems and reduce the size, weight and cost of current devices such as laser designators, laser rangefinders (LRFs), pointers, markers, warning systems and illuminators.  The goal is to achieve a single housing, electronics board, power supply and telescope for all applications to provide a drastic reduction in the SWaP of multi-function laser system, as well as reduction in the logistics inherent in deploying multiple systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated and optimized operation of individual laser segment; selected and optimized best technique for fabrication of structure, segmented laser diode stack and segmented output coupler mirror; evaluated candidate of laser optical bench configuration and components in the laboratory, and determined the key performance parameters of each design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate laser output (pulse energies, wavelength, beam divergence) to support the laser capabilities for designation, range finding, daytime pointing and explosive detection; evaluate laser modules to perform size, weight and power trade-offs for assessment of platform transition opportunities; assemble breadboard laser modules capable of generating the required energy or power to produce three or more wavelengths in selectable modes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.257"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.257"
                                            },
                                            "Text": {
                                                "val": "Will investigate and validate novel breadboard multi-wavelength laser modules for output energy, beam divergence and boresight over MIL-SPEC temperature range; increase the laser efficiency by optimizing the laser resonator configurations and increasing the laser diode pumping efficiency; improve operation over wide operating range; design a brassboard laser with the goal of minimizing laser SWaP for applications such as designation\/marking, LRF and illumination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Performance Small Pixel Uncooled Focal Plane Array (FPA)"
                                    },
                                    "Description": {
                                        "val": "This effort increases the working performance of both uncooled Longwave Infrared (LWIR) and Shortwave Infrared (SWIR) technologies. Through design and improved fabrication techniques this work increases detector resolution to high definition formats (LWIR-1902x1200 pixels, SWIR- 1280x720), improves sensitivity and image quality to increase recognition and identification ranges while reducing SWaP"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed a 1920 x 1080 pixel read out integrated circuit (ROIC) design for large format LWIR; researched and demonstrated the large format LWIR Focal Plane Array (FPA) packaging using an in-house developed capability; delivered and tested the leveraged Defense Advanced Research Project Agency (DARPA) Shortwave Infrared (SWIR) array electronics; and investigated the development of recognition and identification ranges for both large format LWIR and large format SWIR FPAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the pixel material processing of the Long-Wave Infrared (LWIR) Focal Plane Array (FPA) with associated Read Out Integrated Circuits (ROICs);  develop a novel approach (increase number of pixels from 640 to 1920 pixels) to achieve High Definition (HD) to optimize wafer die size based for performance; investigate and evaluate the identification range performance of the large format LWIR\/Shortwave Infrared (SWIR) FPA electronic system; design and develop the brass-board optics for SWIR hyperspectral imaging; research new low noise ROIC that supports HD format clocking and timing; establish multiple design lots to prove out the performance of the HD detector and ROIC; investigate camera electronics that support 60Hz HD video (>276MB\/sec data rate) in order to support the testing and video analysis of the HD FPA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.485"
                                            },
                                            "Text": {
                                                "val": "Will improve the uncooled LWIR FPA design to include a second revision of the ROIC and pixel design to meet the performance goals of increased sensitivity and prevent image degradation; fabricate and evaluate multiple lots to validate performance; design, fabricate and test a brassboard camera system including support electronics to operate at higher frame rates; design a high performance uncooled hyperspectral SWIR camera with multiple bands using low noise SWIR camera electronics and a reduced pixel size."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Structures for Cooled Infrared (IR) Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort researches detector materials and substrates for infrared (IR) sensors. The emphasis is on reducing material defects and increasing the reliability by means of new ways to prepare and treat the substrates and new designs and methods of growing the structures.  The goal is to develop cost effective components for high definition Army IR sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.135"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and tested Longwave Infrared (LWIR) Type II Strained Layer Superlattice (SLS) 256x256 pixel Focal Plane Arrays (FPAs) with improved material uniformity, better material and substrates structural view and lower noise levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate the proof of concept of 2-color 256x256 pixel Longwave Infrared (LWIR) and 640x480 pixel Midwave Infrared\/Longwave Infrared (MWIR\/LWIR) performance; investigate and validate new techniques for Focal Plane Array (FPA) development of very large (2000 x 2000 pixels) FPA grown on low cost substrates with less than 0.5% pixel defects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.727"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.727"
                                            },
                                            "Text": {
                                                "val": "Will develop an advanced imprint technology to deposit small indium bumps suitable for high definition format FPAs; typify performance of emerging III-V and HgCdTe on alternate substrate FPAs; experiment with novel techniques for steep sidewalled plasma etching and passivation thus enabling megapixel III-V and II-VI FPAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Sensor Component and Signal Processing"
                                    },
                                    "Description": {
                                        "val": "This effort investigates new digital image intensified (I2) components to improve maneuver and situational awareness for the dismounted and mounted Soldier, also benefiting pilotage, unmanned aerial systems(UAS) and Unmanned Ground Vehicle (UGV) applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated and tested (laboratory, controlled environment field testing and human factors studies) the brass-board low-light camera, hands free focus optics and monochrome display utilizing digital on-chip processing for high speed video transmission, high resolution, high dynamic range and no-focus digital filtering\/closed loop control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Compact Hyperspectral Imaging (HSI) Component Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates hyperspectral focal plane arrays (FPAs) and sensors for ground and air based platforms that possess the capability to detect targets and discriminate from clutter for overwatch scenarios, while ground-based hyperspectral sensors can detect targets from clutter in close-in urban situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Characterized Hyperspectral Imaging (HSI) imagers from each modality and waveband of interest to exploit sensor capability and identify targets of military significance in diverse environments; integrated sensor hardware and software; conducted tests on the HSI images to assess the sensor capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Digital Readout Integrated Circuit (ROIC)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs new Digital Readout Integrated Circuit (ROIC) technology (digital-in-pixel) enabling the affordable very large format and multiband Infrared Focal Plane Arrays (IR FPAs).  The digital-in-pixel results in increased signal storage available to collect incoming signal information from the scene, compared to traditional analog techniques. The increased storage improves dynamic range for targeting, situational awareness and persistent surveillance applications, contributing to the ability of the U.S. to ensure its historical night vision battlefield advantage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted design of small digital Digital Readout Integrated Circuit (ROIC) unit cell to meet dynamic range requirements by doing analog to digital conversion within the pixel; improved digital ROIC sampling noise to meet signal\/noise requirements through improved control of parasitic capacitances; researched and investigated innovative on-chip signal processing designs to reduce overall IR sensor size, weight and power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate 640x480 pixel digital ROIC implementing innovative on-chip signal processing designs with reduced pitch unit cell; measure dynamic range and signal\/noise performance; conduct analysis allowing correlation of digital ROIC sampling noise and parasitic capacitances to signal\/noise data; conduct design of ROIC for the 640x480 pixel focal plane array (FPA) with reduced pitch unit cell while maintaining performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "Will fabricate and evaluate high definition, 1280x720 pixel, digital-in-pixel ROIC implementing innovative on-chip signal processing designs with 20 micron pitch unit cell; characterize performance to include dynamic range and signal\/noise; conduct design review of ROIC for the 1280x720 FPA with reduced, 12 micron pitch, unit cell resulting in the reduction in overall infrared (IR) sensor cost and SWaP due to much smaller FPAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced IR Detector (\"nBn\") Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and improves a new barrier detector structure that makes FPAs easier and more affordable to manufacture and allows operation at higher temperatures resulting in much more affordable sensor systems and also significant reductions in SWaP of system optics, housings and cryogenic coolers.  In addition the barrier detector approach allows for very small pixel pitch (8 micron) enabling FPAs of very large format, 5000x5000 pixel, for persistent surveillance applications that were not possible prior to emergence of this barrier FPA technology. This effort contributes to the U.S. ability to ensure its historical night vision advantage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed structures to improve the"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate 1-2 Mega pixel (Mpix) focal plane array (FPA) implementing successes from design of experiments on dopant level, type and thickness of individual semi-conductors material layers; further investigate growth of semi-conductor material layers (nBn) on larger diameter (approximately 4-6 inches) GaSb and GaAs wafers to reduce defects of the FPA and determine cause of defects; design 5Mpix FPA incorporating feedback from the results of the 1-2Mpix FPA design process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.300"
                                            },
                                            "Text": {
                                                "val": "Will fabricate 2000x2500 pixel FPA with a 10 micron pitch implementing successes from design studies of a variety of potential manufacturing methodologies; evaluate resulting FPA structure and investigate techniques to increase yield by reducing defect formation; continue investigation of growth of semi-conductor material layers (nBn) on larger diameter (approximately 4-6 inches) GaSb and GaAs wafers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strained Layer Superlattices (SLS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and improves III-V material (materials formed by a combination of elements from group III and V of the periodic table) thin film crystal growth of IR FPAs using a very flexible Strained Layer Superlattice (SLS), structure which will allow high performance multiband IR FPAs to be produced at much lower costs than the existing II-VI FPAs with improved uniformity due to leveraging of III-V material and process investments used for commercial products to include cell phone chips. This effort contributes to the U.S. ability to ensure its historical night vision advantage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.224"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved the performance of SLS detectors through increased sensitivity; reduced excess noise of SLS longwave infrared detectors levels through novel side-wall passivation materials and techniques and novel diode architectures; developed lithography suitable for high definition format, small pixel, multiband SLS FPAs; designed uniform large area SLS wafers by transitioning SLS growth from 3-inch to 4 -inch diameter Gallium Antimonide (GaSb) wafers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.133"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate 640x480 pixel, dual band, midwave infrared\/longwave infrared (MWIR\/LWIR) FPA utilizing results of design of experiments involving passivation material and techniques, diode architectures and lithography; design 640x480 small pixel (15\/20 micrometer) dual band MWIR\/LWIR FPA on alternate substrates, incorporating feedback from the results of experiments involving passivation material and techniques, diode architectures and lithography; correlate material performance of growth on GaSb versus GaAs; convert detector fabrication processes from 3 inches to 5 inches diameter GaSb wafer capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.700"
                                            },
                                            "Text": {
                                                "val": "Will validate design of 1280x720 pixel with reduced pixel pitch, 12 micron, dual band MWIR\/LWIR FPAs on alternate substrates; evaluate and fabricate these FPAs using analog ROICs; establish new growth processes on alternative Gallium Arsenide (GaAs) substrates to reduce defects in the SLS FPA; correlate material performance of growth on GaSb versus GaAs allowing reduction in lattice mismatch defects which increases yield and reduces FPA costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide Field of View Displays and Processing for Head Mounted Display Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs optical filters, objective lenses and personal display viewing optics that will enable ultra-low profile, lightweight sensors and virtual displays for both individual head mounted and vehicle based, multi-user vision systems using the latest developments in holograms for small package optics that can be readily reconfigured (i.e. ultra-small\/light optical zoom). Additional work in this effort investigates image processing as part of the optical design strategy and designs novel approaches for color filtering image processing for low light sensors in order to provide a color low-light imaging capability to the US Warfighter.  This effort is fully coordinated with PE 63710\/K86."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.328"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate techniques for the development of foveated (pitted) pixel architecture sensors and displays for ultra high resolution without trading field of view or low power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "Will investigate and design state-of-the-art technology alternatives for large format waveguide based color heads-up displays; investigate and design light weight waveguide head mounted displays; investigate and design high definition, sparse color, low light image sensor\/color filter architectures and color image processing algorithms. Will validate operation of low latency\/power color processing algorithms on dedicated processing hardware platform; will perform laboratory based proof-of-concept validation of key performance metrics with clear path for SWaP scalability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Low Light Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort develops true starlight and below low light sensing, solid state focal plane technology with very low power and low production cost for Soldier vision enhancement under reduced visibility and low light conditions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research, investigate and assess the power, cost and low light sensitivity trade-offs for employing pixel enhanced quantum efficiency silicon material; evaluate pixel design architecture for in-pixel gain and ultra-low noise readout circuits."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}