{
    "id": "85632c017706012d0abc71f60a31cf531a502f93",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DTRA_JustificationBook_Defense_Threat_Reduction_Agency_PB_2013.zzz_unzipped_JustificationBook_Defense_Threat_Reduction_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research Initiative"
        },
        "R1LineItemNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "46.107"
            },
            "CurrentYear": {
                "val": "47.737"
            },
            "BudgetYearOne": {
                "val": "45.071"
            },
            "BudgetYearOneBase": {
                "val": "45.071"
            },
            "BudgetYearTwo": {
                "val": "45.493"
            },
            "BudgetYearThree": {
                "val": "45.925"
            },
            "BudgetYearFour": {
                "val": "46.757"
            },
            "BudgetYearFive": {
                "val": "47.602"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) safeguards America and its allies from Weapons of Mass Destruction (chemical, biological, radiological, nuclear, and high explosives) by providing capabilities to reduce, eliminate, counter the threat, and mitigate its effects.  The Basic Research Initiative program provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages Department of Defense’s $2 billion annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting Weapons of Mass Destruction-related defense missions and by improving Agency knowledge of other research efforts of potential benefit to DTRA nonproliferation, counterproliferation and consequence management efforts.  \n\nThese efforts are closely coordinated with the Chem-Bio Technology portfolio which executes a basic research program under the joint Chem-Bio Defense Program.  Agency research interests are coordinated with those of Defense Advanced Research Projects Agency and Service basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technology areas not clearly addressed by other basic research efforts.    \n\nThe decrease from FY 2012 to FY 2013 is predominately due to a reduction in the number of grants awarded and the elimination of dedicated support to transition discoveries to DTRA applied research."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "47.412"
                },
                "CurrentYear": {
                    "val": "47.737"
                },
                "BudgetYearOne": {
                    "val": "48.071"
                },
                "BudgetYearOneBase": {
                    "val": "48.071"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.107"
                },
                "CurrentYear": {
                    "val": "47.737"
                },
                "BudgetYearOne": {
                    "val": "45.071"
                },
                "BudgetYearOneBase": {
                    "val": "45.071"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.305"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.000"
                },
                "BudgetYearOneBase": {
                    "val": "-3.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.014"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.050"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.241"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Programmatic - Fiscal Guidance Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease from the previous President’s Budget submission in FY 2011 is due to the Federally Funded Research and Development Center (FFRDC) and the Economic Assumption reductions, and the SBIR transfer.  The FY 2013 decrease from the previous President’s Budget is predominately due to a reduction in the number of grants awarded and the elimination of dedicated support to transition discoveries to DTRA applied research."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.107"
                        },
                        "CurrentYear": {
                            "val": "47.737"
                        },
                        "BudgetYearOne": {
                            "val": "45.071"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.071"
                        },
                        "BudgetYearTwo": {
                            "val": "45.493"
                        },
                        "BudgetYearThree": {
                            "val": "45.925"
                        },
                        "BudgetYearFour": {
                            "val": "46.757"
                        },
                        "BudgetYearFive": {
                            "val": "47.602"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages the Department of Defense’s (DoD) $1 billion annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting Weapons of Mass Destruction-related defense missions and by improving Agency knowledge of other research efforts of potential benefit to Defense Threat Reduction Agency (DTRA) nonproliferation, counterproliferation and consequence management efforts. \n\nThese efforts are closely coordinated with the Chem-Bio Technology Portfolio which executes a basic research program under the joint Chem-Bio Defense Program.  Agency research interests are coordinated with those of Defense Advanced Research Projects Agency and Service basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technology areas not clearly addressed by other basic research efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Fundamental Research for Combating WMD"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.107"
                                            },
                                            "Text": {
                                                "val": "- Expanded the basic research portfolio to a total of 242 active basic research awards to 107 universities and laboratories across 37 states and 2 countries to include Canada and the UK.  The Agency’s 6.1 basic research portfolio supports the Combating Weapons of Mass Destruction (CWMD) grand challenge for the DoD, and is capitalized at 8.5% of the DTRA Science & Technology (S&T) investment.\n-  Supported 381 Principal Investigators, 535 students and 120 post-doctoral researchers which published 340 peer reviewed articles, 572 presentations and submitted 25 patent applications.\n- Conducted a technical review assessing each grant’s scientific advancements and progress in meeting technical objectives.  The review included 240 technical presentations and was attended by 639 people fostering collaboration and building relationships within the scientific community.\n- Conducted an external panel review of the basic research program that was open to DoD research stakeholders, which assessed the focus and scope of the program with respect to the CWMD challenges, and assessed the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.737"
                                            },
                                            "Text": {
                                                "val": "- Program expected to be managing over 200 active basic research awards on a three to five year cycle.  The Agency’s 6.1 basic research portfolio is expected to continue the CWMD grand challenge for the DoD, and be capitalized at approximately 8-10% of the DTRA research and development investment.\n- Plan to conduct a technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Plan to conduct an external panel review of the basic research program, which will be open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.071"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.071"
                                            },
                                            "Text": {
                                                "val": "- Program expected to be managing over 160 active basic research awards on a three to five year cycle.  The Agency’s 6.1 basic research portfolio is expected to continue the CWMD grand challenge for the DoD and to be capitalized at approximately 8-10% of the DTRA S&T investment.\n- Support the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program, which will be open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "23\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.961"
                                        },
                                        "CurrentYear": {
                                            "val": "8.631"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.516"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.567"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.549"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.549"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include in-scope award through Defense Threat Reduction Agency University Strategic Partnership, collaborative funding through other organizations, and competitive award through Broad Agency Announcement."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting Department of Defense educational goals, number of research organizations participating, and percentage of participating universities on the US News & World Report “Best Colleges” list."
                        }
                    }
                }
            ]
        }
    }
}