{
    "id": "865322091b06e9da3efcf86b0ee624b0edbc333b",
    "meta": {
        "filename": "dod-2013_RDTE_2013_MDA_MasterJustificationBook_Missile_Defense_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Missile_Defense_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603901C"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Research"
        },
        "R1LineItemNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "126.096"
            },
            "CurrentYear": {
                "val": "49.943"
            },
            "BudgetYearOne": {
                "val": "46.944"
            },
            "BudgetYearOneBase": {
                "val": "46.944"
            },
            "BudgetYearTwo": {
                "val": "47.865"
            },
            "BudgetYearThree": {
                "val": "47.357"
            },
            "BudgetYearFour": {
                "val": "52.519"
            },
            "BudgetYearFive": {
                "val": "54.513"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Missile Defense Agency (MDA) is conducting research into the transmission and control of Directed Energy (DE) largely above the atmosphere for non-intercept missile defense applications and ultimately boost phase intercepts. The agency works in collaboration with the Office of the Assistant Secretary of Defense for Research and Engineering, the Defense Advanced Research Projects Agency and the High Energy Laser Joint Technology Office in a systems engineering based strategy for the research, development, test and evaluation of high energy laser technologies. \n\nTo transition to the next generation high power directed energy platform, MDA is exploring two promising laser technologies. These candidate laser systems offer a path to high efficiency, electrically-driven, compact, light-weight high energy lasers for multiple Missile Defense applications including discrimination and boost phase defense. MDA is pursuing Diode Pumped Alkali Laser System (DPALS) and fiber combining laser technologies based on their efficiency and scaling potential. A 200 kilowatt class flight qualifiable laser prototype will be built and tested based on the selected technology for non-intercept Ballistic Missile Defense System (BMDS) enhancement. In parallel with laser development, a surrogate high altitude, long endurance (HALE) platform will be instrumented to collect high altitude flight environment data starting in FY 2012. A concept development contract to demonstrate the mission utility of a 200 kilowatt class laser integrated into a high altitude, low mach platform will follow and culminate in successful in-flight Command\/Control, Ballistic Missile Defense System (C2BMDS) enhancement demonstrations. The successful completion of these demonstrations will establish the technical foundation for revolutionary technology. \n\nThe Airborne Laser Test Bed (ALTB) demonstrated a directed energy weapon`s ability to destroy a boosting missile and provided valuable science and technology (S&T) data for the Nations DE knowledge base. The limited funding available for FY 2012 required that MDA stop ALTB S&T data collection. Flight tests were stopped and the aircraft is being prepared for storage and final disposition. This program element funds ALTB disposition. \n\nThe Directed Energy Research contributions to support Combatant Commanders` priorities include: Engage and re-engage a threat to include Short Range Ballistic Missiles (SRBM), Medium Range Ballistic Missiles (MRBM), Intermediate Range Ballistic Missiles (IRBM), Intercontinental Ballistic Missiles (ICBM), and address new and evolving Ballistic Missile discrimination threats. \n\nMD40 consists of Program-Wide Support (PWS) non-headquarters management costs in support of MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.688"
                },
                "CurrentYear": {
                    "val": "96.329"
                },
                "BudgetYearOne": {
                    "val": "91.953"
                },
                "BudgetYearOneBase": {
                    "val": "91.953"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "126.096"
                },
                "CurrentYear": {
                    "val": "49.943"
                },
                "BudgetYearOne": {
                    "val": "46.944"
                },
                "BudgetYearOneBase": {
                    "val": "46.944"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "27.408"
                },
                "CurrentYear": {
                    "val": "-46.386"
                },
                "BudgetYearOne": {
                    "val": "-45.009"
                },
                "BudgetYearOneBase": {
                    "val": "-45.009"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.844"
                    },
                    "CurrentYear": {
                        "val": "-0.057"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-46.329"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "25.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.192"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.940"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-45.009"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-45.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011 increase of $25.000M reflects a congressional increase (Department of Defense and Full Year Continuing Appropriation Act, FY 2011 (Public Law 112-10)) and also SBIR\/STTR transfer of $1.940M and internal reprogrammings of $5.192 for Department of Defense priorities. \n\nFY 2012 decrease of $46.386M reflects a congressional directed reduction (Consolidated Appropriation Act of FY 2012 (Public Law 112-74)) of $46.329 and a congressional general reduction of $.057. \n\nFY 2013 decrease of $45.009M reflects a realignment of Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD69"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "122.806"
                        },
                        "CurrentYear": {
                            "val": "46.257"
                        },
                        "BudgetYearOne": {
                            "val": "44.560"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.560"
                        },
                        "BudgetYearTwo": {
                            "val": "45.450"
                        },
                        "BudgetYearThree": {
                            "val": "45.045"
                        },
                        "BudgetYearFour": {
                            "val": "49.929"
                        },
                        "BudgetYearFive": {
                            "val": "51.748"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "MDA is partnering with the Federally Funded Research and Development Centers and the Defense Advanced Research Projects Agency to explore advanced laser technologies such as the Diode Pumped Alkali Laser System (DPALS) and fiber laser beam combining systems, and will monitor other emerging laser technologies for investment and development. During FY 2012 and 2013, MDA will demonstrate the efficiency, producibility and scaling potential of candidate laser architectures. \n\nBased on successful knowledge point completion and high energy lethality analysis, MDA will select the best candidate laser and develop a 200 kilowatt class laser payload for integration and test on a high altitude, low mach platform. To characterize the high altitude, low mach flight environment a surrogate directed energy platform will be instrumented to provide vibration and jitter data. \n\nMDA will transition the Airborne Laser Test Bed (ALTB) aircraft for permanent storage in FY 2012. Flight tests to characterize lethality, high energy laser beam propagation and to anchor system models for both Air Force and Missile Defense applications stopped in November 2011. The Agency will transition to the next generation Ballistic Missile Defense (BMD) Laser technology, while maintaining the critical skills required for the next generation directed energy platform development. Closeout tasks include: final collation and archiving of ALTB information and data, aircraft and property disposition and Birk Flight Test Center facility restoration at Edwards Air Force Base."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Research"
                                    },
                                    "Description": {
                                        "val": "See Description Below"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "122.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Missile Defense Agency transitioned the Airborne Laser Test Bed (ALTB) aircraft to a national test platform for directed energy\n-Worked with the Office of the Assistant Secretary of Defense for Research and Engineering, the High Energy Laser Joint Technology Office, Defense Advanced Research Projects Agency and the Air Force in a Scientific Review Committee forum to plan and assess the ALTB flight campaign to characterize atmospheric propagation effects and boundary layer and jitter effects with varying engagement geometries\n-Collected field test data for model validation and verification\n-Anchored models for airborne directed energy assets\n-Investigated advanced technologies to increase efficiency of beam control\n-Investigated software algorithms for improvements to beam control and fire control\n-Developed and experimented with diode-pumped gas lasers, fiber lasers, cryogenically-cooled solid state lasers and advanced high-power laser optics\n-Investigated lethality, beam propagation, modeling, laser beam combining and additional innovative areas"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-MDA will complete ALTB testing and collate\/archive test data and documentation for future MDA and DoD directed energy program use \n-Complete ALTB directed energy model validation and verification \n-Prepare and store the ALTB \n-Conduct experiments to characterize high altitude low mach platform vibration with a next generation high altitude surrogate platform \n-Explore and develop directed energy technologies for use against current and future MDA threats \n-Demonstrate the architectural feasibility of Diode Pumped Alkali Lasers (DPALs) and combined fiber lasers for high power applications \n-Investigate lethality, countermeasures, beam propagation, modeling and laser beam combining as well as investigate additional innovative technologies"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Make investments to mature high power directed energy technology\n     -Develop next-generation kilowatt-class fiber amplifiers\n     -Develop high power diode-pumped amplifier systems\n     -Develop fiber laser beam combining techniques to validate laser combining architectures\n-Evaluate concepts for improving technical readiness, reducing risk areas and improving next-generation platform reliability\n-Estimate life-cycle costs and assess viability for further development\n-Partner with the High Energy Laser Joint Technology Office, Universities and National Laboratories to improve high-power laser optics, optical coatings and directed energy modeling and simulation\n-Conduct experiments to characterize the high altitude, low mach flight environment\n-Remove\/de-militarize ALTB hardware, fixtures, tooling and government furnished property"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MDA Fiscal Year 2013 budget submission reflects an emphasis on high power laser technology research and development and application. The acquisition strategy to conduct this technology development effort consists of three pillars. First, leverage the technical expertise of National Laboratories, Federally Funded Research and Development Centers and University Applied Research Centers. Second, continue to leverage relevant existing contracts within limits of the Competition in Contracting Act (CICA), taking into account contractor past performance, scope, ceiling and period of performance. Third, for new technology initiatives, seek industry solutions via the Advanced Technology Broad Agency Announcement for competitive procurements. In addition, MDA will use existing contracts to retire the Airborne Laser Test Bed safely and efficiently."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.290"
                        },
                        "CurrentYear": {
                            "val": "3.686"
                        },
                        "BudgetYearOne": {
                            "val": "2.384"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.384"
                        },
                        "BudgetYearTwo": {
                            "val": "2.415"
                        },
                        "BudgetYearThree": {
                            "val": "2.312"
                        },
                        "BudgetYearFour": {
                            "val": "2.590"
                        },
                        "BudgetYearFive": {
                            "val": "2.765"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013, Program Wide Support reflects a proportional decrease as a result of decreases to Directed Energy Research."
                        },
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of MDA functions and activities across the entire Ballistic Missile Defense System (BMDS). Includes Government Civilians, Advisory and Assistance Services, and Federally Funded Research and Development contracts (FFRDC) providing integrity and oversight of the BMDS as well as, supporting MDA in enabling the development and evaluation of technologies that will respond to the changing threat. In addition, includes Global Deployment personnel and support performing deployment site preparation and activation. Other costs included provide facility capabilities for MDA Executing Agent locations (with the exception of Federal Office Building 2 after FY 2011), such as physical and technical security, legal services, travel and agency training, office and equipment leases, rents and utilities, data and unified communications support, supplies and maintenance, logistics and central property management of equipment, and similar operating expenses. Also includes legal settlements, and foreign currency fluctuations on a limited number of foreign contracts. \nIn keeping with congressional intent, PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the total MDA budget."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Salaries and Support"
                                    },
                                    "Description": {
                                        "val": "See Description Below"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See Paragraph A, Mission Description and budget item justification"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.686"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See Paragraph A, Mission Description and budget item justification"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.384"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.384"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A, Mission Description and budget item justification."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}