{
    "id": "88eddce3684109015aefa46d9fdc735fc0e69ac6",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605075D8Z"
        },
        "ProgramElementTitle": {
            "val": "DCMO Policy and Integration"
        },
        "R1LineItemNumber": {
            "val": "129"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.956"
            },
            "CurrentYear": {
                "val": "41.529"
            },
            "BudgetYearOne": {
                "val": "25.269"
            },
            "BudgetYearOneBase": {
                "val": "25.269"
            },
            "BudgetYearTwo": {
                "val": "22.672"
            },
            "BudgetYearThree": {
                "val": "25.156"
            },
            "BudgetYearFour": {
                "val": "21.940"
            },
            "BudgetYearFive": {
                "val": "22.328"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Deputy Chief Management Officer (DCMO), a position created by the National Defense Authorization Act for 2008, is the Principal Staff Assistant (PSA) and advisor to the Secretary and Deputy Secretary of Defense for matters relating to management and improvement of integrated DoD business operations.  The Office of the DCMO (ODCMO) was created to integrate business processes and over 2,400 business systems costing approximately $7B \/ year to acquire, modernize and operate.  Following FY 2012 disestablishment of the Business Transformation Agency (BTA), the ODCMO conducts research and development of the Business Enterprise Architecture (BEA) for the Department’s Business Mission Area (BMA).  The BEA, along with data standards development and war fighter support, provides the foundation for several Departmental priorities to include Financial Auditability and directed efficiencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "41.808"
                },
                "BudgetYearOne": {
                    "val": "43.009"
                },
                "BudgetYearOneBase": {
                    "val": "43.009"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.956"
                },
                "CurrentYear": {
                    "val": "41.529"
                },
                "BudgetYearOne": {
                    "val": "25.269"
                },
                "BudgetYearOneBase": {
                    "val": "25.269"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.956"
                },
                "CurrentYear": {
                    "val": "-0.279"
                },
                "BudgetYearOne": {
                    "val": "-17.740"
                },
                "BudgetYearOneBase": {
                    "val": "-17.740"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.296"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.296"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Funding Realignment to O&M approriation for Labor"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-14.337"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-14.337"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.956"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.085"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.085"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other  Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.614"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.614"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Section 8023(f) FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.279"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2012, select organizational missions and functions of the ODCMO and the Business Transformation Agency (BTA) were integrated and consolidated within the ODCMO as directed by the Secretary of Defense.  This transfer of select functionality to the Office of the Secretary of Defense (OSD) \/ ODCMO will provide focused integration and synchronization of business improvement activities in support of the war fighter across all Departmental components.\n\nIn FY 2013, the labor adjustment is the result of transfer of labor dollars to the Defense Wide Operations and Maintenance account (O&M), specifically realigning funds in compliance with Financial Management Regulations (FMR) which require expenses of research and development management at headquarters and administrative organizations be funded with O&M; to centralize and consolidate contracting services and realize contracting efficiencies to improve acquisition  planning and oversight. And the final adjustment is the ODCMO portion of Secretary of Defense efficiencies initiatives."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0001"
                    },
                    "ProjectTitle": {
                        "val": "DCMO Policy and Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.956"
                        },
                        "CurrentYear": {
                            "val": "41.529"
                        },
                        "BudgetYearOne": {
                            "val": "25.269"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.269"
                        },
                        "BudgetYearTwo": {
                            "val": "22.672"
                        },
                        "BudgetYearThree": {
                            "val": "25.156"
                        },
                        "BudgetYearFour": {
                            "val": "21.940"
                        },
                        "BudgetYearFive": {
                            "val": "22.328"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Deputy Chief Management Officer (DCMO), a position created by the National Defense Authorization Act for 2008, is the Principal Staff Assistant (PSA) and advisor to the Secretary and Deputy Secretary of Defense for matters relating to management and improvement of integrated DoD business operations.  The Office of the DCMO (ODCMO) was created to integrate business processes and over 2,400 business systems costing approximately $7B \/ year to acquire, modernize and operate.  Following FY 2012 disestablishment of the Business Transformation Agency (BTA), the ODCMO conducts research and development of the Business Enterprise Architecture (BEA) for the Department’s Business Mission Area (BMA).  The BEA, along with data standards development and war fighter support, provides the foundation for several Departmental priorities to include Financial Auditability and directed efficiencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Planned Efforts for FY2012"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.956"
                                            },
                                            "Text": {
                                                "val": "Development and employment of Integrated Semantic Business Enterprise Architecture (BEA)\n• Continue to extend the BEA and its supporting development and maintenance tools into the Semantic Web technical domain. Use the BEA to guide and constrain investment in information technology (IT) business systems and inform business process re-engineering\/process improvement opportunities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.529"
                                            },
                                            "Text": {
                                                "val": "Development and employment of Integrated Semantic Business Enterprise Architecture (BEA)\n• Continue to extend the BEA and its supporting development and maintenance tools into the Semantic Web technical domain. Use the BEA to guide and constrain investment in information technology (IT) business systems and inform business process re-engineering\/process improvement opportunities.\n\nEnd to End (E2E Process)\n• Refine, improve, re-engineer and represent in the BEA, the end-to-end processes that represent integrated DoD business operations.\n•\tThe FY12 focus is to begin defining detailed E2E processes for Procure-to-Pay (P2P) and Hire-to-Retire (H2R).\n  \nTools Development \n• Lead the evaluation and oversee development and testing of tools to build, analyze and execute the BEA throughout the Business Mission Area. \n  \nEnterprise Information Webs (EIWs)\n• Conducted dedicated research and system engineering to design EIW Proof of Delivery (PODs) pilots to establish the Initial Operational Capability (IOC) of Human Resource Enterprise Information Web (HR EIW) capability.  \n• Mature the integration requirements and maintain fidelity of existing systems to work and to develop new capabilities through PoDs that translate these \nresults to executable Enterprise Transition Plans (ETP).  \n• Continue the development and establish baseline standards for  Business Intelligence (BI) standards and services which will access authoritative data sources from anywhere in the Department and present business information to DoD and external customers consistent with performance data standards modeled in the BEA.  \n\nBEA Ontologies\/Standards\n• Through systems engineering and incremental strategy of developing the BEA, Manage Enterprise Data standards to include the standards of the Standard Financial Information Structure (SFIS) and Common Human Resources Information System (CHRIS) to support efficient and interoperable business systems.\n\nEIW Acquisition \n• Provide technical support to Defense Acquisition System\/Business Capability Life Cycle (DAS\/BCL) and Investment Review Boards (IRBs).\n• Continue the development and integration to support Acquisition Oversight requirements of Major Automated Information System (MAIS).\n\nAcquisition Accountability Office for Afghanistan (AAOA)\n•\tOverseeing and guiding establishment of complete visibility of business operations to achieve accountability and build a comprehensive common operating picture (COP) with tracking system traceability for all DoD funds obligated in-theater, electronically capturing DoD approved and funded requirements, obligations, disbursements.\n\nAdaptive Logistics Network (ALN)\n•\tGuiding establishment of repeatable processes and metrics that operationalize US Africa Command (AFRICOM) logistics strategy by developing a Logistics Clearinghouse and Geographic Information Systems (GIS) Access Tool Proof-of-Concept (Phase I).\n•\tEfforts will improve logistics coordination among DoD, US Government Agencies and International Partners and will leverage existing logistics capabilities of the international logistics response community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.269"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.269"
                                            },
                                            "Text": {
                                                "val": "• Continue the evolution of the BEA to be 100% compliant with Semantic Web standards. \n• Evaluate adherence to the DoD Business Program Development and Implementation \"Model-Data-Implement\" strategy and oversee the development of the BEA, as well as the development and testing of tools and methods to build, analyze and execute the BEA throughout the Business Mission Area.  \n• Complete mapping Procure-to-Pay End-to-End (E2E) process mapping; continue Hire-to-Retire (H2R) process mapping; begin mapping Budget-to-Report (B2R) as directed by the Defense Business Systems Management Committee (DBSMC).\n• Provide evaluation and test of tools to support the management of core business mission process and data teams to the BEA build team in the construction of End to End processes.  \n• Deploy and baseline the automated Federation and Semantic compliance with the Semantic BEA.  \n• Utilize the IOC of HR EIW capability to serve as the basis for future EIW releases.  \n• Through the Semantic BEA, continue to manage Enterprise Data standards to include the existing standards and new standards such as the PDS, etc. \n• Establish a robust program for “Equipping the Workforce” to enable the Semantic BEA methods and processes across the Department.  This includes the training, tools and services to ensure success.\n• Develop and deploy services and support for automated BEA and architecture compliance using semantic technologies as the basis for compliance.\n• Expand the role of the Semantic BEA to begin to serve a central role in the ODCMO and DoD Enterprise and Federal reporting.  \n• Develop, coordinate and promulgate policies in support of DoD business operations which will uniformly ensure efficiency and consistency in business operations.  \n• Use the BEA to guide and constrain investment in IT business systems to maintain fidelity of existing systems to work and to develop new capabilities through PoDs that translate these results to executable ETP.  \n• Coordinate coupling between BEA and ETP business systems' development and deployment milestones.  \n• Provide resources and tools to update milestone, measure guidance, related templates and workbooks to be included in the ETP and reports to Congress.  \n• Enable innovation through the utilization of technology to support more and better business operations for the Department.  Innovations will support the full spectrum of operations to include people, processes and technology.  Be the technology strategic thought leadership for the DCMO.  These efforts include the articulation of business strategy, metrics and the outreach to business stakeholders and civilian and commercial thought leaders.  \n• Collaborate with DoD CIO for DoD Architecture Framework (DoDAF) implementation methods and standards, IT Consolidation and required DoD IT infrastructure to support business operations.  \n• Provide input to analyze progress against business system milestones and document analysis in the Congressional Report on Defense Business Operations.  \n• Encourage the evolution of architecture and data standards in support of DoD requirements through international Standards bodies such as World Wide Web Consortium (W3C) and Object Management Group (OMG).  \n• Support the DoD\/Veterans Affairs (VA) Joint Program Office for iEHR for BPR and architecture development and the use of technical standards.  \n• Integrate Enterprise Resource Planning tools with evolving BEA Semantic vision.  \n• Assess and respond to DoD Component CIO Evaluation Scorecard.  \n• Provide input to support Acquisition Oversight requirements of MAIS.\n• Collaborates with the Federal CTO and CIO in support of Federal Reporting and Performance Initiatives.  \n• Support IT Business Acquisition Oversight by providing technical standards and real time support to Infrastructure IRBs.\n\nAAOA and ALN\n•\tFocus areas for AAOA and ALN will be a continuation of identifying business process gaps and supporting the institutionalization of process improvements.  Key activities would include oversight in capturing lessons learned and supporting Joint Staff, Services and OSD offices in developing new processes, policies and other pertinent Doctrine, Organization, Training, Materiel, Leadership, Personnel and Facilities (DOTMLPF) issues."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• \"Percent of Enterprise-level Information Technology software and hardware deployed as business services within 18 months of the capability business cases approval.”  Approximately 88% of the funds devoted to achieve this metric in FY 2012 \/ FY 2013 (70% \/ 80%, respectively, of software \/ hardware deployed) are performed with R&D funds.\n• “Number of Major Automated Information System (MAIS) ‘significant’ breaches (equal to or greater than 15% of Acquisition Program Baseline total cost or within schedule slippages greater than six months.” 100% of funds devoted in achieving this metric in FY 2012 \/ FY 2013 (less than or equal to 1 in both years) are R&D.\n• “Number of Major Automated Information System (MAIS) ‘critical’ breaches (equal to or greater than 25% of Acquisition Program Baseline total cost or within schedule slippages of one year or more.”  100% of funds devoted in achieving this metric in FY 2012 \/ FY 2013 (less than or equal to 2 in both years) are R&D."
                        }
                    }
                }
            ]
        }
    }
}