{
    "id": "8b0f83cb496f76a80abcffcb5a74399761669ccd",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207412F"
        },
        "ProgramElementTitle": {
            "val": "Modular Control System"
        },
        "R1LineItemNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.120"
            },
            "CurrentYear": {
                "val": "3.387"
            },
            "BudgetYearOne": {
                "val": "8.653"
            },
            "BudgetYearOneBase": {
                "val": "8.653"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "7.029"
            },
            "BudgetYearThree": {
                "val": "0.562"
            },
            "BudgetYearFour": {
                "val": "0.578"
            },
            "BudgetYearFive": {
                "val": "0.586"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2012, Project 5294, Theater Control System Improvement-Radar (TACSI-R) efforts transferred to PE 0604283F, Battle Management Command & Control (BMC2) Sensor Development, Project 6002, Three Dimensional Expeditionary Long Range Radar in order to provide this pre-Major Defense Acquisition Program its own Program Element."
        },
        "ProgramElementMissionDescription": {
            "val": "This budget activity funds development of mobile ground-based command and control (C2) capabilities of the Control and Reporting Center (CRC) program.  The CRC is identified as a component of the Integrated Air Missile Defense Family of Systems that defends the Homeland and US national interests at home and abroad by negating an adversary's ability to achieve adverse effects from their air and missile capabilities.   The CRC mission is to provide battlespace awareness and tactical battle management command and control (BMC2) in an assigned area.  It is a ground-based theater air control system (TACS) surveillance and BMC2 element.  It consists of facilities, equipment, and people and is a tailorable, modular, transportable, sustainable and persistent weapon system employed at the tactical level to support air and surface operations.  Currently, the CRCs are fully employed in Operations ENDURING FREEDOM and NOBLE EAGLE.  The CRC projects include development and modernization of Theater Air Control Systems Improvement (TACSI) capabilities and the Three-Dimensional Expeditionary Long-Range Radar (3DELRR).\n\nTACSI efforts include, but are not limited to the AN\/TYQ-23 Operations Module (OM), AN\/TPS-75 Long-Range Surveillance Radar and the AN\/TRC-215 Remote Radio Secure Voice System (RRSVS) that may be tasked across the full range of military operations.  AN\/TYQ-23 OM is a low source\/high demand (LS\/HD) deployable ground-based C2 asset.  This automated, computer-based information system provides operators the real-time battlespace visualization necessary to plan, direct, and control tactical air operations and airspace management tasks.  AN\/TRC-215 RRSVS is a mobile, vehicle-mounted voice radio and OM-interface unit.  The RRSVS allows real-time, secure voice communication between aircraft operating in the battlespace and ground-based BMC2 operators located in the OM of the CRC.  The AN\/TRC-215 is typically deployed to a remote area which can extend the CRCs radio coverage beyond line of sight (BLOS) using organic SATCOM capabilities.\n\nThe 3DELRR program is developing a replacement for the current legacy AN\/TPS-75 radar.  3DELRR will be the principal USAF long-range, ground-based sensor for detecting, identifying, tracking, and reporting aircraft and missiles in support of the Joint Forces Air Component Commander (JFACC) through the Ground Theater Air Control System (GTACS).   The primary mission of the 3DELRR will be to provide long-range surveillance, control of aircraft, theater ballistic missile detection and Combat Identification (CID).  The 3DELRR will respond to the operational need to detect and report highly maneuverable, small radar cross section targets to enable battlespace awareness while at the same time mitigating the reliability, maintainability, and sustainability issues plaguing the AN\/TPS-75 radar system.  Ongoing planning and associated activities will take place to prevent and overcome diminishing manufacturing sources and obsolescence issues as required.\n\nActivities also include studies and analysis to support both current program planning and execution, as well as future program planning.    \n\nThis program is in Budget Activity 7, Operational System Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.313"
                },
                "CurrentYear": {
                    "val": "3.954"
                },
                "BudgetYearOne": {
                    "val": "7.212"
                },
                "BudgetYearOneBase": {
                    "val": "7.212"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.120"
                },
                "CurrentYear": {
                    "val": "3.387"
                },
                "BudgetYearOne": {
                    "val": "8.653"
                },
                "BudgetYearOneBase": {
                    "val": "8.653"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.193"
                },
                "CurrentYear": {
                    "val": "-0.567"
                },
                "BudgetYearOne": {
                    "val": "1.441"
                },
                "BudgetYearOneBase": {
                    "val": "1.441"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.055"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.618"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.520"
                                },
                                "CurrentYear": {
                                    "val": "-0.567"
                                },
                                "BudgetYearOne": {
                                    "val": "1.441"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.441"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding change in FY13 is due to increase for C2 engine modification, increase for inflation rates-nonpay, nonfuel, and decrease due to termination of TPS-75 Mode 5 for Control and Reporting Center."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67485L"
                    },
                    "ProjectTitle": {
                        "val": "Theater Air Control System Imp (TACSI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.363"
                        },
                        "CurrentYear": {
                            "val": "3.387"
                        },
                        "BudgetYearOne": {
                            "val": "8.653"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.653"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.029"
                        },
                        "BudgetYearThree": {
                            "val": "0.562"
                        },
                        "BudgetYearFour": {
                            "val": "0.578"
                        },
                        "BudgetYearFive": {
                            "val": "0.586"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Control and Reporting Center (CRC) program element provides development and modernization of mobile ground-based command and control (C2) capabilities.  The CRC is a ground-based theater air control system (TACS) surveillance and battle management command and control (BMC2) element. It consists of facilities, equipment, and people.  It is a tailorable, modular, transportable, sustainable, and persistent weapon system employed at the tactical level to support air and surface operations.   The CRC projects include development of Theater Air Control Systems Improvement (TACSI) capabilities and the Three-Dimensional Expeditionary Long-Range Radar (3DELRR).  Currently USAF CRCs are fully employed in Operations NEW DAWN, ENDURING FREEDOM, and NOBLE EAGLE.  The TACSI project develops and modernizes software and hardware to make the CRC a viable BMC2 element.  These efforts include, but are not limited to, the development and modernization of the  AN\/TYQ-23 Operations Module (OM) and the AN\/TRC-215 Remote Radio Secure Voice System (RRSVS).\n\nAN\/TYQ-23 OM is a low source\/high demand (LS\/HD) rapidly deployable ground-based C2 asset.  This automated, computer-based information system provides operators the real-time battlespace picture necessary to plan, direct, and control tactical air operations and airspace management tasks.  AN\/TRC-215 RRSVS is a mobile, vehicle-mounted voice radio and OM-interface unit.  The RRSVS allows real-time, secure voice communication between aircraft operating in the battlespace and ground-based battle management C2 operators located in the OM of the CRC.\n\nOMs and RRSVS units are currently deployed world-wide in support of ongoing operations.  Service Life Extension Program (SLEP) efforts to provide capability upgrades\/improvements such as associated Mode 5 passive and\/or active Identify Friend or Foe (IFF), and C2 Engine Upgrade are being developed for the CRC.  Beginning in FY13, activities will include, but not be limited to, studies, analysis, design and prototype, documentation, testing, and production to support both current program planning and execution and future program planning.   This program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continue upgrades to CRC"
                                    },
                                    "Description": {
                                        "val": "Continue upgrades to CRC to include advanced planning, Modular Control System (MCS) upgrades, enhanced radio\/radar\/data link remoting, integrating upgrades into CRC; C2 Engine Upgrade; and AN\/TPS-75 sensor replacement\/upgrade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.664"
                                            },
                                            "Text": {
                                                "val": "Performed development & delivery of software upgrades to RRSVS to include designs for the next increment of RRSVS & redesign of the remote control terminal and server software to operate on a Linux based operating system; performed development & delivery of AN\/TYQ-23 V5 SLEP Prototype and redline drawing package."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.042"
                                            },
                                            "Text": {
                                                "val": "Performing development & delivery of software upgrades to RRSVS to include, but not limited to, develop designs for next increment of RRSVS; and will begin initial development of C2 Engine Upgrade."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.202"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.202"
                                            },
                                            "Text": {
                                                "val": "Will perform development & delivery of software upgrades to RRSVS to include, but not limited to, develop designs for next increment of RRSVS; and will begin initial development of C2 Engine Upgrade."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test Planning"
                                    },
                                    "Description": {
                                        "val": "Continue test and evaluation support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.944"
                                            },
                                            "Text": {
                                                "val": "Performed test and evaluation, including prototype and feasibility testing of changes associated with new radios and transport technology upgrades for RRSVS; Performed test activities for AN\/TYQ-23 V5 SLEP Prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.485"
                                            },
                                            "Text": {
                                                "val": "Performing test and evaluation to include, but not be limited to, testing changes of new radios and transport technology upgrades for RRSVS; test activities for radio interface with TYQ-23, and AN\/TYQ-23 V5 SLEP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Will perform test and evaluation to include, but not limited to, prototype and feasibility testing of changes associated with new radios and transport technology upgrades for RRSVS, and C2 Engine Upgrade."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sys Eng\/Tech Support"
                                    },
                                    "Description": {
                                        "val": "Continue Systems Engineering\/Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.672"
                                            },
                                            "Text": {
                                                "val": "Performed Systems Engineering\/Technical Support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.790"
                                            },
                                            "Text": {
                                                "val": "Performing Systems Engineering\/Technical Support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.504"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.504"
                                            },
                                            "Text": {
                                                "val": "Will perform Systems Engineering\/Technical Support."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management and Administration"
                                    },
                                    "Description": {
                                        "val": "Continue Management Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Text": {
                                                "val": "Continued Management Services"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.070"
                                            },
                                            "Text": {
                                                "val": "Continuing Management Services"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.047"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.047"
                                            },
                                            "Text": {
                                                "val": "Will continue Management Services"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0207412F"
                                    },
                                    "Title": {
                                        "val": "Control and Reporting Center, (OPAF)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.118"
                                        },
                                        "CurrentYear": {
                                            "val": "22.740"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.483"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.483"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.585"
                                        },
                                        "BudgetYearThree": {
                                            "val": "33.390"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.375"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.466"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The CRC program is utilizing evolutionary development to modernize and further advance current and future battlespace awareness and tactical BMC2 capabilities. A variety of contract types will be utilized depending on type of effort. Contracting strategy will include but is not limited to open competition, sole source contracts, and interdepartmental purchase requests."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207412F_BPAC_67485L_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "TPS-75 SLEP Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TPS-75 SLEP Developmental\/Operational Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TPS-75 SLEP Production\/Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Radio Spiral 3.1 Design\/Development\/Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Radio Spiral 3.1 Updates Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Radio Spiral 3.2 Concept\/Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Radio Spiral 3.2 Developmental Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Radio Spiral 3.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OM v(5) SLEP PDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OM v(5) SLEP CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OM v(5) SLEP Developmental\/Operational Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "C2 Engine Upgrade Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "C2 Engine Upgrade Developmental\/Operational Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "C2 Engine Upgrade Production\/Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675294"
                    },
                    "ProjectTitle": {
                        "val": "Theater Air Control System Improvement - Radar (TACSI-R)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.757"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2012, Project 5294, Theater Control System Improvement-Radar (TACSI-R) efforts transferred to PE 0604283F, Battle Management Command & Control (BMC2) Sensor Development, Project 6002, Three Dimensional Expeditionary Long Range Radar in order to provide this pre-Major Defense Acquisition Program its own Program Element."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Three-Dimensional Expeditionary Long-Range Radar (3DELRR) program is developing a replacement for the current legacy AN\/TPS-75 radar.  3DELRR will be the principal USAF long-range, ground-based sensor for detecting, identifying, tracking, and reporting aircraft and missiles in support of the Joint Forces Air Component Commander (JFACC) through the Ground Theater Air Control System (GTACS).  The primary mission of the 3DELRR will be to provide long-range surveillance, control of aircraft, and theater ballistic missile detection and Combat Identification (CID).  The 3DELRR will respond to the operational need to detect and report highly maneuverable, small radar cross section targets to enable battlespace awareness while at the same time mitigating the reliability, maintainability, and sustainability issues plaguing the AN\/TPS-75 radar system.\n\n3DELRR will provide air controllers with a precise, real-time air picture of sufficient quality to conduct close control of individual aircraft under a wide range of environmental and operational conditions.  In the case of theater missile defense operations, the 3DELRR will have the capability to detect, track, and disseminate target information to respective command and control nodes such as the Control and Reporting Center (CRC) to disseminate for warning and engagement.  Similarly, the joint targeting process will benefit from trajectory information provided by the 3DELRR, which will include launch and impact location."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Development (TD) and Program Definition and Risk Reduction (PDRR)"
                                    },
                                    "Description": {
                                        "val": "Technology development (TD) phase and Program Definition and Risk Reduction (PDRR) efforts associated with delivering a new long-range, ground-based sensor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.445"
                                            },
                                            "Text": {
                                                "val": "Continued the Technology Development (TD) Phase and risk reduction efforts of 3DELRR.  Activities included demonstration of Critical Technology Elements (CTEs) to Technology Readiness Level (TRL) 6, design options analyses, requirements refinement, identification and analyses of existing and emerging system threats, (including cyber warfare). Results were captured in appropriate technical requirements, life-cycle cost estimate revision, test planning, and Milestone B documentation development. Planned for PDRR activities including, but not limited to, a full and open competition, design development, development of system functional modeling and simulation, and execution of the program protection plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Description": {
                                        "val": "Continue Program Support (i.e., travel, supplies, equipment, miscellaneous)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.241"
                                            },
                                            "Text": {
                                                "val": "Conducted test and evaluation to include, but not limited to, development of the test strategy and test-related documentation, planning of future developmental test and evaluation events, information assurance planning, and participation in technical and test-related working groups."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering\/Technical Support"
                                    },
                                    "Description": {
                                        "val": "Continue Systems Engineering\/Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.576"
                                            },
                                            "Text": {
                                                "val": "Continued Systems Engineering\/Technical Support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Program Management and Administration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.495"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative services support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0604283F"
                                    },
                                    "Title": {
                                        "val": "Battle Management Command & Control"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.939"
                                        },
                                        "CurrentYear": {
                                            "val": "30.362"
                                        },
                                        "BudgetYearOne": {
                                            "val": "114.417"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "114.417"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207455F"
                                    },
                                    "Title": {
                                        "val": "Three Dimensional Expeditionary Long Range Radar"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "70.160"
                                        },
                                        "BudgetYearThree": {
                                            "val": "69.533"
                                        },
                                        "BudgetYearFour": {
                                            "val": "89.985"
                                        },
                                        "BudgetYearFive": {
                                            "val": "54.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "WSC 833040"
                                    },
                                    "Title": {
                                        "val": "Theater Air Control System Improvement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.644"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PE 0604283F, Three-Dimensional Expeditionary Long-Range Radar (3DELRR), is providing full capability via full and open competition to further advance C2 capabilities supporting battlefield command and control."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207412F_BPAC_675294_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "3DELRR On-going Risk Reduction"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "3DELRR On-going System Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "3DELRR TD Phase Capability Demo B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}