{
    "id": "916148da3d0b46b219d0efedefeeacfaa290c309",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA7_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203758A"
        },
        "ProgramElementTitle": {
            "val": "Digitization"
        },
        "R1LineItemNumber": {
            "val": "169"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.103"
            },
            "CurrentYear": {
                "val": "8.016"
            },
            "BudgetYearOne": {
                "val": "35.180"
            },
            "BudgetYearOneBase": {
                "val": "35.180"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "9.162"
            },
            "BudgetYearThree": {
                "val": "8.786"
            },
            "BudgetYearFour": {
                "val": "7.081"
            },
            "BudgetYearFive": {
                "val": "7.201"
            }
        },
        "ProgramElementNote": {
            "val": "The Army will request prior approval reprogramming of the $25M NIE funding into appropriate procurement accounts prior to execution."
        },
        "ProgramElementMissionDescription": {
            "val": "Horizontal Battlefield Digitization is a strategy that allows warfighters, from the individual soldier and platform to echelons above corps, to share critical situation awareness (SA) and command and control (C2) information. It conducts analysis and evaluation of new information technologies, concepts, and applications of integrated management activities to meet the dynamic Army acquisition technology requirements. The strategy applies digital information technologies to acquire, exchange, and employ data throughout the operational environment, and provides a clear and accurate common operational picture for leaders at all levels. This timely sharing of information significantly improves the ability of commanders and leaders to quickly make decisions, synchronize forces and fires, and increase the operational tempo.  Digitization is a means of realizing a fully integrated C2\/SA capability to the platoon level, including interoperability links with joint and multi-national ground forces. The major efforts included in the program element are: 1) Integration and synchronization of the Army's interoperability efforts, coordination of interoperability efforts between joint and multi-national forces, and the synchronization of combat material and training efforts to develop Army information technologies; 2) Systems engineering and integration of hardware and software interfaces between and across the warfighting functions and across multiple Program Executive Offices, providing System of Systems (SOS) capabilities that satisfy warfighter requirements and enable the execution of mission operations by providing one Common Operational Picture (COP)\/Common Tactical Picture (CTP). 3) Oversee and support synchronization of LandWarNet Battle Command capabilities and ensure interoperability across the current and future force. 4) Support fielding of integrated systems to Active and Reserve Components (USARNG and USAR) in accordance with Army Force Generation (ARFORGEN). 5) Support of the the Army Equipping Enterprise System (AE2S) integration of the Force Development Investment Information System (FDIIS), Army Flow Model (AFM), and the Continuing Early Validation (CEaVa) programs into a single integrated system. This supports the Army's Equipping Strategy Army Force Generation, ARFORGEN, and consolidates capabilities to gain efficiencies. IAW the National Defense Authorization Act 804 and OSD's report to congress,Army is poised to implement the \"Agile Business Process\" that will result in an iterative and incremental approach to software development and hardware\/software capability integration.  This process will improve effectiveness in the identification, assessment and acquisition of capability solutions for the Army Network. The $25M FY13 Network Itegrated Evaluation (NIE) budgeted in this PE will resource procurements of the material solutions that results from the FY12 NIE Cycle.  The Army will request prior approval reprogramming of this funding into appropriate procurement accounts prior to execution."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.329"
                },
                "CurrentYear": {
                    "val": "8.029"
                },
                "BudgetYearOne": {
                    "val": "9.802"
                },
                "BudgetYearOneBase": {
                    "val": "9.802"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.103"
                },
                "CurrentYear": {
                    "val": "8.016"
                },
                "BudgetYearOne": {
                    "val": "35.180"
                },
                "BudgetYearOneBase": {
                    "val": "35.180"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.226"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "25.378"
                },
                "BudgetYearOneBase": {
                    "val": "25.378"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.189"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.037"
                                },
                                "CurrentYear": {
                                    "val": "-0.013"
                                },
                                "BudgetYearOne": {
                                    "val": "25.378"
                                },
                                "BudgetYearOneBase": {
                                    "val": "25.378"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "374"
                    },
                    "ProjectTitle": {
                        "val": "HOR BATTLEFLD DIGITIZN"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.103"
                        },
                        "CurrentYear": {
                            "val": "8.016"
                        },
                        "BudgetYearOne": {
                            "val": "35.180"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.180"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.162"
                        },
                        "BudgetYearThree": {
                            "val": "8.786"
                        },
                        "BudgetYearFour": {
                            "val": "7.081"
                        },
                        "BudgetYearFive": {
                            "val": "7.201"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Horizontal Battlefield Digitization is a strategy that allows warfighters, from the individual soldier and platform to echelons above corps, to share critical situation awareness (SA) and command and control (C2) information. It conducts analysis and evaluation of new information technologies, concepts, and applications of integrated management activities to meet the dynamic Army acquisition technology requirements. The strategy applies digital information technologies to acquire exchange and employ data throughout the operational environment, and provides a clear and accurate common operational picture for leaders at all levels. This timely sharing of information significantly improves the ability of commanders and leaders to quickly make decisions, synchronize forces and fires, and increase the operational tempo.  Digitization is a means of realizing a fully integrated C2\/SA capability to the platoon level, including interoperability links with joint and multi-national ground forces. The major efforts included in the program element are: 1) Integration and synchronization of the Army's interoperability efforts, coordination of interoperability efforts between joint and multi-national forces, and the synchronization of combat material and training efforts to develop Army information technologies; 2) Systems engineering and integration of hardware and software interfaces between and across the warfighting functions and across multiple Program Executive Offices, providing System of Systems (SOS) integration capabilities that satisfy warfighter requirements and enable the execution of mission operations by providing one Common Operational Picture (COP)\/Common Tactical Picture (CTP). 3) Oversee and support synchronization of LandWarNet Battle Command capabilities and ensure interoperability across the current and future force. 4) Support fielding of integrated systems to Active and Reserve Components (USARNG and USAR) in accordance with Army Force Generation (ARFORGEN). 5) Support the Army Equipping Enterprise System (AE2S) integration of the Force Development Investment Information System (FDIIS), Army Flow Model (AFM) and the Continuous Early Validation (CEaVa) programs into a single integrated system. This supports the Army's Equipping Strategy, ARFORGEN, and consolidates capabilities to gain efficiencies. IAW the National Defense Authorization Act 804 and OSD's report to Congress, Army is poised to implement the \"Agile Business Process\" that will result in an iterative and incremental approach to software development and hardware\/software capability integration.  This process will improve effectiveness in the identification, assessment and acquisition of capability solutions for the Army Network. The $25M Network Integrated Evaluation (NIE) funds budgeted in FY13 in this PE will resource procurements of the material solutions that results from the FY12 NIE Cycle.  The Army will request prior approval reprogramming of this funding into appropriate procurement accounts prior to execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Assessment"
                                    },
                                    "Description": {
                                        "val": "funds are to be used for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technical interoperability assessments, perform interoperability\/integration analyses, analyze networked weapon system and  Situational Awareness (SA), Command and Control (C2), Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems compatibility, and assess technical and operational test plans, activities, and results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.088"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technical interoperability assessments, perform interoperability\/integration analyses, analyze networked weapon system and  Situational Awareness (SA), Command and Control (C2), Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems compatibility, and assess technical and operational test plans, activities, and results."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.560"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.560"
                                            },
                                            "Text": {
                                                "val": "Conduct technical interoperability assessments, perform interoperability\/integration analyses, analyze networked weapon system and  Situational Awareness (SA), Command and Control (C2), Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems compatibility, and assess technical and operational test plans, activities, and results."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SA\/C2\/C4ISR"
                                    },
                                    "Description": {
                                        "val": "funds are to be used for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.815"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and synchronize interoperability across SA\/C2\/C4ISR programs in support of acquisition synchronization, testing, training, and fielding System of Systems capabilities to the Army Force.  Continue application across current and future force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and synchronize interoperability across SA\/C2\/C4ISR programs in support of acquisition synchronization, testing, training, and fielding System of Systems capabilities to the Army Force.  Continue application across current and future force."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.560"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.560"
                                            },
                                            "Text": {
                                                "val": "Integrate and synchronize interoperability across SA\/C2\/C4ISR programs in support of acquisition synchronization, testing, training, and fielding System of Systems capabilities to the Army Force.  Continue application across current and future force."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ditization Technical Integration"
                                    },
                                    "Description": {
                                        "val": "funds are to be for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.842"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.865"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.025"
                                            },
                                            "Text": {
                                                "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AE2S Software"
                                    },
                                    "Description": {
                                        "val": "funds are to be for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Procures AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, CEaVa, COP and AFM"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Procures AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, CEaVa, COP and AFM"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Procures AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, CEaVa, COP and AFM"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint & Coalition Interoperability"
                                    },
                                    "Description": {
                                        "val": "funds the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.255"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.255"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Academic Research"
                                    },
                                    "Description": {
                                        "val": "funds to be used for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply university academic and research resources to the integration of Army complex modeling, simulation, and training in support of modernized forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.570"
                                            },
                                            "Text": {
                                                "val": "Apply university academic and research resources to the integration of Army complex modeling, simulation, and training in support of modernized forces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross-platform development"
                                    },
                                    "Description": {
                                        "val": "funds to be used for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.656"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.210"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Text": {
                                                "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Integrated Evaluation (NIE)"
                                    },
                                    "Description": {
                                        "val": "Funds are available for Congress to place in appropriate procurement accounts prior to execution in FY13."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "Implement agile business solutions through the Network Integrated Evaluation (NIE) cycle in FY12 that address Army system shortcomings and bring efficiency, effectiveness and affordabilaity to an otherwise burdensome process.  This process enables the Army to be more responsive to Soldiers' current needs and avoids long-term production commitments to potentially obsolete technology.  Material solutions to fill capability gaps from the FY12 cycle will be ready for procurement in FY13.  The Army will request prior approval reprogramming of this funding into appropriate procurement accounts prior to execution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "To validate\/demonstrate concepts and requirements, near term efforts are focused on developing a seamless battlefield software architecture and digitized hardware systems to include:  evaluation of the horizontal battlefield digitization resources for systems, acquisition, integration, and testing of digital capability across multiple command and control, communications, sensors, and weapons platforms.  The result will be an integrated, synchronized capability designed to meet the near-term requirements of the Stryker Brigade Combat Teams and the Army Future Force.  Also supports the Army's role in joint and multi-national digitization programs, battle command efforts and Joint Battlefield Situational Awareness."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}