{
    "id": "a1831004def917a57e116f54db71d2fdaac65481",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineItemNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "16.939"
            },
            "CurrentYear": {
                "val": "15.765"
            },
            "BudgetYearOne": {
                "val": "15.068"
            },
            "BudgetYearOneBase": {
                "val": "15.068"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "15.221"
            },
            "BudgetYearThree": {
                "val": "15.783"
            },
            "BudgetYearFour": {
                "val": "15.825"
            },
            "BudgetYearFive": {
                "val": "15.839"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) designs and validates electronic warfare (EW) components that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and booby traps. Project 906 supports protection of high-value ground platforms, aircraft, and the Soldier from threat surveillance and tracking systems; imaging systems; and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital, quality combat information directly to users in a timely, actionable manner. Specifically, it focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. \n\nWork in this PE is complimentary of PE 0602120A (Sensors and Electronic Survivability), PE 0603270A (EW Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC),  Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.330"
                },
                "CurrentYear": {
                    "val": "15.790"
                },
                "BudgetYearOne": {
                    "val": "15.058"
                },
                "BudgetYearOneBase": {
                    "val": "15.058"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.939"
                },
                "CurrentYear": {
                    "val": "15.765"
                },
                "BudgetYearOne": {
                    "val": "15.068"
                },
                "BudgetYearOneBase": {
                    "val": "15.068"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.391"
                },
                "CurrentYear": {
                    "val": "-0.025"
                },
                "BudgetYearOne": {
                    "val": "0.010"
                },
                "BudgetYearOneBase": {
                    "val": "0.010"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.100"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.010"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.010"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.291"
                                },
                                "CurrentYear": {
                                    "val": "-0.025"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.939"
                        },
                        "CurrentYear": {
                            "val": "15.765"
                        },
                        "BudgetYearOne": {
                            "val": "15.068"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.068"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.221"
                        },
                        "BudgetYearThree": {
                            "val": "15.783"
                        },
                        "BudgetYearFour": {
                            "val": "15.825"
                        },
                        "BudgetYearFive": {
                            "val": "15.839"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non-communications threat emitters. This project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fuzed munitions). This project also pursues the ability to neutralize booby traps. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nThis project supports Army science and technology efforts in the Command, Control and Communications, Ground, Soldier and Air portfolios.\n\nWork in this project is complimentary of PE 0602120A (Sensors and Electronic Survivability), PE 0603270A (EW Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes advanced automated exploitation and fusion analysis tools, applications, and software services for the creation of improved intelligence products, common information management and information dissemination systems to facilitate collaboration between intelligence and mission command functions. This will provide relevant and timely information in support of command decisions, such as high value identification and targeting in an asymmetric environment. Work being accomplished under PE 0602120A\/project H15 and PE 0603772A\/project 243 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.220"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated additional fusion algorithms, data, sensor and message types, temporal enhancements, as well as integrated extraction, visualization, and conceptualization tools into a fusion & exploitation framework for improved target tracking and identification; conducted metrics study in support of non-cooperative biometrics for single and multi-modality matching and fusion algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate biometric data matching and fusion algorithms for use in non-cooperative intelligence collection environment; investigate standards of ingestion to facilitate addition of non-cooperatively collected biometrics (partial iris scans, scents, three dimensional (3D) face, thermal face, etc.) into biometrics database; code enhanced algorithms to conduct near-real-time matching and fusion of cooperative and non-cooperative biometric intelligence into enhanced biometric intelligence products; finalize data collection process, generate candidate templates, and conduct non-cooperative sensor data collection to assess the process and templates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Text": {
                                                "val": "Will create and populate non-cooperative biometrics database and assess effectiveness of near-real-time matching and fusion algorithms and data templates; interface cooperative and non-cooperative biometrics databases together to permit sharing and fusion of data; evaluate ability to simultaneously collect, query and match biometrics data in near-real-time using representative tactical communications system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort deigns, codes and evaluates cyber software, tools and techniques that identify and capture data traversing targeted networks for the purpose of computer network operations (CNO) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service. Work being accomplished under PE 0603270A\/project K15 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed capability for identification and capture of protocols of interest; implemented algorithms to allow for surgical and coordinated exploitation amongst nodes; developed traffic analysis techniques to discriminate amongst individual data sessions; developed communication and coordination capabilities between CNO and EW systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.646"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine techniques to perform computer network manipulation to include, traffic redirection, data-in-transit, and network situational awareness; develop comprehensive visualization interface that takes into account CNO and EW missions; assess feasibility of integrating next-generation EW systems with tactical CNO capabilities to maximize effects on targets and minimize the training requirements on operator to executing a CNO mission; develop anti-tamper and adapted offensive components, networking resource mutation for network manipulation, and virtualization\/virtual-machine monitors for isolation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.454"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.454"
                                            },
                                            "Text": {
                                                "val": "Will investigate denial of service\/offensive cyber techniques to counter new threat devices; extend capabilities developed for legacy threat devices to enable a coordinated tactical cyber capability against multiple targets and threat devices simultaneously; design and evaluate offensive denial of service techniques on tactical cyber-capable platforms, to include software defined radios and other ground\/air-based sensors and transmitters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and sensor\/countermeasure components to increase probability of detection of small arms and probability of detection and defeat of man-portable air defense system (MANPADS) type threats for aviation platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.999"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalized infrared (IR) and ultraviolet (UV) sensor integration algorithms; experimented with integration concept of these multispectral sensors and their affect on detection and false alarm in a laboratory environment; determined effectiveness of acoustic sensor in enhancing hostile fire indication (HFI) algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate countermeasure techniques against next-generation MANPADS employing digital imaging seekers; use modeling and simulation and limited hardware-in-the-loop methods to investigate potential effectiveness of current platform-resident IR focal plane arrays, likely tracking algorithms, digital IR countermeasure lasers and available imaging sources against these advanced seekers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.569"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.569"
                                            },
                                            "Text": {
                                                "val": "Will create an end-to-end modeling and simulation (M&S) environment to develop countermeasures against advanced imaging missiles, consisting of realistic representations of the missile digital seekers, their rotorcraft targets, likely countermeasures, effects and atmospheric effects; use this environment to assess effectiveness of known countermeasures and explore new countermeasure techniques to use against these threats; integrate digital seeker hardware surrogates into this M&S environment for use in hardware-in-the-loop simulations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Passive and Active Targeting Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort investigates passive and active techniques and software algorithm design and coding for three dimensional detection, identification, and precision geolocation of next-generation wireless communication threats and improved situational awareness. This effort also addresses operational conditions such as dense, co-channel, and multipath RF environments. This effort continues in FY13 under Multi-Functional Intelligence, Surveillance and Reconnaissance (ISR) Technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhanced geolocation techniques based on results of representative hardware analysis; performed additional simulation and laboratory validation of these enhancements utilizing synthesized and outdoor wireless RF data collected in relevant field environments; transitioned executable software package, software model and associated engineering analysis quantifying technique performance and effectiveness to applicable follow-on technology demonstration, program of record or quick reaction capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.529"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate techniques to improve the resolution of conventional non-cooperative time-difference-of-arrival (TDoA) based geolocation techniques; investigate techniques to overcome multipath effects such as reflection, absorption and diffraction found in complex urban environments that cannot be resolved by traditional TDoA and angle of arrival techniques utilizing electromagnetic propagation mapping tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance (ISR) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical ISR sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors in support of area\/base camp protection and investigating an open, scalable architecture adaptable for multiple base sizes and environments and other ISR sensors. This effort transitions from Passive and Active Targeting Techniques which ends in FY12. Work being accomplished under PE 63772\/243 complements this effort"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.745"
                                            },
                                            "Text": {
                                                "val": "Will design and validate radar waveforms to enable communication and coordination between similar radar sensors without the need for a central node; design and implement noise correlation algorithms to mitigate signal interception and compromise, reduce co-site interference and preserve high resolution target detection capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}