{
    "id": "a2b6ce4ad16036c8e9a18c77628ed627713aa332",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258A"
        },
        "ProgramElementTitle": {
            "val": "TARGET SYSTEMS DEVELOPMENT"
        },
        "R1LineItemNumber": {
            "val": "136"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.362"
            },
            "CurrentYear": {
                "val": "11.229"
            },
            "BudgetYearOne": {
                "val": "14.034"
            },
            "BudgetYearOneBase": {
                "val": "14.034"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "13.488"
            },
            "BudgetYearThree": {
                "val": "12.055"
            },
            "BudgetYearFour": {
                "val": "11.898"
            },
            "BudgetYearFive": {
                "val": "16.359"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program funds aerial and ground target hardware and software development, maintenance, and upgrades.  The overall objective is to ensure validation of weapon system accuracy and reliability by developing aerial and ground targets essential for test and evaluation (T&E).  These targets are economical and expendable, remotely controlled or stationary, and often destroyed in use.  The Army is the Tri-Service lead under Reliance for providing rotary wing, mobile ground, towed, and designated targets for T&E.  The Army executes development of some Service-peculiar target requirements in support of quality assurance, lot acceptance, and training and continues development of Service-peculiar and on-going target materiel upgrades to maintain continuity with current weapons technology and trends in modern and evolving Army weapons."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.614"
                },
                "CurrentYear": {
                    "val": "11.247"
                },
                "BudgetYearOne": {
                    "val": "13.462"
                },
                "BudgetYearOneBase": {
                    "val": "13.462"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.362"
                },
                "CurrentYear": {
                    "val": "11.229"
                },
                "BudgetYearOne": {
                    "val": "14.034"
                },
                "BudgetYearOneBase": {
                    "val": "14.034"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.252"
                },
                "CurrentYear": {
                    "val": "-0.018"
                },
                "BudgetYearOne": {
                    "val": "0.572"
                },
                "BudgetYearOneBase": {
                    "val": "0.572"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.157"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.572"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.572"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.095"
                                },
                                "CurrentYear": {
                                    "val": "-0.018"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "238"
                    },
                    "ProjectTitle": {
                        "val": "AERIAL TARGETS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.385"
                        },
                        "CurrentYear": {
                            "val": "7.623"
                        },
                        "BudgetYearOne": {
                            "val": "10.052"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.052"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.031"
                        },
                        "BudgetYearThree": {
                            "val": "8.678"
                        },
                        "BudgetYearFour": {
                            "val": "8.488"
                        },
                        "BudgetYearFive": {
                            "val": "8.628"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aerial Targets support Army Transformation by providing for development, acquisition, operation, storage, update, and maintenance of realistic surrogate or acquired threat high-performance, multi-spectral aerial targets and development of virtual target computer models of aerial targets. Modern weapons require test, evaluation, and training using threat representative aerial targets to assess their effectiveness on the battlefield.  This program encompasses a family of rotary and fixed-wing targets; full-scale, miniature, and subscale targets; virtual targets; ancillary devices; and their control systems.  These products are required to adequately stress weapon systems undergoing test and evaluation (T&E).  In order to stress systems during T&E, aerial targets must have flight characteristics, signatures, and other performance factors that emulate the modern threat.  This program includes long-range planning to determine future target needs and development of coordinated requirement documents; the management of target research, development, test and evaluation process; execution of the validation process to ensure that surrogate targets adequately represent the threat; development and acquisition of surrogate and acquired targets; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of the developed and acquired threat targets to ensure availability for the T&E customer.  The Army is the Reliance lead for rotary wing targets and towed target developments and the Tri-Service lead for procurement and enhancement of the MQM-107 fixed wing target."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Rotary Wing Targets."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the Rotary Wing Targets, including updates for obsolescence, maintenance, and safety to support Test & Evaluation (T&E) programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.478"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the Rotary Wing Targets, including updates for obsolescence, maintenance, and safety to support T&E programs such as Navy Standard Missile (SM-6), Navy LHA air defense upgrades, and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the Rotary Wing Targets program to provide flight operations of Department of Defense's (DoD) current fleet of helicopters.  Rotary Wing Targets also provides updates for obsolescence, maintenance, and safety to support T&E programs such as Navy Standard Missile (SM-6), Navy LHA air defense upgrades, and Army and Navy Aircraft Survivability development projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.468"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the Rotary Wing Targets program to provide flight operations of DoD's current fleet of helicopters.  Rotary Wing Targets will also provide updates for obsolescence, maintenance, and safety to support T&E programs such as Navy Standard Missile (SM-6), Navy LHA air defense upgrades, and Army and Navy Aircraft Survivability development projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the High Speed Aerial Target."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the High Speed Aerial Target (HSAT, MQM-107) equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.241"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the aging High Speed Aerial Target (HSAT, MQM-107) equipment to overcome obsolescence for spare and repair parts, and to maintain equipment and documentation for safe operations supporting T&E programs such as Patriot, Stinger, Joint Land Attack Cruise Missile Defense Elevated Netted Sensors (JLENS), MEADS, and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.297"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the aging High Speed Aerial Target (HSAT, MQM-107) that provides a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds are required to overcome obsolescence for spare and repair parts, and to maintain equipment and documentation for safe operations supporting T&E programs such as Patriot, Stinger, JLENS, MEADS, and classified programs for Army and Tri-Service customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.357"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.357"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the aging High Speed Aerial Target (HSAT, MQM-107) that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds are required to overcome obsolescence for spare and repair parts, and to maintain equipment and documentation for safe operations supporting T&E programs such as Patriot, Stinger, JLENS, MEADS, and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Target Tracking Control Systems (TTCS) and aerial target control components."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the TTCS and aerial target control components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the TTCS and aerial target control components. Updated documentation of the system and operations and maintenance manuals. Supported operational repair and maintenance with engineering analysis of target control system performance. Provided for design modifications to solve obsolescence problems and updated software to correct anomalies. Provided for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. This provided support to programs such as Patriot, MEADS and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the TTCS and aerial target control components. Provides for design modifications to solve obsolescence problems and updates software to correct anomalies. Provides for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Updates documentation of the system and operations and maintenance manuals. Supports operational repair and maintenance with engineering analysis of target control system performance. This will provide support to programs such as Patriot,  MEADS, and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.620"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the TTCS and aerial target control components. Will provide for design modifications to solve obsolescence problems and updates software to correct anomalies. Will provide for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Will updates documentation of the system and operations and maintenance manuals.  Will support operational repair and maintenance with engineering analysis of target control system performance. This will provide support to programs such as Patriot,  MEADS, and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Towed Targets\/Ancillary devices."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the Towed Targets\/Ancillary devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.621"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the Towed Targets\/Ancillary devices. Continued development, enhancement, maintenance, and storage for all Research, Development, Test and Evaluation (RDT&E) aerial targets, towed targets, and ancillary devices. Continuef development and testing of Low Cost Towed target systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the Towed Targets\/Ancillary devices. Continues development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continues development and testing of Low Cost Towed target systems (Cruise Missile Tow Target, Reduced Radar Tow Target, and the Special Low Altitude Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Investigate\/test other cost-saving towed systems (Glide-Tow, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.783"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.783"
                                            },
                                            "Text": {
                                                "val": "Will Continue EMD for the Towed Targets\/Ancillary devices. Will continue development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Will continue development and testing of Low Cost Towed target systems (Cruise Missile Tow Target, Reduced Radar Tow Target, and the Special Low Altitude Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Will investigate\/test other cost-saving towed systems (Glide-Tow, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Integrated Avionics Package (IAP)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the IAP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.234"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the IAP. Designs component changes to correct for obsolescence.  Updated software to correct problems and to modify the software to support specific test and evaluation mission requirements.  IAP provided the avionics for aerial targets to support multiple mission requirements for programs such as Patriot, and MEADS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the IAP. Designs component changes to correct for obsolescence. Update software to correct issues and to modify the software to support specific test and evaluation mission requirements. IAP provides the avionics for aerial targets to support multiple mission requirements for programs such as Patriot and MEADS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.258"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.258"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the IAP which provides the avionics for aerial targets to support multiple mission requirements for programs such as Patriot, and MEADS. Will design component changes to correct for obsolescence. Will update software to correct issues and to modify the software to support specific test and evaluation mission requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for Aerial Virtual Targets."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for Aerial Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focused on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis,and radar analysis simulations; supported verification and validation of models, and provided archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models were employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that were too costly or difficult to be conducted under actual field conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.936"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis,and radar analysis simulations; supports verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models are being used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS) and Lower Tier Patriot offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.031"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.031"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; will focus on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis,and radar analysis simulations; will support verification and validation of models, and will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models will be employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS) and Lower Tier Patriot offices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Army Ground Aerial Target Control System (AGATCS)."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activities for the Army Ground Aerial Target Control System (AGATCS). which will support a modern current technology target control system for control of both aerial and ground targets."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.636"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will fund EMD for the AGATCS which will provide a modern current technology target control system for control of both aerial and ground targets. The system will incorporate software for control of existing targets and have provisions for control of future target systems.  Replaces the existing aerial target control TTCS and several different ground target control systems that have become or will soon become obsolete and non-supportable with a Department of Defense Information Assurance Certification and Accreditation Process (DIACAP) compliant control system.  Provides control system components within the aerial and ground targets to be controlled by the AGATCS.  This will provide support to programs such as Patriot, MEADS, E-IBCT, Apache, and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.962"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.962"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the AGATCS which will provide a modern current technology target control system for control of both aerial and ground targets. The system will incorporate software for control of existing targets and will have provisions for control of future target systems. Will replace the existing aerial target control TTCS and several different ground target control systems that have become or will soon become obsolete and non-supportable with a DIACAP compliant control system. Will provide control system components within the aerial and ground targets to be controlled by the AGATCS. This will provide support to programs such as Patriot, MEADS, E-IBCT, Apache, and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Unmanned Aerial System - Target (UAS-T)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the UAS-T to provide threat representative support for test and experimentation missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.459"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the UAS-T to provide threat representative support for test and experimentation missions including Counter Rockets, Artillery and Mortars (C-RAM), and Black Dart 2011. Provided management for the initial delivery of production air vehicles, initial ground support equipment, initial spares, and operational test support missions. Funds enabled identification and correction of system anomalies identified during operations. Provided for the demonstration flights of production air vehicles to verify the performance of the production equipment. Provided limited engineering capability to address minor enhancements to the basic target system identified during operations including the upgrading of the launcher pneumatic ball valve assembly, the replacement of an obsolete servo used in the parachute hatch locking and electronic payloads required to support test and range requirements. Provided for the updating of the system drawing package to incorporate launcher and parachute hatch locking mechanism modifications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.577"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the UAS-T to operate and maintain a generic, tactical class, unmanned aircraft system target to support a wide variety of test requirements as well as to provide threat representative support for test and experimentation missions including Counter Rockets, Artillery and Mortars (C-RAM), Black Dart 2012, missile enhancements and Littoral Combat Ship testing.  Funds enable identification and correction of system anomalies identified during operations. Provide for the demonstration flights of production air vehicles to verify the performance of the production equipment. Provide limited engineering capability to address minor enhancements to the basic target system identified during operations. Provide for the updating of the system drawing package and Operation and Maintenance manual to incorporate modifications made to the system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.573"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.573"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the UAS-T to operate and maintain a generic, tactical class, unmanned aircraft system target to support a wide variety of test requirements as well as to provide threat representative support for test and experimentation missions including Counter Rockets, Artillery and Mortars (C-RAM), Black Dart 2013, missile enhancements and Littoral Combat Ship testing.  Funds will enable identification and correction of system anomalies identified during operations. Will provide for the demonstration flights of production air vehicles to verify the performance of the production equipment. Will provide limited engineering capability to address minor enhancements to the basic target system identified during operations. Will provide for the updating of the system drawing package and Operation and Maintenance manual to incorporate modifications made to the system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "459"
                    },
                    "ProjectTitle": {
                        "val": "GROUND TARGETS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.977"
                        },
                        "CurrentYear": {
                            "val": "3.606"
                        },
                        "BudgetYearOne": {
                            "val": "3.982"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.982"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.457"
                        },
                        "BudgetYearThree": {
                            "val": "3.377"
                        },
                        "BudgetYearFour": {
                            "val": "3.410"
                        },
                        "BudgetYearFive": {
                            "val": "7.731"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program funds Army efforts to support test and evaluation (T&E) of advanced weapon systems and supports Army Transformation by developing surrogates, acquiring foreign equipment and developing virtual target computer models of ground vehicle targets. These products are required to adequately stress weapon systems undergoing T&E. This tasking includes long-range planning to determine future target needs and development of coordinated requirement documents; the centralized management of the ground target research, development, test and evaluation processes; execution of the validation process; acquisition of foreign equipment; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of developed and acquired targets to ensure availability for T&E customers. This program also manages use of current assets and operates centralized spare parts program. The US Army is the Tri-Service lead for providing mobile ground targets for T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation for the Mobile Ground Target Operations."
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation for the Mobile Ground Target Operations to provide oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management.  Efforts support users such as Brigade Combat Team (BCT), Apache Block III, Guided Multiple Launch Rocket System (GMLRS), and others."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.493"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation for the Mobile Ground Target Operations provided oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management.  Efforts supported users such as Brigade Combat Team (BCT), Apache Block III, Guided Multiple Launch Rocket System (GMLRS), and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.594"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation for the Mobile Ground Target Operations to provide oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management for 138 active and 171 inactive Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts support users such as Brigade Combat Team (BCT), Apache Block III, Guided Multiple Launch Rocket System (GMLRS), and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.798"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation for the Mobile Ground Target Operations to provide oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management for 138 active and 171 inactive Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts will support users such as Brigade Combat Team (BCT), Apache Block III, Guided Multiple Launch Rocket System (GMLRS), and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation for Mobile Ground Target Hardware."
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation for Mobile Ground Targets threat fleet with up to date threat representative targets."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.456"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.456"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation for Mobile Ground Targets threat fleet with up to date threat representative targets that emulate the visual, infrared, radio frequency, and acoustic signatures to support T&E customers such as BCT, Grey Eagle, Javelin, Apache Block III and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation for Ground Virtual Targets."
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation to support the research and development of Ground Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.776"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation funded the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Involved the simulation target models of wheeled and tracked ground vehicles in commonly used model formats as well as develops simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations.  Supported verification and validation of models, and provided archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models were employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that were too costly or difficult to be conducted under actual field conditions.  These models were used by multiple DoD agencies and weapon systems such as Close Combat Weapon System (CCWS) and Longbow Hellfire."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.751"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Focuses on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; develops simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations; supports verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models are employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models are used by multiple DoD agencies and multiple weapon systems such as the Joint Air to Ground Missile (JAGM) and Longbow Hellfire offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.728"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.728"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Will focus on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; will develop simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations; will support verification and validation of models, and will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models will be employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets will support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models will be used by multiple DoD agencies and multiple weapon systems such as the Joint Air to Ground Missile (JAGM) and Longbow Hellfire offices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evalution for Operational Threat Vehicle Company."
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evalution to fund the acquisition and fielding of fully mission capable targets (T-72 Main Battle Tanks, BMP-2 Infantry Fighting Vehicles, and BTR-80 Armored Personnel Carriers)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.708"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evalution funded the acquisition and fielding of fully mission capable targets (T-72 Main Battle Tanks, BMP-2 Infantry Fighting Vehicles, and BTR-80 Armored Personnel Carriers) to meet emerging requirements for threat representative missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.261"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government System Test and Evalution to fund certification and fielding of fully mission capable targets (T-72 Main Battle Tanks, BMP-2 Infantry Fighting Vehicles, and BTR-80 Armored Personnel Carriers) to meet emerging requirements for threat representative missions.  This program provides realistic threat capable targets for use in force-on-force exercises to allow Blue Forces to think and adapts to the changing battle dynamic as it unfolds."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}