{
    "id": "a5c50b1bd1744515e67ef1f74c712ff43ea59749",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603729N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Protection Adv Tech"
        },
        "R1LineItemNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "54.356"
            },
            "CurrentYear": {
                "val": "56.819"
            },
            "BudgetYearOne": {
                "val": "3.880"
            },
            "BudgetYearOneBase": {
                "val": "3.880"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "4.766"
            },
            "BudgetYearThree": {
                "val": "4.845"
            },
            "BudgetYearFour": {
                "val": "4.819"
            },
            "BudgetYearFive": {
                "val": "4.899"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis program supports the development and demonstration of field medical equipment, diagnostic capabilities and treatments; technologies to improve warfighter safety and to enhance personnel performance under adverse conditions; and systems to prevent occupational injury and disease in hazardous, deployment environments.  Navy investment in these areas is essential because Navy\/USMC mission needs are not adequately addressed by the civilian sector or other Federal agencies.  For example, civilian emergency medicine does not address casualty stabilization during long transit times to definitive care.  The National Institutes of Health (NIH) focuses on the basic science of disease processes and not product development.  Programs are coordinated with other Services through the Armed Services Biomedical Research Evaluation Management (ASBREM) Committee to prevent duplication of effort.  This project funds the Force Health Protection program a Future Naval Capability (FNC) that will provide technology options for future Navy and Marine Corps capabilities and supports the \"Sea Warrior\" component of the Naval Transformation Roadmap, medical logistics aspects of \"Sea Basing\" and expeditionary force medical support associated with \"Sea Strike\".\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.076"
                },
                "CurrentYear": {
                    "val": "18.119"
                },
                "BudgetYearOne": {
                    "val": "23.213"
                },
                "BudgetYearOneBase": {
                    "val": "23.213"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "54.356"
                },
                "CurrentYear": {
                    "val": "56.819"
                },
                "BudgetYearOne": {
                    "val": "3.880"
                },
                "BudgetYearOneBase": {
                    "val": "3.880"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "36.280"
                },
                "CurrentYear": {
                    "val": "38.700"
                },
                "BudgetYearOne": {
                    "val": "-19.333"
                },
                "BudgetYearOneBase": {
                    "val": "-19.333"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "38.700"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.184"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.515"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-19.370"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-19.370"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.037"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.037"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.281"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "37.260"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2914"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Protection Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.285"
                        },
                        "CurrentYear": {
                            "val": "18.119"
                        },
                        "BudgetYearOne": {
                            "val": "3.880"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.880"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.766"
                        },
                        "BudgetYearThree": {
                            "val": "4.845"
                        },
                        "BudgetYearFour": {
                            "val": "4.819"
                        },
                        "BudgetYearFive": {
                            "val": "4.899"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program supports the development and demonstration of field medical equipment, diagnostic capabilities and treatments; technologies to improve warfighter safety and to enhance personnel performance under adverse conditions; and systems to prevent occupational injury and disease in hazardous, deployment environments.  Navy investment in these areas is essential because Navy\/USMC mission needs are not adequately addressed by the civilian sector or other Federal agencies.  For example, civilian emergency medicine does not address casualty stabilization during long transit times to definitive care.  The NIH focuses on the basic science of disease processes and not product development.  Programs are coordinated with other Services through the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee to prevent duplication of effort.  This project funds the Force Health Protection program a Future Naval Capability (FNC)that will provide technology options for future Navy and Marine Corps capabilities and supports the \"Sea Warrior\" component of the Naval Transformation Roadmap, medical logistics aspects of \"Sea Basing\" and expeditionary force medical support associated with \"Sea Strike\"."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CASUALTY CARE AND MANAGEMENT"
                                    },
                                    "Description": {
                                        "val": "The goal of Casualty Care and Management is to maximize the continuum of care with lifesaving interventions as close to the battlespace as possible.  This is in an increasingly lethal battlespace, with reduced infrastructure and logistics.\n\nFY 2011 to FY 2012 funding increase is due to the development of the Automated Critical Care System (ACCS), FNC efforts in the activity. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Force Health Protection.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued study to demonstrate selectivity\/specificity of biomarkers for mild & moderate RNT in appropriate pre-clinical model.\n- Continued efforts to develop advanced technologies for First Responders.\n- Continued efforts to develop advanced technologies to support the Forward Resuscitative Surgical System\/ Expeditionary\nResuscitative Surgical Systems (FRSS\/ERSS).\n- Continued program to develop advanced technologies to support En Route Care of casualties.\n- Continued preclinical study to evaluate use of vasopressin to manage traumatic brain injury (TBI).\n- Continued efforts to develop prototype technology for closed-loop resuscitation for USMC En Route Care system.\n- Continued program to examine comorbidity of traumatic brain injury. (Continuation of similar effort funded in Healthy and Fit Force Activity.)\n- Continued pharmacologic research studies to support an FDA Investigational New Drug (IND) application.\n- Continued efforts to develop advanced technologies to support Rapid Blood Treatment. (Previously identified as First\nResponder.)\n- Continued efforts to develop advanced technologies to support Advanced Forward Care. (Previously identified as FRSS\/ERSS.)\n- Continued efforts to develop advanced technologies to support Warfighter Restoration. (Previously identified as En Route Care.)\n- Initiated development of multifunctional blood substitute program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Continue development of multifunctional blood substitute program.\n- Initiate development of the Automated Critical Care System (ACCS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CASUALTY PREVENTION"
                                    },
                                    "Description": {
                                        "val": "Casualty Prevention includes protecting the warfighter from environmental, occupational and battlefield threats.\n\nFY 2011 to FY 2012 funding decrease is due to the realignment of funding to support the development of the Automated Critical Care System FNC enabling capabilities effort. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Force Health Protection.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.871"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to mitigate the effects of environmental and other threats to health.\n- Continued efforts to reduce operational injuries.\n- Continued research to determine the safety and efficacy of perfluorocarbons in treating decompression sickness and arterial gas embolism.\n- Continued development of tools to prevent psychological stress and PTSD.\n- Continued efforts to model head and neck injuries due to accelerated forces; operational injuries.\n- Continued research to enhance force readiness by mitigating the impact of environmental stressors.\n- Continued development of Human Injury and Treatment (HIT) model to assess personnel survivability, optimal personnel treatment, and restoration of ship operational capabilities.\n- Completed research to determine the safety and efficacy of perfluorocarbons in treating decompression sickness and arterial gas embolism."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less those noted as completed above.\n- Initiate development of  Perfluorocarbon-based treatments for explosive blast injuries and hypoxia and lung damage from extreme environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL NOISE-INDUCED HEARING LOSS (NIHL)"
                                    },
                                    "Description": {
                                        "val": "The goal of this program is to reduce the incidence of NIHL by nearly 100%. This program employs a total systems engineering approach that includes advancements in medical technology, jet engine physics, personal protective equipments, and mitigation analyses.  \n\nFY 2011 to FY 2012 funding decrease is due to the realignment of research efforts to support development of Jet Noise Reduction initiatives.\n\nFY 2012 to FY 2013 funding is due to an increase in support of the research efforts to Jet Noise Reduction Initiatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.358"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued advanced research in medical prevention and treatment of NIHL and tinnitus (ringing in the ears).\n- Continued advanced research to reduce noise at the source, jet engine quieting and flight deck noise reduction.\n- Continued advanced research to improve personal protective equipment technology.\n- Continued advanced research to study the incidence and susceptibility of NIHL and tinnitus, and to evaluate mitigation strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.995"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Initiate research to reduce noise at the source, i.e., shipboard and flight deck noise reduction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Efforts within this PE are measured at two levels.  At the lower level, each is measured against technical and financial milestones on a monthly basis.  Annually, each project is reviewed in depth for technical and transition performance by the Chief of Naval Research (CNR)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.071"
                        },
                        "CurrentYear": {
                            "val": "38.700"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "75.771"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "CW Bill Young Marrow Donor Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "31.340"
                                        },
                                        "Text": {
                                            "val": "This effort supported the research of the C.W. Bill Young Bone Marrow Donor Recruitment and Research Program."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "31.500"
                                        },
                                        "Text": {
                                            "val": "This effort continues the research of the C.W. Bill Young Bone Marrow Donor Recruitment and Research Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Special Warfare Performance and Injury Prevention Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.731"
                                        },
                                        "Text": {
                                            "val": "This effort continued work at Naval Special Warfare Group 2 (Little Creek) and Naval Special Warfare Group 4, Special Boat Team 22 (Stennis), and initiated a new work effort at Seal Qualification Training (Coronado) to strategically maximize human capital by reducing the rate of unintentional musculoskeletal injury, sharpen battlefield performance, optimize military readiness, extend the tactical life cycle of the Operator, and enhance quality of life of the Operator after service."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.200"
                                        },
                                        "Text": {
                                            "val": "This effort continued the data collection at Naval Special Warfare Group 2 (Little Creek) and Naval Special Warfare Group 4, Special Boat Team 22 (Stennis), Seal Qualification Training (Coronado) to strategically maximize human capital by reducing the rate of unintentional musculoskeletal injury, sharpen battlefield performance, optimize military readiness, extend the tactical life cycle of the Operator, and enhance quality of life of the Operator after service.  Established human performance laboratory at Coronado."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}