{
    "id": "a7453a6038e88397148e099d8cc3e98245ae31e4",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V2_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604281F"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL DATA NETWORKS ENTERPRISE"
        },
        "R1LineItemNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "192.882"
            },
            "CurrentYear": {
                "val": "47.057"
            },
            "BudgetYearOne": {
                "val": "24.534"
            },
            "BudgetYearOneBase": {
                "val": "24.534"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "25.116"
            },
            "BudgetYearThree": {
                "val": "17.268"
            },
            "BudgetYearFour": {
                "val": "19.105"
            },
            "BudgetYearFive": {
                "val": "22.138"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Tactical Data Networks Enterprise (TDNE) contributes to the development, delivery and deployment of the next generation aerial layer network through a portfolio of legacy and advanced waveform and network management development\/management efforts that advance interoperability and connectivity.  This will be accomplished via fielded and future ground and gateway investments while addressing warfighter urgent demands through the establishment of Quick Reaction Capabilities (QRC).  The TDNE conceptualizes, acquires and fields aerial networking capabilities to support legacy, current, in-development, and future systems across all domains of information exchange that enables strike, mobility, special operations, Command and Control (C2), Intelligence, Surveillance and Reconnaissance (ISR), air, surface, subsurface and space operations.  These capabilities ensure a robust and agile extension of the global information domain down to the tactical edge in support of the warfighter.\n\nFunding will provide for the study, analysis, enhancement, development, integration, demonstration, test, and evaluation of Tactical Data Links (TDLs) as a subset of the broader Aerial Layer Network.  TDLs are used in both peace time and combat environments to exchange information such as character-oriented and fixed-formatted messages, data, radar tracks, target information, platform status, imagery, free-text messaging and command assignments.  TDLs provide interoperability, local and global connectivity, and situational awareness to the user when operating under rapidly changing operational conditions.  TDLs increase mission effectiveness by providing enhanced situational awareness, positive combat identification of aircraft in the network, correlation of on- and off-board sensor data, digital sharing of machine to machine target and threat information, thereby, enabling time critical targeting and other mission assignment tasking. TDLs are used by all Service Theater Command and Control (C2) elements, weapons platforms, and sensors. TDLs include, but are not limited to: Link 16, Link 11, Situational Awareness Data Link (SADL), Variable Message Format (VMF), Intra-Flight Data Link (IFDL), and other Advanced Tactical Data Link technologies, such as Tactical Targeting Network Technology (TTNT), and Multifunction Advanced Data Link (MADL). \n\nFunding also supports Family of Gateway study, analysis, enhancement, development, integration, demonstration, test, and evaluation efforts that will allow joint combat forces to exchange information quickly and accurately by bridging discrete airborne, terrestrial, maritime, and space-based C4ISR networks to produce operational effects not possible within individual networks.  Gateway functions include enabling interoperability between data formats, protocols, and communication mediums.  Additionally, gateway functions extend the range of connectivity, consolidate data from multiple networks into high capacity links for transmission to key C4ISR nodes, routes information between disadvantaged users, and correlates data from multiple sources to improve accuracy.  Gateway functions also provide application hosting, shared data storage, on-demand information access, smart data forwarding, and system monitoring\/network management.  Funding will also support Quick Reaction Response capability requests by the warfighter and support activities associated with the Joint Aerial Layer Network (JALN) Analysis of Alternatives.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "132.941"
                },
                "CurrentYear": {
                    "val": "52.355"
                },
                "BudgetYearOne": {
                    "val": "32.351"
                },
                "BudgetYearOneBase": {
                    "val": "32.351"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "192.882"
                },
                "CurrentYear": {
                    "val": "47.057"
                },
                "BudgetYearOne": {
                    "val": "24.534"
                },
                "BudgetYearOneBase": {
                    "val": "24.534"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "59.941"
                },
                "CurrentYear": {
                    "val": "-5.298"
                },
                "BudgetYearOne": {
                    "val": "-7.817"
                },
                "BudgetYearOneBase": {
                    "val": "-7.817"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-1.048"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-4.250"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "59.941"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.817"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.817"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11 Congressional General Reduction of 0.658M in Other Adjustment row.\n\nFY11 OMNIBUS increase of 60.599M in Other Adjustment row.\n\nFY12 Congressional General Reduction (FFRDC, Sec. 8023) of 1.048M.\n\nFY12 Congressional Directed Reduction of 4.25M from FY12 Defense Appropriation Act (incl. 3.0M for STRATCOM DNC2 and 1.25M for CLIP)\n\nFY13 funding decrease is due to programs transitioning to sustainment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "655050"
                    },
                    "ProjectTitle": {
                        "val": "TDL System Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "67.362"
                        },
                        "CurrentYear": {
                            "val": "32.636"
                        },
                        "BudgetYearOne": {
                            "val": "20.310"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.310"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.604"
                        },
                        "BudgetYearThree": {
                            "val": "17.268"
                        },
                        "BudgetYearFour": {
                            "val": "19.105"
                        },
                        "BudgetYearFive": {
                            "val": "22.138"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding will provide for the study, analysis, enhancement, development, integration, demonstration, test, and evaluation of Tactical Data Links (TDL) as a subset of the broader Aerial Layer Network.  TDLs are used in both peacetime and combat environments to exchange information such as character-oriented and fixed-formatted messages, data, radar tracks, target information, platform status, imagery, free-text messaging and command assignments.  TDLs provide interoperability, local and global connectivity, and situational awareness to the user when operating under rapidly changing operational conditions.  TDLs increase mission effectiveness by providing enhanced situational awareness, positive combat identification of aircraft in the network, correlation of on- and off-board sensor data, digital sharing of machine to machine target and threat information and, thereby, enabling time critical targeting and other mission assignment tasking. TDLs are used by all Service Theater Command and Control (C2) elements, weapons platforms, and sensors.  \n\nThe number of Air Force platforms hosting TDLs has expanded from C2 aircraft (E-3, E-8, etc.) to the fighter, bomber, Intelligence, Surveillance and Reconnaissance (ISR), tanker, airlift and other tactical fleets (F-15, F-16, F-22A, Rivet Joint, B-1, B-2, B-52, etc.), as well as to precision guided munitions. Utilization of TDLs in a joint environment requires the integration of terminals into host platforms and interoperability of TDL networks across all deployed joint and coalition platforms.\n\nEfforts in this project include waveform and integration activities. \n\nWaveform:\nWaveform activities include, but are not limited to, enabling and supporting Joint Interoperability of Tactical Command and Control Systems (JINTACCS), interoperable System Management and Requirements Transformation (iSMART), Coalition Interoperability, Cursor on Target, Tactical Edge Network C2 efforts, and Link 16 Enhancements.  Funding will provide training, logistics development, certification of individual TDL implementations to joint\/allied standards, establishment of service-wide network management procedures\/operations, and system wide enhancements\/testing.\n\nIntegration:\nIntegration activities include, but are not limited to, the Joint Aerial Layer Network (JALN) Analysis of Alternatives (AoA), Data Link Test Facility (DTF), Air Force Participating Test Unit (AFPTU), Network Centric Capability Assessment (NCCA), the Joint Warfighting Integrated NetOps (JWIN) Joint Concept Technology Demonstration (JCTD), and Tactical Communications Suite (TCS).  Funding will ensure continued enhanced interoperability of Air Force and joint assets through efforts such as the development\/coordination of all TDN standards and management capabilities, configuration management, platform\/system interoperability assessments, participation in the Future Airborne Capability Environment (FACE) consortium, and interoperability certification testing.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning efforts for Tactical Data Networks.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Link 16 Enhancements"
                                    },
                                    "Description": {
                                        "val": "Link 16 Support and Sustainment efforts include enhancements to Link 16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.683"
                                            },
                                            "Text": {
                                                "val": "Funding supported and enabled enhancements to the Link 16 network to include the development and prototyping of the Enhanced 1553 bus chipset."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Enabled Weapons (NEW)"
                                    },
                                    "Description": {
                                        "val": "Network Enabled Weapons efforts standardize weapon additions to the tactical data network; enhance precision-guided munitions effectiveness through target updates, in-flight tracking, hit indication, and abort messages; and improves operational assessment, re-strike decisions, and ISR tasking decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.744"
                                            },
                                            "Text": {
                                                "val": "Completed Link 16 message standard updates allowing for the future integration of network enabled weapons into current and future warfighting capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TDN Integration"
                                    },
                                    "Description": {
                                        "val": "TDN Integration efforts include JSS, IFS, DTF, NCCA, JAN-TE, Coalition Interoperability, JALN AoA, and JWIN JCTD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.965"
                                            },
                                            "Text": {
                                                "val": "Funding provided training, logistics, development, and certification to individual TDL implementations to joint\/allied standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.832"
                                            },
                                            "Text": {
                                                "val": "Funding provides training, logistics, development, and certification to individual TDL implementations to joint\/allied standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.050"
                                            },
                                            "Text": {
                                                "val": "Funding will provide training, logistics, development, and certification to individual TDL implementations to joint\/allied standards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Interoperability of Tactical Command and Control Systems (JINTACCS)"
                                    },
                                    "Description": {
                                        "val": "JINTACCS efforts include JINTACCS, iSMART, and AFPTU. JINTACCS ensures interoperability of AF TDL systems with associated joint, allied, and coalition systems and includes development, interoperability certification, TDL message standard implementation (e.g., Links 11A\/B, 16, 22, VMF, IBS, MADL), and configuration management of standards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.217"
                                            },
                                            "Text": {
                                                "val": "Ensured compatibility and interoperability of Tactical Data Links by  conducting necessary joint compatibility and interoperability tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.353"
                                            },
                                            "Text": {
                                                "val": "Ensuring compatibility and interoperability of Tactical Data Links by conducting necessary joint compatibility and interoperability tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.387"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.387"
                                            },
                                            "Text": {
                                                "val": "Funding will ensure compatibility and interoperability of Tactical Data Links by conducting necessary joint compatibility and interoperability tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cursor on Target (CoT)"
                                    },
                                    "Description": {
                                        "val": "CoT is a simple, extensible, 'What, When, Where' (W3) XML message format for interconnecting tactical information systems. The CoT suite consists of the W3 base schema, 14 tailored sub-schemas, and a set of S\/W plug-ins and translators that faciliate machine to machine (M2M) transmission of C2, ISR, and situational awareness data at reduced cost compared with traditional integration methods."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.495"
                                            },
                                            "Text": {
                                                "val": "Funding supports development, test, certification and accreditation of new CoT apps\/plug-ins\/schema and transitioning of apps\/plug-ins\/schema to sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.528"
                                            },
                                            "Text": {
                                                "val": "Funding will support development, test, certification and accreditation of new CoT apps\/plug-ins\/schema and transitioning of apps\/plug-ins\/schema to sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gateways Integration"
                                    },
                                    "Description": {
                                        "val": "Supporting integration efforts including CLIP, Quick Reaction Capabilities (QRC), that cover work to support AF and Joint Urgent Operational Needs, CABLE, and Other Gateways."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.753"
                                            },
                                            "Text": {
                                                "val": "Supported integration efforts including CLIP, Quick Reaction Capabilities (QRC), that cover work to support AF and Joint Urgent Operational Needs, CABLE, and Other Gateways."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.956"
                                            },
                                            "Text": {
                                                "val": "Supporting integration efforts including CLIP, Quick Reaction Capabilities (QRC), that cover work to support AF and Joint Urgent Operational Needs, and Other Gateways."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.345"
                                            },
                                            "Text": {
                                                "val": "Funding will support integration efforts including QRC, that cover work to support AF and Joint Urgent Operational Needs, and Other Gateways."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0207445F"
                                    },
                                    "Title": {
                                        "val": "Fighter TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.756"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0207448F"
                                    },
                                    "Title": {
                                        "val": "C2ISR TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.528"
                                        },
                                        "CurrentYear": {
                                            "val": "1.522"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.633"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.633"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.650"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.691"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.736"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.755"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207445F"
                                    },
                                    "Title": {
                                        "val": "Fighter TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.920"
                                        },
                                        "CurrentYear": {
                                            "val": "0.741"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.148"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.704"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.572"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.721"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207446F"
                                    },
                                    "Title": {
                                        "val": "Bomber TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.616"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.696"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.429"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207448F"
                                    },
                                    "Title": {
                                        "val": "C2ISR TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.957"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.832"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.921"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.963"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.973"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0604281F"
                                    },
                                    "Title": {
                                        "val": "TDN Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF, PE 0604281F"
                                    },
                                    "Title": {
                                        "val": "TDN Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.622"
                                        },
                                        "CurrentYear": {
                                            "val": "10.388"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.269"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.269"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.248"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.169"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.170"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.173"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M AF, PE 0207445F"
                                    },
                                    "Title": {
                                        "val": "Fighter TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.200"
                                        },
                                        "CurrentYear": {
                                            "val": "0.210"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.249"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.249"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.254"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.258"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.265"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.276"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M AF, PE 0401839F"
                                    },
                                    "Title": {
                                        "val": "Air Mobility TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.937"
                                        },
                                        "CurrentYear": {
                                            "val": "2.025"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.989"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.989"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.031"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.974"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.925"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M AF, PE 0604281F"
                                    },
                                    "Title": {
                                        "val": "TDN Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "288.541"
                                        },
                                        "CurrentYear": {
                                            "val": "434.330"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.132"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.132"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.058"
                                        },
                                        "BudgetYearThree": {
                                            "val": "36.952"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.128"
                                        },
                                        "BudgetYearFive": {
                                            "val": "37.521"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Airborne Networking Directorate provides for common development, integration, and interoperability across the entire Airborne Network and ensures that data links are procured and maintained as a joint, end-to-end command and control systems. Platform acquisition strategies vary by program, but the majority of development and integration is normally accomplished by the weapon system prime contractor."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604281F_BPAC_655050_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NEW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JSS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TDN Integration\/Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Joint Interoperability of Tactical Command and Control Systems (JINTACCS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Interoperable System Management and Requirements Transformation (iSMART)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Data Link Test Facility\/Air Force Participating Test Unit (DTF\/AFPTU)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Cursor on Target (CoT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "655262"
                    },
                    "ProjectTitle": {
                        "val": "Family of Gateways"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "125.520"
                        },
                        "CurrentYear": {
                            "val": "14.421"
                        },
                        "BudgetYearOne": {
                            "val": "4.224"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.224"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.512"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "FY 2011 funding totals include $30.0M appropriated for Overseas Contingency Operations."
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding supports Family of Gateway study, analysis, enhancement, development, integration, demonstration, test, and evaluation efforts that will allow joint combat forces to exchange information quickly and accurately by bridging discrete airborne, terrestrial, maritime, and space-based C4ISR networks to produce operational effects not possible within individual networks.  Gateway functions include enabling interoperability between data formats, protocols, and communication mediums.  Additionally, gateway functions extend the range of connectivity, consolidate data from multiple networks into high capacity links for transmission to key C2ISR nodes, route information between disadvantaged users, and correlate data from multiple sources to improve accuracy.  Gateway functions also provide application hosting, shared data storage, on-demand information access, smart data forwarding, and system monitoring\/network management.  Funding in this project will also support Quick Reaction Capability requests by the warfighter such as the Battlefield Airborne Communications Node (BACN), 5th to 4th Generation efforts, and the STRATCOM Distributed Nuclear Command and Control (DNC2) capabilities.  Additionally, funding will support activities associated with the Joint Aerial Layer Network (JALN) Analysis of Alternatives.\n\nEfforts in this project include waveform, ground, and quick reaction capability activities.\n\nWaveforms:\nWaveform activities include, but are not limited to Common Link Integration Processing (CLIP), Situational Awareness Data Link (SADL), and 5th to 4th Generation efforts. CLIP is a software-only, platform-independent middleware application that provides gateway services between diverse message sets and waveforms. CLIP will initially be fielded on the B-1 and B-52 platforms.  SADL integrates US Air Force close air support aircraft with the digitized battlefield via the US Army's Enhanced Position Location Reporting System (EPLRS).\n\nGround:\nGround activities include, but are not limited to the Joint Air Defense System Integrator (JADSI), Joint Range Extension (JRE) functionality [which includes the JRE Transparent Multi-Platform Gateway (TMPG) Equipment Package (JTEP)], Pocket J, and Link 16 Alaska (LAK).  Funding will support enhancements to the interoperability and capabilities of fielded gateways through processing capability upgrades, operating system updates, display\/graphical user interface upgrades, incorporation of additional messaging standards and protocols, and completion of gateway architecture fielding.\n\nQuick Reaction Capability:\nQuick Reaction Capability activities include, but are not limited to, BACN, Communications Airborne Layer Expansion (CABLE), and STRATCOM DNC2.  Funding will support AF rapid acquisition requirements for communications bridging of waveforms through Gateway technology.  Additionally, funding will be utilized for STRATCOM classified capabilities.  \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning efforts for Family of Gateways.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "J-Range Ext\/Transparent Equip Pkg (JRE\/JTEP)"
                                    },
                                    "Description": {
                                        "val": "JRE efforts provide for TDL translation, routing, and forwarding between Link 16 and SADL networks.  JTEP efforts provide for connection of line-of-sight networks and long-haul beyond-line-of-sight networks using serial and satellite links."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.555"
                                            },
                                            "Text": {
                                                "val": "Completed fielding and technical activities in preparation for transition to sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Link Integration Processing (CLIP)"
                                    },
                                    "Description": {
                                        "val": "Common Link Integration Processing efforts provide Link 16 and Joint Range Extension Application Protocol (JREAP) A & C message processing to the B-1B FIDL and B-52 CONECT Platforms via a software upgrade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.847"
                                            },
                                            "Text": {
                                                "val": "Provided an enterprise solution for Link-16 and Joint Range Extension Application Protocol  (JREAP) message processing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.187"
                                            },
                                            "Text": {
                                                "val": "Providing an enterprise solution for Link-16 and Joint Range Extension Application Protocol (JREAP) message processing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Situational Awareness Data Link (SADL)"
                                    },
                                    "Description": {
                                        "val": "Situational Awareness Data Link is the Link 16 gateway for exchange of situational awareness and command & control data based on U.S. Army Enhanced Position Location and Reporting System (EPLRS) radio. This activity develops and integrates capability enhancements to update crypto,\nfacilitate imagery exchange, and support multiple tactical user groups within the network."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.960"
                                            },
                                            "Text": {
                                                "val": "Provided a secure, robust Air-Air and Air-Ground data link and a means to interoperate with Link 16 through a gateway."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.261"
                                            },
                                            "Text": {
                                                "val": "Providing a secure, robust Air-Air and Air-Ground data link and a means to interoperate with Link 16 through a gateway."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Link 16 Pocket J"
                                    },
                                    "Description": {
                                        "val": "Pocket J efforts provide for the primary ground-based TDL gateway supporting North American Aerospace Defense Command (NORAD) air sovereignty mission for Continental United States (CONUS) and President of the United States support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.442"
                                            },
                                            "Text": {
                                                "val": "Funding updated technical documents for the primary ground-based TDL gateway supporting North American Aerospace Defense Command (NORAD) air sovereignty mission for Continental United States (CONUS) and Presidential support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Air Defense System Integrator (JADSI)"
                                    },
                                    "Description": {
                                        "val": "Joint Air Defense System Integrator efforts provide command & control centers a common tactical picture by receiving, processing, and correlating TDL, intelligence, and radar feeds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.961"
                                            },
                                            "Text": {
                                                "val": "Funding provided testing of a software and hardware package that connects and translates between multiple communication devices and provides situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Text": {
                                                "val": "Funding providing testing of a software and hardware package that connects and translates between multiple communication devices and provides situational awareness, permitting the program to transition to sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Other Gateways"
                                    },
                                    "Description": {
                                        "val": "Other Gateways includes the Link-16 Alaska effort that provides communications infrastructure modernization for the Alaskan AOR through line-of-sight and beyond-line-of-sight Link 16 communications to facilitate early detection, identification, and intercept of potential threat aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Provided for integration of communications infrastructure modernization for the Alaskan AOR through LOS and beyond LOS Link 16 communications. FY11 funding for this program is accounted for in BPAC 655050."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Providing for integration of communications infrastructure modernization for the Alaskan AOR through LOS and beyond LOS Link 16 communications. FY12 funding for this program is accounted for in BPAC 655050."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quick Reaction Capabilities"
                                    },
                                    "Description": {
                                        "val": "Quick Reaction Capabilities that include the execution of the BACN JUON, BLOS C2 TACPOD and TTNT ISR Net."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "OCO funding supported BACN pre-planned product improvement (P3I), development, integration, and testing of multiple, high-capacity voice and data links."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BLOS C2"
                                    },
                                    "Description": {
                                        "val": "Support of the Beyond Line of Sight (BLOS) Command\nand Control (2) architecture.  Incorporates seven Tactical Airborne Communication Pods (TACPods) into the BLOS C2 architecture on the MQ-9\nvehicle and support the bi-directional movement of full motion video and collaboration between air and ground forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.000"
                                            },
                                            "Text": {
                                                "val": "Funding supports the Beyond Line of Sight (BLOS) Command\nand Control (2) architecture. One Battlefield Airborne Communications Node (BACN) will be incorporated into the BLOS (C2) architecture and will provide the capability to receive over 50 channels of Full Motion and other C2 and intelligence, surveillance, reconnaissance information within its footprint for aggregation and subsequent transmission and provide in-theater data access. Funds also support the incorporation of seven Tactical Airborne Communication Pods (TACPods) into the BLOS C2 architecture on the MQ-9 vehicle and support the bi-directional movement of full motion video and collaboration between air and ground forces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TTNT ISR Net"
                                    },
                                    "Description": {
                                        "val": "Install Battlefield Airborne Communications Node Intelligence, Surveillance, and Reconnaissance Net (BACN ISR Net) (TTNT with C-band) on currently fielded BACN aircraft 3xBD-700 and 2xRQ-4 aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.600"
                                            },
                                            "Text": {
                                                "val": "Funding provides an aerial layer extension to Army relevant ISR to the Edge 3G (R3G) and ISR Net and will extend the range of R3G and ISR Net beyond line-of-sight of the Persistent Threat Detection Systems (PTDS), and can provide R3G\/ISR Net connectivity between forward operational bases when PTDS are non-operational due to maintenance or weather."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STRATCOM DNC2"
                                    },
                                    "Description": {
                                        "val": "STRATCOM DNC2 efforts provide for the distribution of data from airborne assets to ground components for analysis, decision-making and re-tasking of critical assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.155"
                                            },
                                            "Text": {
                                                "val": "Funding supported development, test, and fielding of operational-hardened, wideband Ground Entry Points (GEPs) and testing with up to three aircraft to ensure functionality of the system in an operational environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.374"
                                            },
                                            "Text": {
                                                "val": "Funding supporting development, test, and fielding of operational-hardened, wideband Ground Entry Points (GEPs) and testing with up to three aircraft to ensure functionality of the system in an operational environment"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.224"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.224"
                                            },
                                            "Text": {
                                                "val": "Funding will support development, test, and fielding of operational-hardened, wideband Ground Entry Points (GEPs) and testing with up to three aircraft to ensure functionality of the system in an operational environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0207445F"
                                    },
                                    "Title": {
                                        "val": "Fighter TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.756"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0207448F"
                                    },
                                    "Title": {
                                        "val": "C2ISR TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.528"
                                        },
                                        "CurrentYear": {
                                            "val": "1.522"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.633"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.633"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.650"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.691"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.736"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.755"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207445F"
                                    },
                                    "Title": {
                                        "val": "Fighter TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.920"
                                        },
                                        "CurrentYear": {
                                            "val": "0.741"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.148"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.704"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.572"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.721"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207446F"
                                    },
                                    "Title": {
                                        "val": "Bomber TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.616"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.696"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.429"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207448F"
                                    },
                                    "Title": {
                                        "val": "C2ISR TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.957"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.832"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.921"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.963"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.973"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0604281F"
                                    },
                                    "Title": {
                                        "val": "TDN Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF, PE 0604281F"
                                    },
                                    "Title": {
                                        "val": "TDN Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.622"
                                        },
                                        "CurrentYear": {
                                            "val": "10.388"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.269"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.269"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.248"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.169"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.170"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.173"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M AF, PE 0207445F"
                                    },
                                    "Title": {
                                        "val": "Fighter TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.200"
                                        },
                                        "CurrentYear": {
                                            "val": "0.210"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.249"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.249"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.254"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.258"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.265"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.276"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M AF, PE 0401839F"
                                    },
                                    "Title": {
                                        "val": "Air Mobility TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.937"
                                        },
                                        "CurrentYear": {
                                            "val": "2.025"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.989"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.989"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.031"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.974"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.925"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M AF, PE 0604281F"
                                    },
                                    "Title": {
                                        "val": "TDN Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "288.541"
                                        },
                                        "CurrentYear": {
                                            "val": "434.330"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.132"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.132"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.058"
                                        },
                                        "BudgetYearThree": {
                                            "val": "36.952"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.128"
                                        },
                                        "BudgetYearFive": {
                                            "val": "37.521"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Airborne Networking Directorate provides for common development, integration and interoperability across the entire Airborne Network and ensures that data links are procured and maintained as a joint, end-to-end, command and control system.  Platform acquisition strategies vary by program, but the majority of development and integration is normally accomplished by the weapon system prime contractor."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604281F_BPAC_655262_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JRE\/JTEP Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JRE\/JTEP Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JRE\/JTEP Transition to WR-ALC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CLIP Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CLIP Transition to WR-ALC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SADL Integration\/Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SADL Transition to WR-ALC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Pocket J Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Pocket J Integration\/Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Pocket J Transition to WR-ALC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Joint Air Defense System Integrator (JADSI) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JADSI Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JADSI Ver 15 Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JADSI Transition to WR-ALC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Link 16 Alaska (LAK) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LAK Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LAK Transition to WR-ALC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "BACN JUON Operational Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "BLOS C2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TTNT ISR Net"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "STRATCOM Risk-Reduction Activities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "STRATCOM Insertion and Modeling and Simulation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}