{
    "id": "aa2dcc3a4069a475c6618d1ec7045195ce605bff",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V1_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineItemNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "89.862"
            },
            "CurrentYear": {
                "val": "86.663"
            },
            "BudgetYearOne": {
                "val": "89.319"
            },
            "BudgetYearOneBase": {
                "val": "89.319"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "92.192"
            },
            "BudgetYearThree": {
                "val": "94.813"
            },
            "BudgetYearFour": {
                "val": "97.738"
            },
            "BudgetYearFive": {
                "val": "99.372"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, directed energy bioeffects, deployment and sustainment of airmen in extreme environments, and understanding and shaping adversarial behavior.  The Learning and Organizational Collaboration project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  The Human Dynamics Evaluation project conducts research to advance information operations and intelligence operator-aiding technologies by developing and applying human-focused research to create and influence behavior signatures of existing and emerging adversaries.  The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which the human optimizes the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of humans and machines.  The Performance Evaluation in Extreme Environments project conducts research to enhance human sensory, cognitive, and physical capabilities to increase airmen survivability and performance.  The Directed Energy Bioeffects project conducts research on the effects of human exposure to electromagnetic energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  Efforts in this program have been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "87.452"
                },
                "CurrentYear": {
                    "val": "86.663"
                },
                "BudgetYearOne": {
                    "val": "86.109"
                },
                "BudgetYearOneBase": {
                    "val": "86.109"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "89.862"
                },
                "CurrentYear": {
                    "val": "86.663"
                },
                "BudgetYearOne": {
                    "val": "89.319"
                },
                "BudgetYearOneBase": {
                    "val": "89.319"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.410"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.210"
                },
                "BudgetYearOneBase": {
                    "val": "3.210"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.250"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.828"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.012"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.210"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.210"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Other Adjustments include -1.012 Congressional General Reductions\n\nFY13: Increase due to Higher Air Force Priorities in Human Dynamics, Sensory Evaluation and Decision Science, and Directed Energy Bioeffects"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Organizational Collaboration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.174"
                        },
                        "CurrentYear": {
                            "val": "13.745"
                        },
                        "BudgetYearOne": {
                            "val": "13.517"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.517"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.329"
                        },
                        "BudgetYearThree": {
                            "val": "13.306"
                        },
                        "BudgetYearFour": {
                            "val": "13.588"
                        },
                        "BudgetYearFive": {
                            "val": "13.984"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and aiding and cognitive and behavioral modeling.  The continuous learning and aiding effort creates live, virtual, and constructive (LVC) decision-making environments for use in developing revolutionary simulation technologies to increase training capabilities as well as enhances training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive and behavioral modeling creates realistic models and simulations of human behavior to advance the understanding of how people perform complex tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Research enhances Distributed Mission Operations (DMO) and decision dominance environments and identifies technology requirements for aircrew training in live and immersive environments.  Continuous learning\/aiding strategies improve personnel selection, mission training, command and control (C2), intelligence, surveillance, and reconnaissance (ISR), and unmanned and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.735"
                                            },
                                            "Text": {
                                                "val": "Completed analysis of simulation requirements for air-to-ground and air-to-air force training.  Utilized results to address specific training requirements for current and future Air Force fighter platforms.  Applied sensory-driven decision-making models to broader range of Air Force mission areas.  Evaluated analysis of modeling and simulation efforts for enhanced training.  Completed evaluation of real-time data insertion capabilities into DMO.  Validated methods for identifying common learning requirements for teams.  Validated adaptation methods that function in both learning and operational environments and at the coalition level of interaction.  Developed and evaluated alternative approaches to model human performance.  Developed alternative data aggregation and reporting methods for analyzing mission performance and used these methods to enhance personnel selection, learning, and training.  Evaluated these alternative methods for their effectiveness in supporting adaptive readiness training for individuals, teams, and teams-of teams.  Began validating approaches for LVC training and performance across tactical, operational, and strategic contexts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.762"
                                            },
                                            "Text": {
                                                "val": "Develop technology that represents accurate training scenario across multiple security levels in live, virtual, constructive environments.  Develop common tools to define scenario and content compatible with different training and operational environments.  Demonstrate alternative models for human performance assessment and predictions into a LVC event.  Complete validation of fidelity analysis methods and models for use in indentifying alternative training and operational environment characteristics.  Develop learning management tools for use in LVC contexts.  Demonstrate mission performance-based after action review tools.  Complete documentation of joint and multi-national best practices for RPA personnel selection, placement, and training.  Demonstrate persistent training and operations event tracking for individual and small team proficiency and squadron readiness assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.027"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.027"
                                            },
                                            "Text": {
                                                "val": "Develop methods to manage mission performance data across LVC contexts.  Develop technology solution tools to monitor the credibility of virtual and constructive players to augment live operational training and rehearsal.  Integrate manned and unmanned DMO systems in common training scenarios.  Develop scenarios for cyber team training in a Red Flag exercise environment. Develop after action review and analysis tools for C2, ISR, and Cyber team training."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Cognitive\/behavioral modeling explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.439"
                                            },
                                            "Text": {
                                                "val": "Integrated mission-relevant task model with language comprehension and generation capability to improve situational awareness of computer-generated teammates.  Conducted empirical studies with skill acquisition\/ retention models and demonstrate ability to produce optimized training and rehearsal programs.  Developed graphical user interface for performance prediction systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.983"
                                            },
                                            "Text": {
                                                "val": "Improve human behavior representation in synthetic teammates by incorporating prediction intervals, enhanced knowledge base, and decision heuristics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.490"
                                            },
                                            "Text": {
                                                "val": "Identify and validate mechanisms to explain and predict human cognitive performance to make performance augmentation.  Develop technologies that facilitate model development for applications that are complex, dynamic, and require orders of magnitude more knowledge than tradition cognitive models for laboratory tasks.  Investigate potential application to manpower and personnel selection and training."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.494"
                        },
                        "CurrentYear": {
                            "val": "15.229"
                        },
                        "BudgetYearOne": {
                            "val": "22.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.467"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "25.785"
                        },
                        "BudgetYearThree": {
                            "val": "26.762"
                        },
                        "BudgetYearFour": {
                            "val": "28.031"
                        },
                        "BudgetYearFive": {
                            "val": "27.991"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Note: In FY 2013, Measurement and Signature Intelligence (MASINT) moves from Project 627184 to this Project to better align the efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities. It develops and applies science and technology to detect and exploit a variety of human-centered signatures, including behavioral, nano, bio, and molecular aspects of existing and emerging adversaries. Research is focused in the following  areas:  1) Human Signatures - Discover, characterize, and integrate signature information to enable rapid and accurate human MASINT; 2) Patterns of Life - The study of relevant human threat and vulnerability patterns in context of everyday life and understand human interaction with autonomous systems; 3) Human Analyst Augmentation - Develop, integrate, and evaluate human-centric analyst technology solutions, such as adversarial modeling and cross-cultural communication, leading to more operationally effective ISR for the Air Force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Identify methods to enhance mission-essential human capabilities for cyber operations.  Develop measures of effectiveness for cyber capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.503"
                                            },
                                            "Text": {
                                                "val": "Continued conducting research to enhance performance and increase situational awareness within cyber operations, including operations support center environments.  Developed quantifiable measures of effectiveness to demonstrate ability to effectively anticipate and influence the behavior of adversaries.  Continued foundational studies toward enhancing cognitive cyber performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "Continue conducting research into enhancing cognitive cyber performance.  Develop technologies that increase situational awareness within cyber operations and research metrics to accurately assess attacks from adversaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nNote:  This effort ends in FY 2012 due to higher Air Force priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to anticipate, influence, and dominate adversary's air, space, and cyber ISR systems, processes, and organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.222"
                                            },
                                            "Text": {
                                                "val": "Conducted research to enable human operators to maximize utility of multi sensor ISR systems in planning for dynamic situations.  Conducted research to develop distributed, collaborative ISR dynamic planning capabilities for intelligence analysts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.061"
                                            },
                                            "Text": {
                                                "val": "Develop framework and knowledge-based foundation for intelligence analysis.  Conduct studies and incorporate feedback from the intelligence community to enhance methodologies for exploiting unstructured and cognitively complex data and information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.075"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.075"
                                            },
                                            "Text": {
                                                "val": "Develop new multi-intelligence analysis concepts and prototypes based upon analyst evaluations.  Conduct studies to evaluate new prototypes for signature, patterns, and other exploited intelligence data to augment analysis effectiveness."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Conduct research to develop technology base for anticipatory command and control intelligence (C2I) decision support.  Conduct research in cross cultural communications and automated speech translation tools for Air Force missions.  Develop models\/metrics to predict\/evaluate organizational effectiveness alignment and collaboration readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.915"
                                            },
                                            "Text": {
                                                "val": "Researched ability of models to simulate enemy potential courses of action, including complex adversarial behavior.  Explored the feasibility to integrate models within visual displays.  Developed adversarial cultural modeling techniques to gauge adversarial threats.  Developed advanced models\/simulation to demonstrate measures of effectiveness for selected influence operations capabilities.  Researched foreign language speech-to-speech translation applications that support automated, cross cultural communications.  Developed foundational decision aid concepts to exploit operator human-human trust and trust in automation for influence operators.  Matured research on organizational effectiveness to support organizational change in government domains.  Developed advanced models\/simulations to show the impact of improved work design, engaged organizational culture, and enhanced collaboration readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.280"
                                            },
                                            "Text": {
                                                "val": "Develop methods to enhance an analyst's ability to assess possible threats as a logical consequence of observed human and organizational behavior.  Begin integration of cognitive modeling architectures and cultural modeling techniques to initiate framework for estimating adversary intent and possible courses of action.  Continue conducting foreign language speech-to-speech translation applications that support automated, cross cultural communications. Continue to refine and expand advanced, automated algorithms for measures of effectiveness analyses supporting improved influence operations capabilities.  Develop methods applicable to theaters of operation that enhance warfighter situational awareness of adversarial location, intent, and predictability of hostile action.  Continue research and development on decision aid concepts to exploit operator human-human trust and trust in automation.  Conduct trust-based experimentation, discourse analysis and building vulnerability modeling tools.  Complete organizational vulnerabilities research; illustrate and document modes\/simulations that show the impact of improved work design, engaged organizational culture and enhanced collaboration readiness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.524"
                                            },
                                            "Text": {
                                                "val": "Explore multi-cultural potential avenues of influence and develop adversary effects models and simulations.  Develop tools, algorithms, and techniques for rapid development of speech recognition, machine translation, and natural language processing components in new languages and domains.  Develop methods for speech recognition and translation of previously unencountered words in languages that have complex prefix and suffix structures in order to improve threat warning.  Explore methods and develop theories for quantification of trust between people and real-time metrics of human trust of automation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research in the areas of mathematics and electromagnetic theory to exploit\/counter adversarial capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.854"
                                            },
                                            "Text": {
                                                "val": "Refined advanced, automated algorithms for measures of effectiveness analyses supporting improved influence operations capabilities.  Developed methods to enhance warfighter situational awareness of adversarial location and intent."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nNote:  In FY12, this effort was combined with the Influence Operations efort in this Project due to Project realignment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 5"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Conduct surveillance and counterproliferation research to support detection, identification, and assessment of threat agents in support of Air Force operational missions. \n\nNote: In FY 2013, two efforts from Project 627184 realign into this effort for better alignment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.868"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.868"
                                            },
                                            "Text": {
                                                "val": "Develop architectures for machine-intelligent biofidelic human threat models.  Develop human motion\/shape information system and online analytic tools for automatic detection and tracking of humans, discernment of gender, and detection of human shape anomalies.  Develop nano-bio technologies and sensor components to detect target molecules of interest in the operational environment.  Develop analysis tools to identify and track molecular-based threat signatures.  Characterize and exploit human signatures to perform ISR mission tagging, tracking, and locating of threats."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.634"
                        },
                        "CurrentYear": {
                            "val": "23.471"
                        },
                        "BudgetYearOne": {
                            "val": "32.037"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.037"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.468"
                        },
                        "BudgetYearThree": {
                            "val": "31.739"
                        },
                        "BudgetYearFour": {
                            "val": "31.875"
                        },
                        "BudgetYearFive": {
                            "val": "32.529"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which the human optimizes the capabilities of Air Force systems, including RPA and adaptive teams of humans and machines.  Research optimizes human situational awareness and cognitive performance, improves the human-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas: applied neuroscience; supervisory control; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance human-human and human-machine collaborations and system interactions in distributed decision-making environments.  The supervisory control area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develops technologies to enhance human performance, human-human and human machine collaboration, and system interaction in distributed decision-making environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.408"
                                            },
                                            "Text": {
                                                "val": "Investigated teams-of-teams performance metrics and begin to explore the nature of teams-of-teams cognitive workload so that future development of adaptive aiding algorithms shape team situational awareness in a network-centric environment.  Investigated algorithms that assess team cognitive workload independent of the workload of individual operators.  Began to develop adaptive interface algorithms for operator decision aiding."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.582"
                                            },
                                            "Text": {
                                                "val": "Develop team functional state assessment criteria and characterize context dependent methodologies for assessing the cognitive functional state of teams.  Explore algorithm utility for assessing real-time team functional state in distributed operations.  Evaluate ability to capture team functional state assessments to enhance collaboration and team decision-making.  Develop adaptive interface algorithms for operator decision aiding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.387"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.387"
                                            },
                                            "Text": {
                                                "val": "Explore the development of trust metrics that can be used to design and enable trust automation for operators.  Develop the framework for modeling physiological and behavioral workload on the human operator. Develop adaptive algorithms for workload management and mitigation.  Evaluate utility of workload assessment tool for teams.  Investigate potential tools for enhancing warfighter cognitive resiliency and performance through the manipulation of intrinsic biological and physiological mechanisms and processes.  Define metrics and biomarkers of resiliency and performance that can be integrated into these tools for sensing and assessing cognitive state. \n\nNote:  In FY 2013, an effort from Project 627184 merges with this effort for better alignment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, and decision aiding algorithms). Identify best design to direct operator attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.732"
                                            },
                                            "Text": {
                                                "val": "Evaluated the utility of 3-D information displays, multi-sensory interfaces, and other virtual reality technologies for multi-RPA supervisory control.  Generated intuitive ways to monitor, interact, and coordinate with complex, intelligent RPA automation algorithms.  Identified predictive information displays, including temporal displays that furnish proactive decision support to the human operator in multi-RPA scenarios.  Investigated unique facets of automation, such as social attributes, that may improve the overall RPA human-system bandwidth."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.422"
                                            },
                                            "Text": {
                                                "val": "Explore flexible automation techniques and transitions to enable a human operator to intervene at various levels with autonomous systems.  Develop methods to quickly and easily ascertain the status\/intent of complex automation.  Design and evaluate methods and interfaces to support distributed, ubiquitous unmanned system control of many heterogeneous systems.  Investigate combined spatial and temporal displays for proactive management of multiple semi-autonomous assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.921"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.921"
                                            },
                                            "Text": {
                                                "val": "Identify human operator-RPA automation interaction technologies and techniques that will provide increased situational awareness while exercising supervisory control of multiple RPAs.  Investigate and develop course-of-action tools, displays, and system software architectures that will support an operator's choice between several courses of action.  Explore the use of adaptive automation for teams of RPAs\/RPA operators to enable real-time situation awareness of human and vehicle states.  Develop an agent information architecture that responds to RPA pilot information queries by gathering, fusing and presenting information from on and off board sources."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Battlespace visualization advances science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.539"
                                            },
                                            "Text": {
                                                "val": "Explored vision enhancement techniques that can support the air, space, and cyber analysts' ability to quickly categorize objects of interest.  Performed laboratory evaluations of visualizations that support human knowledge when presented with complex information in the air, space, and cyber domains.  Developed visualizations and interaction techniques to exploit dynamic information.  Developed situational awareness presentation and interface technologies that increase warfighter knowledge."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.857"
                                            },
                                            "Text": {
                                                "val": "Explore vision enhancement techniques for fusing multi-source data to facilitate decision making.  Develop interactive visualizations for displaying and analyzing multi-source information to improve situational awareness.  Investigate visual analytics to optimally represent relevant information from large and disparate data sets.  Develop initial visualizations to represent and analyze large amounts of data to increase human performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.306"
                                            },
                                            "Text": {
                                                "val": "Assess human perception and performance of fused, multi-source information.  Develop visualizations using visual analytics for representing information from large, disparate data sets.  Extend visualization techniques to three-dimensional displays.  Assess the effectiveness of interactive visualizations to augment human operator situation awareness.  \n\nNote:  This effort increases in FY 2013 due to increased emphasis in this area."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4"
                                    },
                                    "Description": {
                                        "val": "Conducts battlespace acoustics research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.955"
                                            },
                                            "Text": {
                                                "val": "Evaluated the use of multi-modal speech displays to optimize distributed team performance in large-scale communication networks.  Conducted research on immersive audio and multi-modal interfaces for exploiting large-scale networks of distributed information and enhancing real-time situational awareness and time-critical decision effectiveness.  Explored integrated multi-sensory display concepts to optimize the flow of information across distributed teams, emphasizing how intuitive displays can promote shared situational awareness between command, control, intelligence, surveillance, and reconnaissance assets and operators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.610"
                                            },
                                            "Text": {
                                                "val": "Explore the application of multi-modal digital communication technologies to enhance speech intelligibility, communication effectiveness, and situational awareness in communication-intense military environments.  Explore the use of accelerated speech to enhance situational awareness and communication effectiveness.  Assess integration of graphical images with speech and text communication to enhance operator situational awareness and understanding.  Evaluate and monitor operator stress and workload using verbal communication signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.923"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.923"
                                            },
                                            "Text": {
                                                "val": "Explore how best to use multi-modal and networked communications to fight through cyber attacks in defensive cyber operations with a focus on the human interface.  Investigate human interface concepts that disrupt communication effectiveness across networked command and control teams for offensive cyber operations.  Explore the use of advanced multi-modal interfaces to aid combat search and rescue teams in simulated scenarios.  Assess the effectiveness of spatial audio display concepts combined with vibro-tactile displays and enhanced visual displays to augment individual and team performance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 5"
                                    },
                                    "Description": {
                                        "val": "Predict physiological impacts of high stress\/extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Develop physiology modeling and sensing capability to measure stress parameters and predict physiological impacts of high stress\/extreme environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627184"
                    },
                    "ProjectTitle": {
                        "val": "Performance Evaluation in Extreme Environments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.736"
                        },
                        "CurrentYear": {
                            "val": "17.016"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Note: In FY 2013, the efforts in this Project move into Projects 625328, 625329, and 627757 to better align the efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to enhance human sensory, cognitive, and physical capabilities to increase airmen survivability and performance.  The research is focused in four areas:  biobehavioral performance; biomechanics; applied biotechnology; and counterproliferation.  Both biobehavioral and biomechanics focus areas enhance airmen performance and survivability through dynamic human modeling techniques that define the capabilities and limits of system operators under military-unique stressors, as well as assessing and identifying adversarial threats.  Applied biotechnology advances bioscience, nanotoxicology, and neuroscience research to protect airmen from the effects of toxic chemicals and materials, and to monitor and enhance cognitive and physiological performance.  Counterproliferation research focuses on biotechnology for the detection, identification, monitoring, and neutralization of biological threat agents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.555"
                                            },
                                            "Text": {
                                                "val": "Developed anthropometry and motion database ontology to exploit human threat signatures.  Completed development and validate techniques to identify human motion that seem out-of-context as viewed from Air Force sensors.  Developed models that include cultural information to detect anomalies in both behavior and expressions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.244"
                                            },
                                            "Text": {
                                                "val": "Initiate 3-D human activity replication using 3-D human models.  Develop a human motion repository to identify human threat and performance signatures.  Develop tools for image analyst training that identify and visualize critical threat indicating signatures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nNote:  In FY 2013, this effort moves into Project 625328 to better align efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Define and model operator cognitive performance in stressful environments and develop technologies to mitigate effects of stressors on cognitive function, safety, and mission effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Text": {
                                                "val": "Developed biological, behavioral, and physical metrics and markers of cognitive performance.  Delineated mechanisms that affect warfighter (e.g., battlefield airmen and RPA operators) cognitive and physical performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.223"
                                            },
                                            "Text": {
                                                "val": "Define stressor-influenced mechanisms for developing strategies to optimize cognitive readiness and to influence performance in theater. Target specific biological, behavioral, and physical metrics and markers for defining mechanisms that improve cognitive performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nNote:  In FY 2013, this effort moves into Project 625329 to better align efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Conduct bio\/nanotechnology research to advance warfighter performance.  Leverage toxicological\/biological data to improve human performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.929"
                                            },
                                            "Text": {
                                                "val": "Advanced toxicity research associated with Air Force relevant nanomaterials and conduct toxicity assessments of biofuels of Air Force interest.  Continued to identify molecular markers that enhance human performance.  Continued to investigate cell-based pathways."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.592"
                                            },
                                            "Text": {
                                                "val": "Pursue advanced analysis of new and emerging nanomaterials and biofuels of Air Force interest.  Validate molecular markers in specific cognitive and physiological pathways that impact human performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nNote:  In FY 2013, this effort moves into Project 627757 to better align efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4"
                                    },
                                    "Description": {
                                        "val": "Conduct surveillance and counterproliferation research to support detection, identification, and assessment of threat agents in support of Air Force operational missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.770"
                                            },
                                            "Text": {
                                                "val": "Completed techniques to effectively neutralize threat agents.  Used bioinspired approaches to expand and refine nanoparticle taggants research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.957"
                                            },
                                            "Text": {
                                                "val": "Develop and incorporate bioinspired nanoparticle taggants for enhanced warfighter counterproliferation capability during operational missions. Identify biological markers that indicate that individuals have handled, transported, or manipulated weapons of mass destruction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A\n\nNote:  In FY 2013, this effort moves into Project 625328 to better align efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.824"
                        },
                        "CurrentYear": {
                            "val": "17.202"
                        },
                        "BudgetYearOne": {
                            "val": "21.298"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.298"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.610"
                        },
                        "BudgetYearThree": {
                            "val": "23.006"
                        },
                        "BudgetYearFour": {
                            "val": "24.244"
                        },
                        "BudgetYearFive": {
                            "val": "24.868"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals. Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and biobehavioral systems.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research focuses on theoretical and empirical dosimeterry, bioeffects of short-and long-term exposures, methods to counter RFR threats, and exploitation of directed energy systems for offensive capabilities.  Applied biotechnology advances bioscience, nanotoxicology, and neuroscience research to protect airmen from the effects of toxic chemicals and materials to monitor and enhance cognitive and physiological performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology, while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.660"
                                            },
                                            "Text": {
                                                "val": "Conducted research to refine Department of Defense, national, and international safe exposure standards to include multiple wavelength laser exposures.  Initiated research to provide personal protection while operating in a high energy directed energy weapon hazard zones.  Validated collateral hazard assessment software for high energy laser systems and weapon platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.854"
                                            },
                                            "Text": {
                                                "val": "Begin developing tools to assess collateral high energy laser hazards using probabilistic techniques.  Develop new models and techniques for assessing vision effects from laser eye protection.  Assess human factors integration of laser eye protection with visor, helmet, and advanced cockpit designs.  Continue research on advanced designs of personal protection in high energy directed energy weapons hazard zones."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.128"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.128"
                                            },
                                            "Text": {
                                                "val": "Develop high power probabilistic range safety tools for predicting eye and skin hazard zones from high energy laser weapon systems.  Develop models and methods for unique approaches using optical radiation for future weapon systems with scalable, disruptive, and ultra-precise effects.  Develop parameters for optimizing laser vision effect models for advanced laser eye protection models and non-lethal weapons."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.781"
                                            },
                                            "Text": {
                                                "val": "Conducted terahertz research in order to refine national and international safe exposure levels and evaluate potential military utility.  Conducted bioeffects research to support scalable directed energy weapon capabilities.  Initiated development of a model of scalable RFR effects based on experimentation and theoretical physics.  Assessed combinations of directed energy parameters on behavior and physiology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.388"
                                            },
                                            "Text": {
                                                "val": "Conduct electromagnetic radiation bioeffects research in support of national and international safety standards. Conduct biological studies of advanced directed energy weapon concepts. Conduct physiological and behavioral research to support scalable directed energy weapon capabilities. Continue scalable RFR effects modeling development based on theoretical and experimental physics. Assess bioeffects of combined directed energy sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.111"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.111"
                                            },
                                            "Text": {
                                                "val": "Integrate basic mechanisms of interactions between biology and RF radiation for validation of bioeffects models from ultra-short, high peak power, RF systems.  Continue investigating terahertz (THz) radiation effects on cells and tissues and improve bioeffects models for exposure; initiate proposals for refined exposure standards for THz radiation.  Continue assessing combined biological effects from multiple, combined directed energy sources."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Concentrate on human responses to non-lethal weapons and conduct research to assess the effects and risk of these weapons.  Conduct bio\/nanotechnology research to advance warfighter performance.  Leverage toxicological\/biological data to improve human performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.383"
                                            },
                                            "Text": {
                                                "val": "Developed initial quantitative models of behavioral responses using effects data from directed energy non-lethal weapons.  Enhanced Human Effect - Modeling Applications Program (HE-MAP) through addition of a software interface linking HE-MAP graphical user interfaces with predictive models of acoustic non-lethal weapon-induced effectiveness and risk.  Incorporated within HE-MAP the development of an effects-based design module that will allow analysis of design parameters of directed energy non-lethal weapons and their influence on effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.960"
                                            },
                                            "Text": {
                                                "val": "Develop a quantitative framework for relating directed energy and scalable novel-effects technologies (including non-lethal and escalation of force weapons) to operationally relevant outcomes via research on physiological and psychological HE.  Establish a database containing behavioral effectiveness and risk of injury information under operational conditions to facilitate coordination among operators, researchers, and weapon acquisition professionals.  Develop methodology to quantify behavioral effectiveness (e.g., sensory, cognitive, motor) across the range of directed energy and scalable novel-effects technologies.  Develop methodology to quantify the risk of injury (e.g., reversible, irreversible) across the range of non-lethal and escalation of force weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.059"
                                            },
                                            "Text": {
                                                "val": "Continue expanding the quantitative framework for relating directed energy and scalable novel-effects technologies to operationally relevant mission outcomes.  Continue expanding the knowledge base of behavioral effectiveness and risk of injury under operational conditions to facilitate non-lethal weapons wargaming and acquisition.  Advance toxicity and nanotoxicity research; investigate\/establish toxicity impacts to the body of advanced fuels, materials, and chemicals used to support existing and future weapon systems.  Define and pursue modulation of major cell pathways affecting cognition using in vitro and in vivo models and modeling.\n\nNote: In FY 2013, an effort in Project 627184 merges with this effort for better alignment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}