{
    "id": "ad50a5449af2adae6cf0b71e2a114be53304dd57",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602705A"
        },
        "ProgramElementTitle": {
            "val": "ELECTRONICS AND ELECTRONIC DEVICES"
        },
        "R1LineItemNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "63.186"
            },
            "CurrentYear": {
                "val": "62.862"
            },
            "BudgetYearOne": {
                "val": "60.300"
            },
            "BudgetYearOneBase": {
                "val": "60.300"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "55.721"
            },
            "BudgetYearThree": {
                "val": "54.211"
            },
            "BudgetYearFour": {
                "val": "54.672"
            },
            "BudgetYearFive": {
                "val": "54.124"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) designs and evaluates, power components, frequency control and timing devices, high power microwave devices, display technologies; and electronic components.  The applied research on these technologies enable the ability to perform precision deep fires against critical mobile and fixed targets; investigate all-weather, day or night, theater air defense against advanced enemy missiles and aircraft; as well as investigate enhanced communications and target acquisition through support of capabilities such as autonomous missile systems, advanced land combat vehicles, smart anti-tank munitions, electric weapons, secure jam-resistant communications, automatic target recognition, foliage-penetrating radar, and combat identification.  Project EM8 designs and evaluates high-power, microwave, electronic components and technologies.  Project H11 designs, fabricates and evaluates advanced portable power technologies (batteries, fuel cells, hybrids, engines, chargers, and power management).  Project H17 designs and evaluates flexible displays in conjunction with the Flexible Display Center.  Project H94 researches and evaluates electronic component technologies such as photonics, micro electromechanical systems), imaging laser radar, magnetic materials, ferroelectrics, microwave and millimeter-wave components, and electromechanical systems. \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory, Adelphi, MD, and the Army Communications-Electronics Research, Development, and Engineering Center,   Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.859"
                },
                "CurrentYear": {
                    "val": "62.962"
                },
                "BudgetYearOne": {
                    "val": "63.203"
                },
                "BudgetYearOneBase": {
                    "val": "63.203"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "63.186"
                },
                "CurrentYear": {
                    "val": "62.862"
                },
                "BudgetYearOne": {
                    "val": "60.300"
                },
                "BudgetYearOneBase": {
                    "val": "60.300"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.327"
                },
                "CurrentYear": {
                    "val": "-0.100"
                },
                "BudgetYearOne": {
                    "val": "-2.903"
                },
                "BudgetYearOneBase": {
                    "val": "-2.903"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.899"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.903"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.903"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "3.226"
                                },
                                "CurrentYear": {
                                    "val": "-0.100"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EM8"
                    },
                    "ProjectTitle": {
                        "val": "High Power and Energy Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.196"
                        },
                        "CurrentYear": {
                            "val": "15.378"
                        },
                        "BudgetYearOne": {
                            "val": "15.116"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.116"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.927"
                        },
                        "BudgetYearThree": {
                            "val": "14.233"
                        },
                        "BudgetYearFour": {
                            "val": "14.257"
                        },
                        "BudgetYearFive": {
                            "val": "14.398"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the research, development, and evaluation of high-power electronic components, materials, and related technologies.  These technologies have application in compact and efficient power conversion, conditioning, and management sub-systems; energy storage and conversion devices; radio frequency (RF)\/microwave and solid-state laser directed energy weapons (DEW); and traditional and non-traditional RF and laser electronic attack. All project elements are coordinated with and, as appropriate, leveraged by DEW and power\/energy programs in the Air Force, Navy, High Energy Laser Joint Technology Office, Defense Threat Reduction Agency, national labs, university consortia, and relevant industry and foreign partners.   The products of this research are required by developers of Army (DoD) systems to evolve traditional (mechanical-based) sub-systems such as geared transmissions, plate armor, and kinetic projectiles to electrically-based ones.  These products will provide the Soldier enhanced survivability and lethality through increased power management and energy savings as well as new fighting capabilities offered only by electrical power.\n\nThis project sustains Army science and technology efforts supporting the Ground and Soldier portfolio.\n\nThe work in this project is coordinated with the Tank and Automotive Research, Development, and Engineering Center (TARDEC PE 063005, project 441); Armaments Research, Development, and Engineering Center (ARDEC) PE063004, project 232; Aviation and Missile Research, Development, and Engineering Center (AMRDEC) PE 063313, project G03; and Communications-Electronics Research, Development, and Engineering Center (CERDEC) PE 062705, project H11.  These efforts were previously funded in PE 0602120A (Sensors and Electronic Survivability).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power and Energy Technologies"
                                    },
                                    "Description": {
                                        "val": "Research and evaluate electronic materials, structures, and components that will enable the realization of higher energy density and efficiency required by future Army systems such as electromagnetic armor, directed energy weapons, power grid protection, and other pulsed-power systems.  Special emphasis is on components operating at high voltages - greater than (>) 10 kilovolts (kV)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented system with new sources and antennas for counter electronics applications; developed SiC based high-power density modules for switching levels > 25 MW; and investigated and evaluated pulse power technologies for electromagnetic armor and microwave applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.177"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced wide band gap materials for use in high voltage pulse applications (>10kV)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Will investigate and conduct experiments with FY12 advanced wide band gap materials, such as silicon carbide (SiC), operation at   e20kV with emphasis on high voltage packaging based on the results of FY12's >10 kV SiC component research; identify and assess wide band-gap semiconductors (such as aluminum nitride) that allow higher voltage (>25kV) operation for expanded power control in survivability and lethality applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technology"
                                    },
                                    "Description": {
                                        "val": "Research novel solid-state laser concepts, architectures, and components with the goal of providing technology to Army directed energy weapon developers.  Exploit breakthroughs in laser technology, material development and photonics basic research to meet the stringent weight\/volume requirements for platforms. Applied research will be conducted in close collaboration with domestic and foreign material vendors, university researchers, as well as major laser diode manufacturers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated power and efficiency scaling potential of resonantly-pumped Ytterbium (Yb)-free Erbium (Er) doped fiber laser architectures for high power eye-safe Directed Energy Weapons applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.499"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate scalability and efficiency potential of resonantly-pumped, eye-safe, lasers in a 2-2.1 micrometer atmospherically transparent spectral domain based on Holmium (Ho)-doped crystals and ceramics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.541"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.541"
                                            },
                                            "Text": {
                                                "val": "Will investigate solid-state laser thermal management based on composite design of the gain elements (materials that are stimulated to produce laser light) with optically transparent heat sinking material in order to further increase beam power while preserving high beam quality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy\/Electromagnetic Environments (EME) Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and evaluate emerging technologies related to DE technology, electronic warfare (EW) survivability\/lethality, operations in the EME, and supporting high power components with the goal of  enhancing the survivability\/lethality of Army platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported ARDEC in demonstrating military utility of payload concept.  Supported Air Defense Artillery Center and AMRDEC in investigating the feasibility and effectiveness of RF DEWs against electronically guided rockets, artillery and mortars (RAM) for their Enhanced Area Air Defense program. Transitioned target effects data and basic design package for RF DE to the Air Defense System to Center via AMRDEC. Investigated susceptibility profile for unmanned aerial vehicle system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.165"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of counter electronic systems and electronic warfare (EW) technology for CERDEC; continue susceptibility investigations of a variety of targets; as well as transition effects data to applicable Research Development and Engineering Centers (RDECs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.270"
                                            },
                                            "Text": {
                                                "val": "Will investigate the susceptibility of a variety of Improvised Explosive Device (IED) targets in order to determine the vulnerability of these threats as well as design neutralization strategies; design and experimentally validate an initial neutralization sub-component that is a part of a integrated radio frequency based detection, location and IED Neutralization technology for future counter IED devices; investigate the effect of Digital Radio Frequency Memory (DRFM) technology (one of the top concerns in EW across the DoD) on US sensors and receivers and transition data to ARDEC, CERDEC, Army Test and Evaluation Center (ATEC), and program managers as appropriate."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Components and Materials Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, and evaluate compact, high-efficiency, high-temperature, high-power component technologies (such as semiconductor, magnetic, and dielectric devices) for hybrid-electric propulsion, electric power generation and conversion, and smart\/micro-grid power distribution.  Research addresses current and future Army-unique performance and operational requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated power components for higher temperature operations (110 °C coolant) and smaller circuits for platform upgrade programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.684"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate small, high efficiency wide band-gap power modules and circuits utilizing high power component technologies as well as high performance passive components operating at a coolant temperature of 100 °C."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.435"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced wide band gap modules developed in FY12 for use in vehicle and micro-grid applications that potentially  provide improved fault tolerant operation and  efficiency; conduct applied research on next-generation wide band-gap materials and devices to provide high temperature, voltage, and current conversion for micro-grid applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power System Components Integration and Control Research"
                                    },
                                    "Description": {
                                        "val": "Research and evaluate the configuration of electronic components and control strategies required to achieve high-power density and high efficiency power utilization in current and future platform sub-systems, vehicle, and micro-grid (installation) applications to include the operation of military-specific power distribution topologies at the system and circuit levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments with high-temperature, high power density 100 kW battery-to-bus converter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.628"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research control techniques and the use of advance passive devices to provide <60kW high-temperature (110 C) converters; and investigate advanced power conversion techniques for directed energy applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.650"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.650"
                                            },
                                            "Text": {
                                                "val": "Will conduct applied research in designing advanced control techniques, such as smart switches, to provide more efficient, robust, and reliable power delivery for vehicle power applications; conduct investigations at the system and circuit levels to evaluate micro-grid topology effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pulsed-Power Components and Systems Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, and evaluate emerging technologies such as energy storage capacitors, high voltage converters, and high rate-of-current-rise semiconductor switches, explosive based pulse generators, that improve the reliability and efficiency of pulsed-power components for applications such as electromagnetic armor, electronic fuze initiators, and electronic protection systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated component technology that can be implemented into a compact high-efficiency DC-DC pulse converter and SiC pulse switch die at 4.5 kA with fast rate-of-current-rise for powering a distributed EM Armor system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate silicon carbide (SiC) pulse switch die at 6 kA with fast rate-of-current-rise; and experimentally validate a compact power converter for self-contained battery module concept that allows advanced high power systems to be used on current force and next-generation vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.020"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.020"
                                            },
                                            "Text": {
                                                "val": "Will experimentally characterize and validate the FY12 SiC switch and other components in an electromagnetic armor demonstration system  in support of efforts in PE 062618, project H80 and with TARDEC in PE 063005 project 441; and design novel compact high power devices, modules, converters and passive components utilizing emerging wideband gap materials that provide enhanced power density for survivability systems with reduced space and weight."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H11"
                    },
                    "ProjectTitle": {
                        "val": "Tactical  and Component Power Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.646"
                        },
                        "CurrentYear": {
                            "val": "11.377"
                        },
                        "BudgetYearOne": {
                            "val": "10.022"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.022"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.891"
                        },
                        "BudgetYearThree": {
                            "val": "10.736"
                        },
                        "BudgetYearFour": {
                            "val": "11.559"
                        },
                        "BudgetYearFive": {
                            "val": "10.648"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project identifies, advances, and enhances emerging power generation, energy storage, and power management components and software. This project researchs electrochemistry, energy conversion, and signature suppression for primary batteries, rechargeable battery hybrids, fuel cells, power management, and components for electromechanical power generation. This project also researches power sources that are smaller and more fuel-efficient, advanced cooling systems that enable tactical sustainability and survivability, and investigates novel power management methods through low power design tools and dynamic power management software.\n\nThis project supports Army science and technology efforts in the Command, Control and Communications, Soldier and Ground portfolios.  Work in this Project complements and is fully coordinated with efforts in PE 0603001A (Warfighter Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Hybrid Power and Smart Chargers"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and validates Soldier-borne hybrid power sources, batteries, rapid battery chargers, and power management software, devices and techniques in order to decrease Soldier load and power burden, increase power capabilities such as extending battery run-time, and decrease battery sizes and costs.  Work in this effort includes research in Soldier-borne external combustion power generation, fuel cells and batteries, as well as experimenting with chemicals and other material to improve battery components such as electrolyte additives, ceramic membranes, and new cathode materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.515"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed processes and materials required for an integrated safe lithium air (Li\/Air) battery; evaluated a disposable Soldier battery (Li\/Air) at 800 watt hours per kilogram (Wh\/kg) in a relevant environment; experimented with a 150-300W portable squad power source\/charger weighing 25 lbs, and a 50-100W hybrid power source weighing 3.5 lbs at 1000 Wh\/kg."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.247"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a lower cost membrane for protected lithium anode portion of lithium air battery; optimize solid electrolyte membrane to prevent lithium metal corrosion; investigate and develop lower cost processes capable of high volume manufacturing of Li\/Air battery; experiment with packaged battery having >800 Wh\/kg energy density; validate safety characteristics of disposable Soldier battery (Li\/Air); experiment with disposable Soldier battery (Li\/Air) in an operational environment; assess balance of plant (controls, fans, heat transfer coatings, etc.) that will help improve efficiency for portable squad power source\/charger and reduce weight of hybrid power source; experiment with hybrid power source in a relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.124"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.124"
                                            },
                                            "Text": {
                                                "val": "Will fabricate higher rate lithium ion conducting membranes and air electrode catalysts for advanced Li\/Air disposable battery; validate bio-inspired cathode coatings for rechargeable lithium ion cells to improve and exhibit battery safety characteristics and cell performance in a representative environment; further enhance rechargeable Li\/Air battery to achieve and exhibit greater cell energy density in laboratory environment; validate a rechargeable Soldier hybrid power source (external combustion or fuel cell) with greater energy density and extended run time in a laboratory environment; optimize electro-catalyst and alkaline membrane electrolyte performance with different fuels; improve sulfur tolerant catalysts to promote longer system life."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silent Mobile Power"
                                    },
                                    "Description": {
                                        "val": "This effort investigates power generation materials, components and systems to increase energy output, reduced weight and noise, while increasing fuel and cost efficiency in mobile power generation sources. Products are silent mobile power components and materials, waste-heat recovery components and systems, transitional power sources in the 500W-2kW range, and towable generator sets up to 100 kW."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.131"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimented with a high mobility multipurpose wheeled vehicle towable 100 kilowatt power unit in a relevant environment; experimented with a waste-heat recovery system in a relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.130"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to identify emerging nanomaterials for applications to power electronics and fuel processing subsystems for 250W to 2 kW applications; advance and incorporate a new generation of materials (like catalysts for processing JP-8 for use in gasoline engines, ceramic nanocoatings applied to key electromechanical components to enhance durability\/life\/power-output of current generator sets, and nanotubes applied to develop thermoelectric materials with high electrical but low thermal conductivity) to augment performance of emerging and military power systems in the less than 2 kW range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.898"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.898"
                                            },
                                            "Text": {
                                                "val": "Will fabricate and validate advanced logistic fueled 250 to 1000 W mobile power generators with advanced sensors, power electronics\/controls and advanced materials to achieve greater fuel-to-electric efficiency and increase component survivability through real time response to rapid changes in load, environment, and usage; design and fabricate 3 to 5 kWh military standard hybrid energy storage components to maximize fuel economy, extend mission times, reduce recharging and disposal burden of batteries, and support patrol base and command post applications; design and fabricate integrated components and code software for power management of a smart power grid scalable from brigade to installation power levels; fabricate and conduct experiments with smaller, lighter hybrid renewable (battery\/engine\/wind\/solar) energy and co-generation equipment with improved fuel-to-electric efficiencies that provide environmental control (i.e., air conditioning) for brigade tactical operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Energy for the Soldier Venture Capital Initiative"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on innovative power and energy technologies for Soldier power needs to include fuel cells, batteries, alternate power sources and power management. Technologies may include, but are not limited to, devices, systems and software that generate, store, control and manage the power and energy required by the individual soldier for communications, computing, sensing, weapons functioning, mobility and comfort. Focus of interest includes low weight and volume, safety, reliability, cost-effectiveness, longevity, reduced system power requirements, minimal logistics impact, and devices, systems and software that dramatically increase the performance of, or reduce the costs of, other power and energy devices, systems or software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated high output solar panels for tactical and installation power, smart grid management and control technologies, improved rechargeable Soldier batteries and a fuel cell solution to replace the BA 5390 battery pack in a low power short wavelength infrared micro-sensor system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H17"
                    },
                    "ProjectTitle": {
                        "val": "FLEXIBLE DISPLAY CENTER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.728"
                        },
                        "CurrentYear": {
                            "val": "7.496"
                        },
                        "BudgetYearOne": {
                            "val": "6.629"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.629"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.704"
                        },
                        "BudgetYearThree": {
                            "val": "0.854"
                        },
                        "BudgetYearFour": {
                            "val": "0.854"
                        },
                        "BudgetYearFive": {
                            "val": "0.866"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fabricates and evaluates flexible display components emerging from the Army's Flexible Display Center (FDC) at the Arizona State University. The FDC conducts applied research on flexible display technologies that would make them inherently rugged (no glass), light weight, conformal, potentially low cost, and low power.  The resultant display technology would enable enhanced and new capabilities across a broad spectrum of Army applications (such as hands-free\/wrist mounted situational awareness devices, flexible hand-held control devices, and monitors in vehicles).\n\nThis project supports Army science and technology efforts in the Command, Control and Communications and Soldier portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is executed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Flexible Display Center (FDC)"
                                    },
                                    "Description": {
                                        "val": "The Flexible Display Center (FDC) is developing high resolution flexible reflective (electrophoretic) and emissive (organic light emitting diodes) displays."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.854"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FDC optimized color reflective displays for size and resolution, and transitioned reflective displays up to 6-8 inch diagonal to PEO Soldier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FDC continues to integrate color reflective displays and transition displays to integration efforts to include further development of emissive displays with size and resolution optimized to fulfill needs and requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.629"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.629"
                                            },
                                            "Text": {
                                                "val": "Will design full color light emitting displays and the related flexible electronics for soldier applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FlexTech Alliance (FTA) (formerly known as U.S. Displays Consortium)"
                                    },
                                    "Description": {
                                        "val": "Flexible display partnerships funded through the FTA for development of tools, processes, and materials that directly support the FDC mission for the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.874"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FTA conducted flexible electronics development to enable emissive displays.  The FTA continued to support the development for emerging needs in state-of-the-art tools, materials development and materials processes that directly support the goals of the FDC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.913"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FTA supports the goals of the FDC and has direct impact on the development of reflective and emissive displays that will transition into a number of ongoing efforts.  Toolsets necessary for further display and flexible electronics development are being supported."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H94"
                    },
                    "ProjectTitle": {
                        "val": "ELEC & ELECTRONIC DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.616"
                        },
                        "CurrentYear": {
                            "val": "28.611"
                        },
                        "BudgetYearOne": {
                            "val": "28.533"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.533"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.199"
                        },
                        "BudgetYearThree": {
                            "val": "28.388"
                        },
                        "BudgetYearFour": {
                            "val": "28.002"
                        },
                        "BudgetYearFive": {
                            "val": "28.212"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and evaluates electronics and electronic components and devices for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) applications and battlefield power and energy applications.  Significant areas of component research relevant to C4ISR  include: antennas, millimeter wave components and imaging, micro- and nanotechnology, eye-safe laser radar (LADAR), vision and sensor protection, infrared imaging (IR), photonics, and prognostics and diagnostics. Areas of research relevant to power and energy include power and thermal management, micro-power generators and advanced batteries, fuel reformers, fuel cells for hybrid power sources, and photosynthetic routes to fuel and electricity. \n\nThis project supports Army science and technology efforts in the Command Control and Communications, Soldier, Ground and Air portfolios.  Work in this project is fully coordinated with PE 0602709A (Night Vision Technology), PE 0603001A  (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology),  PE 0603008A (Command, Control, Communications Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antennas and Millimeter Wave Imaging (previously titled Antennas)"
                                    },
                                    "Description": {
                                        "val": "This effort designs evaluates and validates high performance antenna components and software for multifunction radar and communication systems.   Research areas include scanning techniques, broadbanding, beamforming, polarization, platform integration, and affordability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated in-situ antenna performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.473"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and fabricate new antenna material structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "Will develop low-profile antennas suitable for conformal and embedded platform applications; develop and assess millimeter-wave and terahertz imaging devices and phenomenology for a wide range of applications such as low-visibility navigation and detection of concealed body-borne threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Micro and Nano  Devices (previously titled RF MEMS)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates micro and nanotechnology components for multifunctional and integrated radio frequency (RF) applications; microrobotics, integrated energetics, control sensor interfaces and sensors for improved battlefield awareness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated system-in-package solutions for combining active components with piezoelectric micro electric mechanical systems (MEMS) (PiezoMEMS) wafer level antenna, PiezoMEMS switchable filters, and broadband PiezoMEMS switch matrices;  investigated building blocks for mechanical microcontroller based on PiezoMEMS switch technology (i.e. registers, latches, and arithmetic logic units)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine cycle reliability in packaged PiezoMEMS switches targeting lifetime in excess of 1 Billion Cycles; develop switch technologies with extremely low on state resistances (<0.5 Ohm); develop switchable filter technology spanning low MHz to low GHz; and investigate PiezoMEMS devices for operation near or above 100 GHz."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.553"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.553"
                                            },
                                            "Text": {
                                                "val": "Will validate mechanical microcontroller for integrated control of electronically-scanned antennas; ; develop methods to extend autonomous jumping microrobot to multiple jumps > 5cm for increased mobility; design and evaluate MEMS based, low power  rotational acceleration switch arrays for  detection of potential traumatic brain injury-causing events; evaluate carbon based devices and develop circuits for future amplifiers and frequency doublers; grow, characterize and fabricate graphene materials and structure for future high performance and low power Army electronic applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter Wave Components and Architectures for Advanced Electronic Systems"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs and evaluates component materials, structures, devices, and the electromagnetic issues of millimeter wave components and active devices.  The goal is to develop components that can enable advanced systems that combine multiple RF functionalities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.499"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed reduced chip-set, thermally optimized RF modules, and perform material and device measurements to correlate and validated device models for new materials and processes for high speed and high power electronic devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design highly integrated silicon based technology for multi-channel, multi-function RF Integrated Circuits (ICs); develop emerging III-V devices for heterogeneous integration of millimeter wave to terahertz subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.841"
                                            },
                                            "Text": {
                                                "val": "Will design high density RF circuit with reduced SWaP for radar, communications, and electronic warfare applications; refine millimeter wave power amplifier linearization design to optimize efficiency and output power for improved data throughput and reduced SWaP in SATCOM applications; design, fabricate and experimentally validate radio receiver components that can sense, identify and exploit RF threat signatures for improved standoff threat signal identification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Imaging Laser Radar (LADAR) and Vision Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses eye-safe three dimensional (3-D) LADAR components and phenomenology for long-range reconnaissance and short-range unmanned ground and air vehicle applications. The effort also develops and evaluates materials for passive protection of electro-optic (EO) vision systems from lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extended opto-electronic sensor protection effort to address jamming threats; ruggedized and hardened autonomous navigation LADAR; and implemented solid-state scannerless LADAR for unmanned ground applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.591"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform skin-based phenomenology measurements for development of long-range uncooperative biometric identification; integrate LADAR onto additional small-robotic platforms and perform relevant-environment experiments; experimentally validate multi-element electro-optic shutter array."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.296"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.296"
                                            },
                                            "Text": {
                                                "val": "Will assess skin-based, long-range biometric identification phenomenology for uncooperative subjects; complete assessment of  LADAR on small-robotic platforms to validate perception performance under realistic conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Photonics and Opto-Electronic devices"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates novel photonic components and architectures to enable detection of hazardous substances for enhanced Soldier situational awareness and survivability.  In addition, this effort develops and assesses the hybridization of Opto-electronic (OE) devices with electronics for optical fuze applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examined luminescence manipulation of hazardous materials using femto-second laser pulse-shaping excitation techniques; investigated Silicon photonic modulator devices for high bandwidth on-chip interconnects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.576"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate active and passive optical fuzes; down-select laser pulse-shaping excitation scheme for further investigations of energetic materials detection; down-select and develop photoacoustics method with most potential for trace energetic detection using currently maturing infrared laser diodes sources; investigate construction of advanced peptide recognition elements using iterative process involving computational modeling coupled with experimental characterizations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.901"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.901"
                                            },
                                            "Text": {
                                                "val": "Will investigate active optical fuses to advance target detection device performance; evaluate laser spectroscopic phenomenology to determine inherent specificity and sensitivity for detection of hazardous or suspicious materials at several ranges; examine trace detection capability of infrared photoacoustic spectroscopy for detecting energetic materials as well as electromagnetic signatures to enhance detection of hostile threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Thermal Management for Small Systems (previoulsy titled MEMS)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and fabricates MEMS based components to improve power generation and micro-cooling technology for both dismounted Soldier and future force applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.570"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured a milliwatt scale battery to actuator power converter component for micro robotic system"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature a milliwatt scale battery to actuator power converter component for micro robotic system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.917"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.917"
                                            },
                                            "Text": {
                                                "val": "Will design and evaluate compact thermal management components utilizing phase change materials to improve heat rejection capabilities, increase cooling capacity, and reduce volume; fabricate efficient high power density, multifunctional components and sub-systems for capturing, transforming, and delivering power to emerging Microsystems; develop and experimentally validate combustion models for JP-8 and alternative fuels and integrate into the design of catalytic liquid fueled energy converters ; characterize catalysts for fuel conversion and fuel synthesis to identify mechanisms for efficient alternative fuels production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prognostics and Diagnostics (P&D)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates prognostics and diagnostics algorithms; designs, fabricates, and evaluates MEMS and other sensors to enable early detection of mechanical failure and hence reduce maintenance costs; designs models and evaluates databases for integration into decision systems to extend sensor rationalization and minimize downtime via condition-based maintenance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.013"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed scheme for implementation on electronic subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.979"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement and conduct experiments of P&D on a vehicle electronic system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.973"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.973"
                                            },
                                            "Text": {
                                                "val": "Will assess and evaluate digital source collectors for use in the areas of structural health, usage monitoring, and integrated prognosis;  apply prognostics and diagnostics methodologies for built-in self test of RF integrated circuits; evaluate algorithms to assess current health and predict the remaining useful life of wide bandgap (WBG) RF power devices and circuits; explore diagnostic sensing with non-traditional semiconductors that are potentially extremely low cost, very robust, and conformable."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrared (IR) Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates materials, components and focal plane arrays (FPA) for the next generation of Army's night vision systems, missile seekers, and general surveillance devices.  Technologies investigated include mercury cadmium telluride (HgCdTe) on Silicon (Si), strained layer superlattices (SLS) and corrugated quantum well infrared photodetector (C-QWIP) detector arrays for both the mid-wave infrared (MWIR) and long-wave infrared (LWIR) spectral regions with goals to increase the operating temperature and decrease the cost of focal plane arrays.  Work accomplished under PE 0602709A\/ project H95 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.234"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented an Electro-Optic (EO) based sensor solution to detect threat launches prior to threat arrival;  determined feasibility of integrating commercially available EO imagers into a threat warning and location sensor system;  integrated narrow band filters into EO imager optical path to enhance threat signal count;  evaluated large area dual color FPAs suitable for such applications as persistent surveillance and distributed aperture systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally validate an improvement in SLS minority carrier lifetimes and show progress toward achieving 2K x 2K quantum well infrared focal plane arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.480"
                                            },
                                            "Text": {
                                                "val": "Will experimentally validate optimized HgCdTe devices on alternate substrates to provide a more sensitive large format and higher resolution LWIR and MWIR C-QWIP FPA;  design voltage tunable two color C-QWIP FPAs that results in increased resolution and higher operating temperatures for more efficient operation and robust target detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates chemistries, materials and components for advanced batteries, fuel reformers, and fuel cells.  Potential applications include hybrid power sources, smart munitions, hybrid electric vehicles, and Soldier power applications.  Investigate applicability of photosynthesis to provide fuel and electricity for Soldier power applications.  Investigate silicon carbide (SiC) power module components to enable compact high efficiency, high temperature, and high power density converters for motor drive and pulse power applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed high temperature (100-110 C) SiC power modules for high-efficiency high density power conversion; developed higher rate cathodes for Lithium (Li) ion chemistries; investigated and developed materials, components, and devices for thin film and conformal thermal batteries and advanced liquid reserve batteries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate high-temperature (110-120 C) high-frequency SiC power modules with integrated sense and gate drive for use in compact high-efficiency power conversion modules;  investigate stable high voltage anode, cathode and electrolyte components for Li ion batteries; incorporate Si anode materials in Li ion cells; develop improved alkaline fuel cell membranes; as well as evaluate lifetime and rise time of thin film batteries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.172"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.172"
                                            },
                                            "Text": {
                                                "val": "Will design and evaluate thin film battery devices for munitions; evaluate advanced alkaline membranes and catalysts with improved efficiency for alkaline fuel cells; evaluate catalyzed Li-air battery reactions for faster charging and high current discharge;  will investigate and evaluate processes for synthetically generating energy through photosynthesis;  evaluate device physics reliability issues (i.e. material defects, interface impedences) of WBG devices; investigate and characterize high frequency operation of WBG devices and for new device material implementation in vehicle motor drives and pulse power applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}