{
    "id": "aedbc2fa9074339d6010eb3b861d18d41d034819",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Advd Tech"
        },
        "R1LineItemNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "95.045"
            },
            "CurrentYear": {
                "val": "71.149"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "166.194"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential S&T efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nWarfighter Sustainment Advanced Technology supports:  Manpower and Personnel, Training, and Readiness; and the Future Joint Warfighting Capabilities identified by the Joint Chiefs of Staff.  It supports Future Naval Capabilities (FNC) Programs in Airframe\/Ship Corrosion; Turbine Engine Technologies; Littoral Combat; Sea Base Planning, Operations and Logistics; and Sea Base Mobility and Interfaces.  It develops technologies that enable the Navy to better recruit, select, classify, assign, and manage its people; to train effectively and affordably in classroom settings, in simulated and actual environments, and while deployed; and to effect human systems design into weapon systems.  Other technologies enable reduced operating costs through life-extension of legacy systems and increased efficiency of future propulsion systems and improved diagnostic tools.\n\nWithin the Naval Transformation Roadmap, this investment supports the achievement of all the transformational capabilities of Sea Warrior and the transformational capabilities of:  Ship to Objective Maneuver and Time Sensitive Strike required by Sea Strike; Littoral Sea Control and Anti-Sub Warfare required by Sea Shield; Compressed Deployment and Employment Times and Enhanced Sea-Borne Positioning of Assets required by Sea Basing; and Battlespace Integration required by FORCEnet.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.261"
                },
                "CurrentYear": {
                    "val": "71.232"
                },
                "BudgetYearOne": {
                    "val": "69.823"
                },
                "BudgetYearOneBase": {
                    "val": "69.823"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "95.045"
                },
                "CurrentYear": {
                    "val": "71.149"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.216"
                },
                "CurrentYear": {
                    "val": "-0.083"
                },
                "BudgetYearOne": {
                    "val": "-69.823"
                },
                "BudgetYearOneBase": {
                    "val": "-69.823"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.083"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.077"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.729"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-69.823"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-69.823"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.564"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Reflects a correction to the Seabasing INP funding profile to be consistent with the changes in complexity and cost associated with going from preliminary design and model development through prototype fabrication.\n\nSchedule: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2915"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "95.045"
                        },
                        "CurrentYear": {
                            "val": "71.149"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "166.194"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Warfighter Sustainment Advanced Technology supports Manpower and Personnel, Training, and Readiness; and the Future Joint Warfighting Capabilities identified by the Joint Chiefs of Staff.  This project supports FNC Programs in Airframe\/Ship Corrosion; Turbine Engine Technologies; Littoral Combat; Sea Base Planning, Operations and Logistics; and Sea Base Mobility and Interfaces.  This project develops technologies that enable the Navy to better recruit, select, classify, assign, and manage its people; to train effectively and affordably in classroom settings, in simulated and actual environments, and while deployed; and to effect human systems integration into weapon systems.  Other technologies enable reduced operating costs through life-extension of legacy systems, increased efficiency of future propulsion systems and improved diagnostic tools.  Within the Naval Transformation Roadmap, this investment supports the achievement of all the transformational capabilities of Sea Warrior and the transformational capabilities of Ship to Objective Maneuver and Time Sensitive Strike required by Sea Strike; Littoral Sea Control and Anti-Submarine Warfare (ASW) required by Sea Shield; Compressed Deployment and Employment Times and Enhanced Sea-Borne Positioning of Assets required by Sea Basing; and Battlespace Integration required by FORCEnet."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIRFRAME\/SHIP CORROSION\/COST REDUCTION TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity includes an integrated approach for the control of the effects of external and internal corrosion in Naval weapon systems as well as cost reduction technology efforts.  The work develops advanced, cost effective prevention and lifecycle management technologies.  This is particularly significant to life extension for the aging \nfleet.\n\nFY 2011 to FY 2012 funding increase is due to the initiation and ramp-up of several new EC's including corrosion related signature technologies and advanced shipboard water desalination and corrosion.  \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.346"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development on improved non-skid coatings.\n- Continued development on improved ship rudder coatings.\n- Continued development on high performance topside coatings\n- Continued development on high performance airfield pavements.\n- Continued down select of materials for erosion control of helicopter main rotor blade leading edges for subsystem evaluation of performance.\n- Continued evaluation and correlation of materials repair technologies related to sub-system materials for erosion control on helicopter main rotor blade leading edges.\n- Completed evaluation of advanced materials for erosion control on helicopter main rotor blade leading edges.\n- Initiated systems testing of materials systems for erosion control on helicopter main rotor blade leading edges.\n- Initiated evaluation, design and demonstration of advanced ASGS (Active Shaft Grounding System) with Condition Based Maintenance (CBM) and signature control.\n- Initiated evaluation, design, large scale testing and demonstration of Impressed Current Cathodic Protection (ICCP) components.\n- Initiated evaluation, design and demonstration of dual-use ICCP and novel sensor technology for CBM and closed-loop deamping.\n- Initiated testing and evaluation of diagnostic models and demonstration of materials with improved barrier dielectrics.\n- Initiated evaluation, testing and demonstration of CBM underwater hull analysis model integrated with closed loop deamping model.\n- Initiated development of thermal management system(s) to arrest excessive heat fluxes and loads on amphibious ship by advanced Naval\/USMC aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.237"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Initiate evaluation and design of rotorcraft structural health management sensors, architecture and diagnostics.\n- Initiate development of sprayable acoustic damping systems for submarines to significantly reduce weight and costly maintenance procedures and increase operational readiness.  \n- Initiate development of low temperature carbon supersaturation (LTCSS) technology to incorporate improved corrosion resistance and surface hardness to materials in erosion-corrosion environments. \n- Initiate development of algorithms to incorporate into design module for corrosion prevention to predict the occurrence of corrosion and provide alternative solutions for use in component and system design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN SYSTEMS DESIGN (FORMALLY INTEGRATION)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the warfighter by providing enhanced capabilities by designing affordable user-centered systems that are efficient, easy to use, and provide required mission capabilities at lowest lifecycle costs.  Such systems will be optimally designed for the right number and types of personnel, requiring minimum training while providing high skills retention.\n\nThis field of research is paramount to the reduction in complex naval systems design, acquisition, operation, and maintenance costs and improvements in the effectiveness of operations. Congressional, DoD, and Navy policies and instructions require Navy and Marine Corps Program Managers to have a comprehensive plan for Human Systems Design in the acquisition process to optimize total system performance, minimize total ownership costs, and ensure the system is built to accommodate the characteristics of the user population that will operate, maintain, and support the systems. A strong Human Systems Design effort is required to meet these goals. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued developing and demonstrating automation and human interface technologies to support collaborative decision-making in which multiple unmanned system operators manage groups of vehicles with optimal manning.\n- Continued developing innovative strategies for significantly improving on-board training and performance measurement for improving submarine command team decision making and overall submarine team performance and resilience.\n- Continued developing a prototype and operational construct, processes, methods and software specifications to merge the full spectrum of Human Systems Engineering into the Navy's standards based, open-architecture, Integrated Product Data Environment.\n- Continued development of mission performance optimizations encompassing task centered design and advanced human\nperformance modeling for achieving the requisite manning, both in numbers and capabilities, for the complex ships and systems of the future fleet.\n- Continued improving the capability to fuse imaging, electronic warfare, inorganic and acoustic sensor inputs into integrated, fused, and intuitive displays that enhance the presentation and command understanding of uncertain information.\n- Completed developing and demonstrating automation and human interface technologies to support collaborative decision-making in which multiple unmanned system operators manage groups of vehicles with optimal manning.\n- Completed developing innovative strategies for significantly improving on-board training and performance measurement for improving submarine command team decision making and overall submarine team performance and resilience.\n- Initiated developments to incorporate environmental stressors impact(fatigue, motion, vibration and extreme temperatures) into systems engineering tools for the development for complex Navy systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.807"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete developing a prototype and operational construct, processes, methods and software specifications to merge the full spectrum of Human Systems Engineering into the Navy's standards based, open-architecture, Integrated Product Data Environment.\n- Complete development of mission performance optimization encompassing task centered design and advanced human performance modeling for achieving the requisite manning, both in numbers and capabilities, for the complex ships and systems of the future fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT"
                                    },
                                    "Description": {
                                        "val": "The goal of Littoral Combat is the application of technologies to enhance the ability of the Navy\/Marine Corps team to execute the Naval portion of a joint campaign in the littorals.  This activity considers all the critical functions of warfighting:  command, control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR), fires, maneuver, sustainment, force protection, and training.  The activity includes support to the following FNC ECs; Battlefield Power, Reduced Support Costs 1, Advanced Naval Fires Technology Spiral 1, Combatant Commander (COCOM) to Marine Combat Identification (ID), Global Information Grid (GIG)-Compliant Networking, Hostile Fire Detection and Response Spiral 2, Position-Location-Information, Reduced Cost of Operations 1, Sea Base Collaborative Command and Control, Sea Base Mobility and Interfaces, and Sea Base Integrated Operations.\n\nFY 2011 to FY 2012 funding reduction reflects realignment of funds due to higher Navy priorities.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.413"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of advanced lighter weight modular individual protective system that will provide increased flexibility and protection for the warfighter. \n- Continued development of advanced armor technologies for improved survivability and advanced suspension technologies for improved cross country mobility of Marine Corps tactical and combat vehicles.\n- Continued development of individual warfighter lightweight protective system technologies that will reduce body armor weight, improve survivability and increase the mobility of the warfighter (lighten the load).  \n- Continued research to develop technology to reduce fabrication and life cycle costs of SSN\/SSGN next generation photonics mast and to improve SSN surface situational awareness through faster image acquisition rates, improve range performance under adverse weather conditions and improve autonomous detection and classification. \n- Continued\/Completed development and transition advanced power generation technologies that enable reduction of the logistical burden on small tactical units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Continue and realign development and transition of technologies to reduce the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing GUI-based software for tradeoff analyses bases on Military Operational Posture to PEs 0602131M, and 0603640M.\n- Complete transition of advanced power generation technologies that enable reduction of the logistical burden on small tactical units to PM-Expeditionary Power Systems, Marine Corps Systems Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANPOWER AND PERSONNEL DEVELOPMENT"
                                    },
                                    "Description": {
                                        "val": "This activity provides Navy personnel system managers with the ability to attract and retain the right people and to place them in jobs that best use their skills, training, and experience. The application of modeling and simulation, mathematical optimization, advanced testing, information visualization, and human performance measurement technologies will enhance Fleet readiness and reduces personnel costs. These technologies enhance the Navy's ability to manage the force efficiently and maintain readiness with fewer people and smaller budgets; provide warfighting capabilities optimized for low-intensity conflict and littoral warfare; and operating and maintaining increasingly sophisticated weapons systems while managing individual workload and supporting optimal manning.\n\nFY 2011 to FY 2012 funding reduction reflects realignment of funds due to higher Navy priorities.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.803"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development and demonstration of decision support tools to better enable meeting the goals of the Navy's evolving strategies for personnel and manpower management.\n- Continued integration of multi-faceted decision support tools to evaluate manpower alternatives.\n- Continued development and demonstration of an agent-based simulation to enhance the effectiveness of behaviorally-based predictive models.\n- Continued development of a prototype decision support system to enable community management program analysts to better\nforecast and assess the effects of active duty enlisted and officer behavior resulting from both proposed and current policy decisions.\n- Continued investigation into relationship of delivery methods of Navy schools training and the differences in training and job performance outcomes and on how these are related to differences in individual's non-cognitive characteristics.\n- Continued investigation of methods for composing minimally sized crews to facilitate the development of teamwork intensive proficiencies at an accelerated pace.\n- Completed investigation into relationship of delivery methods of Navy schools training and the differences in training and job performance outcomes and on how these are related to differences in individual's non-cognitive characteristics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete investigation of methods for composing minimally sized crews to facilitate the development of teamwork intensive proficiencies at an accelerated pace."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASE MOBILITY AND INTERFACES"
                                    },
                                    "Description": {
                                        "val": "This activity includes support for Sea Base Mobility and Interfaces and Force Closure.  This activity improves the capability for transfer of cargo between Sea Base\/Logistics vessels and employment of combat ready forces over unimproved beaches during high sea states.  Capabilities being developed include propulsion technologies, maneuvering technologies, and advanced hull systems technologies needed for sustained operations at high speed in high sea states.  This activity further supports the Seabasing mission of transporting troops, equipment, and materials from the seabase to shore, and providing support to seaborne forces via surface distribution interfaces.\n\nThe reduction between FY 2011 and FY 2012 is due to FNC EPE-FY07-02, MPF (F) Force, Closure nearing completion and final testing for the 38 MW Axial-Flow Waterjet.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.676"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to develop a large scale Axial Flow Waterjet technology with the new transition\ntarget to Littoral Combat Ship (LCS).\n- Initiated deliver full scale waterjet to LCS shipbuilder."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Complete FNC EPE-FY07-02, MPF (F) Force final testing for the 38 MW Axial-Flow Waterjet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASE PLANNING, OPERATIONS AND LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity includes support for Sea Base Integrated Operations; Surface Connector Vehicle Transfer; Automated Weapons Assembly; and Sense and Respond Logistics.  Sea Basing will require more robust afloat command and control for sustainment activities.  Logistics must integrate with the joint task force common operating picture, and provide awareness of mission supportability and readiness at an operational and tactical level.  This activity will produce techniques and systems to support automated transfer of cargo from shipboard unload\/onload point to stowage spaces. This activity further supports the Seabasing mission of marshalling troops, equipment, and materials.  It will improve current replenishment capabilities for transfer of cargo between Sea Base\/Logistics vessels (large ship-to-ship) during high sea states, while maintaining safety of operations.  Technologies include optical recognition, advanced robotics for weapons assembly, integrated data architectures, high-strength composites, wear-resistant coatings, environmental sensing, ship-motion compensation for force control-based systems, intelligent systems, and robotics.\n\nFY11 to FY12 funding decrease is due to the re-aligment of funds for higher priority requirements.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Sea Basing (FNC).  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.407"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts in the development of Interface Ramp Technologies for seabasing.\n- Continued efforts for the development of technologies supporting automated shipboard assembly of\nair-delivered weapons.\n- Continued efforts to develop Sense and Respond Logistics Information Architecture prototype\n- Continued efforts to demonstrate sensor based Sense and Respond Logistics advanced technologies.\n- Continued procurement and testing of available microfiltration (MF), and ultrafiltration (UF), systems suitable for shipboard use.\n- Continued investigation of seawater treatment strategies to optimize performance of MF\/UF pretreatment approaches.\n- Continued procurement and testing of approaches to recover energy from pressurized reverse osmosis waste brine.\n- Continued efforts to select optimal reverse osmosis membranes.\n- Continued development of agent based decision support and logistics planning tools.\n- Completed procurement and testing of available MF, and UF, systems suitable for shipboard use.\n- Completed investigation of seawater treatment strategies to optimize performance of MF\/UF pretreatment approaches.\n- Completed procurement and testing of approaches to recover energy from reverse osmosis waste brine.\n- Completed efforts to select optimal reverse osmosis membranes.\n- Completed and test first article prototypes of Sense and Respond demonstration systems; Logistics Common Operating Picture, Decision Support Tool, Prognostics Embedded Health Management, Maco Fuel Quantity Management, Portable Fuel Quantity, Portable Fuel Quality Analysis. \n- Initiated down selection of desired components and begin design of pretreatment system.\n- Initiated down selection of desired energy recovery strategies and reverse osmosis membranes and begin design of reverse osmosis systems.\n- Initiated development of the Connectors and the Sea Base Enabling Capability including Eniviornmental Ship Motion Forecasting and Advanced Mooring System Technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete testing and integration of Sense & Response Logistics Common Operating Picture.\n- Complete efforts on Interface Ramp Technologies development with demonstrations in relevant environments and transition to NAVSEA PMS385.\n- Initiate model testing of Advanced Mooring System and planning of at-sea demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING"
                                    },
                                    "Description": {
                                        "val": "This activity includes advancement of technologies to support the design and development of Sea Base Enabler Innovative Naval Prototypes (INP's).  Areas include design and development of various Sea Basing prototypes in the areas of high speed, shallow draft and beachable connectors; and vessel to vessel interfaces.\n\nThe Sea Base Enabler INP effort was initiated in FY 2006. The INP program spans from conceptual design through prototype fabrication and testing. This INP plan includes the completion of the development and at-sea testing of the Rapid Deployable Seabasing Stable Transfer Platform demonstrator; the continuation of several land based and tow-tank based model construction and testing for the Sea Base to \"Over-the-Shore\" Connector Transformational Craft (T-CRAFT) Prototype; and the full scale component-level development, evaluation, and testing of critical T-CRAFT technologies.\n \nFY 2011 to FY 2012 funding decrease is due to the completion of contract design and shipyard building plans for T-CRAFT prototype and component construction.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.537"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued multiple INP contracts for preliminary designs in the area of a T-CRAFT and a Rapidly Deployable Seabasing Stable Transfer Platform.\n- Continued the down-selection of T-CRAFT designs for further development and model construction and testing.\n- Continued T-CRAFT model construction and testing.\n- Continued a second evaluation of potential new Seabasing INP efforts.\n- Continued planning of T-CRAFT prototype and component development.- Completed T-CRAFT model testing and evaluation.\n- Continued procurement of components and material to support T-CRAFT prototype construction.\n- Continued\/Completed contract design and develop shipyard building plans for T-CRAFT prototype and component construction.\n- Initiate development of a detailed technology demonstration plan.\n- Initiate T-CRAFT technology demonstration component construction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.943"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "This activity improves mission effectiveness and safety by applying both simulation and instructional technology to the design of affordable education and training methods and systems.  Improved training efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the logistics, development, delivery, evaluation, and execution of training.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.175"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research and assessment of advanced gaming technology for enhanced training.\n- Continued advanced technology development demonstrations of game based training for better\nwarfighter understanding of languages and cultures to enhance their regional expertise.\n- Continued development of tools (behavioral assessment, individual and team trend analysis, and instructor support) to support enhanced live, virtual, and constructive training for land forces in expeditionary warfare.\n- Continued development of an Adaptive Expert System to automatically and rapidly analyze aircrew\nperformance (1M+ flight hours annually) to detect human factors related mishap leading indicators using a new technique with anomaly and corroboration.\n- Continued development of validated, effective, adaptive training system components to enhance individual and team training for submarine navigation and piloting skills and for surface ship Combat Information Center training.\n- Completed development and experiments to validate automated performance assessment and after action reviews.\n- Completed research and assessment of advanced gaming technology for enhanced training.\n- Initiated the designing, building, demonstration, and evaluation of the efficacy of the technology components\/system to deliver combat\/tactical profiling relevant perceptual training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete development of game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.\n- Initiate development of simulation technologies to deliver safe, effective, and balanced live-virtual-constructive aviation training to achieve meaningful training and readiness levels without the costs involved with only using live assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TURBINE ENGINE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "This activity provides integration and experimental engine testing of advanced gas turbine engine technologies to reduce their technical risk and demonstrate their readiness for transition.  These technologies will enable advanced capabilities for Navy weapon systems at reduced total ownership costs.  Versatile Affordable Advanced Turbine Engines (VAATE) is a DoD\/DOE\/NASA\/Industry program to develop and demonstrate versatile, affordable, advanced engine technologies enabling for increased systems capabilities and reduced total ownership costs. The VAATE goal is 10X improvement in propulsion system affordability (capability\/cost) by 2017, with interim goals of 4X by 2009 and 6X by 2013.  The elements of the capability-to-cost index are increased thrust to weight; decreased specific fuel consumption; and reduced development, production, and maintenance costs for the entire integrated propulsion system.  To achieve these goals, VAATE is organized into multiple product areas. Specifically for the Navy, the focus, as part of the Enterprise and Platform Enablers FNC, is on turbine engine capability enhancements for future and emerging systems.  Technologies critical to Navy fighter jets are being worked, including low pressure turbine technologies for short takeoff and landing; high pressure turbine technologies for higher temperature, longer life; fan and compressor technologies for greater engine robustness and durability, and instrumentation and control technologies for greater engine state awareness and less unscheduled maintenance. Technologies being demonstrated include advanced aerodynamic, material, and structural concepts and emerging active control, prognostic health management, thermal management, aircraft subsystem integration, and information technologies.\n\nFY 2011 to FY 2012 funding reduction is due to a VAATE Phase II demonstrator engine effort with P&W being delayed to beyond FY 2012 and aligning funding to accommodate the delay.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the VAATE Phase I demonstrator engine test with Pratt & Whitney (P&W), now to include Short Take-Off Vertical Landing (STOVL) clearance testing for turbine components.\n- Completed the Delta Critical Design Review for the VAATE Phase I demonstrator engine test with P&W, now required due to inclusion of STOVL clearance testing for turbine components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.477"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete the VAATE Phase I demonstrator engine test with Pratt & Whitney (P&W) that includes STOVL clearance testing for turbine components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Efforts within this PE support the FNC program and are monitored at two levels.  At the lowest level, each is measured against technical and financial milestones on a monthly basis.  Annually, each FNC project is reviewed in depth for technical and transition performance by The Chief of Naval Research.  Routine site visits to performing organizations are conducted to assess programmatic and technical progress.  Most are reviewed annually or bi-annually by an independent board of visitors who assess the level and quality of the Science and Technology basis for the project."
                        }
                    }
                }
            ]
        }
    }
}