{
    "id": "b11925a2c8e33a0e154130621319b2aa3b65d849",
    "meta": {
        "filename": "dod-2013_RDTE_2013_SOCOM_JustificationBook_United_States_Special_Operations_Command_PB_2013.zzz_unzipped_JustificationBook_United_States_Special_Operations_Command_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160488BB"
        },
        "ProgramElementTitle": {
            "val": "Military Information Support Operations (MISO) (Formerly SOF PSYOP)"
        },
        "R1LineItemNumber": {
            "val": "272"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.109"
            },
            "CurrentYear": {
                "val": "2.990"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0"
            },
            "TotalCost": {
                "val": "7.099"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Beginning in FY2012, Program Element 1160488BB was renamed Military Information Support Operations (MISO).  Former name was SOF PSYOP.  \n\nThe Military Information Support Operations (MISO) program element provides for the development, test and integration of MISO equipment.  MISO are planned operations to convey selected information and indicators to foreign audiences to influence their emotions, motives, objective reasoning, and ultimately, the behavior of foreign governments, organizations, groups, and individuals.  This program element funds transformational systems and equipment to conduct MISO in support of combatant commanders."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.193"
                },
                "CurrentYear": {
                    "val": "2.990"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.109"
                },
                "CurrentYear": {
                    "val": "2.990"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.084"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.041"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.104"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.021"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  \n\nFY 2011:  Net decrease of $0.084 million due to reprogramming to higher command priorities ($0.041 million), economic assumption reductions (-$0.021 million), and a transfer to Small Business Innovative Research (-$0.104 million).\n\nFY 2012:  None.  \n\nFY 2013:  N\/A.\n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "D476"
                    },
                    "ProjectTitle": {
                        "val": "Military Information Support Operations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.109"
                        },
                        "CurrentYear": {
                            "val": "2.990"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "7.099"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and acquisition of Military Information Support Operations (MISO) equipment.  MISO are planned operations to convey selected information and indicators to foreign audiences to influence their emotions, motives, objective reasoning, and ultimately, the behavior of foreign governments, organizations, groups, and individuals.  This project funds transformational systems and equipment to conduct MISO in support of combatant commanders. The MISO sub-projects funded are grouped by the level of organization they support.  Sub-projects include:  \n\n•   The MISO Broadcast System consists of fixed and deployable multi-media production facilities for radio and television programming, distribution systems, and dissemination systems to provide MISO support to theater commanders. This program is comprised of several interfacing systems that can stand alone or interoperate with other MISO systems as determined by mission requirements. This program includes the fixed site media production center; a lightweight, deployable media production capability; a distribution system that provides a product distribution link to systems worldwide; a media system; a transit case fly-away broadcast systems that consists of a combination of amplitude modulation (AM), frequency modulation (FM), shortwave (SW), and television (TV) transmitters, and radio\/TV production systems; software defined radio and a long range broadcast system which transmits analog and digital broadcasts. The long range broadcast system will include unmanned aerial vehicle payloads, scatterable media, telephony, and Internet broadcast. MISO media displays will consist of easily transportable, state of the art, electronic media displays designed to disseminate and direct broadcast electronic messages, which will influence foreign target audiences, and will support the MISO direct broadcast mission requirements. The Special Operations Media System-B is a tactical deployable radio and television broadcast system. It is designed to act as the forward deployed broadcast platform of products. It has limited production capabilities and consists of two independent systems: a mobile radio broadcast system (AM, FM, SW) and a mobile television broadcast system (VHF, UHF) capable of receiving audio and video products for broadcasting.  Additionally, lightweight and tactical media development work stations will allow soldiers to produce MISO products in deployed locations.   \n\n•  Commando Solo:  Commando Solo supports combat operations by flying broadcast missions for the purpose of broadcasting analog and digital radio and\/or television signals deep into denied territory.  These broadcasts are made from EC-130J aircraft that are equipped with high powered transmitters and large antenna arrays that operate in the 0.45 - 1,000 MHz frequency range.  The Commando Solo program acquisition strategy includes conducting engineering analyses to develop digital broadcast capabilities for the EC-130J and C-130J aircraft.  Commando SOLO will leverage development and hardware from the Fly-Away Broadcast System."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MISO Broadcast System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.909"
                                            },
                                            "Text": {
                                                "val": "Continued primary hardware development, systems engineering, and DT&E on the long range broadcast technology, broadcast modernization efforts and media displays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.990"
                                            },
                                            "Text": {
                                                "val": "Continues primary hardware development, systems engineering, and DT&E on the long range broadcast technology, broadcast modernization efforts and media displays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EC-130J Commando Solo"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Completed engineering study of government and commercial digital broadcast technologies applicable to MISO."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Military Information Support Operations Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.331"
                                        },
                                        "CurrentYear": {
                                            "val": "4.142"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.417"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.417"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.471"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.690"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.752"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.352"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•  MISO Broadcast System consists of wide-area systems providing radio, television programming and multi-media production, distribution and dissemination support to the theater commander.  This system is comprised of several interfacing systems that can stand alone or interoperate with other systems as determined by mission requirements.  These various sub-programs are in a post-Milestone C or various stages of milestone decisions.  Media displays consist of electronic media displays, modular systems, electronic paper, and electronic games.  The program acquires and modifies, as necessary, commercial off-the-shelf \/government off-the-shelf COTS\/GOTS systems and equipment to provide the system capabilities. \n\n•  Commando Solo funds modifications of the Commando Solo special mission equipment that broadcasts television and radio messages to target audiences in denied areas.  Enhancements are periodically required to meet theater commander operational requirements and maintain compatibility with forces equipment upgrades to allow in-flight receipt of products for dissemination.  The program acquires and integrates into the EC-130J commercial and GOTS systems to replace or enhance current system capabilities and address equipment shortfalls due to obsolescence."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MISO Broadcast System"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.398"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.990"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.388"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding - Completed Efforts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.271"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.271"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}