{
    "id": "b2d1795602f30a79e0f70f335a02355f2f3f48be",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineItemNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "26.160"
            },
            "BudgetYearOne": {
                "val": "24.662"
            },
            "BudgetYearOneBase": {
                "val": "24.662"
            },
            "BudgetYearTwo": {
                "val": "24.675"
            },
            "BudgetYearThree": {
                "val": "25.116"
            },
            "BudgetYearFour": {
                "val": "23.399"
            },
            "BudgetYearFive": {
                "val": "23.826"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This funding develops emerging capabilities in support of near and mid-term irregular warfare needs guided by the framework Secretary of Defense (SECDEF), under Secretary of Defense (USD) Acquisition Technology and Logistics (AT&L), Assistant Secretary of Defense (ASD) Research and Engineering (R&E), of Deputy Assistant Secretary of Defense (DASD) Rapid Fielding (RF) and Rapid Reaction Technology Office (RRTO) objectives and focus areas.  With an emphasis on interagency and Service partnerships, initiatives are developed to pursue risk-reducing prototypes and demonstrations in order to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span a two to three year period and are demonstrated and fielded in spirals within that project timeline.  In addition, during FY 2012 and FY 2013 the office will expand a maritime portfolio focused on irregular warfare capabilities in that domain as a complement to the existing maritime technology demonstrator and ground and Inteligence, Surveillance, and Reconnaissance (ISR) portfolios.  This Program Element has evolved from exclusive support of force transformation activities to the activities described above, which are more closely aligned with departmental goals."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "26.972"
                },
                "BudgetYearOne": {
                    "val": "32.298"
                },
                "BudgetYearOneBase": {
                    "val": "32.298"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "26.160"
                },
                "BudgetYearOne": {
                    "val": "24.662"
                },
                "BudgetYearOneBase": {
                    "val": "24.662"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.812"
                },
                "BudgetYearOne": {
                    "val": "-7.636"
                },
                "BudgetYearOneBase": {
                    "val": "-7.636"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-0.632"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.636"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.636"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.180"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Baseline Review.  A  zero-based review to align resources to the most critical priorities and eliminate lower priority functions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "26.160"
                        },
                        "BudgetYearOne": {
                            "val": "24.662"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.662"
                        },
                        "BudgetYearTwo": {
                            "val": "24.675"
                        },
                        "BudgetYearThree": {
                            "val": "25.116"
                        },
                        "BudgetYearFour": {
                            "val": "23.399"
                        },
                        "BudgetYearFive": {
                            "val": "23.826"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element is a new start in FY 2012 and reflects a transition from 0605799D8Z to 0603699D8Z in FY 2012.\n\nThis funding develops emerging capabilities in support of near and mid-term irregular warfare needs guided by the framework Secretary of Defense (SECDEF), under Secretary of Defense (USD) Acquisition Technology and Logistics (AT&L), Assistant Secretary of Defense (ASD) Research and Engineering (R&E), of Deputy Assistant Secretary of Defense (DASD) Rapid Fielding (RF) and Rapid Reaction Technology Office (RRTO) objectives and focus areas.  With an emphasis on interagency and Service partnerships, initiatives are developed to pursue risk-reducing prototypes and demonstrations in order to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span a two to three year period and are demonstrated and fielded in spirals within that project timeline.  In addition, during FY 2012 and FY 2013 the office will expand a maritime portfolio focused on irregular warfare capabilities in that domain as a complement to the existing maritime technology demonstrator and ground and Inteligence, Surveillance, and Reconnaissance (ISR) portfolios.  This Program Element has evolved from exclusive support of force transformation activities to the activities described above, which are more closely aligned with departmental goals."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Overwatch"
                                    },
                                    "Description": {
                                        "val": "Overwatch is an overarching ground capability development effort which seeks to leverage technology and new concepts to fill ground combat and interagency capability gaps.  It contains multiple initiatives seeking to cultivate and leverage emerging technologies and concepts to counter the current and future challenges characteristic of the irregular warfare environment.  Projects are oriented toward increasing war fighter effectiveness on the battlefield and\/or the development\/enhancement of “whole of government” irregular warfare capability.\n  \nThe capability development effort furthers interagency capabilities by pursuing concept experimentation\/validation, interoperability enhancements, and command and control development.  Ground capabilities focus on command and control, force protection, situational awareness, and networked, cooperative engagement.  These solutions include completed operational assessments, equipment prototypes, or validated concepts which can be used to inform and drive formal procurement processes and\/or policy decisions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.380"
                                            },
                                            "Text": {
                                                "val": "Project Overwatch will continue with ten active subordinate projects:  the Enhanced Mortar Targeting System; Campaign Planning and Assessment Requirements\/Identifying Human and Technological Resource Requirements; Forward Operating Base Defense Integrated Protection Initiative; Off-the-shelf Guided Munitions; Walking Papers:  Building Geospatial Understanding; QuickNETS Humanitarian Assistance\/Disaster Relief efforts; Spectral Management efforts for equipment; Building Effective Institutions; NextTECH; and, Intelligent Small Unit Power (ISUP) efforts to reduce small unit fuel consumption.  Spectral Management efforts, NextTECH and ISUP are new efforts for FY 2012.  The Spectral Management effort will produce coatings to reduce the signature of U.S. equipment in the field to reduce vulnerability to emerging sensor modalities.  NextTECH will identify emerging technology areas that are likely to disrupt traditional military production or significantly enhance the ability of non-state actors to produce effects traditionally associated with national forces.  The Intelligent Small Unit Power initiative will look at modifying existing equipment to reduce fuel dependencies and usage at the lowest tactical level.  Additional projects will be developed and informed by Deputy Assistant Secretary of Defense (DASD) Rapid Fielding (RF) and Rapid Reaction Technology Office (RRTO) objectives and focus areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.026"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.026"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, the Enhance Mortar Targeting System; Spectral Management efforts for equipment; Intelligent Small Unit Power (ISUP) efforts to reduce small unit fuel consumption; and Off-the-Shelf Guided Munitions projects will continue development. New projects for FY 2013 will include: Tactical Counter Mortar and Electromagnetic Environmental Understanding.  The Tactical Counter Mortar project will develop a wheeled-vehicle class counter mortar\/rocket capability.  Electromagnetic Environmental Understanding will explore how social media and emerging network technologies can be identified and exploited by a tactical unit.  The project will develop tools at the tactical level to understand the normal or baseline electromagnetic environment. Additional projects will be developed and informed by DASD (RF) and RRTO objectives and focus areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Irregular Warfare\/Stiletto"
                                    },
                                    "Description": {
                                        "val": "As a complement to the Stiletto dedicated maritime demonstration vessel, the Maritime Irregular Warfare portfolio investigates and develops irregular warfare capability gaps in the maritime domain.  Recent projects conducted by RRTO have highlighted a significant gap in maritime capability against non-traditional challenges, which this portfolio addresses.  Stiletto is a maritime demonstration platform designed to assist in the rapid transition of technologies applicable across the range of military operations to higher Technology Readiness Levels.  The 88-foot long boat is an experimental, all carbon fiber craft originally built to explore the scalability of non-mechanical dynamic lift, composite carbon fiber construction, and high-speed performance for military operations.  The craft was purposefully designed to rapidly acquire, deploy, and employ new capabilities to explore the military utility of emerging technologies and concepts of operation for special and expeditionary forces.  Both the craft and its systems were designed to be flexible, modular, and re-configurable to enable near “plug-and-play” installation of C4I equipment used as part of experimentation.\n\nThe Stiletto program, managed in partnership with the Naval Surface Warfare Center’s Combatant Craft Division and the Naval Air Warfare Center Aircraft Division’s Warfare Innovation Cell, streamlines the experimental process and helps facilitate the rapid demonstration, exploration, and risk reduction of emerging technologies and capabilities.  The craft’s simple application process for experimentation is intended to provide low cost access for industry, government and academic organizations to install and prove their systems in a realistic maritime environment.  The demonstration process also encourages system developers to engage directly with the warfighter in the maritime environment to rapidly adapt technologies around warfighter needs.  The Stiletto vessel is homeported in Norfolk, Virginia."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.805"
                                            },
                                            "Text": {
                                                "val": "The Maritime Irregular Warfare Portfolio explores the development of counter evolved non-state capabilities such as semi and fully submersible vehicles and swarms, countering unmanned swarms, maritime non-lethal weapons systems, and low cost littoral fire support, among other capabilities.  Within that context, NAUTICUS is a new FY 2012 effort to non-invasively identify contraband materials such as explosives or illegal drugs being transported by maritime vessels underway. Stiletto will continue to serve as a maritime demonstration platform.  Increase in funding reflects the development of the maritime domain irregular warfare capability development portfolio.  For Stiletto, the intent is to expand the number of opportunities for non-traditional businesses that have not worked with DoD to utilize Stiletto as a low cost, accessible demonstration venue to enter the defense support realm.  Priority will be given to demonstrations that directly assist an acquisition program.  Specific focus for demonstrations will be on evaluating unmanned systems capabilities; sensors; launch and recovery; and human factors.  Stiletto plans to participate in the Trident Warrior operational experiment in FY 2012 as a “control ship” for multiple unmanned autonomous vessels.  Additional opportunities will be sought to assist the Combatant Commands (COCOMs) and services in experiments and exercises, as well as in demonstrating state-of-the-art capabilities in anticipation of future needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.025"
                                            },
                                            "Text": {
                                                "val": "Further development of the Maritime Irregular Warfare Portfolio is planned for FY 2013, specifically exploring the development of counter evolved non-state capabilities such as semi and fully submersible vehicles and swarms, countering unmanned swarms, maritime non-lethal weapons systems, and low cost littoral fire support, among other capabilities.  In FY 2013, projects will focus on partnerships with Navy, U.S. Coast Guard, Army Watercraft Systems, SOCOM, SOUTHCOM, and other operational users.  Stiletto will continue to serve as a maritime demonstration platform.  Increase in funding reflects the growth of the maritime domain irregular warfare capability development portfolio.  For Stiletto, the intent is to expand the number of opportunities for non-traditional businesses that have not worked with DoD to utilize Stiletto as a low cost, accessible demonstration venue to enter the defense support realm.  Priority will be given to demonstrations that directly assist an acquisition program, with specific focus on technology transition.  Specific focus for demonstrations will be on evaluating unmanned systems capabilities; sensors; launch and recovery; and human factors.  Stiletto plans to pursue participation in planned operational experiments in FY 2013 such as Trident Warrior and Trident Spectre, as well as hosting capability development exercises with operational commands such as Naval Expeditionary Combat Command, Army Watercraft Systems, and Naval Special Warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Airship"
                                    },
                                    "Description": {
                                        "val": "In conjunction with the NASA-Ames Research Center the USAF Research Laboratory, and U.S. Transportation Command (USTRANSCOM), the Department has undertaken a hybrid airship project  which is a non-deployable technology demonstrator that integrates independent technologies into a single, rigid aeroshell variable buoyancy (RAVB) air vehicle.  The project will demonstrate the technical maturity of a scalable vertical takeoff and landing aircraft.  Key technologies to be demonstrated include a buoyancy management system to enable ballast-independent operations, composite lightweight rigid external structure to reduce environmental restrictions, a responsive low-speed\/hover control system with associated control algorithms, and a ground handling subsystem to enable operations on unimproved landing surfaces.\n\nThe program objective is to mitigate long-term technical risk by integrating and demonstrating a suite of technologies with the potential to reduce operational constraints on future heavy-lift, buoyant-aircraft development programs.  If successful, the prototype will enable the rapid development of a nascent class of air vehicle which will radically reduce the energy use per ton-mile of airlift operations, permit high-payload operations directly into and out of austere regions with little infrastructure, and enable long-endurance manned or unmanned air operations.\n\nRAVB aircraft appear to be potentially scalable to payloads of 500-1,000 tons (compared with payloads in the 125-ton range for the largest current U.S. cargo aircraft).  With cruise speeds of 80-100 knots, RAVB aircraft could surpass by several times the speed of fast sealift.  With the potential to operate from land or water with very little infrastructure, RAVB aircraft may also drastically reduce the need for intermodal transportation as cargo moves from origin to point of need, with corresponding reduction in delivery times.\n\nUsing a two step process, the project has been reduced to a four year program.  Step one, in FY 2011, consisted of Assistant Secretary of Defense (ASD) Research and Engineering (R&E) providing an additional $6.000 million to the program (new total FY 2011 $14.000 million) to fund acceleration of the actions needed for early completion.  These actions consisted of finalizing vehicle design, analysis, and subsystem prototyping\/testing.  Step two of this process was to roll some of the requested FY 2013 funding ($5.000 million) into FY 2012 to fund systems integration and construction plus ground and flight testing.  This project is an interagency effort between the Department of Defense, the National Aeronautics and Space Administration Ames Research Center, and the USAF Research Laboratory."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "The funding increase in FY 2012 was for the acceleration and technical risk reduction to the hybrid airship initiative.  Specifically, the project will evolve from its current technical demonstrator approach to a program to develop a prototype suitable for transition.  Additional FY 2012 actions include completion of integrated subsystems and vehicle assembly followed by a Flight Readiness Review of the air vehicle prior to full hangar tethered flight testing and full flight testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, U.S. Transportation Command will have assumed oversight of further this efforts developmental initiatives.  Funding will support the development of follow-on demonstrations and capability development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "Thunderstorm is an enduring multi-Intelligence technology demonstration venue for the Office of the Secretary of Defense, interagency partners, Combatant Commanders, Services, academia, government laboratories and commercial vendors.  It provides participating partners with an opportunity to evaluate and assess the capabilities of new and emerging Intelligence, Surveillance, and Reconaissance (ISR) technologies and related information collection, processing, exploitation, and dissemination (PED) capabilities prior to full-scale operational employment.  Within this context, as many as four multi-intelligence technology demonstration opportunities per year can be conducted in mission-related, geographically and operationally relevant areas where the effectiveness of offensive and defensive capabilities of evolving ISR architectures, emerging technologies and transformational concepts can be tested and evaluated.  DoD, other government organizations, international, commercial and academic partners can demonstrate new, legacy and emerging detection, cueing, monitoring, tracking and handoff ISR technologies in real-world and simulated scenarios.  Thunderstorm technology demonstrations lend themselves to developing enduring interagency ISR information sharing tactics, techniques, procedures and collaboration tools and developing scenarios, using multi-Intelligence engagement, which minimize in-theater or on-site information processing, exploitation and dissemination (PED) requirements to advance remote PED capabilities for the DoD and interagency partners.  Using Thunderstorm demonstration objectives, performance measures, lessons learned, and post-demonstration assessments and data evaluation, ISR operational and architectural improvements are developed and codified."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.273"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, funding supports the planning and execution of the Thunderstorm Spiral 5.0 technology demonstration.  Execution of this summer 2012 spiral in the Rio Grande Valley Customs and Border Protection (CBP) Sector will leverage DHS\/CBP involvement as well as Joint Task Force North (JTF-N) and Joint Inter-Agency Task Force-South (JIATF-S) in supporting roles.  The Rio Grande Valley was chosen for this spiral because it offers multi-Intelligence demonstration opportunities against land, air, sea and littoral scenarios.  These scenarios serve to challenge ISR assets in multiple domains and will highlight the strengths and weakness in each.  \n\nIn the Spring of FY 2012, a related, but less complex Intelligence, Surveillance, and Reconnaissance (ISR) technology demonstration called Bluegrass will take place.  The objective of the Bluegrass exercise is to amass large urban\/suburban data sets using ISR\/wide-area motion imagery sensors tracking designated actors and use these data sets with known or “ground truth” information to develop and improve urban\/suburban wide-area motion analysis techniques for the DoD, agencies and industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.261"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.261"
                                            },
                                            "Text": {
                                                "val": "In early FY 2013, planning will begin for subsequent Thunderstorm Spirals building on previous iterations.  Using Thunderstorm Spiral 5.0 demonstration objectives, performance measures, lessons learned, and post-demonstration assessments and data evaluation, detailed plans will be developed to complement current operational challenges.  Thunderstorm Spiral 5.1 will return to the Rio Grande Valley to employ lessons learned in FY 2012 and improve the tactics, techniques and procedures using more complex scenarios to improve sensor capabilities, data integration, and processing, exploitation, and dissemination capabilities.\n\nResults of the FY 2012 Bluegrass demonstration will be used to determine follow-on activities for this effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emerging Space Capabilities"
                                    },
                                    "Description": {
                                        "val": "This new portfolio will apply the RRTO business model of relatively low-cost, short duration, high-impact, gap filling investments to complement Air Force and National Reconnaissance Office initiatives in pursuit of the National Space Strategy objective to preserve the space environment.  Projects will be synchronized with other ongoing interagency efforts and seek to pursue research and development of technologies and techniques to mitigate and remove on-orbit debris, reduce hazards, and increase understanding of the current and future debris environment.  This project also seeks to develop partnerships with the private sector to develop new and emerging space technology; and explore non-traditional approaches to rapid satellite development and launch in order to quickly respond to changes in the threat environment.    \n\nIn addition, during FY 2013 the office will focus the space portfolio on new space capabilities that complement existing ISR portfolios."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, this project purses the development of unique emerging capabilities in support of low-earth orbit debris mitigation and support needs guided by the National Security Space Strategy to preserve the space arena.  With an emphasis on interagency and service partnerships, initiatives will seek risk-reducing technology and prototypes that minimize orbital debris hazards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, projects focused on orbital debris mitigation and preservation of the space arena will continue.  In addition, projects will be initiated to develop partnerships with commercial entities that develops new and emerging space technology with the goal of recognizing and mitigating technological surprise and improving multi-Intelligence sensing, processing, exploitation and dissemination capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science and Technology Support to Information Operations"
                                    },
                                    "Description": {
                                        "val": "This new portfolio will apply the RRTO business model of relatively low-cost, short duration, high-impact, gap filling investments to complement DoD, State Department, and Department of Homeland Security initiatives in the areas of Information Operations, Strategic Communication, and Public Diplomacy.  Projects of particular interest include efforts to fill gaps in tools and capabilities that support the National Counterterrorism Strategy and the Countering Violent Extremism (CVE) Abroad Framework by developing measures of effectiveness, social media analysis, and counter-narrative capabilities.  Specific support to COCOM needs will be coordinated through the Director for Information Operations in the Office of the Under Secretary of Defense for Policy, Special Operations and Low Intensity Conflict (SO\/LIC)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.502"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, the office will develop the portfolio by updating its previous survey and gap analysis of the U.S. Government’s science and technology for strategic communication, broadening the field to include information operations.  The update will focus on existing and needed technical capabilities to respond in a systemic, rapid, sustained and measurable way to adversarial narratives being used to undermine our military and security efforts.  It will also look at technologies to rapidly analyze and respond to those narratives in the information environment.  The update will identify gaps in seven areas to guide future project developments: analytical tools, production, content delivery, research, planning, training, and evaluation tools.  Utilizing this gap analysis, several projects will be funded in FY 2012 to support Information Operations and CVE needs in partnership with SO\/LIC, the COCOMs, State Department’s Center for Strategic Counterterrorism Communications, USAID, and the Department of Homeland Security’s S&T and Human Factors programs.  Specific emphasis will be placed on capabilities beneficial to the priority countries identified by the National Security Staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Utilizing the report and gap analysis will complete in FY 2013.  Projects funded in FY 2013 will support Information Operations and CVE needs in partnership with SO\/LIC, the COCOMs, State Department’s Center for Strategic Counterterrorism Communications, USAID, and the Department of Homeland Security’s S&T and Human Factors programs.  Specific emphasis will be placed on capabilities beneficial to the priority countries identified by the National Security Staff.  Projects will focus on developing technologies and capabilities in the areas of measurement of effectiveness, social network analysis, advanced communications technologies, and other areas identified through partnerships with other DoD and interagency stakeholders."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target dates, production measures, fielding dates, and demonstration goals and dates.  Generic performance metrics applicable to Emerging Capabilities includes attainment of DoD Strategic Objective 4-2D.  The title of this objective is \"Speed Technology Transition Focused on Warfighting Needs\" and the metrics for this objective is to transition 30% of completing demonstrations program per year.  In FY2011, Emerging Capabilities Technology Development had 100% of its completing projects successfully transition."
                        }
                    }
                }
            ]
        }
    }
}