{
    "id": "b4e63dbb2503bf0b94908ccaa0ca36ba42334f0e",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207134F"
        },
        "ProgramElementTitle": {
            "val": "F-15 PROGRAMS"
        },
        "R1LineItemNumber": {
            "val": "131"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "200.966"
            },
            "CurrentYear": {
                "val": "194.831"
            },
            "BudgetYearOne": {
                "val": "192.677"
            },
            "BudgetYearOneBase": {
                "val": "192.677"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "354.193"
            },
            "BudgetYearThree": {
                "val": "361.441"
            },
            "BudgetYearFour": {
                "val": "369.328"
            },
            "BudgetYearFive": {
                "val": "320.172"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The F-15 program, Project 670131 has one FY 2013 new start, the F-15 Eagle Passive\/Active Warning Survivability System (EPAWSS)."
        },
        "ProgramElementMissionDescription": {
            "val": "The F-15 is the most versatile fighter in the world today.  The F-15A-D continues to provide air superiority with an undefeated and unmatched aerial combat record.  The F-15E retains this air superiority capability and adds systems, such as advanced imaging and targeting systems, to meet the requirement for all-weather, deep penetration, and night\/under-the-weather, air-to-surface attack.  Configured with conformal fuel tanks (CFTs), the F-15E deploys worldwide with minimal tanker support and arrives combat-ready.  A mainstay in operations both domestic and abroad, upgrades to the F-15 (avionics, armament, airframe, and engines) are critical to maintaining combat viability (lethality, survivability, and supportability). Projected to remain in service past 2030, avionics modernization is key to long-term weapon system viability.  This modernization is built on a foundation of technical studies (both internal to the Air Force and through outside contractors), forestalling obsolescence, exploiting proven technological advances, and leveraging new technology.  Major avionics upgrades center around radar modernization (both hardware and software upgrades) and the exploitation of enhanced capability via precision timing, data delivery and processing technology, precision registration systems, cockpit Head Up Display (HUD) and instrumentation digitization and modernization, central computer processing power increases, digital mission event recording systems and an infrared (IR) based fire control system.  Funds are also used, as required, to resolve Diminishing Manufacturing Sources and Material Shortage (DMSMS) issues. The proliferation of fourth generation enemy aircraft and sophisticated \"double-digit\" anti-aircraft missile systems pose a significant threat to F-15 survivability.  A fully integrated electronic warfare suite holds the promise of providing survivability as well as expanded electronic attack capability. Nearly all improvements are linked to an aircraft operational flight program update schedule that works to integrate new capabilities with the airframe.  These updates are a responsive way to increase the offensive and defensive capability and survivability of the F-15.  Incorporation of corresponding spiral and\/or phased technology\/equipment improvements that include support equipment, mission planning systems, and training device upgrades will improve performance, supportability, and aircrew training\n\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "222.677"
                },
                "CurrentYear": {
                    "val": "207.531"
                },
                "BudgetYearOne": {
                    "val": "167.510"
                },
                "BudgetYearOneBase": {
                    "val": "167.510"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "200.966"
                },
                "CurrentYear": {
                    "val": "194.831"
                },
                "BudgetYearOne": {
                    "val": "192.677"
                },
                "BudgetYearOneBase": {
                    "val": "192.677"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-21.711"
                },
                "CurrentYear": {
                    "val": "-12.700"
                },
                "BudgetYearOne": {
                    "val": "25.167"
                },
                "BudgetYearOneBase": {
                    "val": "25.167"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-12.700"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.652"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-16.059"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "25.167"
                                },
                                "BudgetYearOneBase": {
                                    "val": "25.167"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Congressional General Reductions -$1.059 million, Congressional Directed Reductions -$15.000 million and Small Business Innovative Research (SBIR) reductions -$5.652 million \n\nFY 2012: Funding decreases $12.7 million in Congressional Directed Reductions \n\nFY 2013: Funding increases $25.167 million to for Advanced Display Core Processor II development and Eagle Passive\/Active Warning Survivability System development."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670131"
                    },
                    "ProjectTitle": {
                        "val": "Initial Operational Test and Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "200.966"
                        },
                        "CurrentYear": {
                            "val": "90.206"
                        },
                        "BudgetYearOne": {
                            "val": "92.555"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.555"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "182.755"
                        },
                        "BudgetYearThree": {
                            "val": "170.920"
                        },
                        "BudgetYearFour": {
                            "val": "164.333"
                        },
                        "BudgetYearFive": {
                            "val": "82.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The F-15 program, Project 670131 has one FY 2013 new start, the F-15 Eagle Passive\/Active Warning Survivability System (EPAWSS)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This includes development of the F-15E APG-82(V)1 Active Electronically Scanned Array (AESA) radar, the F-15C\/D and F-15E Advanced Display Core Processor (ADCP) II and the F-15C\/D and F-15E Eagle Passive\/Active Warning Survivability System (EPAWSS).\n\nThe APG-82(V)1 will supply the F-15E with a digital radar that will provide improved range and resolution, as well as a significant improvement in reliability.  Also, an AESA radar has the potential to provide electronic attack and protection capabilities.  \n\nThe ADCP II will develop a common mission computer for the F-15C\/D and F-15E.  The current mission computers of both platforms have reached their limits of speed, memory and throughput.  Additionally, digital systems have changed the security requirements of both platforms, which the older mission computers cannot be upgraded to meet.  A common mission computer is expected to reduce overall development costs as well as long term maintenance costs.  The program will also develop a new F-15C\/D cockpit display to replace an obsolete one.\n\nEPAWSS will replace the obsolete Tactical Electronic Warfare System (TEWS), which will help the aircraft survive in high threat environments.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational  Flight Program (OFP) Development Efforts"
                                    },
                                    "Description": {
                                        "val": "Provides OFP program software and hardware updates to integrate new capabilities on all F-15 aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.484"
                                            },
                                            "Text": {
                                                "val": "Complete Suite 7E System Verification Review (SVR) #1 and #2.  Accomplish Suite 7E Flight Test activity for Development Test and Force Development Evaluation.  Accomplish S7E Validation\/Verification & Aircrew\/Maintenance publication and technical orders production.  Award Suite 8E Phase 1.  Begin Suite 7C (formerly known as Suite 7M) development and complete PDR.  Continuation of organic software support and Special Projects development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Moved to Project 676020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Test"
                                    },
                                    "Description": {
                                        "val": "Flight testing of improvements initiated in prior years.  Baseline infrastructure and personnel support for F-15 Developmental Test (DT) and Operational Test (OT)operations.  Purchases long-lead test support assets and unique aircraft test instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.648"
                                            },
                                            "Text": {
                                                "val": "Continuation of flight test activities at Eglin AFB, FL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Moved to Project 676020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Electronic Warfare System (TEWS) Intermediate Support System (TISS) Technology Insertion Program (TTIP)"
                                    },
                                    "Description": {
                                        "val": "Development of Tactical Electronic Warfare System (TEWS) Intermediate Support System (TISS) Technology Insertion Program (TTIP).  Replaces the TEWS TISS radio frequency interface on 36 stations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.386"
                                            },
                                            "Text": {
                                                "val": "Replaces the TEWS TISS radio frequency interface on 36 stations and provides 5 years of Engineering Support.  Replaces the TEWS TISS radio frequency interface on 36 stations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15E Radar Modernization Program (RMP) APG-82(V)1"
                                    },
                                    "Description": {
                                        "val": "New AESA radar replacing legacy APG-70 radars on all F-15E aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "76.462"
                                            },
                                            "Text": {
                                                "val": "Complete System Verification Review (SVR) #1.Complete Production Readiness Review. Complete installation\/modification of 5 DT\/OT test aircraft. Complete Flight Test Readiness Review. Begin DT&E. Complete MS C"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.353"
                                            },
                                            "Text": {
                                                "val": "Complete DT&E and SVR#2. Begin IOT&E.  Begin verification of publications.  Complete modification of aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.351"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.351"
                                            },
                                            "Text": {
                                                "val": "Complete EMD phase of program"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15C\/D Infrared Search and Track system (IRST)"
                                    },
                                    "Description": {
                                        "val": "Develops IRST pod for use on F-15C\/D with fast scanning air-to-air detection, tracking and ranging capability in the Infrared (IR) spectrum."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.399"
                                            },
                                            "Text": {
                                                "val": "Risk reduction tech demo, test hardware development,  OFP software maturation, and OGCs associated with concluding pre-MS B development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Moved to Project 676020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Eagle Passive\/Active Warning Survivability System (EPAWSS)"
                                    },
                                    "Description": {
                                        "val": "Replacement of the existing F-15 self-protection, Tactical Electronic Warfare System (TEWS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.082"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.082"
                                            },
                                            "Text": {
                                                "val": "New Start FY13.  Integration risk reduction, technology development; OFP risk reduction and system\/sub-system design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Display Core Processor (ADCP) II (formerly known as Computer Processor Modernization Program and Advanced Display Core Processor Plus w\/Vertical Situation Display.  FY12 combined programs)"
                                    },
                                    "Description": {
                                        "val": "New central computer for both F-15E and F-15C\/D modernization.  Additionally, this program provides a high resolution color display to replace the current F-15C\/D Vertical Situation Display (VSD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.587"
                                            },
                                            "Text": {
                                                "val": "Initiated Pre-EMD Technology Development phase with the design and production and initial production of ADCP II prototypes.  Preliminary Subsystem Requirements development.  Prototyping of initial boot software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.853"
                                            },
                                            "Text": {
                                                "val": "Subsystem System Requirements Review (SRR), Preliminary Design Review\n(PDR), Aircraft SRR, Subsystem Critical Design Review (CDR).  Continued software prototyping.  Begin EMD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "86.122"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "86.122"
                                            },
                                            "Text": {
                                                "val": "Continue EMD. Critical Design Review (CDR). Initial hardware build. OFP Suite 8E rehost for F-15 C\/D. Software development and testing on prototype hardware.  Vertical Situation Display Replacement (VSDR) design and integration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0207130F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0207130F, Aircraft Modification (F-15A\/B\/C\/D Squadrons, APAF)    [BP 11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "184.439"
                                        },
                                        "CurrentYear": {
                                            "val": "137.010"
                                        },
                                        "BudgetYearOne": {
                                            "val": "62.660"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "62.660"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "196.999"
                                        },
                                        "BudgetYearThree": {
                                            "val": "189.745"
                                        },
                                        "BudgetYearFour": {
                                            "val": "201.894"
                                        },
                                        "BudgetYearFive": {
                                            "val": "132.844"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207134F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0207134F, Aircraft Modification (F-15E Squadrons, APAF [BP11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "118.243"
                                        },
                                        "CurrentYear": {
                                            "val": "117.825"
                                        },
                                        "BudgetYearOne": {
                                            "val": "85.045"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "85.045"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "249.533"
                                        },
                                        "BudgetYearThree": {
                                            "val": "270.211"
                                        },
                                        "BudgetYearFour": {
                                            "val": "320.222"
                                        },
                                        "BudgetYearFive": {
                                            "val": "333.185"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207445F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0207445F, Aircraft Modification (Fighter Tactical Data Link, APAF) [BP11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.171"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.377"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.821"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.946"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.964"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0809731F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0809731F, Aircraft Modification (Training Support to Units, APAF) [BP11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.987"
                                        },
                                        "CurrentYear": {
                                            "val": "0.751"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.673"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.673"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.835"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.081"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.107"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.125"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207130F, Aircraft Support Eq..."
                                    },
                                    "Title": {
                                        "val": "PE 0207130F, Aircraft Support Equipment (O&I) (F-15A\/B\/C\/D Squadrons, APAF) [BP 12]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.983"
                                        },
                                        "CurrentYear": {
                                            "val": "1.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207134F, Aircraft Post Produ..."
                                    },
                                    "Title": {
                                        "val": "PE 0207134F, Aircraft Post Production Support (F-15E Squadrons, APAF)  [BP 13]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.502"
                                        },
                                        "CurrentYear": {
                                            "val": "2.076"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.363"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.363"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.403"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.479"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.540"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.581"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207130F, Aircraft Initial Sp..."
                                    },
                                    "Title": {
                                        "val": "PE 0207130F, Aircraft Initial Spares and Repairs (F-15A\/B\/C\/D Squadrons, APAF)  [BP 16]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.096"
                                        },
                                        "CurrentYear": {
                                            "val": "0.087"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.097"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.097"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.951"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.181"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.460"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.300"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207134F, Aircraft Initial Sp..."
                                    },
                                    "Title": {
                                        "val": "PE 0207134F, Aircraft Initial Spares and Repairs (F-15E Squadrons, APAF)  [BP 16]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.458"
                                        },
                                        "CurrentYear": {
                                            "val": "17.863"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.012"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.012"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.253"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.137"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.765"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.887"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program is a continuation of effort which includes the development for all F-15 models.  Funds are executed organically in support of equipment improvement, study, analysis, and test.  Acquisition and management strategies for each program are independently developed and use a variety of contract methods and types to accomplish program objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207134F_BPAC_670131_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-15E APG-82(V)1 RMP EMD - Complete"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EPAWSS--FY13 New Start"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676020"
                    },
                    "ProjectTitle": {
                        "val": "F-15"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "104.625"
                        },
                        "BudgetYearOne": {
                            "val": "100.122"
                        },
                        "BudgetYearOneBase": {
                            "val": "100.122"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "171.438"
                        },
                        "BudgetYearThree": {
                            "val": "190.521"
                        },
                        "BudgetYearFour": {
                            "val": "204.995"
                        },
                        "BudgetYearFive": {
                            "val": "238.172"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "BPAC 676020 was created in the FY 2012 President's Budget to improve management of F-15 development.  Funds that were moved from BPAC 670131 to BPAC 676020 were:  FY 2012 $117.7M, FY 2013 $129.7M, FY 2014 $145.4M, FY 2015 $144.5M, and FY 2016 $146.8M."
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort includes development of F-15E Electronic Protection (EP) capabilities and provides funding for Operational Flight Program (OFP) upgrades and for Flight Testing.\n\nEP will enhance digital Active Electronic Scanned Array (AESA) radar capabilities to counter sophisticated electronic threats.  \n\nFor the F-15 to maintain operational effectiveness, the program must make a continuous effort to provide the platforms with improved capabilities.  To accomplish this there is an on-going need to develop software upgrades and to flight test new capabilities and systems.   The OFP funding line allows the Air Force to release software upgrades approximately every 3 years.  At any one time the program has three OFP upgrades in work: one in requirements definition\/pricing, one in code writing and test, and one in flight test and release preparation.  Flight Test funding line allows the Air Force to fund the on-going test effort.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Flight Program (OFP) Development Efforts"
                                    },
                                    "Description": {
                                        "val": "Provides OFP program software and hardware updates to integrate new capabilities on all F-15 aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funded in Project 670131"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.970"
                                            },
                                            "Text": {
                                                "val": "Continue Suite 8E Phase 1 and initiate S8E Phase 2 planning and contracting actions. Continue Suite 7C (otherwise known as Suite 7M)  development efforts and complete Critical Design Review (CDR). Continuation of organic software support and Special Projects development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.341"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.341"
                                            },
                                            "Text": {
                                                "val": "Complete S8E requirements definition and initiate S8E Phase II development.  Continue Suite 7C (otherwise known as Suite 7M) development and CDR.  Integrate Alpha 2 Lite into the OFP. Continuation of organic software support and Special Projects development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Test"
                                    },
                                    "Description": {
                                        "val": "Flight testing of improvements initiated in prior years.  Baseline infrastructure and personnel support for F-15 Developmental Test (DT) and Operational Test (OT) operations.  Purchases long-lead test support assets and unique aircraft test instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funded in Project 670131"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.105"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides prime contractor support cadre at Eglin and Nellis for DT\/OT support, avionics integration lab Operations and Maintenance (O&M), Combined Test Force (CTF) O&M, and long-lead test unique equipment, i.e., program specific aircraft instrumentation, weapons instrumentation kits, weapons simulators, data reduction\/handling equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.049"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides prime contractor support cadre at Eglin and Nellis for DT\/OT support, avionics integration lab O&M, CTF O&M, and long-lead test unique equipment, i.e., program specific aircraft instrumentation, weapons instrumentation kits, weapons simulators, data reduction\/handling equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15C\/D BLOS"
                                    },
                                    "Description": {
                                        "val": "Provide F-15C\/D beyond line of sight (BLOS) communications capability on all long term aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.550"
                                            },
                                            "Text": {
                                                "val": "New start FY 2012.  Software development and qualification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15E Radar Enhancements"
                                    },
                                    "Description": {
                                        "val": "Improvements to F-15E Electronic Protection (EP) and other radar enhancements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "New start FY 2012.  Initial EP capability integration, technology maturation, hardware purchases for radar lab development and testing.  Assessment of existing EP effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.732"
                                            },
                                            "Text": {
                                                "val": "EP software development, technology maturation, and OFP risk reduction."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0207130F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0207130F, Aircraft Modification (F-15A\/B\/C\/D Squadrons, APAF) [BP 11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "184.439"
                                        },
                                        "CurrentYear": {
                                            "val": "137.010"
                                        },
                                        "BudgetYearOne": {
                                            "val": "62.660"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "62.660"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "196.999"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1894.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "201.894"
                                        },
                                        "BudgetYearFive": {
                                            "val": "132.844"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207134F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0207134F, Aircraft Modification (F-15E Squadrons, APAF [BP11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "118.243"
                                        },
                                        "CurrentYear": {
                                            "val": "117.825"
                                        },
                                        "BudgetYearOne": {
                                            "val": "85.045"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "85.045"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "249.533"
                                        },
                                        "BudgetYearThree": {
                                            "val": "270.211"
                                        },
                                        "BudgetYearFour": {
                                            "val": "320.222"
                                        },
                                        "BudgetYearFive": {
                                            "val": "333.185"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207445F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0207445F, Aircraft Modification (Fighter Tactical Data Link, APAF) [BP11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.171"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.377"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.821"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.946"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.964"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0809731F, Aircraft Modificati..."
                                    },
                                    "Title": {
                                        "val": "PE 0809731F, Aircraft Modification (Training Support to Units, APAF) [BP11]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.987"
                                        },
                                        "CurrentYear": {
                                            "val": "0.751"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.673"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.673"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.835"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.081"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.107"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.125"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207130F, Aircraft Support Eq..."
                                    },
                                    "Title": {
                                        "val": "PE 0207130F, Aircraft Support Equipment (O&I) (F-15A\/B\/C\/D Squadrons, APAF) [BP 12]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.983"
                                        },
                                        "CurrentYear": {
                                            "val": "1.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207134F, Aircraft Post Produ..."
                                    },
                                    "Title": {
                                        "val": "PE 0207134F, Aircraft Post Production Support (F-15E Squadrons, APAF) [BP 13]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.502"
                                        },
                                        "CurrentYear": {
                                            "val": "2.076"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.363"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.363"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.403"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.479"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.540"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.581"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207130F,  Aircraft Initial S..."
                                    },
                                    "Title": {
                                        "val": "PE 0207130F,  Aircraft Initial Spares and Repairs (F-15A\/B\/C\/D Squadrons, APAF) [BP 16]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.096"
                                        },
                                        "CurrentYear": {
                                            "val": "0.086"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.097"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.097"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.951"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.181"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.460"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.300"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207134F, Aircraft Initial Sp..."
                                    },
                                    "Title": {
                                        "val": "PE 0207134F, Aircraft Initial Spares and Repairs (F-15E Squadrons, APAF) [BP 16]"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.458"
                                        },
                                        "CurrentYear": {
                                            "val": "17.863"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.012"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.012"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.253"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.137"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.765"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.887"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program is a continuation of effort which includes the development of all F-15 models.  Funds are executed organically in support of equipment improvement, study, analysis, and test.  Acquisition and management strategies for each program are independently developed and use a variety of contract methods and types to accomplish program objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207134F_BPAC_676020_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "OFP Continuous Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 C\/D BLOS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Radar Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}