{
    "id": "b8eaccb70fb546aa168182ee4d47a58e238e28ed",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineItemNumber": {
            "val": "143"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "68.118"
            },
            "CurrentYear": {
                "val": "70.116"
            },
            "BudgetYearOne": {
                "val": "69.183"
            },
            "BudgetYearOneBase": {
                "val": "69.183"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "64.432"
            },
            "BudgetYearThree": {
                "val": "62.607"
            },
            "BudgetYearFour": {
                "val": "64.990"
            },
            "BudgetYearFive": {
                "val": "66.002"
            }
        },
        "ProgramElementNote": {
            "val": "Taxes witheld and congressional add in FY11"
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element provides critical front-end investments for development of new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of M&S and instrumentation prototypes; and the full development of systems for the United States Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); Redstone Test Center (RTC), Redstone Arsenal, Alabama; and West Desert Test Center (WDTC) at Dugway Proving Ground (DPG), Utah. OTC consists of four forward Test Directorates (Airborne Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; Fire Support Test Directorate, Fort Sill, Oklahoma; and Intelligence Electronic Warfare Test Directorate, Fort Huachuca, Arizona) together with five other Test Directorates (Aviation; Maneuver; Battle Command and Computers; Engineer and Combat Support; and Future Force) at Ft Hood, Texas. These capabilities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives in support of operations in Iraq and Afghanistan.  Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for M&S and instrumentation systems to assure adequate test data collection capabilities. This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the Mine Resistant Ambush Protected (MRAP) vehicles, Ground Combat Vehicle (GCV), Network Integration Evaluation (NIE), Terminal High Altitude Area Defense (THAAD), Patriot Advance Capability Phase 3 (PAC 3), Mobile Gun System (MGS), Warfighter Information Network - Tactical (WIN-T), Joint Tactical Radio System (JTRS),and the Army Battle Command System (ABCS) which includes Force XXI Battle Command Brigade and Below (FBCB2)\/Blue Force Tracking (BFT).  This Program Element develops and sustains developmental and operational test capabilities that provide key support to the Army's Transformation.  In addition this Program Element supports Overseas Contingency Operations by providing instrumentation to support ATEC's 24\/7 mission at YTC, Arizona, WSMR, New Mexico and ATC, Maryland supporting the Joint Improvised Explosive Device Defeat Organization (JIEDDO) - as well as efforts throughout ATEC in support of the Army's Rapid Equipping the Force (REF) initiative."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.040"
                },
                "CurrentYear": {
                    "val": "70.227"
                },
                "BudgetYearOne": {
                    "val": "68.506"
                },
                "BudgetYearOneBase": {
                    "val": "68.506"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "68.118"
                },
                "CurrentYear": {
                    "val": "70.116"
                },
                "BudgetYearOne": {
                    "val": "69.183"
                },
                "BudgetYearOneBase": {
                    "val": "69.183"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.078"
                },
                "CurrentYear": {
                    "val": "-0.111"
                },
                "BudgetYearOne": {
                    "val": "0.677"
                },
                "BudgetYearOneBase": {
                    "val": "0.677"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "8.720"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.888"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.677"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.677"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "2.246"
                                },
                                "CurrentYear": {
                                    "val": "-0.111"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.197"
                        },
                        "CurrentYear": {
                            "val": "46.977"
                        },
                        "BudgetYearOne": {
                            "val": "45.498"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.498"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "44.619"
                        },
                        "BudgetYearThree": {
                            "val": "42.949"
                        },
                        "BudgetYearFour": {
                            "val": "46.423"
                        },
                        "BudgetYearFive": {
                            "val": "47.122"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC), which include: Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropic Regions Test Center (TRTC), (at various locations); Redstone Test Center (RTC), Redstone Arsenal, Alabama; and West Desert Test Center (WDTC) Dugway Proving Ground (DPG), Utah. These capabilities are required to support developmental testing requirements of high priority Army systems being rapidly fielded to Iraq and Afghanistan, and those systems supporting Army modernization efforts. \n\nA key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of body armor and other soldier protective equipment, advanced methods for testing the survivability of ground vehicles and aircraft, refurbishment of kineto-tracking mounts (precise optical instruments used in missile and aviation testing), and an expanded instrumentation suite in support of the growing mission to test Command, Control, Communication and Computer (C4) systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Provides command-level oversight, management and technical support for the DTC test technology and instrumentation investment accounts.  Provides support to ATEC Capstone efforts in coordinating development of common instrumentation and technology needs for developmental and operational testing.  Provides management and support costs for direct interface with the T&E Executive Agent, management of needs and solutions calls for T&E Reliance oversight, management of the Small Business Innovation Research (SBIR), and support of the Army principal of the Test Resource Advisory Group (TRAG)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.320"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of the existing requirement for the development of common instrumentation and technology to support developmental and operational testing. Management of the Small Business Innovation Research (SBIR), and support of the Army principal of the Test Resource Advisory Group (TRAG)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.943"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of the existing requirement for the development of common instrumentation and technology to support developmental and operational testing. Management of the Small Business Innovation Research (SBIR), and support of the Army principal of the Test Resource Advisory Group (TRAG)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.756"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.756"
                                            },
                                            "Text": {
                                                "val": "Continuation of the existing requirement for the development of common instrumentation and technology to support developmental and operational testing. Management of the Small Business Innovation Research (SBIR), and support of the Army principal of the Test Resource Advisory Group (TRAG)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires and sustains critical test technology and instrumentation: Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment and other test capabilities to successfully develop and test the Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities and models and simulations needed for testing the Army materiel.  Acquires instrumentation for reliability, availability and maintainability (RAM) data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition tests; supports development of common data collection instrumentation used in testing across all test commodity areas; acquires instrumentation for electromagnetic environment effects on ground and air systems; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry equipment used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire and active protection systems; upgrades and replaces mobile range communications equipment and digital end devices; and develops advanced test technologies and instrumentation for testing next generation materiel such as advanced armor protection, multi-spectral sensors, and advanced soldier systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.795"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.377"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automotive Technology Evaluation Facility"
                                    },
                                    "Description": {
                                        "val": "Automotive Technology Evaluation Facility (ATEF) Test Track Upgrades - An automated traffic control system will be installed to monitor vehicle positions on the course and control accesses to and from the facility.  Continuous vehicle monitoring is required for range safety and automatic collision avoidance while simultaneously conducting sustained speed endurance, vehicle dynamics and stability, robotic\/autonomous vehicle control and traction control testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained automated traffic control system and continue monitoring range safety while conducting simultaneous vehicle testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.995"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintain automated traffic control system and continue monitoring range safety while conducting simultaneous vehicle testing.  An instrumentation suite will be procured to collect and transmit real-time test data, consisting of on-board data acquisition equipment, telemetry receiving stations, wireless communications network, vehicle position systems, a fiber-optic network interface, and will be equipped with a driverless test vehicle guidance system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.901"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.901"
                                            },
                                            "Text": {
                                                "val": "Will maintain automated traffic control system and instrumentation suite.  Will continue monitoring range safety while conducting simultaneous vehicle testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Test and Evaluation Command (ATEC) Common Test Technology for Developmental Testing, Operational Testing, and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Army Test and Evaluation Command (ATEC) Common Test Technology for Developmental Testing, Operational Testing, and Evaluation. Provides support for development of the Versatile Information System Integrated, On-line (VISION) Digital Library to enable a centrally accessible repository for test data; development of a Test and Evaluation Enterprise Architecture to facilitate use of common tools and standards; support for critical Test Technology Domain Focus Areas of Instrumentation, Modeling and Simulation, Threats, Data Management, and Networks; and support,  implementation of ATEC Regulation 70-15"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to provide support for development of the VISION digital library, the development of test and evaluation enterprises to facilitate use of common tools and standards. Continued to support critical test technology domain focus areas of instrumentation, modeling and simulation, threats, data management and Networks. Implementation of ATEC Reg 70-15"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide support for development of the VISION digital library, the development of test and evaluation enterprises to facilitate use of common tools and standards. Continue to support critical test technology domain focus areas of instrumentation, modeling and simulation, threats, data management and Networks. Implementation of ATEC Reg 70-15"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.464"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support for development of the VISION digital library, the development of test and evaluation enterprises to facilitate use of common tools and standards. Will continue to support critical test technology domain focus areas of instrumentation, modeling and simulation, threats, data management and Networks. Implementation of ATEC Reg 70-15"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "MODELING AND SIMULATION INSTRUMENTATION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.921"
                        },
                        "CurrentYear": {
                            "val": "23.139"
                        },
                        "BudgetYearOne": {
                            "val": "23.685"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.685"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.813"
                        },
                        "BudgetYearThree": {
                            "val": "19.658"
                        },
                        "BudgetYearFour": {
                            "val": "18.567"
                        },
                        "BudgetYearFive": {
                            "val": "18.880"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The United States Army Operational Test Command (USAOTC) plans, conducts and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of War fighting systems.  Operational Test (OT) Instrumentation collects required data from both the systems being tested and the surrounding activity.  OT Simulation enhances the live forces conducting operational testing by simulating additional units, message traffic, effects, and terrain.  The Army's OPTEMPO has reduced the number of tactical units and vehicles available to support OT, making augmentation through simulation needed at times to test in a realistic, operational environment. The Program Executive Office for Simulation, Training, and Instrumentation (PEO STRI) Program Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) provides development of major simulation and instrumentation systems while USAOTC adapts systems from other organizations, purchases off-the-shelf systems, develops minor new systems, and sustains all USAOTC simulation and instrumentation systems.  The OT Simulation and Instrumentation (S&I) (Sustainment and Minor Development) program funds the expertise and the adaptation, purchases, minor development and sustainment requirements that support systems undergoing OT.  Costs unique to specific systems under test may require PM funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ATEC Common Technology Tools"
                                    },
                                    "Description": {
                                        "val": "These funds also support development of the Command, Control and Communication Driver (C3 Driver), Test and Evaluation Enterprise Architecture (TEEA), and ATEC Technology Tools.  The C3 Driver supports the Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), specifically Army Battle Command System (ABCS) 6.3, and, 6.4, development and integration at the Central Technical Support Facility (CTSF) Fort Hood, TX and contractor locations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funded the development of the C3 Driver, TEEA, and ATEC Common Technology Tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.734"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds the development of the TEEA and ATEC Common Technology Tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.665"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.665"
                                            },
                                            "Text": {
                                                "val": "Will fund the development of the TEEA and ATEC Common Technology Tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling, Simulation and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "The individual accomplished technology projects within all the domains as described in ATEC Regulation 70-15, Table 1, 22 Mar 06, include but are not limited to:  DoD Information Assurance Certification and Accreditation Process (DIACAP) for many OTC Modeling, Simulation, and Instrumentation Systems, Sustainment and Operations of all OTC Technology Capabilities and associated data management, Test Technology Integration, Operational Test Command Analytic Simulation and Instrumentation Suite (OASIS) Integration and Architecture, Test Technology Execution Capabilities, Network Control Systems, Battle Command Integration System, and Instrumentation, Real Time Casualty Assessment (RTCA) Sustainment, Extensible C4ISR Instrumentation system Fire Support Application (ExCIS FSA), Intelligence Surveillance and Reconnaissance (ISR) Simulation and Instrumentation - Intelligence Modeling ans Simulation for Evaluation (IMASE), Performance Instrumentation, Voice\/Video Emulation Systems, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.892"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY11 current program funds were utilized for the sustainment, development, and upgrade of OTCs high priority modeling, simulation, and instrumentation systems identified under the POM submission FY12-17.  The programs executed that fall under the ATEC domain categories shown above but were not limited to:  RTCA equipment procurement, sustainment, and minor upgrades, TTEC Operations to sustain M&S capability, and integration of systems of systems, OTC Technology Base Support, ExCIS FSA, IMASE Simulation Scoring System (ISSS) & IMASE Scenario Generation Tool (ISGT), BCNIS, Geometric Advanced Video Enhanced Location Systems (GAVELS), High-speed Digital Recording System, and OASIS Integration and Architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.405"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 12 Planned Programs: The individual accomplished technology projects within all the domains as described in ATEC Regulation 70-15, Table 1, 22 Mar 06, include but are not limited to DIACAP for many OTC Modeling, Simulation, and Instrumentation Systems, Sustainment and Operations of all OTC Technology Capabilities and associated data management, Test Technology Integration, OASIS Integration and Architecture, Test Technology Execution Capabilities, Network Control Systems, Battle Command Integration System, and Instrumentation, RTCA Sustainment, ExCIS FSA, ISR Simulation and Instrumentation - IMASE, Performance Instrumentation, Voice\/Video Emulation Systems, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.020"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.020"
                                            },
                                            "Text": {
                                                "val": "FY 13 Planned Programs:  The individual will accomplish technology projects within all the domains as described in  ATEC Regulation 70-15, Table 1, 22 Mar 06, include but are not limited to DIACAP for many OTC Modeling, Simulation, and Instrumentation Systems, Sustainment and Operations of all OTC Technology Capabilities and associated data management, Test Technology Integration, OASIS Integration and Architecture, Test Technology Execution Capabilities, Network Control Systems, Battle Command Integration System, and Instrumentation, RTCA Sustainment, ExCIS FSA, ISR Simulation and Instrumentation - IMASE, Performance Instrumentation, Voice\/Video Emulation Systems, etc."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}