{
    "id": "bd9c372c62abdc48d2b3236537f060504792edb5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Applied Res"
        },
        "R1LineItemNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.762"
            },
            "CurrentYear": {
                "val": "5.937"
            },
            "BudgetYearOne": {
                "val": "5.973"
            },
            "BudgetYearOneBase": {
                "val": "5.973"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "6.060"
            },
            "BudgetYearThree": {
                "val": "6.194"
            },
            "BudgetYearFour": {
                "val": "6.303"
            },
            "BudgetYearFive": {
                "val": "6.427"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DOD's Joint Non-Lethal Weapons Program (JNLWP) was established by the Secretary of Defense, who assigned centralized responsibility for DoD joint research and development of non-lethal technology to the Commandant of the Marine Corps as the Executive Agent.  The Under Secretary of Defense for Acquisition, Technology and Logistics provides direct oversight of the JNLWP.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions provided by the Joint Non-Lethal Weapons (NLW) Integrated Product Team, a multi-service flag level corporate board that executes the JNLWP for the Commandant of the Marine Corps.  This direction is based on the needs and capabilities of the Services, the Special Operations Command, and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document.  This coordinated joint S&T development approach addresses mutual capability gaps and assures the best non-lethal technologies and equipment are provided to the operating forces while eliminating duplicative service S&T investment.\n\nThis program funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect.  Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-material missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics.  This program transitioned from PE 0602114N, Power Projection Applied Research by order of the Under Secretary of Defense for Acquisition, Technology, and Logistics, USD(AT&L), to a separate PE for Joint Non-Lethal Weapons Applied Research and established the Marine Corps as the executive agent for DoD Joint Non-Lethal Weapons RDT&E.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.002"
                },
                "CurrentYear": {
                    "val": "5.937"
                },
                "BudgetYearOne": {
                    "val": "5.918"
                },
                "BudgetYearOneBase": {
                    "val": "5.918"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.762"
                },
                "CurrentYear": {
                    "val": "5.937"
                },
                "BudgetYearOne": {
                    "val": "5.973"
                },
                "BudgetYearOneBase": {
                    "val": "5.973"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.240"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.055"
                },
                "BudgetYearOneBase": {
                    "val": "0.055"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.040"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.169"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.055"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.055"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.031"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "JT Non-Lethal Wpns Applied Res"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.762"
                        },
                        "CurrentYear": {
                            "val": "5.937"
                        },
                        "BudgetYearOne": {
                            "val": "5.973"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.973"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.060"
                        },
                        "BudgetYearThree": {
                            "val": "6.194"
                        },
                        "BudgetYearFour": {
                            "val": "6.303"
                        },
                        "BudgetYearFive": {
                            "val": "6.427"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect. Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-material missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "(U) JOINT NON-LETHAL WEAPONS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.762"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued investigation of the characteristics, optimization, and control of Laser Induced Plasma (LIP) phenomena for its nonlethal applications to both counter-personnel and counter-materiel missions. Completed the Counter-vehicle mission applicability determination portion of this effort. LIP is a phenomenon of high energy, short pulse lasers that have several potential applications to produce or transmit non-lethal stimuli.\n- Continued refinement of directed energy weapon models through research into non-lethal phenomena and assessment of human effects and weapon effectiveness.\n- Continued applied research in the development of counter-personnel and counter-materiel directed energy non-lethal weapons, including counter-vehicle and advanced active denial activities.\n- Continued academic research into technology areas with relevance to non-lethal weapon capabilities.\n- Continued investigations of alternative technologies with potential to address emerging capability gaps.\n- Continued characterization efforts of alternative directed energy technologies by building upon the Advanced Total Body Model (ATBM) as part of the Human Effects Modeling Analysis Program (HEMAP) to incorporate suitable sensors capable of measuring directed energy effects (millimeter - wave, high powered microwave, etc).\n- Continued investigation of candidate technologies applicable to delivering laser induced plasma effects.\n- Continued human effects investigation of alternative physical phenomena to non-lethally suppress humans beyond small arms range.\n- Initiated target effects characterization and assessment of resulting crowd behavior and effectiveness\nassociated with promising alternative physical phenomena identified during FY 2010 investigations.\n- Initiated investigations of advanced materials and emergent technologies suitable for extended range\nnon-lethal weapon payload applications.\n- Initiated transition of foundational effects associated with advanced electro-muscular disruption\ntechnologies to higher levels of technology development and demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.937"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2011. \n- Complete applied research in the development of counter-personnel and counter-materiel directed energy non-lethal weapons, including counter-vehicle and advanced active denial activities.\n- Complete investigation of candidate technologies applicable to delivering laser induced plasma effects.\n- Initiate applied research for potential emergent technologies with applicability to the clear-a-space counter-personnel mission.\n- Initiate transition of foundational effects associated with underwater acoustics bioeffects applied research to higher levels of technology development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.973"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.973"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2012, less those noted as completed.\n- Complete transition of foundational effects associated with underwater acoustics bioeffects applied research to higher levels of technology development.\n- Complete investigation of the characteristics, optimization and control of Laser Induced Plasma (LIP) phenomena as they pertain to the counter-material counter-aircraft mission application (completed during FY11). Investigation of LIP phenomena as they pertain to counter-personnel mission applicability continues.\n- Initiate investigation of collateral non-lethal effects to personnel associated with anticipated employment of maturing counter-material non-lethal weapons technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Program Element is the development of technologies that lead to the next-generation of Non-Lethal Weapons. The program consists of a collection of projects that range from studies and analyses to the development and evaluation of feasibility demonstration models. Individual project metrics reflect the technical goals of each specific project. Typical metrics include both the effectiveness of the technology, human effects and effectiveness, and potential for compliance with policy and legislation. Overarching considerations include the advancement of related Technology Readiness Levels and Human Effects Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}