{
    "id": "bf98696b4fce0ee6b3935c7b5cc7c520a97d9b5b",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603662D8Z"
        },
        "ProgramElementTitle": {
            "val": "Networked Communications Capability"
        },
        "R1LineItemNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.032"
            },
            "CurrentYear": {
                "val": "23.185"
            },
            "BudgetYearOne": {
                "val": "25.393"
            },
            "BudgetYearOneBase": {
                "val": "25.393"
            },
            "BudgetYearTwo": {
                "val": "30.395"
            },
            "BudgetYearThree": {
                "val": "37.210"
            },
            "BudgetYearFour": {
                "val": "38.461"
            },
            "BudgetYearFive": {
                "val": "39.189"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Warfighter’s today rely more and more on communications networks to support and enable actions from targeting and shooting weapons to video-conferencing.   Though military basic infrastructure capabilities follow the mainstream commercial internet, for many reasons (security, mobility, and robustness), commercial telecommunications especially commercial wireless (tactical edge) communications are not well-matched with the requirements of today’s warfighter.  These trends will continue as the military data load becomes more diverse and heavy.  The National Research Council’s Network Science Report (2005) and Army Mobile Ad-hoc Network (MANET) JASONS Report (January 2006) state that the type of networking projected to meet military tactical requirements is not supported by network theory, network design nor analysis tools.  These tactical edge technology challenges cut across all warfare domains (space, air, ground, and sea).  In response to recognized technical problems today, as well as anticipated problems in the future, this research will focus on two key problems in networked technologies: 1) the need for expanded wireless reach where no communications infrastructure exists, and 2) the need to create ways to manage diverse wireless communications load and heterogeneous network types.  Airborne Network Gateway will expand the wireless communications and networking reach for the tactical force in the form of an airborne network gateway capability.  Network Communications Analysis will establish the scientific foundations for military tactical mobile networking with a specific emphasis on the integrated network management of tactical networks.  This research will provide the technical basis to standardize the implementation of military network communications capabilities in the areas of airborne network gateways and network communications analysis across the military services, Joint Staff, Office of the Secretary of Defense, and defense agencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.035"
                },
                "CurrentYear": {
                    "val": "23.890"
                },
                "BudgetYearOne": {
                    "val": "28.900"
                },
                "BudgetYearOneBase": {
                    "val": "28.900"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.032"
                },
                "CurrentYear": {
                    "val": "23.185"
                },
                "BudgetYearOne": {
                    "val": "25.393"
                },
                "BudgetYearOneBase": {
                    "val": "25.393"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.003"
                },
                "CurrentYear": {
                    "val": "-0.705"
                },
                "BudgetYearOne": {
                    "val": "-3.507"
                },
                "BudgetYearOneBase": {
                    "val": "-3.507"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.664"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.445"
                    },
                    "CurrentYear": {
                        "val": "-0.546"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.127"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.088"
                                },
                                "CurrentYear": {
                                    "val": "-0.159"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.507"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.507"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P663"
                    },
                    "ProjectTitle": {
                        "val": "Network Communications Analysis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.032"
                        },
                        "CurrentYear": {
                            "val": "23.185"
                        },
                        "BudgetYearOne": {
                            "val": "25.393"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.393"
                        },
                        "BudgetYearTwo": {
                            "val": "30.395"
                        },
                        "BudgetYearThree": {
                            "val": "37.210"
                        },
                        "BudgetYearFour": {
                            "val": "38.461"
                        },
                        "BudgetYearFive": {
                            "val": "39.189"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Tactical Mobile Networking - As studies have suggested, for instance, the National Research Council’s Network Science Report (2005) and Army Mobile Ad-hoc Network (MANET) JASONS Report (January 2006), the type of networking projected to meet military tactical requirements is not supported by network theory, network design, and analysis tools.  This research will define those technical parameters important to military tactical mobile networking environments, investigate the status of network design and analysis tools, and evaluate how modeling and simulation is conducted to support tactical mobile networking environments.  The role of network experimentation with respect to network modeling will be explored.  Further development and analysis will be conducted to improve the awareness of the condition of tactical mobile networking technologies.  Design tools, architectures, and technical approaches will be recommended to acquisition programs as a result of this research.  \n  \nNetwork Management Tools and Analysis - Network management in the commercial world is a highly organized, synchronized activity that has excellent tools to monitor activity and repair disrupted networks as needed.  These same tools are ill-matched for management in the wireless world, and specifically for military tactical mobile networking.  In addition, the military tactical mobile networking environment lacks the infrastructure (connectivity) and support (helpdesk) because resources (spectrum, people, and equipment) are scarce (not in harm's way).  As the complexity of networking grows and as network capabilities are introduced, improved network management is required.  For military operations, assured delivery may be needed for specific information and operations.  This requires management tools to be in place to ensure continued secure and robust operations, which is not achieved with commercial wireless technologies.  This research will assess network management tools in place for the military tactical mobile networking environment and develop technology and tools to address shortfalls with the goal to transition technology to operational systems.   \n  \nSpectrum Management Tools and Analysis -  For wireless, tactical mobile networking, the management of the use of spectrum effects network operations.  The demand for spectrum is increasing due to the expanded use of sensors, imagery, and voice.  This demand increases the pressure on the limited shared radio frequency (RF) spectrum for military tactical networking.  The current Department of Defense (DoD) frequency planning and management infrastructure will have a limited ability to cope with this demand through operational planning, Coalition Joint Spectrum Management Planning Tool (CJSMPT) Joint Capability Technology Demonstration (JCTD), and the Global Electromagnetic Spectrum Information System (GEMSIS).  Advanced spectrum management concepts such as sense and adapt, spectrum sharing, and dynamic reallocation are under investigation but not yet mature support operations.  This research will evaluate opportunities for more efficient and effective use of the frequency spectrum within DoD.  Technology advances are expected to advance the concept of cognitive radio and cognitive antenna devices to sense and adapt operations based on spectrum policy and usage, the management of multi-band and multifunction apertures, and the use of spectrum efficient waveforms for use in military environments.  This research will develop the models and tools to demonstrate capabilities for operational planning and monitoring of spectrum as these technologies are introduced.  \n  \nIntegrated Network Management Capability - Network management becomes more complex as more and different types of networking capability become available.  Integrated network management across heterogeneous systems, especially wireless systems, requires definition, design, and development.  Operationally, network management assumes all functions required to share networking resources and ensure proper operation for participants.  This research will define integrated network operations tools for all aspects of network resource management and to prioritize across operational spectrum management, security management, network management, and information management.  This research will also develop test beds especially to validate models and simulations used to develop and test network management tools, and conduct experimentation on approaches developed. \n\nNetworked Communications Analysis Open Call –  A percentage of the Networked Communications Analysis funding will be dedicated to supporting new research initiatives in this technical area.  Each fiscal year, a request for proposal is sent out with specific technical focus area and evaluation criteria for each project.  The proposals are graded by a peer review team who score each proposal based on predetermined criteria.  Proposals are then selected based on total score.\n\nTactical Networking Evolution and Expansion – Fielded and about-to-be-fielded tactical networks can be vastly expanded and evolved from their current capabilities by developing and applying new techniques (or existing techniques developed in basic research) to the existing systems, providing modern capability to the warfighter without the large expense to the DoD of developing new systems.  This research will focus on developing and applying new DoD specific techniques to create leap-ahead approaches to Anti-Jam resistance of tactical networks, larger, more fully exploited networks, and expanded capabilities for signal\/data processing and data compression in radios and across the networks.  This research will take advantage of new software defined radios about to be fielded by the Department, as well as focus on the existing legacy systems, using the successful approach we developed when fielding the Netted Iridium capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Mobile Networking"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of new applications and standards that can be used on existing tactical networks to improve data retrieval and discovery by the tactical warfighter.  In addition, research is conducted into tactical communications architectures to develop models useful for optimizing and exploiting tactical networks.  New applications and architectures will be tested in a joint federated experimental emulation test bed being developed within this program.  Project collaboratively executed by the Navy and Air Force.  Results planned for transition to programs of record as maturity of models allow.   Research efforts include Wireless Computational Networking Architecture, Heterogeneous Intelligent Filtering Extensions (HIF), Cooperative Heterogeneous Comms, Inter-domain Routing, Tactical Edge Group Wise Networking, Satellite Communications (SATCOM) and Tactical NetOps, Tactical Edge Protocol Evaluation and Experimentation (TEPEE), Channel Modeling for Software Defined Radios in Real Atmospheric Environments, and Communications for Autonomy.\n \nOverall goal: Increase understanding of the condition of tactical mobile networking technologies.  Improve specification of technical standards and policy for tactical mobile networking.  Refine fidelity modeling and simulation to support operations analysis and the articulation of operational requirements and performance parameters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.496"
                                            },
                                            "Text": {
                                                "val": "- Continued work in reliable unmanned aerial vehicle (UAV) data transport and technology transition.  Developed UAV-based cloud computing architecture to provide assured computing capacity on demand at the tactical edge.  Improved performance consistency of Transmission Control Protocol (TCP) connections over UAV wireless channels by exploiting channel diversity and developing performance models.\n- Ended work on Heterogeneous Intelligent Filtering Extensions (HIF).\n- Expanded suite of protocols to include the ability to handle multiple flows simultaneously and multicast traffic.  Worked to improve network coding protocol.\n- Analyzed common approaches to determine if certain configurations result in poor or undesirable performance.  Used the results and use the performance as feedback to modify protocols.  Released protocol results as open source software.  Updated scenarios and enhance protocols.  \n- Continued the research fundamental applied science issues in group-based structures in self-organizing networks.  Continued research and development of extensions to XMPP Overlay (XO) and group-based reliable messaging.  XO-based reliable server-less group XMPP chat were part of coalition operations experiments (French and German militaries) at Ft. Dix in October 2010.  Continued Disruption-Tolerant Networking (DTN) research into group-based extensions and approaches.  Authored NORM Protocol standard.\n- Completed a study on SATCOM and Tactical Network Operations (NetOps) control architectures and interactions, including a draft common architecture approach.  Provided a campaign plan for joint strategic and tactical concept of operations for integrated NetOps and recommendations for future work.\n- Completed experimental evaluation of current state of the art protocols.  Provided support for flight evaluation of select tactical edge protocols and technologies.  Completed research and experimentation of enhanced cutting edge protocols with autonomy enhancements and hybrid approaches.\n- Performed a suitable validation and analysis of the channel model.  Automated tool developed to compute the channel impulse response that accounts for range-dependent refractivity and terrain.  Obtained and developed numerous refractivity and terrain profiles to test the model.  \n- Deferred Communications for Autonomy work until FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.336"
                                            },
                                            "Text": {
                                                "val": "- Create wireless 'MapReduce' implementation for UAV-based airborne cloud computing to support fast decision-making at the edge of an enterprise.  Prototype wireless compute clouds to support transport and processing of large-scale sensor data based on advanced compression techniques.  Document compressive sensing based network protocols for fast distribution estimation, spectrum sensing, and medium access control.  Investigate network protocols for simultaneous compression and encryption.\n- Share Cooperative Heterogeneous Comms information with programs of record including Joint Tactical Radio System (JTRS) and Warfighter Information Network-Tactical (WIN-T).  Implement a prototype version on Lincoln Labs mobile vehicle testbed.  Prepare a software package (to enable proactively exploiting the redundancy in heterogeneous networks) for release and transition to Programs of Record.\n- Document Inter-domain Routing lessons learned and distribute to Department of Defense (DoD) operators.  Publish definitions of the impact of routing policy configurations on the interoperation and performance of connection disparate networks.  Continue advanced protocol development.  Conduct emulation test.\n- Continue to work Internet standards in self-organizing mobile ad hoc networks.  Publish and document experiments and related design and make available to the community.  Develop reliable messaging prototype to include algorithm options for distributed long-term consistency vs. adaptive real-time delivery in mobile and disrupted network environment models.  Summarize Disruption-Tolerant Networking (DTN) findings in group-based communications.  Continue research and development and identify transition opportunities for XMPP Overlay (XO) capability.\n- Submit a paper on satellite communications and tactical networks project to Military Communications (MILCOM) Conference 2012.\n- Conduct flight testing for tactical edge protocol project.\n- Develop end-to-end system simulation capability for the channel model.  Generate performance curves to characterize atmospheric impact on systems of interest to the military.  Document project results and publish a journal article.  \n- Investigate approaches to improve simultaneous communications and suppression capabilities by investigating algorithms and technologies that jointly optimize both missions.  Create architecture and emulation\/simulation description.  Demonstrate and define the communications requirements needed to support the growth and evolution of unmanned and autonomous systems (for example, unmanned aerial vehicles (UAV) and ground robotics)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.268"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.268"
                                            },
                                            "Text": {
                                                "val": "- Field test and evaluate wireless 'MapReduce' implementation for UAV-based airborne cloud computing to support fast decision-making at the edge of an enterprise.  Prototype wireless compute clouds to support transport and processing of large-scale sensor data based on advanced compression techniques.  Work with Small Business Innovation Research (SBIR) contractors on technology transition. \n- Research and develop technical systems integration for the Cooperative Heterogeneous Comms technologies information with programs of record including Joint Tactical Radio System (JTRS) and Warfighter Information Network-Tactical (WIN-T).  Implement a prototype version on Lincoln Labs mobile vehicle testbed.  Prepare a software package (to enable proactively exploiting the redundancy in heterogeneous networks) for release and transition to Programs of Record.\n- Continue document\/update Inter-domain Routing lessons learned and distribute to DoD operators.  Publish definitions of the impact of routing policy configurations on the interoperation and performance of connection disparate networks.\n- Continue to work Internet standards in self-organizing mobile ad hoc networks.  Publish and document experiments and related design and make available to the community.  Develop reliable messaging prototype to include algorithm options for distributed long-term consistency versus adaptive real-time delivery in mobile and disrupted network environment models.  Summarize DTN findings in group-based communications.  Identify transition opportunities for XO capability.\n- Prepare a study report on dynamic SATCOM access schemes and recommendations for all-digital terminal control efforts.  Submit a MILCOM 2013 paper on SATCOM and tactical networks project.\n- Conduct flight testing for tactical edge protocol project.\n- Test and evaluate an end-to-end system simulation capability for the channel model.  Generate performance curves to characterize atmospheric impact on systems of interest to the military.  Document project results and publish a journal article.  \n- Continue define, develop and demonstrate the communications requirements needed to support the growth and evolution of unmanned and autonomous systems (ex. UAV, ground robotics)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Management Tools and Analysis"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of joint standards and tools for policy-based and measurement-based tactical network management.  New standards and applications will be tested in a joint federated experimental emulation test bed being developed within this program.  This project is jointly executed by the Navy, Air Force and Army, with technology transition agreements being pursued with programs of record.  Research efforts include Network Agent Technology for Management (NATM), Joint Integrated Network Management System Exchange (JINX), Small Form Factor Cross Domain Solution (SFF CDS), Cyber Security Metrics Trust Model, Explicit Congestion Network (ECN) Message Based Admission Control (MBAC), Tactical Resource Management and Control, Network End-to-End Monitoring (NEEMO), High Performance Information Assurance for Wireless Applications, Optimal Scheduling in Time Division Multiple Access (TDMA) Networks, and Dynamic Policy Management (DPM).\n \nOverall goal:  Increased understanding of the complexity of the tactical network management.  Determination of the support required for tactical network operations.  Evaluation of technology to support transition and fielding to operational capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.944"
                                            },
                                            "Text": {
                                                "val": "- Incorporated additional NetOps\/Situational Awareness components by specifically integrating security management and information assurance (IA); developed data mining techniques to offer automated network troubleshooting recommendations; continued work on topology detection; continued research into flow-based analysis; worked on synchronization techniques to allow for timing differences at remote nodes; integrated IA techniques to detect unauthorized activity and researched integration of multi-layer analysis.  Worked with appropriate Joint demonstration projects including a potential Joitn Capability Technology Demonstration (JCTD) focused on NetOps.\n- Expanded Adaptable Information Distribution (AID) work with Disruption Tolerant Distribution and enhanced Multi-Topology Routing Distribution for NATM.\n- Continued field testing of JINX tool and transition tool to joint environment.  Created software that produces live network common operating picture (COP) from Visio diagrams.  Began development on visualization of JINX on multi-touch table device.  Created Android operating system (OS) implementation of Naval Research Lab (NRL) server-less chat using 802.11 for JINX. Supported Joint Warfighting Integrated NetOps (JWIN) JCTD.\n- Continued performing emulating research management test in Lincoln Labs emulation testbed.  Created semantic network descriptions & policy language design.  Produced final report on test results.\n- Continued installation of NEEMO on Network Emulator to further research scalability issues and integrate network management into Extendable Mobile Ad-hoc Network Emulator (eMANE).  Developed data mining techniques to offer automated network troubleshooting recommendations.  Continued research\/implementation of network topology discovery.  Continued research into flow-based analysis.  Implemented open-sourced GUI (Graphical User Interface) to support real-time graphing capabilities.  Expanded NEEMO capability for interaction with external network management products.  Conducted NEEMO test and evaluation with the U.S. Marine Corps.\n- Extended the developed architecture and Crypto Host Interface Control Document (ICD) to: 1) support separate Ethernet data ports for multiple waveforms \/ applications at different classification levels, needing Type 1 cryptography (using Programmable Embeddable INFOSEC Product (PEIP) technology); 2) allocate channel usage within the Crypto for multi-level security (MLS) and the different application needs; and 3) support secure remote command and control (C2) to dynamically establish crypto channels, load black keys, mission task orders, control the red\/black processor cards, etc.\n- Created prioritization and multicast for the wideband networking waveform (WNW) target.  Wrote reports for throughput comparison and algorithm investigation.   Completed, coded, and tested the Dual-LP scheme.  Created a report on the Dual-LP Scheme and packing problems.\n- Began initial network manager integration of dynamic policy management (DPM) in tactical communications lab.  Identified candidate policy-based network management partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.810"
                                            },
                                            "Text": {
                                                "val": "- Continue to incorporate additional NetOps\/Situational Awareness components by specifically integrating security management and IA; implement multi-layer analysis capabilities; integrate into NetOps architectures and continue transition effort to programs of record.  Continue research into flow-based analysis; research methods for automated intrusion detection and resolution; and continue work with appropriate Joint demonstration projects.\n- Continue work on Disruption Tolerant Distribution and enhanced Multi-Topology Routing Distribution for NATM.  Conduct additional demonstrations to show integration and information sharing in the joint network management environment.  Conduct experimentation in network monitoring anomaly detection.  Deliver the software. \n- Mature interactive design and media (ID&M) software for JINX by incorporating server-less tactical chat interoperable with existing systems, system center operations manager (SCOM) enhanced with JINX-based Management Packs, and network visualization tools.  Create Network scan software to capture existing network organization.  Integrate Visio-based visualization tool to enable user-defined displays.\n- Based on previous demonstrations of the tactical resource management and control project, provide a software package that can be used to illustrate the benefits of longer time-scale more-granular network management function that coordinates and brokers resources across a number of disparate network management systems that are organic to tactical communications systems.\n- Focus on transition of NEEMO.  Continue to expand capability to interact with external network management products.  Support the Joint Warfighting Integrated NetOps (JWIN) JCTD.  Integrated IA techniques to detect unauthorized activity.  Investigate tactical connectivity issues involved in network management.\n- Apply crypto architecture to the Software Reprogrammable Payload (SRP).\n- Develop plans for a Joint Demonstration of the optimal scheduling in time division multiple access (TDMA) Networks capability.  Submit MILCOM papers on the topic.\n- Optimize DPM algorithm.  Conduct small scale lab demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.748"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.748"
                                            },
                                            "Text": {
                                                "val": "- Conduct small scale lab demonstration and create a distributed joint NetOps development experimentation platform in at least three sites.\n- Continue to improve\/incorporate additional NetOps\/Situational Awareness components by specifically integrating security management and IA.  Implement multi-layer analysis capabilities.  Integrate into NetOps architectures and continue transition effort to programs of record.  Continue research into flow-based analysis; research methods for automated intrusion detection and resolution and continue work with appropriate Joint demonstration projects.\n- Continue work on Disruption Tolerant Distribution and enhanced Multi-Topology Routing Distribution for NATM. Conduct additional demonstrations and deliver software. \n- Demonstrate, test and evaluate the ID&M software for JINX by incorporating server-less tactical chat interoperable with existing systems, SCOM enhanced with JINX-based Management Packs, and network visualization tools.  Create Network scan software to capture existing network organization. \n- Deliver a software package that can be used to illustrate the benefits of longer time-scale, more-granular network management function that coordinates and brokers resources across a number of disparate network management systems that are organic to tactical communications systems based on the results of demonstrations of the tactical resource management and control project, \n- Focus on the field testing\/deployment of NEEMO and other products.  Continue to expand capability to interact with external network management products.  Conduct\/support the Joint Warfighting Integrated NetOps (JWIN) Joint Concept Technology Demonstration (JCTD). \n- Test and evaluate cryptographic architecture of the Software Reprogrammable Payload (SRP).\n- Conduct a Joint Demonstration of the optimal scheduling in TDMA Networks capability.  Submit MILCOM technical papers on the topic."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Management Tools and Analysis"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of measurement-based spectrum management tools.  Applications will be developed and tested in a laboratory environment.  Project is executed by the Army and results are available to the Navy and Air Force through the Joint NETOPS Integrated Collaborative Working Group.  Transition planned for the GEMSIS program in 2010-2011 as maturity allows, and to other existing tactical network programs as appropriate.   Research efforts include Dynamic Spectrum Allocation (DSA) Spectrum Analysis Software, Cognitive Networking Radio Platform (CNRP) and Cognitive Radio Algorithmic Fusion Technologies for Spectrum Management (CRAFTSMAN), SIGINT-assisted Spectrum Management, Cognitive Radio Architecture Research, Networking for Spectrum Aware Cognitive Radios, Directional Ad-hoc Networking Technology (DANTE-2), DSA Enhancements, Spectrum Analysis and Experimentation in Dynamic Operational Environments (SAEDOE), and Integrating Comm and Electronic Attack.\n \nOverall goal:  Develop the technical basis to support changes regarding the operational use of spectrum both within the military and among spectrum regulatory bodies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.862"
                                            },
                                            "Text": {
                                                "val": "- Integrated next generation Spectrum Management tool set in existing operational environments (i.e., Spectrum management centers). Developed algorithms that improve node cooperation via the use of relay nodes.  Studied the impact of heterogeneity in the available spectrum at different locations of the network.  \n- Created ad-hoc negotiation schema, subnet fragmentation algorithms, subnet reconstitution algorithms, and multi-hop policy requirements for DSA.\n- Began creating integrated radio network test bed that enables the development, evaluation, and demonstration of technologies that enable the operation of a Cognitive Radio Network.   This will be accomplished by integrating CRNP with the VAN testbed.\n- Designed low-cost sensor for SIGINT assisted spectrum management.  Presented year-end report.\n- Conducted electromagnetic environment survey, modeling, manipulation, simulation and emulation.  Extended current cognitive radio testbed for more complex testing configurations and parameters.  Continued to study capabilities of Cognitive Radio (CR) for electronic warfare (EW) as well as a counter to implementation of CR. NRL and CERDEC jointly produced DSA testing framework.  Created DSA radio and network testbed.\n- Continued research on stable throughput of cognitive radio networks and developing capacity scaling laws for cognitive radio networks. \n- Performed DANTE subsystems tests.  Designed, simulated, fabricated and tested 1.7 to 2.1 GHz DANTE subsystems.  Created conceptual design of multiple radio per node architecture.\n- Supported joint Service enhancements to the DSA software.  Studied RF man-made noise effects on DSA.  Completed Phase 2 of the DSA security design.\n- Demonstrated a wireless, airborne and ground based spectrum sensing network.  Created software visualization tools to convey real-time sensed spectrum space. Submitted data sets to the DoD wireless Networking Library (WNL).  Began investigating spectrum information dissemination.  \n- Deferred Integrating Comm. & Electronic Attack work until FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.857"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate the integrated next generation Spectrum Management tool set in existing operational environments (i.e., Spectrum management centers), which will extend policy-based reasoning to encompass Comms-EW coexistence requirement; expand policy capabilities to incorporate cooperative collaboration with EW systems and adaptive algorithms for real time cognitive control with special optimization technique to minimize interference for DSA\/EW compatibility. \n- Create comms\/EW interaction schema, active jammer algorithms, reactive jammer algorithms, and multi-hop policy solutions for DSA.\n- Perform an interoperability demonstration of CRNP in the VAN testbed.\n- Define an interface for connecting and fusing SIGINT data as inputs to spectrum management systems.\n- Continue cognitive radio testbed research and produce reports and documentation on findings.  Develop set of spectral scenarios to evaluate DSA radios.  Expand and increase fidelity of modeled DSA environment.  Explore EA (Electronic Attack) effectiveness against cognitive jammers.\n- Research Multi-hop cognitive radio networks by developing methodologies that maximize resource allocation for a set of end-to-end communication sessions while considering node heterogeneity with respect to available spectrum bands and bandwidth exchange as a means of cooperation. \n- Integrate the 15 GHz DANTE subsystems into a monolithic system.  Perform DANTE 15 GHz integrated hardware extension to other frequencies (antenna) and conduct field demonstrations.\n- Refine DSA security design to make it more comprehensive.\n- Refine spectrum software visualization tools.  Submit additional data sets into the DoD WNL.\n- Research reactive electronic attack (EA) radios that can search for potential threats and study the benefits of EA radios cooperation with comm. radios.  Investigate cooperation techniques and research key cooperative technologies. Demonstrate the ability to share functions across the two missions and illustrate the benefit to each mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.808"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.808"
                                            },
                                            "Text": {
                                                "val": "- Develop transition\/insertion plans for the integrated next generation Spectrum Management tool set in existing operational environments (i.e., Spectrum management centers), which will extend policy-based reasoning to encompass Comms-EW coexistence requirement; and expand policy capabilities to incorporate cooperative collaboration with EW systems and adaptive algorithms for real time cognitive control with special optimization technique to minimize interference for DSA\/EW compatibility. \n- Test and evaluate the Comms\/EW interaction schema, active jammer algorithms, reactive jammer algorithms, and multi-hop policy solutions for DSA.\n- Develop an interface for connecting and fusing SIGINT data as inputs to spectrum management systems.\n- Continue cognitive radio testbed research and produce reports and documentation on findings.  Create cooperative sensing strategies for heterogeneous environments.\n- Model\/prototype the Multi-hop cognitive radio networks by developing methodologies that maximize resource allocation for a set of end-to-end communication sessions while considering node heterogeneity with respect to available spectrum bands and bandwidth exchange as a means of cooperation.\n- Demonstrate multiple-radio-per-node DANTE network. \n- Continue to develop\/refine DSA security design to make it more comprehensive.\n- Continue to develop\/refine spectrum software visualization tools.  Submit data sets into the DoD Wireless Networking Library.\n- Build on the functional decomposition and sharing strategy developed in the previous year that recommends approaches for simultaneously operating communications and electronic attack transmitters.  Demonstrate the ability to share functions across the two missions and illustrate the benefit to each mission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Network Management Capability"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of joint integrated network management tools, and three federated experimental test beds for the development and evaluation of integrated tactical network management and spectrum management.  The project is executed jointly by the Navy, Army and Air Force.  The plan is to also establish a Joint Network Operations (NETOPS) Integrated Collaborative Working Group for the establishments of standards and joint development in support of all projects in this program.  Membership includes the research community from the Navy, Marine Corps, Army and Air Force as well as developers from acquisition programs such as Warfighter Information Network-Tactical (WIN-T) and Joint Tactical Radio System (JTRS).  Future plans call for further joint infrastructure test bed development to include DoD PlanetLab as well as joint networking tools in support of NETOPS.  The results of this research will transition to future increments of JTRS and WIN-T, and if successful, to the field through a joint integrated tactical NETOPS program. Research efforts include Joint Network Management Interoperability, Wireless Networking Library (WNL), Network Emulation and Experimentation, Tactical Edge Wireless Experimentation, Edge Network Visualization and Emulation (ENVE), and Tactical Edge Network Integration and Operational Environment Testbed.  \n \nOverall goal:  Common integrating framework to support interoperability among various aspect of developmental network operations and management to include: spectrum management, network management, security management, and information management.  Reduce the cost to develop, procure, and support networks through the integration across networks and functions within networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.900"
                                            },
                                            "Text": {
                                                "val": "- Performed a joint Service lab inter-connection specifically using a “chat” capability to validate experimentation.  Initiated selection and evaluation of next generation integrated network management software tools. Integrated next generation integrated network management software tools in existing operational environments (i.e., TNOCs, JTF-GNO).  \n- Improved ease of use (through GUI enhancements, etc.) and accessibility of VAN testbed.  Developed the capability for the VAN testbed to act as a cloud service on the DREN (Defense Research and Engineering Network) to allow authorized users to test software via remote connections.  Performed scalability and application testing.  \n- Continued to administer WNL (including updating software and security patches) and increase usage.\n- Completed emulation infrastructure expansion.\n- Implemented models of additional DoD command and control tactical edge networking waveforms including legacy and anticipated waveform technologies in Extendable Mobile Ad-hoc Network Emulator (eMANE).  Incorporated initial simulation-in-the-loop capabilities provided by other mobile network modeling tools and RF propagation prediction models into Extendable Mobile Ad-hoc Network Emulator (eMANE) framework.  Validated EMANE emulated network performance against known data sets collected from field experimentation.  Began advanced tactical data link modeling.  Experimented to validate EMANE emulated network performance against known data sets collected from field experimentation.  Conducted third DoD Mobile Network Modeling Workshop.  Made refinements to traffic generators, visualization, and analysis tools.  Initiated development work to allow emulation systems to model different security functions.  Began Phase 2 of SRW (Soldier Radio Waveform) model development.\n- Completed paper of findings\/results associated with protocol development for MlabCUNE.  Completed final technical report.  Transitioned findings to ENVE project.  Developed hybrid AF emulation environment that integrates with EMANE.  Created bi-dimensional statistical data-driven propagation model.  Used propagation models to emulate specific flight test and study airborne network protocols and applications.  \n- Conducted experimental evaluation of current state of the art tactical edge protocols."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.998"
                                            },
                                            "Text": {
                                                "val": "- Develop a user-friendly virtual network configuration and management toolset.  Create user test network instrumentation and technical support capability.  Create a testing and debugging software toolkit for distributed software applications.  Add “faster-than-real-time” simulations in the VAN testbed.   \n- Continue to recruit and manage the data sets in the WNL.\n- Perform upgrades to improve ability to better manage simultaneous experiments, better collect consistent data collection formats, and enhance performance visualization tools in the MIT-LL testbed.  Conduct research on large-scale network emulation experiments and share network visualization and instrumentation software through open source channels.   \n- Develop tactical data link models, radio module interfaces, and automated experiment test-control ‘harness’ for Extendable Mobile Ad-hoc Network Emulator (eMANE).  Complete Phase 2 of SRW model development.  Conduct 4th DoD Mobile Network Modeling Workshop.  \n- Conduct flight testing of selected tactical edge protocols and technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.909"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.909"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of optimal virtual network configuration and management toolset.  Create user test network instrumentation and technical support capability.  \n- Continue to update, recruit and manage the data sets in the WNL.\n- Perform upgrades to improve ability to better manage simultaneous experiments, better collect consistent data collection formats, and enhance performance visualization tools in the MIT-LL testbed.  Conduct research on large-scale network emulation experiments and share network visualization and instrumentation software through open source channels.   \n- Continue development of advanced tactical data link models, radio module interfaces, and automated experiment test-control ‘harness’ for EMANE.\n- Develop transition\/insertion planning for the selected tactical edge protocols and technologies.\n- Develop and conduct a JCTD or other major demonstration to showcase capabilities developed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Communications Analysis Open Call"
                                    },
                                    "Description": {
                                        "val": "A percentage of the Networked Communications Analysis funding will be dedicated to supporting new research initiatives in this technical area.  Each fiscal year, a RFP is sent out with specific technical focus area and evaluation criteria for each project.  The proposals are graded by a peer review team who score each proposal in each of predetermined criteria.  Proposals are then selected based on total score. \n \nOverall goal:  To add innovative research projects in the area of networked communications to the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.783"
                                            },
                                            "Text": {
                                                "val": "- Created and distributed FY 2011 RFP.  Conducted a Peer Review Conference where proposal candidates presented their work to the Peer Review teams."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Networking Evolution and Expansion"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of new applications and approaches that can be used on existing tactical networks to improve the physical and networking layers for the tactical warfighter.  It will explore new ways to build architectures, antennas, and signal and data processing or exploit waveforms to improve Anti-Jam resistance, network throughput and scale, or network packet routing, and improve these metrics at low cost and without sacrificing interoperability.  Enhanced Performance for HNW including Net Entry at Extended Range, AFC2IC Airborne Network Management Analysis, and Advanced Waveform Support projects transferred from P662 starting in FY 2011.  Beyond-Link16 project began in FY 2011.\n\nOverall goal:  Next generation tactical networking in the fielded tactical systems, with vastly increased capabilities, at the lowest cost possible to the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.047"
                                            },
                                            "Text": {
                                                "val": "- Enhanced Performance for Highband Networking Waveform (HNW) including Net Entry at Extended Range, AFC2IC Airborne Network Management Analysis, and Advanced Waveform Support projects transferred from P662 starting in FY 2011.  Began Beyond-Link16 project.\n- Began development of early prototypes for Anti-Jam improvements field testing.  Identified transition opportunities.  Goal was to demonstrate capabilities in FY 2012.  Began planning for additional improvements to increase throughput, scale and IP-networking capability.  Identified other candidate improvements.  Evaluated operational impact of potential improvements.  Transferred Enhanced Performance for HNW including Net Entry at Extended Range, AFC2IC Airborne Network Management Analysis, and Advanced Waveform Support projects from P662.  \n- Demonstrated the range advantage of a single tone waveform.  Integrated active beam and phase-locked loop steering based on signal levels.  Conducted preliminary waveform performance evaluation. \n- Completed Phase II of the Joint Aerial Layer Network (JALN) Management Study.  Created formal joint concept of JALN control.  Entered and completed Joint Concept Development and Experimentation (JCD&E) Process.\n- Integrated individual advanced waveform approaches into a single waveform design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "- Develop more efficient Multicast routing schemes for directional antenna mobile routing networks.  Refine the cross-layer radio-to-router interface and examine advanced routing load balancing over mixed media networks.  Compare long range theoretical link performance with measured results using Office of Naval Research (ONR) funded apertures with HNW to further extend the range\/throughput performance.  Complete Geodesic Cone field test report.\n- Support JALN Network Management Assessment of Alternatives.  Support JALN DOTMLPF Change Requests.  Assist with Validation of JALN Network Management Requirements.  Create AF Joint Concept and begin formal coordination.\n- Perform feasibility assessment by implementing advanced waveform on hardware appropriate for air applications.  Create the definition of a future airborne C2 capability that can co-exist with and augment current Link-16 capabilites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.660"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.660"
                                            },
                                            "Text": {
                                                "val": "- Develop computationally efficient RF propagation models and continue the development of more efficient routing schemes for next generation directional antenna mobile routing networks.  Prototyping the cross-layer radio-to-router interface and examine advanced routing load balancing over mixed media networks. Test and evaluation (long range theoretical) link performance with measured results using ONR funded apertures with HNW to further extend the range\/throughput performance.  Complete Geodesic Cone field test report.\n- Support JALN Network Management Assessment of Alternatives.  Support JALN DOTMLPF Change Requests.  Assist with Validation of JALN Network Management Requirements.  Obtain approval of AF Joint Concept.\n- Perform feasibility assessment by implementing advanced waveform on hardware appropriate for air applications.  Create the definition of a future airborne C2 capability that can co-exist with and augment current Link-16 capabilities. \n- Develop and conduct a JCTD or other major demonstration to showcase capabilities developed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Netted Iridium (NI) capability will be transitioned directly to production and sustainment to the DTCS-Army program by the Army for use in the U.S. Central Command Area of Responsibility.  Other program capabilities will be transitioned to acquisition programs as successful and appropriate."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported: Net-Centric Warfare\/Joint Interoperable Communication.  Meet current needs of tactical warfighter.\n\nExisting Baseline: Prototype relays and gateways; initial federated, laboratory test beds; and prototype joint network management tools.\n\nPlanned Performance Improvement \/ Requirement Goal:  Link expansion in prototype relays and gateways; and continued integration in federated test beds; demonstration of prototypes and software tools.\n\nActual Performance Improvement:  Prototype and transition able relays and gateways; usage of federated test beds; and demonstration of prototypes and software tools.\n\nPlanned Performance Metric \/ Methods of Measurement:  Utilization of federated test beds; and demonstration of prototypes and software tools.\n\nActual Performance Metric \/ Methods of Measurement:  Progress on test bed development; prototype software demonstrated; and prototype architectures developed."
                        }
                    }
                }
            ]
        }
    }
}