{
    "id": "c7c9f32c88551fb183cef008cb7819216a16c43d",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0101127F"
        },
        "ProgramElementTitle": {
            "val": "B-2 SQUADRONS"
        },
        "R1LineItemNumber": {
            "val": "120"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "244.732"
            },
            "CurrentYear": {
                "val": "280.319"
            },
            "BudgetYearOne": {
                "val": "35.970"
            },
            "BudgetYearOneBase": {
                "val": "35.970"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "116.144"
            },
            "BudgetYearThree": {
                "val": "117.505"
            },
            "BudgetYearFour": {
                "val": "48.576"
            },
            "BudgetYearFive": {
                "val": "33.219"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY13, B-2 Defensive Management System (DMS) funding in PE 0101127F project 676023 was transferred to PE 0605931F, project 653844.\n\nThe Cost to Complete and Total Cost for MDAP projects in this program element are documented in the R3. The Cost to Complete and Total Cost on the R2 are entered as \"Continuing\" and not reflective of the total cost for MDAP projects since the R2 does not account for prior years funding."
        },
        "ProgramElementMissionDescription": {
            "val": "The B-2A Spirit is the world's most advanced long-range strike asset.  The unique combination of range, precision, payload, and ability to operate in anti-access environments allow the B-2 to identify, locate, target, and destroy the highest value enemy targets.  The B-2 can, with necessary upgrades, accomplish its mission regardless of location, return to base safely, and permit freedom of movement for follow-on forces, including other long range strike platforms.\n\nThe array of planned RDT&E projects are necessary to preserve this strategic advantage as well as increase flexibility, lethality, and survivability of this national asset tasked across a broad spectrum, from tactical to national strategic objectives.  System upgrades include, but are not limited to, Defensive Management System Modernization (DMS-M), Extremely High Frequency (EHF) Satellite Communications (SATCOM) and Computers Increments 1 and 2, alternative communications solutions such as Very Low Frequency antenna and receiver, Radar Modernization Program (RMP), Massive Ordnance Penetrator (MOP), Adaptable Communications Suite (ACS), Link-16 Center Instrument Display (CID)\/In-Flight Replanner (IFR), Ultra High Frequency (UHF) SATCOM, Mode 5\/S Identification Friend or Foe (IFF)-Automatic Dependence Surveillance-Broadcast, armament integration, structures, engine improvements, low observable modifications, trainers, support equipment, Electro-magnetic pulse (EMP) Hardening Testing, and advanced low detection data links upgrades.     \n\nSpecific efforts will be managed under one of four projects:\n676021 Baseline Support\n676022 EHF SATCOM and Computer\n676023 Defensive Management System Modernization \n675345 B-2 Modernization\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "260.466"
                },
                "CurrentYear": {
                    "val": "340.819"
                },
                "BudgetYearOne": {
                    "val": "432.155"
                },
                "BudgetYearOneBase": {
                    "val": "432.155"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "244.732"
                },
                "CurrentYear": {
                    "val": "280.319"
                },
                "BudgetYearOne": {
                    "val": "35.970"
                },
                "BudgetYearOneBase": {
                    "val": "35.970"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.734"
                },
                "CurrentYear": {
                    "val": "-60.500"
                },
                "BudgetYearOne": {
                    "val": "-396.185"
                },
                "BudgetYearOneBase": {
                    "val": "-396.185"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-82.500"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-22.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "22.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.703"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.538"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "14.507"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-396.185"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-396.185"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2011 adjustments of $14.507M is comprised of: +$16.0M Congressional Add for Mixed loads and other capabilities; -$1.410M for economic assumptions and -$.084M for Congressional General reductions\n\nFY2012 Directed Reduction of EHF SATCOM and Computer Increment 2 due to contract delays (-$82.5M).  Congressional Add for Mixed loads capability (+$22.0M).\n\nFY2013 changes\n   Increased funding for Defensive Management System (+$109.822M)\n   Removed funding for EHF SATCOM and Computer Increment 2 (-$238.086M);\n   Transferred Defensive Management System funds out of PE 0101127F, project 676023 into PE 0605931F project 653844 ($281.056M)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675345"
                    },
                    "ProjectTitle": {
                        "val": "B-2 Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "244.732"
                        },
                        "CurrentYear": {
                            "val": "27.135"
                        },
                        "BudgetYearOne": {
                            "val": "21.759"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.759"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "101.808"
                        },
                        "BudgetYearThree": {
                            "val": "101.493"
                        },
                        "BudgetYearFour": {
                            "val": "34.544"
                        },
                        "BudgetYearFive": {
                            "val": "19.001"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY12:\nFunding for Baseline Support transferred from project 675345 to project 676021.\nFunding for Extremely High Frequency (EHF) SATCOM and Computers transferred from project 675345 to project 676022.\nFunding for DMS-M upgrade transferred from project 675345 to project 676023.\n\nIn FY13\nFunding for DMS-M transferred from PE 0101127F, project 676023 to PE 0605931F, project 653844."
                        },
                        "ProjectMissionDescription": {
                            "val": "Totals include funding for Major Defense Acquisition Program Number (MDAP PNO) 224, B-2 EHF Increment 1; and MDAP PNO 376, B-2 Radar Modernization Program (RMP).\n\nThe B-2A Spirit is the world's most advanced long-range strike asset. The unique combination of range, precision, payload, and ability to operate in anti-access environments allow the B-2 to identify, locate, target, and destroy the highest value enemy targets. The B-2 can, with necessary upgrades, accomplish its mission regardless of location, return to base safely, and permit freedom of movement for follow-on forces, including other long range strike platforms. An array of planned RDT&E projects are necessary to preserve a strategic advantage as well as increase the flexibility, lethality, and survivability of this national asset tasked across a broad spectrum, from tactical to strategic national objectives. \n\nThe B-2 has a projected lifecycle through 2058. To ensure the fleet can accomplish its nuclear and conventional mission in highly defended and anti-access environments, periodic modernization efforts must be undertaken to upgrade combat capability as well as improve the viability, supportability, and survivability of the weapon system. Recent and ongoing investments in necessary avionics, structures, communications, and weapons upgrades keep the B-2 viable in the immediate future.  Current system upgrades include Defensive Management System Modernization (DMS-M)(PE 65931F\/653844 starting in FY13), Extremely High Frequency (EHF) Satellite Communications (SATCOM) and Computers Increments 1 and 2, alternative communication solutions such as Common Very Low Frequency (VLF) Receiver (CVR), Radar Modernization Program (RMP), Massive Ordnance Penetrator (MOP), Stores Management Operational Flight Plan (SMOFP) Rehost, Adaptable Communications Suite (ACS), Link-16 Center Instrument Display (CID)\/In-Flight Replanner (IFR), Ultra High Frequency (UHF) SATCOM, armament integration, structures upgrades, engine improvements, low observable signature and supportability modifications, training systems improvements, support equipment modifications, Electro-magnetic pulse (EMP) hardening testing, mission planning improvements, flight test aircraft sustainment and upgrades, and advanced low detection data link upgrades. \n\n\nThe Flexible Strike modernization efforts will establish an improved foundation for the Moving Target Kill and Non-Traditional Surveillance and Reconnaissance combat capabilities necessary to ensure air superiority in 21st century combat environments.  Efforts include, but are not limited to, Stores Management hardware and software upgrades necessary to accommodate integration of updated conventional and nuclear System II weapons into the B-2 fleet and provide ability to carry different weapons carriage equipment in the separate weapons bays, providing weapons flexibility to combat planners.  Other Flexible Strike efforts include the development of a Universal Armament Interface (UAI), integrating multi-platform advanced data links with satellite communication links, integration of the Global Positioning System (GPS) M-Code hardware and software necessary for modernization of Air Traffic Management communications, navigation, and surveillance systems, and enhancement of the Mode 5\/S Identification Friend or Foe (IFF) system and add Automatic Dependence Surveillance-Broadcast (ADS-B)capability mandated by US and European military and civil aviation agencies to improve situational awareness of controlled and contested airspaces.  Finally, improvements are required on the platform data\/voice\/video recorders to comply with Air Force mandates to provide specific flight and platform data, frequency of update, data precision, and recording duration that does not exist in the aircraft recorder today. \n\nAfter Flexible Strike modifications are implemented, the B-2 fleet will be poised to deliver Moving Target Kill combat capability by leveraging a high precision weapon such as the Small Diameter Bomb II as the mobile target kill munition, forming a foundation to exploit the modularity and improved precision algorithms of Universal Armament Interface (UAI), as well as a display infrastructure that can support the integration of this weapon. The inherent low observable characteristics of the B-2 platform will enable accomplishment of a Non-Traditional Surveillance and Reconnaissance (NTSR) mission.  Necessary modifications include, but are not limited to, enhancement of current radar modes, high resolution improvements to the synthetic aperture radar, and improved information fusion required to gather, analyze, and communicate enemy movements and combat capabilities to friendly follow-on forces and the National Command Authority and other operation centers via the Global Information Grid. \n\nThe B-2 is currently undergoing modernization of avionics\/communications systems, structure components, engines, armament systems, low observable components, core training system components, core flight test systems as well as analysis of Electro-Magnetic Pulse (EMP) protection capabilities, and studying future Integrated Strike Warfare (ISW) and Advanced Tactical Data Link (ATDL) integration requirements.\n\nDMS-M will maintain B-2 direct attack capability while addressing emerging 21st century threats and countering continuing obsolescence issues (transferring to PE 65931F\/653844 in FY13). EHF SATCOM and Computers Increment 1 will provide upgraded flight management computer processors, increased data storage, re-hosted flight management operational flight program, and a high bandwidth data bus in order to prevent degradation of existing capabilities resulting from EHF SATCOM installation. EHF Increment 2 will provide full spectrum secure, survivable, two-way communications and net ready upgrades for command and control of nuclear and conventional National Command Authority directives. The Common Very Low Frequency (VLF) Receiver (CVR) effort develops and integrates a receive only VLF receiver and antenna subsystem to provide secure, survivable strategic communication capability for the B-2. The receiver will be adaptable for use by other platforms. RMP changes the operating frequency of the radar system to enable the B-2 to operate as a primary user worldwide. ACS provides a non-integrated communications system that allows the B-2 fleet to receive a complete integrated mission, time sensitive targeting information, intelligence updates, and positive command and control procedures. Link-16 CID\/IFR allows the B-2 access to theater tactical data links, improving on-board situational awareness while greatly enhancing the ability of theater commanders to coordinate the B-2 with other assets. The Center Instrument Display Digital Video Recorder provides the ability to record video signals from the display to the existing recorders in the cockpit. This capability allows mission playback, operational assessments and de-briefs, and provides aircrew training. \n\nArmament upgrades include, but are not limited to, integration of new and\/or advanced weapons on the B-2 to destroy a wider array of target sets, to include moving target sets and hardened, deeply buried targets, as well as destroy more targets per sortie. Integration of the 30K lb class Massive Ordnance Penetrator (MOP) provides the nation with the ability to hold additional hardened, deeply buried targets at risk that are currently unachievable with 5K lb class penetrator munitions. The B-2 is the only anti-access penetrating platform capable of carrying the MOP and meets Urgent Operational Need requirements. The MOP integration project designs, develops, integrates, and tests hardware, software, and support equipment required for carriage, jettison, and release of two MOP weapons from the B-2. The initial MOP Quick Reaction Capability effort will expand to include a fully developed Launch Acceptability Region, a single Smart Bomb Rack Controller per bay, dual fuse control, and mixed carriage capability with Smart Bomb Rack Assemblies (SBRA). Further \nexpansion includes the addition of a GPS signal into the weapons bays to allow Monitor and Control Equipment (MACE) weapons, SBRA weapons, and RLA weapons to acquire and track GPS satellites prior to weapons release, maintaining unjammed delivery accuracy in a jamming environment. The Stores Management Operational Flight Plan (SMOFP) Rehost and Mixed Carriage program will rehost stores management software onto a new integrated processor to enable simultaneous configuration of multiple weapons carriage capabilities, providing B-2 with maximum strategic nuclear and conventional strike flexibility.\n\nPlanned upgrades also include integration of upgrades to currently fielded or inventory weapons and weapons development, such as, but not limited to, B61 Life Extension Program, GBU-28 E\/B Selective Availability Anti-Spoofing Module(SAASM) with impact angle control, GBU-28 D\/B SAASM with impact angle control, Hard Target Void Sensing Fuse, extended range Joint Air-to-Surface Standoff Missile, and JDAM-5000.  The B-2 Weapons System Tester and its associated Test Program Sets (TPS), to include but not limited to, the Common Organizational Level Tester (COLT), MUSTANG, and B-2 Armament Tester, will be continually upgraded for increased reliability and performance to support current and new B-2 weapon suspension and release systems. \n\nStructures improvements include, but are not limited to, windshield redesign which provides improved components and windshield manufacturing processes to remedy windshield cracking and electrical conductivity \nlimitations; Proximity Sensor Logic Unit upgrade counters obsolescence issues with electronic components, improving safety of maintainers working around various aircraft bay doors, improving reliability of onboard landing gear indicators, and mitigating safety risks to the aircraft and aircrew.\n \nEngine improvements include, but are not limited to, the F118 engine service life extension program and the extended mission oil tank upgrade; Stage 1 and 3 engine fan blade improvements will reduce engine \nchanges, increasing aircraft availability. Engine upgrades are necessary to maintain commonality with the F110 engine core. \n\nLow Observable Signature and Supportability Modification (LOSSM) projects decrease low observable (LO) maintenance, increase aircraft availability, and maintain and improve the combat-ready LO signature for the B-2 fleet. LOSSM projects improve materials, structures, and diagnostic tools necessary to evaluate LO materials and systems in the B-2 fleet. LOSSM projects include, but are not limited to, improvements to door edge treatments, tile protection system, magnetic radar absorbing material picture framing and other LO materials development, hot structures, tailpipe material improvements, nozzle bay doors, windshield low observable treatments, advanced topcoat system, radar frequency diagnostics and other LO diagnostic tools development such as, but not limited to, improvements of the signature diagnostic system database, tier one material inspection system, and other low observable special test equipment and information systems. \n\nThe B-2 Training System keeps pace with aircraft system updates while countering obsolescence issues. Improvements include, but are not limited to, threat environment upgrades, radar display emulation, aero fidelity of key pilot procedures, improvements to courseware, upgrades of display systems, subsystems, and simulation and computational processors. Other upgrades include, but are not limited to, conventional and nuclear guided weapons delivery training, expanded crypto keyfill capability in simulators, upgraded capability to train weapons as powered up upon completion of initial conditions, as well as upgrades to the electronic combat environment threat database tools to include threat laydown, threat parametrics, and Integrated Air Defense System. Upgrades also include the Defensive Management System simulation (DMS), DMS \nalternative\/emergency procedures courseware, and Mission Generation System. Enhancements are provided to the B-2 family of trainers to include the Weapon System Trainers, Mission Trainer, Cockpit \nProcedures Trainers, Computerized Maintenance Training System, Weapon System Training Aids, Weapons Load Trainer, Crew Escape System Maintenance Trainer, Flight Control System Trainer, instructor-operator \nstation, and Training System Support Center. \n\nEMP hardening requirements test individual components and the entire B-2 fleet at higher EMP levels for Nuclear Command and Control Survivability. \n\nIntegrated Strike Warfare (ISW) Airborne Network project models and simulates combat effects and performance constraints in an environment that can demonstrate, integrate, generate, and validate four generic \nwave form models which will be used on the B-2 platform. Additionally, this project establishes a viable end-to-end distributed modeling and simulation network. \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate \nproduction and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "B-2 Baseline Support"
                                    },
                                    "Description": {
                                        "val": "B-2 Baseline Support, to include developmental flight test aircraft \nmodification and base of operations, Mission Planning, long range planning, studies, program integration activities, acquisition planning, and other government costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.893"
                                            },
                                            "Text": {
                                                "val": "Continue B-2 Baseline Support to include developmental flight test \naircraft modification and base of operations, Mission Planning, long range planning, studies, program integration activities, acquisition planning, and other government costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY12, funding for Baseline transferred from project 675345 to project 676021."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-2 EHF SATCOM and Computers Increment 1 System Development"
                                    },
                                    "Description": {
                                        "val": "Development of EHF SATCOM and Computers Increment 1 System Development \nand Demonstration (SDD) and design and fabrication of new and modified \ncomponents for two test aircraft and two Force Development Evaluation (FDE) aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "52.827"
                                            },
                                            "Text": {
                                                "val": "Continue EHF SATCOM and Computers Increment 1 SDD, continue flight test, leading to a successful Milestone C decision in FY12."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY12, funding for Extremely High Frequency (EHF) SATCOM and Computers transferred from project 675345 to project 676022."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-2 EHF SATCOM and Computers Increment 2 System Development"
                                    },
                                    "Description": {
                                        "val": "B-2 EHF SATCOM and Computers Increment 2 Component Advanced Design risk reduction activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "62.643"
                                            },
                                            "Text": {
                                                "val": "Continue EHF SATCOM and Computer Increment 2 component advanced design, risk reduction activities, and antenna system functional review (SFR) to meet Milestone B in FY13."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY12, funding for Extremely High Frequency (EHF) SATCOM and Computers transferred from project 675345 to project 676022."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-2 Defensive Management System (DMS) Moderization"
                                    },
                                    "Description": {
                                        "val": "B-2 Defensive Management System Modernization (DMS-M) development to improve aircrew situational awareness through replacement of passive antennas, receiver\/processors, display processors, address critical system shortfalls, and improve DMS component repair issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "85.260"
                                            },
                                            "Text": {
                                                "val": "Continue development of DMS core capability, complete system functional \nreview (SFR), achieve a successful Milestone A decision, and begin Technology Development phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY12, funding for DMS-M upgrade transferred from project 675345 to project 676023.  In FY13, DMS-M will transfer to PE 0605931F, project 653844."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-2 Modernization"
                                    },
                                    "Description": {
                                        "val": "B-2 Modernization development of Low Observable Signature and Supportability Modifications (LOSSM), Proximity Sensor Logic Unit (PSLU), Massive Ordnance Penetrator (MOP) Integration and Enhancements, Integrated Windshield Solution, Training System core upgrades, Electro Magnetic Pulse (EMP) testing, Common Organizational Level Tester (COLT), Adaptable Communication Suite (ACS), Integrated Strike Warfare\/Advanced Tactical Data Link development, Stores Management Operational Flight Plan Rehost and Mixed Carriage, other weapon integration efforts, Common Very Low Frequency Receiver, Mode S\/5 IFF, and other airframe and avionics improvements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.109"
                                            },
                                            "Text": {
                                                "val": "Continue development of ongoing LOSSM, Integrated Strike Warfare (ISW), Advanced Tactical Data Link (ATDL), Training System core upgrades, PSLU, GBU-28, ACS, Stores Management Operational Flight Plan Rehost and Mixed  Carriage, MOP Enhancements, other weapon integration efforts, and other airframe, avionics integration improvements. Complete development efforts for COLT and the EMP Hardening test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.135"
                                            },
                                            "Text": {
                                                "val": "Continue development of on-going LOSSM improvements, ISW\/ATDL, Training System core upgrades, ACS, Stores Management Operational Flight Plan Rehost and Mixed Carriage, MOP Enhancements, other weapon integration efforts, Common Very Low Frequency Receiver, and other airframe, avionics improvements. Complete PSLU and ISW\/ATDL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.007"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.007"
                                            },
                                            "Text": {
                                                "val": "Continue development of on-going LOSSM improvements, ISW\/ATDL, Training Systems core upgrades, ACS, MOP Enhancements, other weapon integration efforts, Stores Management Operational Flight Plan Rehost and Mixed Carriage, other weapons integration efforts, Common Very Low Frequency Receiver, and other airframe and avionics improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-2 Stores Management Operational Flight Program (SMOFP) rehost and mixed carriage"
                                    },
                                    "Description": {
                                        "val": "Re-host the B-2 stores management software onto a larger, more capable processor, enabling mixed carriage loads (simulataneous carriage of rotary launcher and smart bomb rack) for the B-2"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "Inital efforts funded with congressional add"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.300"
                                            },
                                            "Text": {
                                                "val": "Initiate development efforts for the B-2 stores management operational flight program re-host and mixed weapons carriage effort. FY13 wil focus on efforts to enter engineering and manufacturing development (EMD)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Very Low Frequency Receiver"
                                    },
                                    "Description": {
                                        "val": "Provide secure, survivable strategic communication for the B-2, while providing a hardware receiver that can be adapted for other aircraft or ground station use."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.452"
                                            },
                                            "Text": {
                                                "val": "Initiate development efforts for the Common Very Low Frequency Receiver"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons, APAF..."
                                    },
                                    "Title": {
                                        "val": "B-2 Modification Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "34.486"
                                        },
                                        "CurrentYear": {
                                            "val": "1.514"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.221"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.221"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.947"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.559"
                                        },
                                        "BudgetYearFour": {
                                            "val": "25.279"
                                        },
                                        "BudgetYearFive": {
                                            "val": "81.463"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0809731F, Training Support to..."
                                    },
                                    "Title": {
                                        "val": "B-2 Training Support Modification"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.038"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.038"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.006"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.477"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.630"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.776"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207446F, Bomber Tactical Dat..."
                                    },
                                    "Title": {
                                        "val": "B-2 Tactical Data Link Modification"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.140"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.060"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (3)..."
                                    },
                                    "Title": {
                                        "val": "B-2 Interim Contractor Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.640"
                                        },
                                        "CurrentYear": {
                                            "val": "39.239"
                                        },
                                        "BudgetYearOne": {
                                            "val": "39.416"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "39.416"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.513"
                                        },
                                        "BudgetYearThree": {
                                            "val": "39.736"
                                        },
                                        "BudgetYearFour": {
                                            "val": "32.585"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.113"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (4)..."
                                    },
                                    "Title": {
                                        "val": "B-2 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.432"
                                        },
                                        "CurrentYear": {
                                            "val": "10.080"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.683"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.683"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.584"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.064"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.511"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.715"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (5)..."
                                    },
                                    "Title": {
                                        "val": "B-2 Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.005"
                                        },
                                        "CurrentYear": {
                                            "val": "11.477"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 02074467F, B-2 Squadrons, APA..."
                                    },
                                    "Title": {
                                        "val": "B-2 Tactical Data Link Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.339"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.343"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.346"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (7)..."
                                    },
                                    "Title": {
                                        "val": "B-2 Depot Activation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "155.433"
                                        },
                                        "CurrentYear": {
                                            "val": "11.891"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.262"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.262"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.803"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.455"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.768"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.943"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0207439F, B-2 Squadrons, APAF..."
                                    },
                                    "Title": {
                                        "val": "B-2 Eglin Depot Activation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.188"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons, OPAF..."
                                    },
                                    "Title": {
                                        "val": "B-2 Other Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.490"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.599"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.599"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.649"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.503"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.505"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.512"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Key elements of the overall acquisition strategy include: use of sole source contract with a prime\/integrating contractor (Northrop Grumman); use of cost plus award fee\/ incentive fee  (CPAF\/IF) development contracts; and the combination of developmental upgrades with software sustainment blocks to minimize the number of software releases, aircraft downtime, and differences in fielded configurations."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101127F_BPAC_675345_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Radar Modernization Program LRIP Installs complete"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Radar Modernization Program FRP Installs complete"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Completion of MOP QRC Flight\/Weapons Tests"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MOP QRC RAA"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MOP Enhancements Development Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMOFP Rehost\/Mixed Carriage Ph 1 Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Common Very Low Frequency Receiver Development Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676021"
                    },
                    "ProjectTitle": {
                        "val": "BASELINE SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "9.523"
                        },
                        "BudgetYearOne": {
                            "val": "7.875"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.875"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.336"
                        },
                        "BudgetYearThree": {
                            "val": "16.012"
                        },
                        "BudgetYearFour": {
                            "val": "14.032"
                        },
                        "BudgetYearFive": {
                            "val": "14.218"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY12, funding for Baseline Support transferred from project 675345 to the new project 676021."
                        },
                        "ProjectMissionDescription": {
                            "val": "Baseline Support maintains the B-2 unique flight test aircraft, as well as obtains, modifies, and operates a flying test bed, developmental hardware\/software and test equipment, to support developmental systems integration and flight test, reducing the need for additional operational aircraft and accelerating deployment of advanced operational capabilities to the warfighter. Baseline Support also ensures the Mission Planning system keeps pace with aircraft modifications and improves the mission planning core system. Baseline Support provides for other B-2 unique government costs and includes acquisition planning activities for future capabilities such as, but not limited to, Advanced Tactical Data Link efforts, Moving Target Kill capability, High Resolution Synthetic Aperture Radar and Enhanced Radar Modes, F118 Service Life Extension and F118 Extended Mission Oil Tank Upgrades, B61 Life Extension Program, Universal Armament Interface, System 2 Nuclear Interface, Global Positioning System\/M-Code Receivers, Joint Precision Approach and Landing System upgrades, Radar Processor Modernization, Automatic Dependent Surveillance – Broadcast IFF, Flight Data and Voice Recorder, Communications\/ Navigation\/Surveillance-Air Traffic Management, and integration of currently fielded or new weapons including, but not limited to, GBU E\/B Selective Availability and Anti Spoofing Module (SAASM)with impact angle control, GBU D\/B SAASM with impact angle control, Hard Target Void Sending Fuse, Joint Air-to-Surface Standoff Missile Extended Range, and Joint Direct Attack Munition-5000.\n \nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate \nproduction and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Baseline Support Acquisition Planning"
                                    },
                                    "Description": {
                                        "val": "Baseline Support provides for other B-2 unique government costs and includes acquisition planning activities for future capabilities, Training System core support, long range planning, studies, and program integration activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY11 effort covered under project 675345."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.901"
                                            },
                                            "Text": {
                                                "val": "Continue Baseline Support activities including acquisition planning for \nfuture capabilities, Training System core support, long range planning, studies, and program integration activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "Continue Baseline Support activities including acquisition planning for \nfuture capabilities, Training System core support, long range planning, studies, and program integration activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Baseline Support Flight Test"
                                    },
                                    "Description": {
                                        "val": "Baseline Support Flight Test maintains the B-2 unique flight test aircraft as well as obtains, modifies, and operates a flying test bed and developmental hardware\/software and test equipment, to support \ndevelopmental systems integration and flight test, reducing the need for additional operational aircraft and accelerating deployment of advanced operational capabilities to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY11 effort covered under project 675345."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.645"
                                            },
                                            "Text": {
                                                "val": "Continue B-2 Flight Test activities, maintaining the B-2 unique flight test aircraft as well as obtaining, modifying, and operating a flying test bed and developmental hardware\/software and test equipment, to support developmental systems integration and flight test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.684"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.684"
                                            },
                                            "Text": {
                                                "val": "Continue B-2  Flight Test activities, maintaining the B-2 unique flight test aircraft and as well as obtaining, modifying, and operatating a flying test bed and developmental hardware\/software and test equipment to support developmental systems integration and flight test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Baseline Support Mission Planning"
                                    },
                                    "Description": {
                                        "val": "Baseline Support Mission Planning improvements ensure the mission planning system keeps pace with aircraft modifications and improves mission planning core systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY11 effort covered under project 675345."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.977"
                                            },
                                            "Text": {
                                                "val": "Continue B-2 Mission Planning activities, keeping pace with aircraft \nmodifications and improving mission planning core systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.480"
                                            },
                                            "Text": {
                                                "val": "Continue B-2 Mission Planning activities, keeping pace with aircraft \nmodifications and improving mission planning core systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Key elements of the overall acquisition strategy include: use of sole source contract with a prime\/integrating contractor (Northrop Grumman); use of cost plus award fee\/ incentive fee  (CPAF\/IF) development contracts; and the combination of developmental upgrades with software sustainment blocks to minimize the number of software releases, aircraft downtime, and differences in fielded configurations."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101127F_BPAC_676021_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Mission Planning Release 4.3.0.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mission Planning Release 4.3.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY12 Flight Test Core Support Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY13 Flight Test Core Support Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676022"
                    },
                    "ProjectTitle": {
                        "val": "EHF SATCOM and Computer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "202.534"
                        },
                        "BudgetYearOne": {
                            "val": "6.336"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.336"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY12, funding for Extremely High Frequency (EHF) SATCOM and Computers transferred from project 675345 to project 676022.\n\nEHF Increment 2 program funding was removed in the FY13 PB due to higher Air Force priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "The aging Ultra High Frequency (UHF) Military Satellite Communications system is being phased out and replaced by the Advanced Extremely High Frequency (AEHF) Satellite Communications (SATCOM) system. The B-2 Extremely High Frequency (EHF) SATCOM program supports the replacement of the present B-2 UHF Terminal Set with an EHF SATCOM system that will be compatible with the legacy MILSTAR I\/II satellite constellation and the future AEHF satellite constellation. The B-2 EHF SATCOM system is one element of a system-of-systems that includes the AEHF satellites, multiple platforms, and the Family of Advanced Beyond-Line-of-Site Terminals (FAB-T) or other equivalent terminals, as required. The B-2 EHF SATCOM upgrade is an incremental program. \n\nEHF Increment 1 provides upgraded Flight Management Control Processors, increased data storage, rehosted flight management operational flight program, and a high bandwidth data bus in order to prevent degradation of existing capabilities. Additionally, the Increment 1 Integrated Processing Unit and Disk Drive Unit architectures establish a high speed fiber optic structure network as well as maintain connectivity to legacy interfaces. EHF Increment 1 provides a processing growth path to future B-2 upgrades. \n\nEHF Increment 2 integrates the FAB-T Government Furnished Equipment, or other equivalent terminals (if required), into the B-2 as well as develops and installs a low-observable antenna system consisting of arrays, antenna line replaceable units, and structural modifications for both power and cooling. This upgrade is critical to ensure the B-2 is compatible with the next generation communications satellite architecture and is absolutely essential in providing uninterrupted, highly survivable, two-way communications required for the command and control of the nation’s strategic nuclear and conventional forces. Connectivity is mandatory to enable network centric enabled attack in an anti-access environment. Due to integration issues and schedule delays, the Air Force is currently pursuing alternative communication solutions, such as a Very Low Frequency antenna and terminal modification effort.\n \nIncrement 3 enables the B-2 to interface with the Global Information Grid and provides net ready capability. \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "B-2 EHF SATCOM and Computers Increment 1 System Development"
                                    },
                                    "Description": {
                                        "val": "EHF SATCOM and Computers Increment 1 System Development and Demonstration (SDD), and design and fabrication of new and modified components for two test aircraft and two Force Development Evaluation aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY11 effort covered under Project Number 675345."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.069"
                                            },
                                            "Text": {
                                                "val": "Continue EHF SATCOM and Computers Increment 1 SDD, complete Initial Operational Test & Evaluation (IOT&E), and begin Low Rate Initial Production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.336"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.336"
                                            },
                                            "Text": {
                                                "val": "Complete EHF SATCOM and Computers Increment 1 SDD, complete IOT&E, and begin Full Rate Production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-2 EHF SATCOM and Computers Increment 2 System Development"
                                    },
                                    "Description": {
                                        "val": "Development of EHF SATCOM and Computer Increment 2 Component Advanced Design and risk reduction activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY11 effort covered under Project Number 675345."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "145.465"
                                            },
                                            "Text": {
                                                "val": "Complete EHF SATCOM and Computer Increment 2 Component Advanced Design and risk reduction activities to achieve a successful system Preliminary Design Review (PDR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "EHF Increment 2 program funding was removed in the FY13 PB due to higher Air Force priorities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons, APAF..."
                                    },
                                    "Title": {
                                        "val": "EHF Inc I Kits and Installs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "29.501"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.037"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.037"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.469"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.373"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (1)..."
                                    },
                                    "Title": {
                                        "val": "EHF Inc 1 Interim Contract Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.101"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.481"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.481"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.489"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.840"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.739"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (2)..."
                                    },
                                    "Title": {
                                        "val": "EHF Inc 1 Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.654"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.481"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.481"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.429"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.739"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0101127F, B-2 Squadrons,  (3)..."
                                    },
                                    "Title": {
                                        "val": "EHF Inc 1 Depot Activation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "3.925"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.703"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.703"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.192"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.196"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Key elements of the overall acquisition strategy include: use of sole source contract with a prime\/integrating contractor (Northrop Grumman); use of cost plus award fee\/ incentive fee  (CPAF\/IF) development contracts; and the combination of developmental upgrades with software sustainment blocks to minimize the number of software releases, aircraft downtime, and differences in fielded configurations"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101127F_BPAC_676022_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "EHF Increment 1 Milestone C Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHF Increment 1 LRIP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHF Increment 1 FRP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHF Increment 2 Array Preliminary Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676023"
                    },
                    "ProjectTitle": {
                        "val": "Defensive Management System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "41.127"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY12, funding for DMS upgrade transferred from project 675345 to project 676023.\nIn FY13, funding transfers to PE 65931F, project 653844."
                        },
                        "ProjectMissionDescription": {
                            "val": "The B-2 Defensive Management System Modernization (DMS-M) program maintains the B-2 direct attack capability while addressing emerging 21st century threats. DMS-M is the #1 priority modification program in the B-2 program office. DMS-M will upgrade the Electronic Support Measures, antennas, and display processing units. Modernization of this system will resolve the #1 obsolescence issue in the B-2 fleet. \n\nThe B-2 DMS-M will provide the Joint Force Commander and the B-2 fleet with advanced situational awareness, improved supportability, enhanced lethality, increased platform survivability, and networked battlespace awareness. The B-2 DMS-M upgrade will provide the following core capabilities for the B-2 and joint warfighting force: 1) Ability to provide indication, type, and position of airborne and ground-based \nradio frequency (RF) threats with the situational awareness needed to avoid, engage, or negate threats, 2) Improved RF threat information that can be reported to control agencies or inter-flight for improved \nsituation\/battlespace awareness, 3) Ability to adequately control, process, and display incoming threat information to the aircrew and provide updated battle-space awareness, and 4) Improved supportability and reduced operations and maintenance costs. \n\nAs DMS-M requires increased functionality and capability of the display processor, it includes FY10 and future year budgets transitioned from the B-2 Integrated Display System modification (MN-110041). FY10 Congressional Plus-up for B-2 Strike Control System establishes the foundation for all future data fusion and pilot-vehicle interface upgrades. Funds were applied to the DMS-M development program.  \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "B-2 Defensive Management System (DMS) Modernization"
                                    },
                                    "Description": {
                                        "val": "DMS Modernization program develops improved aircrew situational awareness through replacement of passive antennas, receiver\/processors, display processors; also addresses critical system shortfalls, and improves DMS component repair issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY11 effort covered under Project Number 675345."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.127"
                                            },
                                            "Text": {
                                                "val": "Continue DMS Modernization technology development leading to Preliminary Design Review and a successful Milestone B decision in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY13 effort covered under PE 0605931F, project 653844"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "PE 0605931F"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "281.056"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "281.056"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "318.150"
                                        },
                                        "BudgetYearThree": {
                                            "val": "254.961"
                                        },
                                        "BudgetYearFour": {
                                            "val": "216.195"
                                        },
                                        "BudgetYearFive": {
                                            "val": "141.114"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Key elements of the overall acquisition strategy include: use of sole source contract with a prime\/integrating contractor (Northrop Grumman); use of cost plus award fee\/ incentive fee  (CPAF\/IF) development contracts; and the combination of developmental upgrades with software sustainment blocks to minimize the number of software releases, aircraft downtime, and differences in fielded configurations."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101127F_BPAC_676023_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "DMS-M Milestone A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DMS-M Technology Development Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DMS-M Preliminary Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DMS-M Milestone B Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DMS-M EMD Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DMS-M Critical Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}