{
    "id": "ca978f2346e8c6c4a8750a059daebb06c8e10d99",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603710A"
        },
        "ProgramElementTitle": {
            "val": "NIGHT VISION ADVANCED TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "71.723"
            },
            "CurrentYear": {
                "val": "42.348"
            },
            "BudgetYearOne": {
                "val": "37.217"
            },
            "BudgetYearOneBase": {
                "val": "37.217"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "39.257"
            },
            "BudgetYearThree": {
                "val": "43.136"
            },
            "BudgetYearFour": {
                "val": "43.393"
            },
            "BudgetYearFive": {
                "val": "44.042"
            }
        },
        "ProgramElementNote": {
            "val": "FY 11 Increase attributed to Congressional addition of 23.1 million of Overseas Contingency Operations (OCO) funding for Aviation Night and Limited Visibility Sensor Demonstration"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates sensor technologies that increase Warfighter survivability and lethality by providing sensor capabilities to acquire and engage targets at longer ranges in complex environments and operational conditions (e.g. day\/night, obscured, smoke, adverse weather).  Project K70 pursues technologies that improve the Soldier's ability to see at night, provide rapid wide area search, multispectral aided target detection (AiTD), and enable passive long range target identification (ID beyond threat detection) in both an air and ground test-beds. Project K86 matures and evaluates sensors and algorithms designed to detect targets (vehicles and personnel) in camouflage, concealment and deception from airborne platforms, and provides pilotage and situational awareness imagery to multiple pilots\/crew members independently for enhanced crew\/aircraft operations in day\/night\/adverse weather conditions.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this PE is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602709A (Night Vision and Electro-Optics Technology), PE 0602712A (Countermine Systems), PE 0603001A (Warfighter Advanced Technology), PE 0603003A (Aviation Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), PE 0603774A (Night Vision Systems Advanced Development) and PE 0604710A (Night Vision Systems Engineering Development).   \n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "39.912"
                },
                "CurrentYear": {
                    "val": "42.414"
                },
                "BudgetYearOne": {
                    "val": "40.727"
                },
                "BudgetYearOneBase": {
                    "val": "40.727"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "71.723"
                },
                "CurrentYear": {
                    "val": "42.348"
                },
                "BudgetYearOne": {
                    "val": "37.217"
                },
                "BudgetYearOneBase": {
                    "val": "37.217"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "31.811"
                },
                "CurrentYear": {
                    "val": "-0.066"
                },
                "BudgetYearOne": {
                    "val": "-3.510"
                },
                "BudgetYearOneBase": {
                    "val": "-3.510"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "23.100"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.997"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.941"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.510"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.510"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.345"
                                },
                                "CurrentYear": {
                                    "val": "-0.066"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "K70"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION ADV TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.790"
                        },
                        "CurrentYear": {
                            "val": "25.727"
                        },
                        "BudgetYearOne": {
                            "val": "21.760"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.760"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.901"
                        },
                        "BudgetYearThree": {
                            "val": "25.508"
                        },
                        "BudgetYearFour": {
                            "val": "25.534"
                        },
                        "BudgetYearFive": {
                            "val": "25.882"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase target detection range, extend target identification range, and reduce target acquisition (TA) timelines for dismounted Soldiers and tactical vehicles against threats that are beyond today's detection ranges or are partially obscured by terrain, weather or other features.\n\nThis project supports Army science and technology efforts in the Command Control and Communications, Ground, Air and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon Sight Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops, integrates and demonstrates critical components for the next generation of weapon sight systems for mounted and dismounted Soldier use to provide improved actionable intelligence and the tools to assist in recognizing and identifying friend or foe."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Optical Augmentation (OA) hardware prototype integration for demonstration and user evaluation from multiple sources; began phase II weapon sight prototype hardware integration of down-selected configurations for dismounted and crew served applications; matured and demonstrated enhancement in Soldier situational awareness through increased target detection and engagement technologies including small pixel, large format focal plane arrays in the longwave infrared spectrum providing smaller, lower power and better resulotution detectors; conducted laboratory tests and assessments of the weapon sight system from multiple sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Counter Surveillance System (CSS) brassboard integration; demonstrate and conduct user evaluation then transition CSS technology to Program Manager-Soldier Sensors and Lasers (PM-SSL) and PM-Stryker; complete weapon sight brassboard integration; demonstrate and conduct user evaluations of the weapon sight technology then transition the technology to PM-SSL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate Optical Augmentation (OA) hardware; complete final weapon sight integration and ruggedization for testing and evaluation; demonstrate sensor fusion integration between ultra violet (UV) and virtual pointer (VP) hardware and weapon sights for greatly enhanced target handoff during both day and night operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Sensor Suite"
                                    },
                                    "Description": {
                                        "val": "This effort develops and integrates 360 degree closed hatch vision capability with real time acoustic and non-real time on-the-move (OTM) moving target indicator (MTI) threat detection and cueing sensors and algorithms, high resolution interrogation sensors (for slew to cue identification), improved resolution driving sensors, and high bandwidth video capture capabilities in urban operations for improved survivability, lethality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development of system architecture, hardware, and software for integrated processing of video and multiple threat detection alerts (acoustic\/Moving Target Indicator (MTI)); completed integration of improved resolution driving cameras, high resolution slew to cue camera, and weapons fire detection sensors; completed maturation of software for graphical user interface with camera and sensors to assess threat detection and discrimination of imagery analysis; completed integration, maturation, and demonstration of detection systems on vehicle platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.872"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advanced crew stations with the state of the art electro-optic indirect vision systems (high resolution threat interrogation and driving sensors, autonomous threat detection and cueing, and digital video recording and displays); complete maturation of products to include: sensor interface for target handoff and pointing to\/from dismounted Soldiers, high resolution forward looking infrared, image intensified and visual sensors, threat cueing sensors and algorithms for weapons fire detection\/location; develop signal processing algorithms for pixel level sensor fusion and information fusion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Text": {
                                                "val": "Will validate, mature and optimize hardware designs which provide high resolution persistent surveillance imagery with picture in picture capability in order to identify specific areas of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Ground Persistent Surveillance and Targeting (previously titled: Unmanned Tactical Ground Persistent Surveillance and Targeting)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase local situational awareness and target discrimination capabilities and reduce target acquisition (TA) timelines for dismounted Soldiers, combat vehicles, tactical robots, ground and urban sensors against threats that are beyond today's ranges or discrimination capabilities or are partially obscured by terrain."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of higher performance, lower cost advanced sensor technology and incorporate new sensors into manned and unmanned vehicles, as well as Soldier borne applications, to acquire targets at extreme ranges while reducing the size and power needs to the platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.916"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.916"
                                            },
                                            "Text": {
                                                "val": "Will mature large format high definition infrared (IR) focal plane arrays and model their range and resolution performance; evaluate low cost 3 vs. 4 axis stabilization systems required to operate system at 4km-5km; mature components and construct brassboard system to demonstrate radar\/IR\/laser Slew-to-Cue in an operational environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Sensors for Precision"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that allow combat vehicle commanders and crewmen to detect more rapidly, identify and geo-locate threat targets to enable fire control for platform weaponry. The effort leverages advance IR imaging technology, 3-dimensional (3-D) imaging sensor techniques, and precise far target location technology to increase target detection range, extended target and reduce target acquisition timelines."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature a 3-Dimensional (3-D) sensor suite with precise target acquisition technology (target identification and location); demonstrate and validate the performance of precision sensors for combat vehicle target acquisition sighting and fire control system for demonstration onboard a Heavy Brigade Combat Team (HBCT) vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.207"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.207"
                                            },
                                            "Text": {
                                                "val": "Will fabricate, optimize, evaluate and demonstrate in a relevant environment, an affordable, high definition (HD), forward looking infrared (FLIR), multi-purpose sensor for high resolution target discrimination and identification of personnel and weapon\/non-weapon scenarios providing a potential upgrade in a commander's independent thermal viewer form factor; mature algorithms and validate multi-purpose sensor performance for hostile fire detection and situational awareness applications; integrate the multi-purpose HD FLIR with an ultra-violet (UV) pointer for day\/night targeting handoff between mounted and dismounted personnel enabling cooperative engagement for a user evaluation in a relative environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Designator Technology"
                                    },
                                    "Description": {
                                        "val": "This effort leverages US Army investments in low power laser designation technology to provide advanced lightweight target detection and call for fire capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated reduced size, weight and power of the Target Location Designation System (TLDS) Azimuth & Vertical Angle Module (AVAM) that matures a far target location (FTL) technology; demonstrated the TLDS technology capabilities simultaneously in a brass-board system; evaluated the small pixel, large format uncooled midwave infrared sensor target acquisition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K73"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION SENSOR DEMONSTRATIONS (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.100"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Overseas Contingency Operations (OCO) Congressional Interest Item funding for Night Vision advanced technology development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aviation Night and Limited Visibility Sensor Demonstration"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporated multi-spectral sensors, helmet mounted displays, and brown-out symbology with a miniaturized on-aircraft processing capability.  Built and incorporated advancing low cost cooled and uncooled mega-pixel long-wave infrared sensors to meet future affordability goals, as well as information fusion with millimeter wave-radar."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K86"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION, ABN SYS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.833"
                        },
                        "CurrentYear": {
                            "val": "16.621"
                        },
                        "BudgetYearOne": {
                            "val": "15.457"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.457"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.356"
                        },
                        "BudgetYearThree": {
                            "val": "17.628"
                        },
                        "BudgetYearFour": {
                            "val": "17.859"
                        },
                        "BudgetYearFive": {
                            "val": "18.160"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates intelligence, surveillance, reconnaissance, targeting, and pilotage technologies in support of the Army's aviation and networked systems. This effort focuses on improved reconnaissance, surveillance and target acquisition and night pilotage sensors, high-resolution heads-up displays, sensor fusion, and aided target recognition (AiTR) capabilities for attack, scout, cargo, and utility helicopters and unmanned aerial systems (UAS). UAS payload efforts mature and demonstrate small, lightweight, modular, payloads (electro-optical\/infrared, laser radar, designator) to support target detection, identification, location, tracking, and targeting of tactical targets for the Brigade Combat Team.  \n\nThe project supports Army science and technology efforts for the Air and Command Control and Communications portfolios.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Unmanned Persistent Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates day and night persistent surveillance imaging (PSI) and enhanced reconnaissance, surveillance, and target acquisition (RSTA) capabilities from a single payload on the Extended Range\/Multi-Purpose (ER\/MP) Grey Eagle, Unmanned Aerial System (UAS). Technology developed will be applied to smaller\/lighter UASs as miniaturized large format sensors mature."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.224"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed step-stare and ground-based processing software; demonstrated brassboard for tracking, image compression, and scene segmentation software; and finalized designs for tiered data processing and integrated designs for the 3rd generation focal plane array."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.676"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate enhanced capabilities (high definition sensors and dual color infrared (midwave\/longwave)) into a high definition demonstrator; complete intelligent data compression subsystem to provide persistent wide-area activity monitoring, personnel\/vehicle tracking, and enhanced reconnaissance, surveillance and target acquisition (RSTA) capabilities to include high resolution target search; complete and demonstrate the 3rd generation focal plane array turret to provide the optimal infrared imaging band for prevailing battlefield conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.464"
                                            },
                                            "Text": {
                                                "val": "Will conduct flight test and demonstration of enhanced RSTA and targeting capabilities with a high definition, dual-band infrared focal plane array-based turret; collect airborne imagery to support development of processing subsystem; train, test and optimize the image exploitation subsystem for persistent wide area activity monitoring."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Definition Aviation Displays"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates an advanced monocular, see-through, high definition, digital, helmet mounted display (HMD) to replace Apache's analog, cathode ray tube-based integrated helmet and display sight system (IHADSS) and provides a baseline for future aviation HMDs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.945"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature the capabilities of waveguide display optics technology; expand field-of-view and resolution through innovative optical designs, materials and advanced display technologies; begin to integrate and demonstrate the system (conduct laboratory and engineering flight tests)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.993"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.993"
                                            },
                                            "Text": {
                                                "val": "Will complete fabrication of initial engineering prototype displays with advanced monocular optics and low power miniature liquid crystal displays; demonstrate and assess key head-borne ergonomic parameters such as size and weight, center of gravity, display brightness\/contrast and resolution; integrate with HGU-56P helmet; conduct laboratory performance characterization and fabricate five system demonstrators for flight testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Lasers for Unmanned Aerial System (UAS) Payloads"
                                    },
                                    "Description": {
                                        "val": "This effort develops, integrates and demonstrates an advanced target acquisition and designation laser payload to satisfy the RSTA mission requirements for the Class I Unmanned Aerial System (UAS) customized to a 7 lb payload capacity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.294"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed manufacture and integration of the advanced demonstrator payload brassboard sensors; characterized and flight test the payloads in a relevant environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-mode system Payloads for Enhanced Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved targeting capabilities, especially against difficult camouflage, concealment, and defilade targets, by combining the wide area search and identification capabilities of hyperspectral imaging with the 3-dimensional target identification and through foliage\/camouflage capabilities of laser radar (LADAR) for target range interrogation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.315"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Leveraged and matured mono-block laser technology to begin the development of a compact multi-function laser capable of providing standard eye-safe range-finding and LADAR laser functions; developed processor for real time hyperspectral imaging for airbourne applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}