{
    "id": "cbd8c19149351328f4d1f6ee64a937490e340fb8",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Applied Res"
        },
        "R1LineItemNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "143.063"
            },
            "CurrentYear": {
                "val": "196.734"
            },
            "BudgetYearOne": {
                "val": "143.301"
            },
            "BudgetYearOneBase": {
                "val": "143.301"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "136.588"
            },
            "BudgetYearThree": {
                "val": "133.072"
            },
            "BudgetYearFour": {
                "val": "122.825"
            },
            "BudgetYearFive": {
                "val": "120.872"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this program element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability.  This is accomplished by improvements in platform offensive performance, stealth, and self defense.  This PE supports the Future Naval Capabilities (FNC) Program in the areas of Sea Shield, Sea Strike, Cross Pillar Enablers and Enterprise and Platform Enablers (EPE).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "107.448"
                },
                "CurrentYear": {
                    "val": "156.901"
                },
                "BudgetYearOne": {
                    "val": "156.391"
                },
                "BudgetYearOneBase": {
                    "val": "156.391"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "143.063"
                },
                "CurrentYear": {
                    "val": "196.734"
                },
                "BudgetYearOne": {
                    "val": "143.301"
                },
                "BudgetYearOneBase": {
                    "val": "143.301"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "35.615"
                },
                "CurrentYear": {
                    "val": "39.833"
                },
                "BudgetYearOne": {
                    "val": "-13.090"
                },
                "BudgetYearOneBase": {
                    "val": "-13.090"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.167"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "40.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.941"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.566"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-13.320"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-13.320"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.230"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.230"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.878"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "40.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Applied Res"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "103.266"
                        },
                        "CurrentYear": {
                            "val": "156.734"
                        },
                        "BudgetYearOne": {
                            "val": "143.301"
                        },
                        "BudgetYearOneBase": {
                            "val": "143.301"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "136.588"
                        },
                        "BudgetYearThree": {
                            "val": "133.072"
                        },
                        "BudgetYearFour": {
                            "val": "122.825"
                        },
                        "BudgetYearFive": {
                            "val": "120.872"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability by virtue of improvements in platform offensive performance, stealth, and self defense.  This effort supports the FNC in the areas of Sea Shield, Cross Pillar Enablers, and Enterprise and Platform Enablers (EPE).\n\nThis project reflects the alignment of Future Naval Capability (FNC) program investments for the following Enabling Capabilities (ECs):  Anti-Ship Missile Defense Technologies, Sea Based Missile Defense of Ships & Littoral Installations, Advanced Threat Aircraft Countermeasures, Helicopter Low-Level Operation, Four Torpedo Salvo Defense, Shipboard Force Protection in Port and Restricted Waters - Detection and Classification, Underwater Total Ship Survivability, Compact Power Conversion Technologies and Affordable Submarine Propulsion and Control Actuation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scaleable naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tiltrotor rotor drive systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. This activity directly supports the Naval Aviation Enterprise Science and Technology Objectives and the Naval Science and Technology Strategic Plan, principally in the Platform Mobility, Survivability and Self-defense, Affordability\/Maintainability\/Reliability, Autonomy and Power Projection Focus Areas: and the Sea-Based Aviation National Naval Responsibility (SBA NNR). \n\nFY 2012 and FY 2013 funding increases are due to two programs beginning in FY12 and ramping up in FY 2013: Variable Cycle Advanced Technology (VCAT) and Autonomous Aerial Cargo\/Utility System (AACUS). VCAT will identify and mature critical, relevant variable\/adaptive cycle propulsion system technologies for the next generation carrier-based TACAIR\/ISR systems. AACUS will develop advanced autonomous capabilities to enable rapid resupply of distributed forces in the short term."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of survivability\/reduced observables technology. Metrics are classified. \n- Continued development of flight control, intelligent autonomy, command & control, and multi-vehicle cooperation technologies for Unmanned Air Vehicle (UAV). \n- Continued development of a Computational Fluid Dynamics (CFD) based integration system to maximize operational capability of autonomous aircraft by choosing optimal flight pattern for any environmental condition including low speed operations and brownout. \n- Continued vertical lift technology investments. \n- Continued research in fixed wing aircraft\/vertical lift\/rotorcraft technology areas such as aeromechanics, propulsion, active rotor control for enhanced ship board operations, structural concepts compatible with shipboard operations, autonomous operations in the shipboard and austere environment, and innovative vehicle concepts for naval application. \n- Continued research in vertical lift aircraft \/rotorcraft technology areas such as aeromechanics, propulsion, active rotor control for enhanced ship board operations, structural concepts compatible with shipboard operations, autonomous operations in the shipboard and austere environment, and innovative vehicle concepts for naval application. \n- Initiated effort to develop a portable system for stand-off detection of explosives and other illicit materials, including trace residues. \n- Initiated effort to demonstrate the solution processing of an inorganic nanowire based photovoltaic device that operates in the infrared region."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Initiate the Variable Cycle Advanced Technology (VCAT) Program.  Critical technology development efforts will begin with major engine manufacturers and weapon system contractors to develop and mature to TRL 4\/5 the highest priority, long-lead, propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems.\n- Initiate Autonomous Aerial Cargo\/Utility System (AACUS) advanced autonomous capability technologies for sea based resupply of distributed forces and casualty evacuation.\n- Initiate maturation of Science of Autonomy basic research into applied research to reduce manning for unmanned system operations in shipboard and expeditionary operations, enable safe and sustainable unmanned air system operations in challenging environmental\/weather conditions, and provide robust cooperation between unmanned systems that can adapt to changes in the battlespace and environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012.  \n- Complete physics based analysis of morphing optimized rotor technology trades, and analytical methodology development for ducted fans and fan-in-wing configurations.\n- Continue efforts on future deck operations with mixed manned and autonomous air systems.  \n- Continue efforts on autonomy for low-altitude persistence by small UAVs.\n- Complete experiments with UAS autonomy for scouting of riverine environments.\n- Complete flight test of time-critical distributed multiple unmanned air system collaboration.\n- Complete experiments on using predictive models to improve UAS supervisory control performance.\n- Complete effort to develop a portable system for stand-off detection of explosives and other illicit materials, including trace residues. \n- Initiate demonstration of initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS).\n- Initiate development of rotorcraft \/ VTOL systems automated launch and recovery technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLEET FORCE PROTECTION AND DEFENSE AGAINST UNDERSEA THREATS"
                                    },
                                    "Description": {
                                        "val": "Fleet Force Protection and Defense against Undersea Threats efforts include applied research for complementary sensor and processing technologies for platform protection and shipboard technologies to increase the survivability of surface ship and submarine platforms against torpedo threats and to develop the capability to interdict underwater asymmetric threats to ships and infrastructure in harbors.  Current small platforms (both surface and airborne) have little to no situational awareness (SA) or self-protection against air, surface, and asymmetric threats.  A goal of this activity is to provide these platforms with effective self-protection.  The technology areas specific to platform protection will develop individual, multispectral electro-optical (EO), infrared (IR), radio frequency (RF), electro-magnetic (EM), visual and acoustic or chemical sensors\/biosensors and associated processing.  To defend platforms from current and advanced threats in at-sea littoral environments and in port, these technologies must improve multispectral detection and distribution of specific threat information. \n\nAnother goal of this activity is to develop a torpedo defense capability to fill Sea Shield Warfighting Capability Gap\/Enabling Capability: Platform Defense against Undersea Threats, including Four Torpedo Salvo Defense.  This provides a capability to prevent any of the torpedoes, in up to four-torpedo salvos fired at high value units, from hitting those units.  \n\nThis activity supports the Fleet and Force Protection FNC and includes support to Sea Shield and Sea Strike Pillars and FNC Enabling Capabilities for: Aircraft Integrated Self-protection Suite; Fortified Position Security; Advanced Electronic Sensor Systems for Missile Defense; and Shipboard Force Protection in Port and Restricted Waters - Detection and Classification.  \n\nThis activity supports the development of technologies that aid the helicopter pilot when operating in degraded visual cue environments (brown-out).  \n\nFY 2013 funding decrease is due to completion of the STK-FY09-07 FNC for Helicopter Low-Level Operations (HELO).  The decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to new FNC R2 activities titled Sea Strike and Sea Shield.  Efforts in these R2 activities have been continued from FY 2012 to FY 2013 into new R2 activities to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.267"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing\n- Continued efforts in biomimetic sonar systems for operation in air and aquatic environments based on bat echolocation neurophysiology and information processing algorithms. \n- Continued efforts in biomimetic signal processing: panoramic periscope for submarines and temporal pattern recognition for Systems for Security Breaching Noise Detection. \n- Continued efforts in bioinspired quiet, efficient and maneuverable self-propelled line array using high-lift propulsors based on insect biomechanics. \n- Continued studies to develop catalytic activity profile of bioactive coatings against chemical agents. Designed and initiated fabrication of coatings to degrade both, chemical and biological agents. \n- Continued advanced concept development to integrate object recognition and tracking algorithms, machine vision, multiple networked video streams into different classes of EO\/IR sensors within the Intelligent Video Surveillance FNC product (transferred from PE 0602131M). \n- Continued FNC EC Shipboard Force Protection in Port and Restricted Waters - Detection and Classification. This project will develop mission specific electro-optic\/infrared sensors to detect, classify, and determine the intent of potential terrorist and special operations force threats to ships and craft import and transiting restricted waters. \n- Continued the Countermeasures for Advanced Imaging Infrared (IIR) Guided Missiles FNC effort by initiating IIR threat model development. \n- Continued the Countermeasures for Millimeter Wave Guided Missiles FNC effort by initiating requirements analysis. \n- Continued the Multifunction Capabilities for Missile Warning Sensors FNC effort by commencing data collection and analysis. \n- Continued efforts to design microfabricated system for 3-color fluorescence measurements using integrated waveguides. \n- Continued effort to develop new, highly selective, preferential oxidation catalysts for the generation of power from the reformate gas purification process. \n- Continued effort to develop aspheric gradient index optics\n- Continued the Helicopter Laser-Based Landing Aids FNC effort by development of a ladar capable of sensing through degraded visual cue environments (brown-out) and providing a display format that is usable to the pilot.\n- Completed FNC EC Shipboard Force Protection in Port and Restricted Waters - Detection and Classification. This project develops mission specific electro-optic\/infrared sensors to detect, classify, and determine the intent of potential terrorist and special operations force threats to ships and craft in port and transiting restricted waters.\n\nUnderwater Platform Self-Defense\n- Continued development of low-cost, light weight swimmer detection and localization technologies. \n- Continued development of software encoded algorithms for the Anti-Torpedo Torpedo (ATT) sensor and controller that will enable ATT's to successfully engage torpedo salvoes of up to four attacking units\n- Completed development of optimized microfluidic components suitable for explosive, chemical, and biological sensing applications, and initiate the development of models required to apply existing automated design tools to components with more complex physics and more general geometries.\n\nIn support of FNC (Force Projection Applied Research), perform the following efforts:\n- Initiated the development and application of emerging technologies that support delivery of Navy approved FNC enabling capabilities structured to close operational capability gaps in force projection.\n- Initiated the packaging of emerging force projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period.\n- Initiated the development of force projection technologies that support naval requirements identified within the Sea Shield and Sea Strike naval capability pillars as well as those applicable to specific naval platforms and those that apply across the naval enterprise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing\n- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete STK-FY09-07 FNC for Helicopter Low-Level Operations (HELO).\n- Initiate the development of an inexpensive, miniaturized, low-power chemical sensors for incorporation into autonomous distributed networks.\n- Initiate design and development of storage and delivery systems of nucleic acids without need for refrigeration for use in battlefield environments. \n\n- Underwater Platform Self-Defense\n- Continue all efforts of FY 2011, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing \n- Continue all efforts of FY 2012, less those noted as completed above. \n- Complete the Countermeasures for Millimeter Wave Guided Missiles FNC effort by bench testing the decoy power supply and power amplifier modules.\n- Complete the Countermeasures for Advanced Imaging Infrared (I2R) Guided Missiles FNC effort by completing the final techniques and advanced component designs.\n\nUnderwater Platform Self-Defense \n- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MISSILE DEFENSE (MD)"
                                    },
                                    "Description": {
                                        "val": "This activity describes Missile Defense S&T projects of the Sea Shield FNC program, and non-FNC-related Navy research.\n\n- Naval Interceptor Improvements (NII) technology upgrades for STANDARD Missile (SM) future fleet air defense missile. Metrics are to achieve SM performance requirements in specified tactical rain environments and achieve SM performance requirements in all specified electronic countermeasures environments.\n- Extended Distributed Weapons Coordination (EDWC) algorithms for an Automated Battle Management Aid (ABMA) that recommends hard kill weapons, soft kill countermeasures, and emission control measures to reduce the probability of being hit or to optimally engage threats with self-defense weapons.  Metric is improved probability of negation (Pneg) against advanced ballistic & cruise missile anti-ship threats that may be susceptible to decoys and jamming.\n- Positive Control of Naval Weapons (PCNW) - additional technology upgrades for SM to enable forward relay, remote launch & potentially forward pass engagements. Metrics are classified.\n- Midcourse and Terminal Algorithms (MTA) for prototype state-of-the art weapon system algorithms for STANDARD Missile (SM) engagements vs modern anti-ship missile threats. Specific metrics are classified.\n- Enhanced Lethality Guidance Algorithms (ELGA) to increase Navy shipboard missile probability of kill versus an expanded threat set including ASBMs and advanced ASCMs. Metrics for this project are classified.\n- Enhanced Maneuverability Missile Airframe (EMMA) technology for Navy shipboard missile systems to intercept highly agile maneuvering ASCMs and ASBMs. Metrics for this project are classified.\n- Integrated Active & Electronic Defense (IAED) technology basis for response combinations of active and electronic weapons & systems to optimize Pneg against ASBMs and ASCMs, including potential interactions. Metrics are classified. \n- Radar Resource Manager (RRM) algorithms and software for weapon control system capability to provide dynamic platform and force-level radar management and coordination of radar resources for integrated air and missile defense (IAMD). Metrics will be classified.\n- Non-FNC-related investigation of effects of charged particle layers on UHF to S-Band radars used to track space vehicles and initiate development of advanced electromagnetic decoy launchers and payloads.\n\nFY 2011 to FY 2012 funding increase reflects initiation of the RRM project.  The decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to new FNCs R2 activities titled Sea Shield and Sea Strike.  Efforts in these R2 activities have been continued from FY 2012 to FY 2013 into the new R2 activities to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.512"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed EDWC, NII and PCNW development efforts.\n- Initiated IAED project effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.208"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Initiate RRM project effort.\n- Initiate a capability to examine via analysis and modeling prototype electronic attack concepts against radars in expanded spectral bands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STOPPAGE OF LARGE SURFACE VESSELS AT SEA"
                                    },
                                    "Description": {
                                        "val": "The Chief of Naval Operations (CNO) in the Navy Strategic Plan (NSP) has specified that the Navy must combat Weapons of Mass Destruction (WMD) at sea and ashore. To support this requirement, the Navy must be able to temporarily stop ships that are suspected of carrying WMDs or their component materials. This activity addresses the development of key technologies that will enable the Navy to use non-lethal methods for temporarily stopping and delaying non-cooperative large, greater than 20 meters or 300 gross tons, vessels at sea that will not comply with voice commands or warning devices. The technologies will be deployable by ship or aircraft and should be capable of disabling the vessel at safe distances from high-valued assets and infrastructures. \n\nFY 2011 to FY 2012 funding decrease is due to completion of large-scale demonstrations. Funding zeroed in FY 2013 due to termination of further applied research in this investment area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.292"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued and completed analysis and modeling of hydrodynamic forces generated between a large vessel and much smaller intercept craft or Unmanned Surface Vehicle (USV).\n- Continued and completed a study to evaluate the required performance parameters of a vehicle capable of emplacing a package to externally inhibit seawater cooling flow to ship propulsion equipment.\n- Continued development of a submergible autonomous delivery and deployment capability for a device emplacement package to externally inhibit seawater cooling flow to ship propulsion equipment.\n- Continued and completed fabrication of a large-scale demonstration system for a large vessel momentum reduction device.\n- Initiated large-scale demonstrations of submergible autonomous device components to externally inhibit seawater cooling flow to ship propulsion equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.872"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete large-scale demonstrations of submergible autonomous device components to externally inhibit seawater cooling flow to ship propulsion equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Efforts include: signature reduction, hull life assurance, hydromechanics, distributed control for automated survivability (includes damage control), and advanced naval power systems. Signature reduction addresses electromagnetic, infrared, and acoustic signature tailoring, both topside and underwater. Hull life assurance addresses development of new structural system approaches for surface ships and submarines, including the management of weapons effects to control structural damage and the improvement of structural materials. Hydromechanics addresses hydrodynamic technologies, including the signature aspects of the hull-propulsor interface and maneuvering. Distributed intelligence for automated survivability addresses both the basic technology of automating machinery control systems, as well as, distributed control of systems utilizing autonomy for mission context based reconfiguration. Advanced naval power systems efforts address electrical and auxiliary system and component technology to provide improvement in energy and power density, operating efficiency and recoverability from casualties. Advanced Naval Power efforts include: Compact Power Conversion Technologies that reduce the cost of high power conversion equipment required to enable more-electric and all-electric ships. This activity also supports the Overseas Contingency Operations (OCO) Counter IED - Extramural activity which supports applied research for force protection of Naval platforms. Technologies are being developed that focus on prediction, prevention, detection, neutralization, and mitigation of improvised explosive devices in the maritime\/littoral environment.  Efforts for ONR Science Advisors are also funded in this R-2 Activity.\n\nFY 2011 to FY 2012 funding increase is due to expansion of the Counter-Improvised Explosive Devices (C-IED) program, initiation of FNCs in support of Enterprise and Platform Enablers (EPE) and Expeditionary Maneuver Warfare (EMW) pillars, UUV Power and Energy efforts and development of damage control technologies.  The decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from these R2 activities to new FNCs R2 activities titled Enterprise and Platform Enablers and Power and Energy.  Efforts in these R2 activities have been continued from FY 2012 to FY 2013 into the new R2 activities to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "52.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures\n- Continued advanced numerical acoustic codes (and gridding methods for those codes) for submarines.\n- Continued mmWave Signatures measurement to identify key signature characteristics.\n- Continued Alternating Current (AC) propagation experiments.\n- Continued the next generation Infrared Electro-Optic Visual (IR\/EO\/VIS) model for surface ships by development of mitigation strategy supporting low observable infrared platforms, development of supporting physics, and prototype measurement techniques.\n- Continued development of quiet control surface design tool based on control surface flow noise studies.\n- Continued IR and radar detectability prediction capability.\n- Continued surface ship super-conductive degaussing with laboratory demonstration loop for Electromagnetic (EM) field accuracy measurements and control methods.\n- Continued testing on Advanced Electric Ship Demonstrator (AESD) to assess energy propagation and acoustic radiation\nmechanisms and to develop mitigation concepts for surface ships.\n- Continued IR assessment of two advanced treatments.\n- Continued first of a series of IR validation experiments and critical sensitivity analysis.\n- Continued Improved Corrosion Related Magnetic (CRM) Field Prediction Model to design compensation systems to reduce\nship's CRM signature.\n- Continued assessment of ship biostatic Radar Cross Section (RCS).\n- Continued large-scale tests on AESD to develop signature prediction and design tools for surface ship incorporating a variety of propulsion technologies including external podded propulsion.\n- Continued experimental effort to characterize electric drive motor signature mechanisms and verify modeling and simulation approaches for signature prediction.\n- Continued development of modeling methods and noise control concepts for modular\/reconfigurable submarine architectures.\n- Continued investigation into hull treatment concepts for acoustic signature\/vibration control for surface ships.\n- Continued development of advanced RF metamaterials for platform signature control.\n- Continued development of signature modeling approaches for electric actuation and alternate electric drive system architectures.\n- Continued development of Low probability Intercept (LPI) technologies for surface ship emissions including communication, navigation, electronic warfare, and combat systems.\n- Initiated advanced EM modeling tools development and validation.\n- Initiated next generation deckhouse integration technology development.\n- Initiated modeling of hydroacoustics of turbulence-propulsor interaction.\n\nSurvivable Platforms - Hull Life Assurance\n- Continued development of global surface wave measurement capability for ship models.\n- Continued Dynamic Behavior of Composite Ship Structures (DYCOSS) (joint effort with Dutch Navy).\n- Continued development of structural analysis codes describing failure mechanism of sandwich composites.\n- Continued Explosion Resistant Coatings (ERC) effort, providing US input to trilateral agreement with UK and Australia.\n- Continued Joint US\/Japan Advanced Hull Materials & Structures Technology (AHM&ST) addressing hybrid hull concept and\nhybrid (steel\/composite) joints in ship construction.\n- Continued composite and composite-metal hull performance characterization and testing including structural loading, thermal stress and signatures.\n- Continued effort on an advanced class of polymers as a follow-on to current ERC for application against advanced threats, Overseas Contingency Operations (OCO).\n- Continued Payload Implosion and Platform Damage Avoidance efforts.\n- Continued development of reliability-based recoverability methods for assessing damaged ship structures.\n- Continued development of advanced analytical, numerical and experimental methods in support of platform signature reduction.\n- Initiated effort on exploitation of polymers for the deflection and dissipation of shock wave impact on ship and submarine hull structures.\n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability\n- Continued development of modeling and simulation methods for robust design and virtual testing of integration of shipboard auxiliary systems including their control systems.\n- Continued research into advanced HM&E system reconfiguration approaches, including agent-based control systems and\nalgorithms, and model-based reasoning.\n- Continued demonstration of Genetic Algorithm(s) for determining optimal distributed system control strategy.\n- Continued development of Survivability Analysis Algorithms Operable on a Total Ship Modeling Environment.\n- Completed initial demonstration of real-time modeling of multiple distributed systems - utilizing the small scale demonstrator.\n- Completed development of a hardware in-the-loop small scale demonstrator for fluid\/thermal\/electrical distributed systems.\n- Completed Second Generation distributed systems model development.\n- Initiated the transition of the small scale hardware-in-the-loop demonstrator to the academic community for challenge problem formulation.\n- Initiated demonstration of the developed model based reasoning control algorithms on full scale hardware test beds.\n\nAdvanced Platforms - Advanced Platform Concepts and Designs\n- Continued validation of asymmetric hull forms with experimental data.\n- Continued development of analytical models to further define submarine modular hull concepts.\n- Continued development of reliability based design and structural analysis code development.\n- Continued development design tools for integrated antenna and composite topside.\n- Continued circulation control analysis for three-dimensional flow effects.\n- Continued aperstructures microwave communication system.\n- Continued concept for Ultra High Frequency (UHF)\/Very High Frequency (VHF) aperstructures opportunistic array (Advanced Hull-form Inshore Demonstrator - AHFID).\n- Continued development of methods for determining reliability and vulnerability of aluminum ship structures.\n\nAdvanced Platforms - Hydromechanics\n- Continued experimental database\/computational tools development for extreme submarine maneuvers (e.g., crashback).\n- Continued the validation of circulation control and advanced control surfaces with experiments.\n- Continued to investigate improved maneuvering simulation capability for submarines.\n- Continued validation of Reynolds Average Navier-Stokes (RANS) code for advanced waterjet propulsor performance predictions.\n- Continued development of two-phase flow waterjet concept, Detached Eddy Simulation (DES) method for crashback prediction and numerical prediction method(s) of waterjet cavitation.\n- Continued modeling of turbulent flow interaction with propeller Leading Edge (LE) and Trailing Edge (TE) and modeling and simulation of rough-wall boundary layer noise.\n- Continued development of podded propulsor design\/analysis tools.\n- Continued prediction and validation of damaged stability and capsize.\n- Continued non-body-of-revolution tool development for advanced submarine configurations.\n- Continued the multi-platform interaction analysis and tool development.\n- Completed optimization for waterjet-hull interaction. \n- Completed tip-vortex cavitation inception and scaling modeling.\n- Completed modeling of shock performance on composite propeller.\n- Initiated modeling of performance of composite propellers in extreme maneuvers.\n\nAdvanced Naval Power Systems \n- Continued demonstration of dynamic stability of an advanced intelligent, reconfigurable, solid-state-based, zonal-electrical power system that reconfigures within 10 milliseconds.\n- Continued designing software for the system manager for the Universal Control Architecture (UCA).\n- Continued development of thermal management technology for shipboard power distribution.\n- Continued investigation of potential applications of silicon-carbide in future high voltage and high power applications.\n- Continued improvements in electrical component and device technology allowing a reduction in motor propulsion and motor controllers weight and volume.\n- Continued development of technologies to support dynamic reconfiguration of shipboard systems under conditions of stressing scenarios and\/or system degradation.\n- Continued multi-year program to directly convert thermal energy to electricity. Such a capability would allow elimination of the steam cycle on an electric warship.\n- Continued studies of alternative cooling systems for future shipboard radar systems.\n- Continued development of structural macroscopic 3-dimensional battery.\n- Continued development of pulsed power technologies to include pulsed alternators and capacitors.\n- Continued control surface actuator project focused on the technologies needed to define the design space for control surface actuators supporting submarines.\n- Continued development of automated HVAC system architectures for future Naval platforms.\n- Continued development of common universal stator design to accommodate varying rotor topologies to improve affordability of motor design and development.\n- Continued ship service fuel cell development.\n- Continued development of shipboard waste heat driven chiller systems.\n- Continued program to develop and demonstrate 3 - 50 kW class solid oxide fuel cell onboard mobile power generation\ncapabilities having compatibility with future logistics fuels to enable rapid recharge of batteries and direct power for C4ISR equipment.\n- Continued analytical model and reduced scale component development of power conversion technologies for multi-function\nmotor drives, bi-directional power conversion modules, and power management controllers focusing on closing technology gaps associated with Alternative Integrated Power System (IPS) Architectures.\n- Continued studies of advanced heating, ventilation, and air-conditioning architectures, including studies of alternative (nonvapor-compression) refrigeration systems and concepts for waste heat reuse, to enhance ship cooling and provide thermal energy storage.\n- Continued research into the development of fuel chemistries, materials, and energy conversion technologies for optimal\nperformance in Naval power systems.\n- Continued Electrically Actuated Submarine Control Surfaces FNC to develop electric actuation for submarine control surfaces.\n- Completed detailed design and breadboard demonstration of control surface actuator systems.\n- Completed electromechanical actuator noise source characterization activities.\n- Completed torque measurements on reduced scale models in support of electromechanical actuators.\n- Initiated fabrication of scaled control surface actuator systems under the FNC program.\n- Initiated fuel cell propulsion for unmanned systems.\n- Initiated energy programs in support of SECNAV Energy Goals including biofuels and ship energy efficiencies.\n- Initiated effort to develop energy storage and conversion devices (e.g., batteries, capacitors, fuel cells) that are critical to many military missions. \n\nSurface Ship & Submarine HM&E Applied Research\n- Continued efforts to expand counter-improvised explosive devices (C-IED) enhancement to support urger operational needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "82.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures\n- Continue all efforts of FY 2011.\n\nSurvivable Platforms - Hull Life Assurance\n- Continue all efforts of FY 2011.\n- Initiate effort on DDG51 hull modification for flight IV using hybrid hull concept to increase efficiency and provide BMD capability, larger Radar loads and additional power requirements.\n- Initiate effort on exploitation of polymers for the deflection and dissipation of shock wave impact on ship and submarine hull structures.\n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability\n- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete initial demonstration of real-time modeling of multiple distributed systems - utilizing the small scale demonstrator.\n- Complete development of a hardware in-the-loop small scale demonstrator for fluid\/thermal\/electrical distributed systems.\n- Complete Second Generation distributed systems model development.\n- Initiate the transition of the small scale hardware-in-the-loop demonstrator to the academic community for challenge problem formulation.\n- Initiate demonstration of the developed model based reasoning control algorithms on full scale hardware test beds.\n- Initiate development of simulations for optimal distribution of control objectives amongst computational resources.\n- Initiate development of simulations for the decomposition of control objectives for distributed solutions.\n- Initiate development of simulations for complexity and control for multiple, heterogeneous, interdependent, HM&E systems.\n- Initiate development of simulations for Information Theory and Information Entropy for control of HM&E systems.\n\nAdvanced Platforms - Advanced Platform Concepts and Designs\n- Continue all efforts of FY 2011.\n- Initiate efforts to provide relevant stealth technologies in accordance with Ohio Replacement mission and threat analysis. \n- Initiate efforts to provide technologies for the next generation Ohio Class submarine\n\nAdvanced Platforms - Hydromechanics\n- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete optimization for waterjet-hull interaction.\n- Complete tip-vortex cavitation inception and scaling modeling.\n- Complete modeling of shock performance on composite propeller.\n- Complete non-body-of-revolution tool development for advanced submarine configurations.\n- Initiate modeling of performance of composite propellers in extreme maneuvers.\n\nAdvanced Naval Power Systems\n- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete breadboard demonstration of control surface actuator systems.\n- Initiate efforts in support of the Electric Warship Power System program, including demonstrating MVDC System\n  Protection, Control and Stability, incorporating\/evaluating core D&I developments, demonstrating agent-based control \n  methods and providing design tools and multi-physics-based component models for MVDC design.\n- Initiate fuel cell propulsion for unmanned systems.\n- Initiate energy programs in support of SECNAV Energy Goals including biofuels and ship energy efficiencies.\n- Initiate development and demonstration of technology options for UUV energy systems.\n- Initiate efforts in support of Renewable-Sustainable Expeditionary Power FNC.\n- Initiate efforts in support of Long Endurance Undersea Vehicle Propulsion FNC.\n\nSurface Ship & Submarine HM&E Applied Research\n- Continue all efforts of FY 2011.\n- Continue efforts to expand the Counter-Improvised Explosive Devices (C-IED) enhancement to support urgent operational needs.\n- Initiate development of autonomous system to navigate through ship interior to locate and apply advanced damage control technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "78.812"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "78.812"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures \n- Continue all efforts of FY 2012. \n\nSurvivable Platforms - Hull Life Assurance \n- Continue all efforts of FY 2012, less those noted as completed above. \n- Initiate efforts on combinations of highly rate-sensitive materials through experiment and modeling for extreme hyper velocity threat conditions.\n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability \n- Continue all efforts of FY 2012. \n\nAdvanced Platforms - Advanced Platform Concepts and Designs \n- Continue all efforts of FY 2012. \n- Initiate large scale demonstration efforts of advanced mitigation technologies.\n\nAdvanced Platforms - Hydromechanics \n- Continue all efforts of FY 2012, less those noted as completed above. \n\nAdvanced Naval Power Systems \n- Continue all efforts of FY 2012. \n\nSurface Ship & Submarine HM&E Applied Research \n- Continue all efforts of FY 2012.\n- Increase emphasis of the Science Advisor engagement within the joint S&T community across DOD, which will focus on addressing the operational and strategic needs of the Fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ADVANCED ENERGETICS"
                                    },
                                    "Description": {
                                        "val": "Advanced Energetics efforts address technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns.  Goals include: advanced energetic materials for warheads, propellants, and reactive material based subsystems for both defensive and offensive applications.  Efforts include: development of new fuels, oxidizers, explosive ingredients and formulations; and reliable simulation tools and diagnostics to develop and design superior-performance, and\/or reduced-vulnerability systems tailored to specific warfighter missions.\n\nFY 2011 to FY 2012 funding decrease is due to the conclusion and transition of Advanced Energetics efforts in the areas of enhanced performance formulations, insensitive explosives, detonation merging techniques, and reactive materials. FY 2012 to FY 2013 funding increase is due to increased funding for advanced energetics materials efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.037"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Advanced Energetics research in technology development for the next generation reactive material warhead concepts(formulations, material properties, target interaction, lethality models, and experiments) for highly reactive materials, high density reactive materials and novel reactive structural materials.\n- Continued Advanced Energetics research in development and evaluation of advanced explosive\/propellant\/reactive ingredients and formulations for next generation higher performing systems.\n- Continued Advanced Energetics research in development of advanced directed hydro-reactive material warhead concepts to enhance performance of undersea warheads.\n- Continued proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. This work involves development of high quality, small particle energetic ingredients, novel processing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n- Continued Advanced Energetics research in advanced multiphase blast concepts employing dense metalized explosives to enhance performance of air and underwater blast warheads.\n- Continued Advanced Energetics research in development and diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application\n- Continued research in technology development for the next generation reactive material warhead concepts formulations, material properties, and energy release experiments) for highly reactive materials, high density reactive materials and novel reactive structural materials. Transition application specific target interaction, lethality modeling and ordnance specific experiments and demonstrations to Electromagnetic Rail Gun, PE 0603114N.\n- Continued development of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target. Limit efforts to analytical and laboratory scale proof of concept experimental efforts.\n- Continued development and evaluation of energetic ingredients and formulations for next generation higher performance applications. Conclude scale-up development and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.201"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete or terminate efforts associated with Energetics Applied Research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate processing optimization studies for MTX-1 (1-[(2E)-3-(1H-tetrazol-5-yl)triaz-2-en-1-ylidene] methanediamine), an additive to percussion primers.\n- Initiate the processing optimization design of material compositions for Reactive Material explosive fragment applications.\n- Initiate optimization and refinement studies of Poly NitratoOxetane (3-PNO) process for solid rocket motor propellants.\n- Initiate the development of a reliable chemical scale-up and material specification process techniques.\n- Initiate ultra-high density reactive material investigations (13 - 15 grams\/cc) for the next generation reactive material warhead material (formulations, material properties, target interaction, letality models, and experiments).\n- Continue Advanced Energetics research in development and evaluation of advanced explosive\/propellant\/reactive ingredients and formulations for the next generation higher performing systems.\n- Continue proof-of-concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance.\n- Continue Advanced Energetics research in development and diagnostics of novel energy conversion concepts.\n- Continue non-tradional energy conversion studies with columbic and cluster material investigations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL RESEARCH ENTERPRISE"
                                    },
                                    "Description": {
                                        "val": "The Naval Research Enterprise (NRE) is the in-house Independent Applied Research (IAR) efforts focused on solving a wide range of Naval Science and Technology (S&T) fleet issues utilizing the unique warfare center (WC) laboratory capabilities.  Efforts under this activity address the full spectrum of the DON S&T Strategic Plan technology focus areas that engage Naval aviation, sea surface, undersea, space, weapons, communication, information, and human systems. The IAR Program provides participating Naval Warfare Centers and Laboratories with in-house funding for: applied research to support the execution of their assigned missions; developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems; promoting the hiring and development of talented new scientists and engineers (S&E) with the insurance of proper mentoring with senior personnel; and encouraging collaboration with universities, private industry, and other Navy and Department of Defense laboratories.  Efforts are selected by Naval Warfare Centers Commanding Officers and Technical Directors each fiscal year through rigorous internal competition.  Efforts typically last two to three years, are generally designed to promote the investment in high-risk high-payoff research, and allow young S&Es to manage a Navy relevant research project.  A limited number of successful efforts developed under the basic research Program Element 0601152N are matured and further developed under the IAR program with the goal of transitioning these technologies to the warfighter.\n \nThis is a new R2 activity effective 2013, titled:  Naval Research Enterprise (NRE).  This activity consolidates all NRE related investments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete research for the Mitigation of Acute and Chronic spinal Pain in Naval Aircrew project by determining the efficacy of interventions to reduce neck and low back pain severity and incidence in a randomized controlled series of trials with U.S. Navy aircrew.\n\n-Complete research for Mid- to Long-Wavelength Infrared Optical Emitter Sources for Chemicals and Explosives Detection through the development of a high-performance long-wavelength infrared tunable laser that would enable a significant increase in standoff detection.\n\n- Complete research for Viscoelastic Materials Study for the Mitigation of Blast-Related Brain Injury where the investigation of viscoelastic polymers are identified for use as a helmet liner to protect the warfighter from exposure to blast pressure and reduce the incidence of blast-related Traumatic Brain Injury (TBI).\n\n-Complete research for the Development of a Solid Propellant Burning Rate Model to optimize the performance of Navy missiles by addressing: surface decomposition of propellant ingredients, gas-phase diffusion rates, reaction kinetics, particle-size, and the effects of pressure and initial temperature.\n\n-Continue research for Unmanned Sensor Network Concepts for Counter-Surveillance and Explosive Hazard Detection by investigating autonomy with imperfect perception, sensor and signal processing techniques supporting autonomy and battlefield sensing missions, and Human-Machine Interaction (HMI).\n\n-Continue research for Advanced Search and Tracking routines through the utilization and modification of advanced algorithms such as Maximum Likelihood Probabilistic Data Association Tracker (ML-PDA) and Moving-Source Matched Field Processing (MFP).\n\n-Continue research for sensors and ultra-low\/self-powered sensors for remote applications addressing sub-threshold hydrophones, undersea wireless networks, and communication networks.\n\n-Continue research for advanced energetic materials with significantly enhanced explosive yields (over HMX) while improving insensitivity characteristics such as shock and thermal stabilities.\n\n-Continue research for reduced drag on surface ship hull designs utilizing advanced computational analysis and hydrodynamic model testing addressing scaling effects due to non-dimensional parameters such as the Froude number.\n\n-Initiate research for the repair and repair process of Navy aircraft and ship alloys such as titanium and high-strength low-alloy steels.\n\n-Initiate research for warfighter performance predictions utilizing cognitive information and other human factors to enhance training experience and outcome.\n\n-Initiate research for highly accurate autonomous unmanned undersea vehicles (UUV) communication and navigation.\n\n-Initiate projects that are intended to be approximately two to three years in length.  Based on historical trends approximately 30% of these projects will turn over each year."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms.  Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of or produce a demand for inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.  Efforts funded in this PE also include energy programs in support of SECNAV energy goals and efforts in support of the Ohio Replacement program.\n\nSpecific examples of metrics under this PE include:\n- Torpedo defense thresholds will be validated by modeling and simulation to satisfy the overall system performance specification of a Probability of Survival (PS) of the US Navy platform as specified in the draft Capabilities Development Document (CDD) for Surface Ship Torpedo Defense.  \n- Additional metrics are included within the Missile Defense Activity description."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.797"
                        },
                        "CurrentYear": {
                            "val": "40.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "79.797"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "39.797"
                                        },
                                        "Text": {
                                            "val": "The Alternative Energy Research program addressed critical energy needs primarily for the Asia-Pacific region.  Technology areas pursued include renewable power generation (solar, wind, and ocean energy); alternative fuels, including biofuels and hydrogen; fuels cells and batteries for vehicle power and energy storage; advanced power management and models for micro-grids; energy efficient structures and platforms; and waste-to-energy.  The program incorporated and integrated energy research, education, and technology evaluations."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "40.000"
                                        },
                                        "Text": {
                                            "val": "The Alternative Energy Research program addressed critical energy technology needs to meet the Department of Navy's energy security and energy efficiency goals.  A key element of the program was the focus on sustainability in the Asia-Pacific region through alternative energy research, technology development and education.   Technology areas pursued include:  renewable power generation (solar, wind and ocean energy); alternative fuels (biofuels and hydrogen); fuel cells for unmanned vehicles and non-tactical ground vehicles; energy storage for grid management and stabilization; energy efficiency technologies and energy efficient structures; and waste-to-energy.  The program incorporated and integrated energy research, STEM (science, technology, engineering and mathematics) education and technology evaluation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}