{
    "id": "cca742463988d89e40a6fd271bfa690482c906c9",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207449F"
        },
        "ProgramElementTitle": {
            "val": "C2 Constellation"
        },
        "R1LineItemNumber": {
            "val": "157"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.039"
            },
            "CurrentYear": {
                "val": "17.254"
            },
            "BudgetYearOne": {
                "val": "18.086"
            },
            "BudgetYearOneBase": {
                "val": "18.086"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "16.808"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Cost to Complete and Total Cost for MDAP projects in this program element are documented in the R3. The Cost to Complete and Total Cost on the R2 are entered as \"Continuing\" and not reflective of the total cost for MDAP projects since the R2 does not account for prior years funding."
        },
        "ProgramElementMissionDescription": {
            "val": "The Command and Control Constellation (C2C) is the sole Air Force program for defining, developing, and assessing integrated effects of global, theater and tactical level Air Force air, space, and cyber Command and Control (C2) capabilities in support of the joint warfighter.  The Air Force faces a complex future where conflict will range across a broad spectrum of operations and lethality.  The Air Force requires capabilities with the maximum possible flexibility to deal with the widest possible range of conflict.\n\nThe C2C is the enabling program element for C2 Integration\/Modernization.  The Air Force is working to establish a C2 framework and architecture to be used as a unifying vision of command and control for each of the services core functions.  C2C will support:  C2, C2 of Intelligence, Surveillance, and Reconnaissance (ISR), integration by providing architectural analysis, prototyping, experimentation, innovation to develop cross-cutting solutions, and enable an improved \"sense-to-kill\" cycle time.  C2C innovations and experimentation provides strategic, operational, and tactical direction for Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) solutions to facilitate an integrated mission environment that support C2 planning and execution for air, space, and cyberspace.  In-depth development and analyses of C2 operational, systems, and technical architectures are geared towards identifying capability gaps, identifying required \"To Be\" information services, and evaluating C2 program planned improvements.  Through prototyping and experimentation, C2C will integrate rapidly developing technologies to promote common standards, data sharing, and information services across Air Force and joint warfighting applications to support joint enterprise solutions. \n \nProject 5078, Horizontal Integration (HI) conducts DOTMLPF analysis and assessments to guide cross-cutting, C2 sub-enterprise and cyberspace investment decisions that integrate USAF capabilities into joint and coalition operations.  HI identifies, prioritizes, and develops horizontally integrated solution recommendations to ensure the latest technologies and information services are integrated into a cross cutting C2 system that enables integrated effects in all warfighter domains.  The HI strategy will be validated by Headquarters, Air Force (HAF) to ensure that initiatives are harmonized with the most urgent warfighter needs described by the C2 Capability Assessment Team (CAT) and C2 Core Function Master Plan (CFMP).  Once validated, HI funds are applied toward identifying the most critical warfighter capabilities and ensuring they are horizontally integrated into both Air Force and joint C2 programs of record.\n\nProject 5140, Joint Expeditionary Force Experiments (JEFX) are agile and frequent innovation-focused experiments which lead to pre-fielded operational and technical assessments.  Constructive, live and virtual, operationally representative warfighter environments are created to support integration challenges which focus on critical C2 areas of interest that support the joint warfighter; including, C2 of ISR innovation that supports the air, space, and cyberspace domains.  JEFX provides the infrastructure and integration initiatives for experimentation with emerging operational concepts and attendant new technologies that fill operational gaps in Air Force capabilities to meet emerging and rapidly changing real world threats.  The JEFX strategy is validated and supported by Commander, Air Combat Command (COMACC) and coordinated with Headquarters, Air Force (HAF) ensuring initiatives are harmonized with the most urgent warfighter needs and validated requirements described in the AF Core Function Master Plans (CFMP) and supported through MAJCOM Core function Lead Integrator (CFLI).  JEFX initiatives are based on emerging CONOPS and warfighter challenges, important enablers of innovation and transformation, which are designed to support the themes and demonstrate emerging Air Force capabilities to deploy and employ decisive air, space and cyberspace power in support of the Joint Force.  \n\nThis program is in Budget Activity 7, Operational System Development, because these budget activities include development efforts to upgrade systems currently fielded or have approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.229"
                },
                "CurrentYear": {
                    "val": "18.102"
                },
                "BudgetYearOne": {
                    "val": "18.113"
                },
                "BudgetYearOneBase": {
                    "val": "18.113"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.039"
                },
                "CurrentYear": {
                    "val": "17.254"
                },
                "BudgetYearOne": {
                    "val": "18.086"
                },
                "BudgetYearOneBase": {
                    "val": "18.086"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.810"
                },
                "CurrentYear": {
                    "val": "-0.848"
                },
                "BudgetYearOne": {
                    "val": "-0.027"
                },
                "BudgetYearOneBase": {
                    "val": "-0.027"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.848"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.308"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.660"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.838"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.027"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11 Congressional General Reduction of 0.838M in Other Adjustment row.\n\nFY12 Congressional General Reduction (FFRDC, Sec. 8023) of 0.848M."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675078"
                    },
                    "ProjectTitle": {
                        "val": "Horizontal Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.541"
                        },
                        "CurrentYear": {
                            "val": "8.365"
                        },
                        "BudgetYearOne": {
                            "val": "8.477"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.477"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.455"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Horizontal Integration (HI) develops an integrated mission environment that supports cross-cutting solutions across the air, space, and cyberspace Command and Control (C2) warfighter domain.  HI activities include:  requirements, architecture, systems engineering, technology development, risk reduction, prototyping, and transition.  These activities are required to:  identify, design, develop, experiment, and implement C2 solutions supporting warfighting integration and interoperability needs which are not the sole responsibility of a specific program of record.  \n\nThe nature of integrated and interoperable C2 warfighting capabilities span multiple platforms and domains.  These capabilities are routinely being adjusted to meet the changing requirements from the warfighting communities.  The HI project is uniquely designed to look across platforms and domains enabling the Air Force to respond to the needs across the seams of individual systems.  These horizontal integration initiatives will be prototyped, assessed, appropriately captured in requirements documents and then transitioned to programs of record for production, fielding and sustainment.  \n\nSystems Engineering and analysis is the 'glue' that holds Command and Control Constellation (C2C) elements together and closes the seams in the C2 architectures.  Capability analysis identifies areas where interoperability can be improved within the Air Force, among joint services, and coalition partners.  Once capability issues are identified, they are prioritized and pilot initiatives are developed to provide solutions to the warfighter challenges to resolve the capability gaps.  The HI project also helps to competitively prototype integrated solutions against validated program requirements. \n\nThe benefits of these activities are two-fold:  the operational community is able to weigh the cost, risk, and performance trade-offs between enterprise solutions versus program centric solutions, and it supports competitive prototyping of all acquisition programs.  The synchronization of HI prototyping and program milestone requirements offers an effective environment for increasing interoperability while reducing the impact of this policy on multiple programs.  An infrastructure environment manages a continuous distributed operational environment that supports air, space, and cyberspace C2 and rapid acquisition, prototyping, development, integration, and fielding.  C2 initiatives may use this infrastructure to mature their development status prior to entry into JEFX for operational and technical suitability assessment. \n\nThe HI prototype performances are assessed for operational utility, and the most promising initiatives\/technologies will be matured and transitioned into weapon system configuration control baselines.  Requirement documents will be published and revised, and a requirements database and implementation plan identifying the most significant C2C net-centric integration issues will be updated to catalog the activities necessary to accomplish this integration. \n\nIn addition, this project supports concept exploration, program definition\/risk reduction efforts, and studies that support continuous improvements in C2; including but not limited to:  C2 of Intelligence, Surveillance and Reconnaissance (ISR), Remotely Piloted Aircraft (RPA) standards, cyber vulnerabilities, improvements to Air Force Processing Exploitation and Dissemination (PED), imagery and radar development, and interoperability with Joint Service, Allied and Coalition systems.  Activities also include studies and analysis to support both current program planning and execution, as well as future program planning.\n\nThis program is in Budget Activity 7, Operational System Development, because these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Reqmts\/ CBP\/ Integrated Ops\/ C2 Framework"
                                    },
                                    "Description": {
                                        "val": "Requirements\/Capabilites Based Planning (CBP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.503"
                                            },
                                            "Text": {
                                                "val": "Developed and documented integrated Command and Control (C2) requirements for Integrated Air and Missile Defense (IAMD). Analyzed and documented emerging Air Force (AF) C2 requirements. Focused on the future C2 integration\/modernization strategy; integration of material sources with theater support in the Langley Air Force Base Operations Support Center (OSF). Concentrated efforts on Integrated Operating Environment (IOE) Space, IOE Electronic Warfare Battle Management, IOE Targeting, IOE Agile Combat Support and Joint Air Ground Integration Cell (JAGIC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Text": {
                                                "val": "Refine Integrated Air and Missile Defense (IAMD) C2 requirements.  Continue future C2 integration\/modernization strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.852"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.852"
                                            },
                                            "Text": {
                                                "val": "Will analyze, develop, and document emerging Air Force (AF) integrated Command and Control (C2) requirements. Will continue future C2 integration\/modernization strategy in a series of concept and\/or capability development and technology exploration activities designed to integrate C2 operations across air, space, and cyberspace domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arch and SE"
                                    },
                                    "Description": {
                                        "val": "Architecture Development and Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.499"
                                            },
                                            "Text": {
                                                "val": "Continued functional and engineering analysis within Command and Control, Intelligence, Surveillance, and Reconnaissance (C2ISR) community. Emphasized Air-Ground Modernization, C2 of Intelligence, Surveillance, and Reconnaissance (ISR) Integration, Dynamic ISR management, and C2 of cyber requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.364"
                                            },
                                            "Text": {
                                                "val": "Continue technical expertise support of functional and engineering analysis within the C2 community. Specific emphasis on Air-Ground Modernization and C2 of ISR Integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.738"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.738"
                                            },
                                            "Text": {
                                                "val": "Will continue functional and systems engineering analysis within the C2 community to flesh out technical architectures and their relationships to operational architectures within the warfighting environment. Specific focus areas and efforts will depend on real world needs, C2 enterprise and C2 of cyber requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis Integ and SE"
                                    },
                                    "Description": {
                                        "val": "Analysis Integration and Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.805"
                                            },
                                            "Text": {
                                                "val": "Continued analysis and integration efforts. Specific focus areas and effort piloted real world needs and C2ISR enterprise requirements.  Continued analysis and transition of the prototype capability developed in previous years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.519"
                                            },
                                            "Text": {
                                                "val": "Complete analysis and integration efforts. Specific focus areas are tailored to real world needs, the C2 enterprise, and C2 of Cyber requirements. Complete the analysis and transition of prototype capability developed in previous years."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ops-Tech Analysis-Concept Dev't"
                                    },
                                    "Description": {
                                        "val": "Ops\/Tech Analysis and Concept Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.438"
                                            },
                                            "Text": {
                                                "val": "Developed an Integrated Operational Environment (IOE) capability that improved mobility force integration theater planning efforts. Prototyped a capability for in-transit visibility of Global Strike assets for 8AF. Investigated a multi-level security solution that integrated ISR mobility and weather data that supported political\/military operations. Continued the development of an IOE concept to guide AF integration of Command and Control (C2) and provided the necessary material and non-material capabilities that enabled the efficient cross-functional domain flow of monitoring, assessment, planning and execution data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.533"
                                            },
                                            "Text": {
                                                "val": "Complete the modernization of the Command and Control (C2) center programs. Enable a collaborative Integrated Operating Environment (IOE) to present, plan, and execute AF capabilities in support of Joint operations. Improve and complete real time information exchange through the planning and execution phases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HI Solutions Assessments"
                                    },
                                    "Description": {
                                        "val": "Horizontal Integration Solutions Assessment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.296"
                                            },
                                            "Text": {
                                                "val": "Selected HI initiatives for execution that fostered enterprise integration across C2ISR programs and supported the DoDI 5000.02 requirements for competitive prototyping.  Initiatives selected for funding in FY11 included:  Extension to support of near-term Cyber integration for situation Awareness (Map The Mission); Extended capabilities for Air-Ground Modernization to integrate AF systems like Theatre Battle Management Core Systems (TBMCS) with a number of Army systems that shared air space information; and gap filling capabilities that addressed shortcomings during operator experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.299"
                                            },
                                            "Text": {
                                                "val": "Continue the selection of HI initiatives for execution that will foster enterprise integration across C2 and C2 of cyber programs and support the DoDI 5000.02 requirement for competitive prototyping. After the data call is issued and the submissions evaluated, the selected initiatives will be funded for execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.887"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct annual selection of HI initiatives for new execution or continuation that will:  a. foster enterprise integration across C2 and extend an Integrated Operating Environment, b. support the DoDI 5000.02 requirements for competitive prototyping and c. aid in refining requirements. Key criteria are near-term warfighter impact and likelihood of transition. Potential initiatives will be evaluated late third\/fourth quarter, and the selected initiatives will be funded for execution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project uses full and open competition for operational requirements document creation, systems engineering & architecture development, modeling & simulation and experimentation, joint interoperability\/integration, and horizontal integration approaches."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Requirements\/Capability Based Planning (CBP)\/ GAPS\/AWS Horizontal Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.335"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements\/Capability Based Planning (CBP)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Langley AFB, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.814"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements\/Capability Based Planning (CBP)(2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Langley AFB, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.178"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements\/CBP\/Assessment\/Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT\/LL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.063"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture Development and Systems Engineering\/ GAPS\/AWS Horizontal Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.489"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.466"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.466"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture Development and Systems Engineering\/ GAPS\/AWS Horizontal Integration (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Langley AFB, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.740"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.740"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Analysis, Integration, and SE\/Capability Roadmaps (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.895"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Analysis and Concept Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.437"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.107"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.490"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.490"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Analysis and Concept Development (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.915"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Horizontal Integration Solution Assessment (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.917"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.972"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.120"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.120"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Horizontal Integration Solution Assessment (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs ETASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Horizontal Integration Solution Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.589"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.253"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.253"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Assessment - 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs, ETASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.025"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Support Assessment - 4"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Spectrum"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.545"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support-1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech PASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.468"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support-2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs ETASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.367"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207449F_BPAC_675078_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Requirements\/Capability Based Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Integrated Ops Environment and C2 Framework"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Architecture Development and Systems Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Analysis (Integration\/Ops\/Tech) and Systems Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Horizontal Integration Solutions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675140"
                    },
                    "ProjectTitle": {
                        "val": "Joint Expeditionary Force Experiments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.498"
                        },
                        "CurrentYear": {
                            "val": "8.889"
                        },
                        "BudgetYearOne": {
                            "val": "9.609"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.609"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.353"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Expeditionary Force Experiments (JEFX) and supporting Limited Objective Experiments (LOEs) are warfighter integration and validation experiments that address operational challenges and are part of the Air Force (AF) Command and Control (C2) integration and experimentation enterprise. Activities include:  support to C2 aspects of the AF Integrated Air and Missile Defense (IAMD) mission, Remotely Piloted Aircraft (RPA)\/Non-Traditional ISR (NTISR), Homeland Defense (HLD), as well as C2 Integration and Modernization. JEFX provides continued integration and experimentation efforts across the AF C2 seams and programs in air, space and cyber domains as defined by CORONA, HQ AF, and the AF Command and Control Integration Center (AFC2IC).\n\nJEFX\/LOE activities explore significant capability gaps across the range of Air Force Command and Control (C2) by means of assessing Concept of Operations (CONOPS), Tactics, Techniques and Procedures (TTPs) and materiel solutions. The activities address critical lessons learned from recent operations and the validated requirements described in the AF Core Function Master Plans (CFMP) and supported through MAJCOM Core Function Lead Integrator (CFLI). JEFX creates and uses representative-experiment enterprise warfighter environments to address joint and coalition warfighter gaps and shortfalls that demonstrate existing and emerging Air Force capabilities to deploy and employ decisive air, space and cyberspace power for the Joint Force Commander and enable innovation and transformation. These unique missions are the major reason JEFX is an experiment and not simply a demonstration or exercise. Activities also include studies and analyses to support current program planning and execution, as well as future program planning.\n\nThis program is in Budget Activity 7, Operational System Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Requirements Identification and SE"
                                    },
                                    "Description": {
                                        "val": "Spiral develop systems architecture, systems engineering, and integration of initiatives into a cohesive system of systems process"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.673"
                                            },
                                            "Text": {
                                                "val": "Continued JEFX 2011 (JEFX 11) experimentation efforts with focus on tactical and strategic architectures, communications, systems, and Tactics, Techniques, and Procedures (TTPs) affected by loss or disruption of space signals due to atmospheric or intentional factors; evaluated effects and refined technologies; TTPs improved AF contributions to the joint warfighters assuring mission assurance in a contested environment. Increased rapid spiral fielding in support of tactical operations; airborne communication integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.921"
                                            },
                                            "Text": {
                                                "val": "Continue support for Architecture, Systems Engineering (SE), and JEFX activities.  JEFX 2012 (JEFX 12) LOEs focus on the four issues outlined per CORONA Fall 2009 direction:  1) Lack AF-wide IAMD knowledge & emphasis—strategic to tactical; 2) Significant Commanders Numbered Air Force (C-NAF) organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors and C2 systems lack integration with joint partners. To address these issues, JEFX will initiate integration of the Ballistic Missile Defense (BMD) systems and process initiatives into the Air Operations Center (AOC) Weapons System with the goal of full integration into the Joint Counter Air Mission capabilities as relevant operational scenarios for JEFX 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.225"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.225"
                                            },
                                            "Text": {
                                                "val": "Will continue integration and experimentation across Air Force (AF) C2 seams and programs in air, space and cyber domains as defined by CORONA, HAF, and AFC2IC. JEFX 2013 (JEFX 13) will complete Integrated Air and Missile Defense (IAMD) efforts and then begin to provide some support for C2 of Remotely Piloted Aircraft (RPA)\/Non-Traditional ISR (NTISR)and other C2 Integration\/Modernization activities to include requirements identification, systems engineering of initiatives and limited objective experiments (LOEs) focusing on the integration of C2 services. Requirements validation will be established in MAJCOM-directed CFMP processes to connect warfighter needs to initiative identification. In addition to validating materiel solutions, experimentation will add value by recommending changes to standing or new concepts of employment, concepts of operations, tactics, techniques and procedures (TTPs), in conjunction with the Programs of Record and Centers of Excellence for Tactics, Doctrine, Operations, and Education. The experimentation team may perform either an operational utility and\/or a technical assessment which feeds final experimentation products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Plan and Design"
                                    },
                                    "Description": {
                                        "val": "Plan, design, coordinate, assess and report the JEFX experiments,  provide expertise to support initiative selection, acquisition, program management, communications and systems planning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.964"
                                            },
                                            "Text": {
                                                "val": "Continued experimentation efforts with focus on tactical and strategic architectures, communications, systems, and TTPs affected by loss or disruption of space signals due to atmospheric or intentional factors; evaluated effects and refined technologies, aimed at improving AF contributions to the Joint Warfighters to assure mission assurance in a contested environment. Increased focus on rapid spiral fielding in support of tactical operations; airborne communication integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.263"
                                            },
                                            "Text": {
                                                "val": "Continue support for plan & design activities.  JEFX 12 LOEs will focus on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge & emphasis—strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars \/ sensors and C2 systems lack integration with joint partners. To address these issues, JEFX will initiate integration of the BMD systems, other technology, and process initiatives into the AOC Weapons System with the goal of full integration into the Joint Counter Air Mission capabilities. Also initiate the Air Sea Battle concept as the relevant operational scenario for JEFX 12. Initiate the Air Sea Battle concept as the relevant operational scenario for JEFX 12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.743"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.743"
                                            },
                                            "Text": {
                                                "val": "JEFX will leverage AF and joint sponsored experimentation events (i.e. AGILE Fire, Coalition Warfighter Interoperability Demonstration (CWID), Trident Warrior, etc.) when and where feasible. JEFX will develop internally-generated, stand-alone events employing simulation facilities, as necessary. Limited engineering capability will be available to support attendance at external venues as well as hosting\/building internal events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Develop Initiatives"
                                    },
                                    "Description": {
                                        "val": "Develop initiatives to introduce new technologies and operational capabilities into the Aerospace Expeditionary Force (AEF) Concept of Operations (CONOPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.545"
                                            },
                                            "Text": {
                                                "val": "Continued experimentation efforts with focus on tactical and strategic architectures, communications, systems, and TTPs affected by loss or disruption of space signals due to atmospheric or intentional factors; evaluating effects and refining technologies, TTPs aimed at improving AF contributions to the Joint Warfighters assuring mission assurance in a contested environment.  Increased the focus on rapid spiral fielding in support of tactical operations; airborne communication integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.338"
                                            },
                                            "Text": {
                                                "val": "Continue support for initiative development. JEFX 12 LOEs will focus on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge & emphasis—strategic to tactical; 2) Significant Commander -Numbered Air Force (C-NAF) organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors and C2 systems lack integration with joint partners. To address these issues, JEFX will initiate integration of the Ballistic Missile Defense systems\/other technology and process initiatives into the Air Operations Center Weapons System with the goal of full integration into the Joint Counter Air Mission capabilities. Also initiate the Air Sea Battle concept as the relevant operational scenario for JEFX 12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.337"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.337"
                                            },
                                            "Text": {
                                                "val": "JEFX will sponsor initiatives that are primarily industry based with focus on leveraging existing government and commercial technologies to address a specific integration shortfall. Some initiatives will be developed by the HI portion of this program with specific interest in operational and\/or technical utility. These requirements driven experiments support the programs of record by examining; a. integration of incremental program improvements, b. potential candidates for upcoming program selection, and c. potential rapid fielding integration and other transition efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Define and Build Events"
                                    },
                                    "Description": {
                                        "val": "Implement architectural configuration, conduct M&S, install and test the communications infrastructure and execute the experiment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.142"
                                            },
                                            "Text": {
                                                "val": "Continued experimentation efforts with focus on tactical and strategic architectures, communications, systems, and TTPs affected by loss or disruption of space signals due to atmospheric or intentional factors; evaluated effects and refined technologies, TTPs aimed at improved AF contributions to the Joint Warfighters assuring mission assurance in a contested environment.  Increased focus on rapid spiral fielding in support of tactical operations; airborne communication integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.265"
                                            },
                                            "Text": {
                                                "val": "Continue support for Architecture Implementation  activities.  JEFX 12 LOEs will focus on the 4 issues outlined per CORONA Fall 2009 direction:  1) Lack AF-wide Integrate Air and Missile Defense (IAMD) knowledge & emphasis—strategic to tactical; 2) Significant Commander - Numbered Air Force (C-NAF) organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors, C2 systems lack integration with joint partners. To address these issues, JEFX will initiate integration of the Ballistic Missile Defense (BMD) systems & other technology, and process initiatives into the Air Operations Center Weapons System with the goal of full integration into the Joint Counter Air Mission capabilities. Also initiate the Air Sea Battle concept as the relevant operational scenario for JEFX 12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.181"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the migration of the JEFX program from a major venue to a series of LOE venues with focus on initiative integration and systems engineering to combine initiatives with either AF\/Joint sponsored of stand-alone events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assessment and Transition"
                                    },
                                    "Description": {
                                        "val": "Transition successful JEFX-assessed, and Air Force approved, warfighting capabilities for fielding into an integrated C2 baseline"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.174"
                                            },
                                            "Text": {
                                                "val": "Continued experimentation efforts with focus on tactical and strategic architectures, communications, systems, and TTPs affected by loss or disruption of space signals due to atmospheric or intentional factors; evaluated effects and refining technologies, TTPs aimed at improved AF contributions to the Joint Warfighters assuring mission assurance in a contested environment.  Increased focus on rapid spiral fielding in support of tactical operations; airborne communication integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.102"
                                            },
                                            "Text": {
                                                "val": "Continue support for Transition activities.  JEFX 12 LOEs will focus on the four issues outlined per CORONA Fall 2009 direction:  1) Lack AF-wide IAMD knowledge & emphasis—strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors, C2 systems lack integration with joint partners. To address these issues, JEFX will initiate integration of the BMD systems & other technology and process initiatives into the AOC Weapons System with the goal of full integration into the Joint Counter Air Mission capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.123"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.123"
                                            },
                                            "Text": {
                                                "val": "The program transition under the JEFX Limited Objective Experiments (LOEs) paradigm will change significantly from a long-lead plan to a near-term transition with the Programs of Record or initiative sponsor. This paradigm will continue to focus upon the initiative's transition with validation through operational and technical assessments. It places a much higher priority under the new JEFX scheme to ensure technical and operation transition is possible upon completion of JEFX."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JEFX supports evolutionary acquisition of multiple programs by providing venues and initiatives to experiment new and emerging technologies to be integrated into other systems-of-record."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Requirements Identification and SE"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.900"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.458"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.854"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.854"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements Identification and SE (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.426"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.051"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements Identification and SE (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Spectrum"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.869"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.358"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.244"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.244"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.992"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.052"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hurlburt Field, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.780"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.843"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.244"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.244"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design (3)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacob Sverdrup"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hurlburt Field, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.300"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop Initiatives"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.639"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.763"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.763"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop Initiatives (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.711"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.367"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.252"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop Initiatives (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.456"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.496"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.179"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.179"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.189"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.215"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.215"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "98 RANWG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Nellis AFB, NV"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.225"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (3)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.882"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.504"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.378"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.378"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (4)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.593"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (5)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFC2IC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hampton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.982"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assessment and Transition"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.165"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assessment and Transition (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.052"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Experiment Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech PASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.450"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.285"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207449F_BPAC_675140_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Requirements Identification and System Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Plan and Design"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Initiatives"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Define and Build Events"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Assessment and Transition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Experiments\/Product Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}