{
    "id": "cdfb28a839efba64162e7c6b4b0b9f885e9ffb98",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602304E"
        },
        "ProgramElementTitle": {
            "val": "COGNITIVE COMPUTING SYSTEMS"
        },
        "R1LineItemNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "81.796"
            },
            "CurrentYear": {
                "val": "49.365"
            },
            "BudgetYearOne": {
                "val": "30.424"
            },
            "BudgetYearOneBase": {
                "val": "30.424"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "24.405"
            },
            "BudgetYearThree": {
                "val": "24.832"
            },
            "BudgetYearFour": {
                "val": "15.927"
            },
            "BudgetYearFive": {
                "val": "15.751"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Cognitive Computing Systems program element is budgeted in the Applied Research budget activity because it is developing the next revolution in computing and information processing technology that will enable computational systems to have reasoning and learning capabilities and levels of autonomy far beyond those of today's systems.  The ability to reason, learn and adapt will raise computing to new levels of capability and powerful new applications. \n\nThe Cognitive Computing project will develop core technologies that enable computing systems to learn, reason and apply knowledge gained through experience, and respond intelligently to things that have not been previously encountered.  These technologies will lead to systems demonstrating increased self-reliance, self-adaptive reconfiguration, intelligent negotiation, cooperative behavior and survivability with reduced human intervention.\n\nThe Collective Cognitive Systems and Interfaces project will dramatically improve warfighter and commander effectiveness and productivity using advanced cognitive approaches that enable faster, better informed, and more highly coordinated actions than those of our enemies.  This will be accomplished by developing revolutionary methods that increase our information processing capabilities, enhance our situational awareness, and enable more cohesive group action by our forces.  Critical technical areas addressed in this project include automated coordinated decision support, information sharing, and ensured communications."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "90.143"
                },
                "CurrentYear": {
                    "val": "49.365"
                },
                "BudgetYearOne": {
                    "val": "46.424"
                },
                "BudgetYearOneBase": {
                    "val": "46.424"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "81.796"
                },
                "CurrentYear": {
                    "val": "49.365"
                },
                "BudgetYearOne": {
                    "val": "30.424"
                },
                "BudgetYearOneBase": {
                    "val": "30.424"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.347"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-16.000"
                },
                "BudgetYearOneBase": {
                    "val": "-16.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.458"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-6.069"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.320"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-16.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-16.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Decrease reflects reductions for the Section 8117 Economic Adjustment, rescissions and the SBIR\/STTR transfer, offset by internal below threshold reprogrammings.\nFY 2013: Decrease reflects transfer of the Detection and Computational Analysis of Psychological Signals (DCAPS) program to PE 0602115E, Biomedical Technology."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "COG-02"
                    },
                    "ProjectTitle": {
                        "val": "COGNITIVE COMPUTING"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.546"
                        },
                        "CurrentYear": {
                            "val": "15.674"
                        },
                        "BudgetYearOne": {
                            "val": "13.542"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.542"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.578"
                        },
                        "BudgetYearThree": {
                            "val": "8.840"
                        },
                        "BudgetYearFour": {
                            "val": "8.840"
                        },
                        "BudgetYearFive": {
                            "val": "8.703"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cognitive Computing project will develop core technologies that enable computing systems to learn and apply knowledge gained through experience, and to respond intelligently to new and unforeseen events.  These technologies will lead to systems with increased self-reliance, cooperative behavior, and the capacity to reconfigure themselves and survive with reduced programmer intervention.  These capabilities will make the difference between mission success and mission degradation or failure, even in the event of cyber-attack or component attrition resulting from kinetic warfare or accidental faults and errors.  Systems that learn and reason will reduce the requirement for skilled system administrators and dramatically reduce the overall cost of system maintenance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Robotic Manipulation (ARM)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Robotic Manipulation (ARM) program is developing advanced robotic technologies that will enable autonomous (unmanned) mobile platforms to manipulate objects without human control or intervention.  A key objective is intelligent control of manipulators to independently perform subtasks over a broad range of domains of interest to the warfighter, thereby reducing operator workload, time on target, training time, bandwidth, and hardware complexity.  Current manipulation systems have many limitations.  For example, while they perform well in certain mission environments, they have yet to demonstrate proficiency and flexibility across multiple mission environments; they require burdensome human interaction and the full attention of the operator; and the time required to complete tasks generally exceeds military users' desires.  ARM will create manipulators with a high degree of autonomy capable of serving multiple military purposes across a wide variety of application domains including, but not limited to, counter-improvised explosive device, countermine, search and rescue, weapons support, checkpoint and access control, explosive ordnance disposal, and combat casualty care (including battlefield extraction).  ARM will enable autonomous manipulation systems to surpass the performance level of remote manipulation systems that are controlled directly by a human operator."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.472"
                                            },
                                            "Text": {
                                                "val": "-  Developed manipulation primitives for handling a variety of objects, such as opening a door lock or a satchel.\n-  Developed kinesthetic search techniques based on tactile and haptic sensing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.674"
                                            },
                                            "Text": {
                                                "val": "-  Develop a bi-manual manipulator platform by adding a second arm to the existing manipulator system, and demonstrate operation within a larger workspace and handling of articulated objects such as pliers and scissors.\n-  Develop algorithms that enable head tracking of the task objects to accelerate completion time and increase robustness to change."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.542"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.542"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate algorithms for autonomous grasping of complex objects, such as the handle of an ammunition box.\n-  Develop and demonstrate algorithms for autonomous bimanual manipulation, such as zipping open a satchel bag and extracting an object."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personalized Assistant that Learns (PAL)"
                                    },
                                    "Description": {
                                        "val": "The Personalized Assistant that Learns (PAL) program enabled intelligence in information processing systems so critical DoD systems can better support the warfighter.  PAL systems have embedded learning capabilities that allow them to retain prior learned knowledge, apply this knowledge to new scenarios and ultimately provide faster and more effective assistance.  Cognitive systems technologies developed in this program will be applied and demonstrated in ongoing and future Command and Control Systems programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.041"
                                            },
                                            "Text": {
                                                "val": "-  Integrated PAL technology in version Battle Command-10 (BC-10) of the U.S. Army's Command Post of the Future (CPOF), demonstrated enhanced overall effectiveness and efficiency for BC-10 users, and transitioned to numerous operational units."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foundational Learning Technology"
                                    },
                                    "Description": {
                                        "val": "The Foundational Learning Technology program developed advanced machine learning techniques that enable cognitive systems to continuously learn, adapt and respond to new situations by drawing inferences from past experience and existing information stores.  Techniques addressed diverse machine learning challenges in processing of sensory inputs, language acquisition, combinatorial algorithms, strategic analysis, planning, reasoning, and reflection.  Modeling human language acquisition by associating words with the real-world entities perceived through multiple modes of sensory input enabled computers to associate real world objects and events with linguistic information and use this language facility for reasoning and planning.  This enabled computers to comprehend the physical world and its linguistic representations which will constitute a building block for the development of advanced computer reasoning capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.033"
                                            },
                                            "Text": {
                                                "val": "-  Implemented and tested machine learning approaches on selected problems in processing of sensory inputs, language acquisition, strategic analysis, planning, reasoning, and reflection.\n-  Developed a platform for visual and tactile input to ground concepts such as objects and actions for language learning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomimetic Computing"
                                    },
                                    "Description": {
                                        "val": "Biomimetic Computing's goal was to develop the critical technologies necessary for the realization of a cognitive artifact comprised of biologically derived simulations of the brain embodied in a mechanical (robotic) system, which is further embedded in a physical environment.  These devices represent a new generation of autonomous flexible machines that are capable of pattern recognition and adaptive behavior and that demonstrate a level of learning and cognition.  Key enabling technologies include simulation of brain-inspired neural systems and special purpose digital processing systems designed for this purpose."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated an autonomous robot with a simulated neural system capable of grasping a three-dimensional object as it enters the visual field and performing a mental rotation task on visual patterns by utilizing working memory."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "COG-03"
                    },
                    "ProjectTitle": {
                        "val": "COLLECTIVE COGNITIVE SYSTEMS AND INTERFACES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.250"
                        },
                        "CurrentYear": {
                            "val": "33.691"
                        },
                        "BudgetYearOne": {
                            "val": "16.882"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.882"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.827"
                        },
                        "BudgetYearThree": {
                            "val": "15.992"
                        },
                        "BudgetYearFour": {
                            "val": "7.087"
                        },
                        "BudgetYearFive": {
                            "val": "7.048"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Collective Cognitive Systems and Interfaces project will dramatically improve warfighter and commander effectiveness and productivity using advanced cognitive approaches that enable faster, better informed, and more highly coordinated actions than those of our enemies.  This will be accomplished by developing revolutionary methods that increase our information processing capabilities, enhance our situational awareness, and enable more cohesive group action by our forces.  Critical technical areas addressed in this project include automated decision support, information sharing, ensured communications, and advanced informatics.  Cognitive decision support tools reason about tasks, timings, and interactions so that when plans change or the enemy does not respond as anticipated, U.S. forces can quickly adapt.  The quality of such decisions and the effectiveness of our actions depend critically on our ability to take full advantage of all available information in a rapid and flexible manner.  This requires the capability to share information and to automatically integrate distributed information bases for broad tactical battlespace awareness.  Finally, the use of advanced informatics will help guide user's to information most relevant to them, assist caregivers with treatment, destigmatize the psychological health process, and help alert DoD to emerging psychological health trends and crises.  The suite of programs under this project will significantly advance the military's ability to successfully deal with complex situations in operational environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transformative Apps"
                                    },
                                    "Description": {
                                        "val": "Transformative Apps will create the information infrastructure required to enable mission support and tactical applications (apps) to meet the efficiency, security, and availability requirements for use on mobile military networks.  Of particular importance is development of a new data synchronization architecture between the handhelds and the backend computing\/storage nodes.  Additionally, appropriate middleware services and libraries will be developed to facilitate shared capabilities such as map viewing, apps management, and collection of logs, usage statistics and user feedback.  Apps, together with handhelds and networks, will be tested in different training environments as well as in deployed environments.  Performance and usage will be carefully tracked and user feedback collected to guide rapid enhancement of apps.  The effort will create a military apps development community by reaching out to non-traditional performers and will explore new models for software acquisition based on end-user empowerment.  The effort will leverage the resources, experience, and lessons-learned derived from the Tactical Ground Reporting System (TIGR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial set of middleware services and tools.\n-  Developed initial tactical apps suite available on a beta repository.\n-  Deployed 500+ Android handhelds and developed 20 customized and integrated apps to users in theater and completed training.\n-  Initiated partnership to transition the software and agile processes to Army Net Warrior baseline efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.502"
                                            },
                                            "Text": {
                                                "val": "-  Continue operational trial in theater.\n-  Conduct evaluations with secure network infrastructure.\n-  Enhance middleware and services for apps.\n-  Demonstrate apps code screening and vetting process.\n-  Develop tools for non-experts to create apps on smartphone platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.882"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.882"
                                            },
                                            "Text": {
                                                "val": "-  Integrate and test with military tactical radio networks (e.g., Wireless Network After Next).\n-  Demonstrate interoperability with Army Joint Capability Release system on mounted platforms.\n-  Develop and deploy the apps certification process with Army users.\n-  Expand app library and initiate transition to program of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection and Computational Analysis of Psychological Signals (DCAPS) - Medical*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Healing Heroes - Medical\n\nThe Detection and Computational Analysis of Psychological Signals (DCAPS) program will develop automated information systems that identify group and individual trends indicative of post-traumatic stress disorder (PTSD) and traumatic brain injury (TBI), anomaly detection algorithms to identify emerging physical and psychological crises, and provide guided access to information and educational materials.  This will complement commercial on-line resources, interactive media, and social networks that supplement traditional healthcare options but have not focused on issues specific to the warfighter.  DCAPS recognizes that security and privacy are critical to user acceptance and Health Insurance Portability and Accountability Act compliance and so will incorporate strong authentication and other security mechanisms as needed to protect patient data.  The program will also develop partnerships with key DoD organizations working in this area, including the Defense Centers of Excellence for Psychological Health and Traumatic Brain Injury, the Defense Medical Research and Development Program, the Army Telemedicine & Advanced Technologies Research Center, and the National Center for TeleHealth and Technology.  This effort will be funded in PE 0602115E, Biomedical Technology beginning in FY 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.750"
                                            },
                                            "Text": {
                                                "val": "-  Developed features and a classifier framework for detecting psychological distress symptoms from on-line text-based interactions.\n-  Initiated development of a mobile device application with integrated privacy safeguards for assessing psychological health status in real-time.\n-  Formulated a general approach to optimally combining multiple psychological health indicators using semantic techniques and Bayes nets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.079"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of a mobile device psychological health application with integrated privacy safeguards.\n-  Develop additional psychological telehealth applications that integrate multiple psychological health indicators such as so called \"honest signals\".\n-  Develop plans for user trials of mobile psychological health and telehealth applications in coordination with transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graph Understanding and Analysis for Rapid Detection - Deployed On the Ground (GUARD DOG)"
                                    },
                                    "Description": {
                                        "val": "The Graph Understanding and Analysis for Rapid Detection - Deployed On the Ground (GUARD DOG) program will develop an integrated system to provide real-time data collection and analysis of patrol-based civilian interviews and field observations to facilitate understanding of the local and regional political, social, economic, and infrastructure situation in which U.S. forces are deployed.  GUARD DOG will consist of two segments: a handheld\/portable digital assistant to support dismounted soldiers patrolling neighborhoods and villages; and a laptop\/desktop computer system that integrates data from multiple patrols and supports battalion\/brigade-level analysts.  GUARD DOG will provide automated support for the collect-update-analyze-prioritize process by supporting data collection and advanced analytics to evaluate the current local\/regional situation, identify gaps in the knowledge base, and generate information requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed fast, graph-based, information analysis algorithms that can handle large, complex data sets.\n-  Developed new technologies and system architecture to support real-time data collection and analysis.\n-  Developed simulation test bed to evaluate selected graph-based algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.110"
                                            },
                                            "Text": {
                                                "val": "-  Optimize algorithms to run on handheld devices in the field.\n-  Enhance algorithms to address uncertain and dynamic data.\n-  Expand architecture to support multiple distributed users.\n-  Design, conduct and analyze field experiments using test bed and National Training Center at Ft. Irwin and\/or Joint Readiness Training Center at Ft. Polk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Soldier Sensor Information System and Technology (ASSIST)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Soldier Sensor Information System and Technology (ASSIST) program developed an integrated information system that exploits soldier-worn sensors to augment the soldier's ability to capture, report, and share information in the field.  This includes an integrated system using advanced technologies for processing, digitizing and analyzing information captured and collected by soldier-worn sensors.  ASSIST drew heavily on the experiences and lessons learned from previous Operation Iraqi Freedom missions and other surveillance and reconnaissance missions.  A baseline system demonstrated the capture of video\/still images together with voice annotations and location-stamping.  The advanced system demonstrated automatic identification and extraction of key objects, events, activities and scenes from soldier-collected data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Automated the extraction of relevant portions of feeds for indexing into the Tactical Ground Reporting system (TIGR) database.\n-  Implemented robust operation over wireless networks of very limited bandwidth.\n-  Developed real-time collaboration tools for dismounted soldiers.\n-  Successfully transitioned TIGR to Army Program of Record under Program Manager, Force XXI Battle Command Brigade and Below."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}