{
    "id": "cff13c31e8877d53d689a5f0b41a4c3b38b2abb4",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "22.716"
            },
            "CurrentYear": {
                "val": "7.112"
            },
            "BudgetYearOne": {
                "val": "6.983"
            },
            "BudgetYearOneBase": {
                "val": "6.983"
            },
            "BudgetYearTwo": {
                "val": "7.634"
            },
            "BudgetYearThree": {
                "val": "8.332"
            },
            "BudgetYearFour": {
                "val": "8.599"
            },
            "BudgetYearFive": {
                "val": "8.756"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "In Overseas Contingency Operations (OCO), the United States (US) must be ready to meet the widespread and growing threat of asymmetric weapons such as Man Portable Air Defense Systems (ManPADS), unguided hostile fire and portable small weapons improvised from commercially available electronic sensors, computer modules, navigation and control components coupled with various disruptive payloads.  Such devices provide terrorists and foreign military units the novel means to rapidly construct a wide range of weapons capable of disruptive actions against civilian and military forces alike.  The US must be ready to counter such weapons on short notice.\n\nThe asymmetric nature of such devices is already well understood by terrorists.  ManPADS and mortars have been used to attack both air and ground forces, and pose a threat in any region due to their portability.  Digital processors, analog-to-digital converters and digital optical sensors give terrorists the means to deploy unexpected threats on short notice.  Conventional kinetic defenses against these devices can be impractical in urban settings.  Because the speed of appearance of these disruptive devices can be short, such threats are asymmetric in comparison with the long development cycles that are typical of US military defensive systems.  Together these asymmetries highlight the need to rapidly evolve alternative Electronic Warfare, Information Operations and Counter Terrorism capabilities suitable for neutralizing such threats in a timescale that is commensurate with their appearance.  This program element investigates novel means to detect and neutralize asymmetric threats, as well as special mission and other methods to employ asymmetric principles against our adversaries.\n\nThis program seeks to identify rapidly deployable solutions (outside of service programs of record) that can effectively mitigate asymmetric threats by integrating advanced commercial or military off-the-shelf technology in innovative ways that augment and\/or reduce risk when inserted into service programs of record."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.386"
                },
                "CurrentYear": {
                    "val": "7.287"
                },
                "BudgetYearOne": {
                    "val": "7.179"
                },
                "BudgetYearOneBase": {
                    "val": "7.179"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.716"
                },
                "CurrentYear": {
                    "val": "7.112"
                },
                "BudgetYearOne": {
                    "val": "6.983"
                },
                "BudgetYearOneBase": {
                    "val": "6.983"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "14.330"
                },
                "CurrentYear": {
                    "val": "-0.175"
                },
                "BudgetYearOne": {
                    "val": "-0.196"
                },
                "BudgetYearOneBase": {
                    "val": "-0.196"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "14.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.096"
                    },
                    "CurrentYear": {
                        "val": "-0.126"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.043"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.029"
                                },
                                "CurrentYear": {
                                    "val": "-0.049"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.196"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.196"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P619"
                    },
                    "ProjectTitle": {
                        "val": "Joint Electronic Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.716"
                        },
                        "CurrentYear": {
                            "val": "7.112"
                        },
                        "BudgetYearOne": {
                            "val": "6.983"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.983"
                        },
                        "BudgetYearTwo": {
                            "val": "7.634"
                        },
                        "BudgetYearThree": {
                            "val": "8.332"
                        },
                        "BudgetYearFour": {
                            "val": "8.599"
                        },
                        "BudgetYearFive": {
                            "val": "8.756"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The widespread and growing availability of sophisticated, commercially available electronic sensors, computer modules, navigation and control components coupled with widely proliferated Man Portable Air Defense Systems (ManPADS), portable explosives, mortars, rockets provide terrorists and foreign military units with the novel means to rapidly construct a wide range of weapons capable of disruptive actions against military forces.  In Overseas Contingency Operations (OCO), the United States (US) must be ready to counter such weapons on short notice.  The asymmetric nature of such devices is already well understood by terrorists.  ManPADS, man portable weapons and mortars have been used to attack both air and ground forces, and pose a threat to any region due to their portability.   Digital processors, analog-to-digital converters and digital optical sensors give terrorists the means to deploy unexpected threats on short notice.  Because conventional kinetic defenses against these devices can be impractical in urban settings and because the speed of appearance of such devices can be short, such threats are disruptive and asymmetric in comparison with the typically long development cycles associated with US military defensive systems.  These asymmetries highlight the need to rapidly evolve alternative Electronic Warfare (EW), Information Operations and Counter Terrorism capabilities suitable for neutralizing such threats.  This program will investigate novel means to detect and neutralize these asymmetric threats, as well as special mission and other methods to employ asymmetric principles against our adversaries.\n\nThis program seeks to identify rapidly deployable solutions (outside of service programs of record) that can effectively mitigate asymmetric threats by integrating advanced commercial or military off-the-shelf technology in innovative ways that augment and\/or reduce risk when inserted into service programs of record.  Laboratory and field testing is used to evaluate the feasibility and military utility of resultant low cost, near term capabilities.  FY 2013 efforts will investigate, integrate, test and demonstrate elements of the following technologies:\n\n1.  Integrated Situational Awareness and Countermeasures\nDepartment of Defense (DoD) helicopters currently use a federated architecture of sensors and countermeasures to protect themselves against guided and unguided hostile threats while simultaneously avoiding collisions with the ground and other obstacles.  These sensors typically provide the pilot with a separate display of radar, radar warning, missile warning or off-board communications to guide the pilot in selecting automatic or manual countermeasures against radar, laser, or radio frequency guided threats.  These un-fused sensors create a serial information stream which can induce an inadequate response to the threat.  Federated systems consume weight, space, and power which are at a premium in small platforms.  The initial goal of this project is to fuse multiple functions such as missile detection and countermeasures, hostile fire detection, navigation in visually degraded environments, and active search using optical detection into a one or two aperture device with a single integrated display to produce improved situational awareness.  Subsequent efforts of this joint service government\/contractor team will assess integration of multi-platform sensor fusion using Radio Frequency (RF) and laser data-links to create cross-platform shared situational awareness among a section or division of helicopters or Unmanned Aerial Vehicles (UAVs) which is more complete than a single platform warning\/tracking system.  Such efforts will be proven in a series of Rotary Wing Aircraft Survivability Equipment (RASE) experiments bringing sensors and shooters together in a collaborative learning environment using live fire with a variety of weapons and environments.\n\n2.  Low Cost\/Near Term Counter Asymmetric Systems\nInvestigate low cost, near term technologies solutions to allow aircraft to fly in medium to high ManPADS threat airspace in support of OCO.  Emphasis is on threats, aircraft and system approaches that are not covered by existing programs of record including but not limited to:  innovative threat warning, advanced pyrophoric decoys, miniature high reliability lasers, magnetically steered high reliability pointer-trackers, higher powered and higher duty cycle lasers, preemptive countermeasures systems.\n \nTasks leading to a rapid technology transition to be completed in FY 2013:\n\nBegin efforts to evaluate the signatures of air platforms that are threatened by new classes of surface-to-air threats.  Efforts will include using new instrumentation in conjunction with tests that are planned for other purposes (tag-along testing) to measure relevant signatures of platforms in order to develop defensive strategies.  Additionally, FY 2013 efforts include investigation of rapidly deployable technologies that could be used to help counter emerging threats.\n\n3.  Disruptive Technology Defeat and Utilization\nThis effort involves emerging and disruptive technologies analysis and rapid prototyping of technologies required to adapt counter-terrorism techniques to threats in OCO.  Primary payoff is an assessment of current system capabilities and limitations against the threat and capture of baseline system performance against the threat set for developing technologies.  Joint Electronic Advanced Technology (JEAT) will demonstrate rapid prototyping of technologies required to combat adaptive threats.  Emphasis will be on demonstrating an end-to-end kill chain and techniques which minimize or eliminate collateral damage.  Starting in FY 2011 the efforts of this mostly-government team included novel techniques to detect and locate the signatures of terrorist activities using electronic means.  Trident Spectre provides a venue for various members of Special Forces, Conventional Forces and Intelligence Community to collaborate on and evaluate technologies and techniques related to “Tactical Intelligence” in a technical, operational, and safe environment.  Trident Spectre provides an opportunity for capability developers (scientists, engineers, designers) to interact directly with tactical operators, collectors and analysts; and a process that correctly and efficiently reviews potential tactical Intelligence technologies and techniques that will enhance the operational capability of the DoD activities in OCO.   Primary payoff is improved connectivity and more efficient collection and dissemination of Tactical Intelligence.  Customers include US Central Command (CENTCOM), US Special Operations Command (SOCOM), Assistant Secretary of Defense, Research & Engineering (ASD (R&E)), DoD Conventional\/Special Forces, and members of the Intelligence Community.  Products include an after action report and a transition plan moving management activities to SOCOM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Situational Awareness and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "DoD helicopters currently use a federated architecture of sensors and countermeasures to protect themselves against guided and unguided hostile threats while simultaneously avoiding collisions with the ground and other obstacles.  These sensors typically provide the pilot with a separate display of radar, radar warning, missile warning or off-board communications to guide the pilot in selecting automatic or manual countermeasures against radar, laser, or radio frequency guided threats.  These un-fused sensors create a serial information stream which can induce an inadequate response to the threat.  These federated systems consume weight, space, and power which are at a premium in small platforms.  The initial goal of this project is to fuse multiple functions such as missile detection and countermeasures, hostile fire detection, navigation in visually degraded environments, and active search using optical detection into a one or two aperture device with a single integrated display to produce improved situational awareness.  Subsequent efforts of this joint service government\/contractor team will assess integration of multi-platform sensor fusion using RF and laser data-links to create cross-platform shared situation awareness among a section or division of helicopters or UAV’s which is more complete than a single platform warning\/tracking systems.  Such efforts will be proven in a series of RASE, bringing sensors and shooters together in a collaborative learning environment using live fire with a variety of weapons and environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.623"
                                            },
                                            "Text": {
                                                "val": "Efforts included integration of a high speed optical detector (position sensing detector array) with the high speed magnetic mirror in a single unit to demonstrate a breadboard capability for hostile fire detection, geo-location and non-lethal countermeasures.  Efforts to integrate features to navigate in degraded visual environments were initiated.  Follow-on testing continued under RASE.  Deliverables include a report on feasibility of combined Infrared Countermeasures\/Hostile Fire Indicator (IRCM\/HFI)\/Degraded Visual Environment (DVE) functionality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.337"
                                            },
                                            "Text": {
                                                "val": "Include efforts to demonstrate the feasibility of a hostile fire detection and non-lethal countermeasures capability using advanced threat detectors and magnetically actuated optics.  Demonstrate capability to use magnetically actuated mirror technology to provide situational awareness in degraded visual environments.  Begin efforts to integrate free space laser communications capability based upon magnetically actuated optics and study\/begin to demonstrate feasibility of combining design elements with IRCM, Hostile Fire Detection\/Countermeasures and obstacle avoidance systems into an integrated package."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.850"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.850"
                                            },
                                            "Text": {
                                                "val": "Complete efforts to demonstrate the feasibility of a hostile fire detection and non-lethal countermeasures capability using advanced threat detectors and magnetically actuated optics.  Demonstrate capability to use magnetically actuated mirror technology to provide situational awareness in degraded visual environments by creating a working prototype that can be evaluated using ground based testing.  Begin efforts to integrate free space laser communications capability based upon magnetically actuated optics by creating a working prototype that can be evaluated in laboratory testing and study\/begin to demonstrate feasibility of combining design elements with IRCM, Hostile Fire Detection\/Countermeasures and obstacle avoidance systems into an integrated package. Also, begin efforts to evaluate integrating offboard information into an integrated EW Battle Management construct that incorporates helicopter and tactical jet derived information to provide integrated Infra Red (IR) and RF countermeasures in a complex spectral environment containing threats operating in multiple areas of the electromagnetic spectrum threat airspace.  Emphasis is on threats, aircraft and system approaches that are not covered by existing programs of record including but not limited to:  innovative threat warning, advanced threat countermeasures, miniature high reliability lasers, magnetically steered high reliability pointer-trackers, higher powered and higher duty cycle lasers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost\/Near Term Counter Asymmetric Systems"
                                    },
                                    "Description": {
                                        "val": "Low cost, near term technologies solutions to asymmetric EW threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.677"
                                            },
                                            "Text": {
                                                "val": "Distributed Ground Based Threat Detection System (DGTDS) focused on finalizing all system documents and hardware drawing to allow for a smooth transition of the technology to the customer.  This technology will allow any large urban airfield to provide an exceptionally high quality of missile warning to any aircraft in the area.  It can be coupled with either an air or ground based countermeasure system.  System documentation was completed to enable seamless technology transfer to limited production\/industry. \n\nAircraft Missile Protection System (AMPS) completed aircraft hardware prototype creation, qualify hardware for prototype installation in aircraft, integrate into AH-1Z System Integration Lab at Naval Air Warfare Center, Weapons Division, China Lake, CA for system performance testing in December 2010; performed end-to-end live fire missile firing test at China Lake to demonstrate system performance in December 2010; closed out project with final delivery of all system design documentation, hardware, and software code in February 2011.  AMPS was also integrated with the Defensive System Digital Recorder (DSDR) system and demonstrated the ability to accept ground sensor cueing from the Countermeasure Expendable with Replaceable Block Elements for Reactive Unmanned Systems (CERBERUS) to pass Cursor on Target (CoT) information to a surrogate air vehicle and multiple man portable targeting systems simultaneously.  AMPS design, documentation, hardware and software is available for near term integration\/implementation for contingency operations.\n   \nElectronic Warfare System Effectiveness Analysis (EWSEA) conducted characterization of the EW techniques available for EW systems against given threats.  Completed detailed analysis with Navy Tactical Aircraft, Anti-Ship Missile Defense and standoff jammers.  Effectiveness metrics for Analytic Agenda scenarios were captured from programs of record, ascertaining how effective our EW inventory and techniques perform against given threats.\n\nSpecial Material Aero Urban Decoy (SMAUD) conducted effectiveness flight testing for the updated decoy design for H-60 aircraft.  Funding was provided to DoD components for test planning, test aircraft and vans, and range costs.  Conducted modeling and simulation of the potential effectiveness of this decoy concept for the CV-22.  Funding was provided to DoD Modeling and Simulation laboratories for analysis and transition.  Briefings were provided at Advanced Threat Tactical Electronic Defense Symposiums, Military Sensing Symposiums, and Aircraft Survivability Symposiums.  \n\nBegan efforts to investigate novel means of detecting and locating signatures of terrorist activity, differentiating between terrorist and indigenous activities and providing timely, actionable intelligence enabling disruption of terrorist kill chains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Refine a knowledge base of existing EW techniques and systems started in FY 2011.  This capability will assist leadership in finding synergies between existing systems and developmental capabilities.  This knowledge base will help realize efficiencies in development as well as identify opportunities to create rapid prototypes of capabilities to defeat advanced and asymmetric threats.  \n\nBased upon the Office of the Secretary of Defense (OSD) Advanced Threat study, completed in FY 2010, JEAT will continue efforts to implement and demonstrate solutions to emerging threats.  JEAT will begin efforts to evaluate techniques to rapidly develop countermeasures to advanced, fourth and fifth generation IR missiles.  This will include signature measurements, modeling, technique development and evaluation as well as laboratory trials.  Create and populate data into the countermeasures database available for broad joint service use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.225"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.225"
                                            },
                                            "Text": {
                                                "val": "Maintain and improve the EW techniques knowledge base.  Use the knowledge base to identify inter-service and cross domain opportunities for synergy in joint EW endeavors.\n\nContinue efforts to create countermeasures for advanced ManPADS threats including creation and laboratory evaluation of brass-board prototypes of countermeasure capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Technology Defeat and Utilization"
                                    },
                                    "Description": {
                                        "val": "Emerging and disruptive technologies analysis; rapid prototyping of technologies required to adapt counter-terrorism techniques to threats in OCO. Primary payoff is an assessment of current system capabilities and limitations against the threat and capture of baseline system performance against the threat set for developing technologies.  JEAT will demonstrate rapid prototyping of technologies required to combat adaptive threats.  Emphasis will be on demonstrating an end-to-end kill chain and techniques which minimize or eliminate collateral damage.  In FY 2012 the efforts of this mostly-government team will include novel techniques to detect and locate the signatures of terrorist activities using electronic means.  Trident Spectre provides a venue for various members of Special Forces, Conventional Forces and Intelligence Community to collaborate on and evaluate technologies and techniques related to “Tactical Intelligence” in a technical, operational, and safe environment.  Trident Spectre provides an opportunity for capability developers (scientists, engineers, designers) to interact directly with tactical operators, collectors and analysts; and a process that correctly and efficiently reviews potential tactical Intelligence technologies and techniques that will enhance the operational capability of the DoD activities in OCO.  Primary payoff is improved connectivity and more efficient collection and dissemination of Tactical Intelligence.  Customers include CENTCOM, SOCOM, ASD(R&E), DoD Conventional\/Special Forces, and members of the Intelligence Community.  Products include an after action report and a transition plan moving management activities from ASD(R&E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.416"
                                            },
                                            "Text": {
                                                "val": "Efforts were developed in coordination with the defense research community and Defense Intelligence Agency (DIA) elements seeking ways to avoid technological surprise.  Further efforts investigated novel means of detecting and locating signatures of terrorist activity, differentiating between terrorist and indigenous activities and providing timely, actionable intelligence that allows asymmetric disruption of terrorist kill chains.  JEAT is working with the US SOCOM, Naval Special Operations Command, and other members of the Special Forces, Conventional Forces, and Intelligence Community in planning, executing, and reporting on Trident Spectre.  This activity provided a venue for various members of the DoD and Intelligence Community to collaborate on and evaluate technologies and techniques in a technical, operational, and safe environment, as well a technical out-brief to ASD(R&E) leadership and report on the experiment’s results.  The payoff of this activity will be a process that correctly and efficiently reviews potential technologies and techniques that will enhance the operational capability of the war-fighter in OCO. \n\nThis project provided expertise to Joint Integrated Air and Missile Defense Organization (JIAMDO) for a variety of US defense systems that were demonstrated and evaluated in August 2011 and to demonstrate an end-to-end kill chain of UAVs in the maritime environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.275"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to investigate novel means of detecting and locating signatures of terrorist activity, differentiating between terrorist and indigenous activities and providing timely, actionable intelligence enabling disruption of terrorist kill chains.  JEAT will work with the US SOCOM, NSOC, and other members of the Special Operations and Intelligence Community in planning, executing, and reporting on Trident Spectre.  This activity will provide a venue for various members of the DoD and Intelligence Community to collaborate on and evaluate technologies and techniques in a technical, operational, and safe environment, as well a technical out-brief to ASD(R&E) leadership and report on the experiment’s results.  The payoff of this activity will be a process that correctly and efficiently reviews potential technologies and techniques that will enhance the operational capability of the warfighter in OCO.\n\nThis project will provide expertise to JIAMDO for a variety of US defense systems to be demonstrated and evaluated in the August 2012 timeframe and to demonstrate Combat Identification (CID) and the end-to-end kill chain of UAVs in the maritime environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.908"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.908"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to evaluate special operations and intel community requirements\/synergies and develop rapidly deployable capability.  Trident Spectre will transition to a long term special operations\/intel community sponsorship in FY 2013."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}