{
    "id": "d51c71d767dd40335b6370d3e35f2ae8e8c368ec",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V1_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603788F"
        },
        "ProgramElementTitle": {
            "val": "Global Information Dev\/Demo"
        },
        "R1LineItemNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.403"
            },
            "CurrentYear": {
                "val": "38.628"
            },
            "BudgetYearOne": {
                "val": "31.419"
            },
            "BudgetYearOneBase": {
                "val": "31.419"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "48.093"
            },
            "BudgetYearThree": {
                "val": "41.993"
            },
            "BudgetYearFour": {
                "val": "42.334"
            },
            "BudgetYearFive": {
                "val": "46.550"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates Air Force Enterprise-Centric Information technologies for the warfighter.  The Global Battlespace Awareness project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and total battlespace awareness by using and exploiting information from all sources.  The Assured Worldwide Connectivity project provides advanced net-enabled architectures and communications technologies in support of global military operations, including a secure information grid for worldwide information exchange of near-real-time multimedia (i.e., voice, data, video, and imagery) information.  In addition, this project develops and demonstrates advanced optical networking and communications for Air Force air- and space-based information exchange on and between platforms.   These optical networks will be rapidly deployable, mobile, interoperable, and seamless between Air and Space Operations Centers (AOC) and air- and space- based platforms either en route or in theater.  This project also provides the tools and applications leading to the development and integration of cyber deterrence technologies resulting in a strategic capability of cyber dominance within the secure information grid.  The Knowledge Management and Computing project develops the technology applications that will provide for a secure, tailored, seamless exchange of information among producers, consumers, and managers of information relevant to a particular community of interest (COI).  The project also provides the development of interactive and real-time computing technologies that greatly improve the usability of high performance computing for the exchange, utilization, and management of information in the enterprise.  The Anticipatory Ops Intent and Response project develops the technologies for dynamic planning and execution with the accuracy, fidelity, and timeliness needed to dominate the battlespace. This program has been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication. This program is in Budget Activity 3, Advanced Technology Development, since it develops and demonstrates technologies for existing upgrades and\/or new system developments that have military utility and address warfighter needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.382"
                },
                "CurrentYear": {
                    "val": "38.656"
                },
                "BudgetYearOne": {
                    "val": "43.536"
                },
                "BudgetYearOneBase": {
                    "val": "43.536"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.403"
                },
                "CurrentYear": {
                    "val": "38.628"
                },
                "BudgetYearOne": {
                    "val": "31.419"
                },
                "BudgetYearOneBase": {
                    "val": "31.419"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.979"
                },
                "CurrentYear": {
                    "val": "-0.028"
                },
                "BudgetYearOne": {
                    "val": "-12.117"
                },
                "BudgetYearOneBase": {
                    "val": "-12.117"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.028"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.023"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.758"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.198"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.117"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.117"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Other Adjustments include -0.198 Congressional General Reductions \n\nDecrease in FY13 is due to higher Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635319"
                    },
                    "ProjectTitle": {
                        "val": "Anticipatory OPS Intent and Response"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.553"
                        },
                        "CurrentYear": {
                            "val": "8.738"
                        },
                        "BudgetYearOne": {
                            "val": "4.870"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.870"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.676"
                        },
                        "BudgetYearThree": {
                            "val": "6.229"
                        },
                        "BudgetYearFour": {
                            "val": "5.761"
                        },
                        "BudgetYearFive": {
                            "val": "5.840"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In order to achieve information dominance, the Air Force must be able to monitor, assess, plan, and execute (MAPE) missions rapidly across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict (pre-conflict, conflict through stability operations).  This project develops and integrates decision support technologies that will enhance the commander's ability to anticipate and dominate the future battlespace by more effectively forecasting the evolution of the battlespace and by more rapidly generating options to \"virtually checkmate\" the adversary.  It develops the decision aid technologies and processes to plan the use of various assets and assess their effects in the battlespace.  It provides a tailorable information environment to effectively portray complex data sets accurately in real-time."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate distributed information technologies that are scalable and reconfigurable and provide seamless access to tailored multi-media and multi-spectral data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "Completed development of capabilities to allow seamless information sharing for enhanced situational awareness and understanding by the decision maker. Developed an initial capability to plan and measure effectiveness of information operations synchronized with precision munitions to determine successful achievement of command intent in time and location.  Conducted a campaign of experimentation to quantitatively measure transformational command and control (C2) concepts enabled by net centric warfare capabilities.  Investigated space C2 planning and scheduling technologies to enable enhanced space operations.  Developed an integrated C2 tasking capability to enable seamless full spectrum options to be reasoned over and recommendations provided to the operator that will meet commander's intent. Completed the development of the capability to integrate a variety of user-defined operating display technologies to visualize individual data set contexts for better situational awareness across the air, space, and cyber domains at the strategic, operational, and tactical levels.  Developed and demonstrated enhanced capability to conduct space C2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.234"
                                            },
                                            "Text": {
                                                "val": "Complete development of and demonstrate enhanced capability to conduct space C2.  Complete campaign of experimentation to quantitatively measure transformational C2 concepts enabled by net centric warfare capabilities.  Complete the investigation of space C2 planning and scheduling technologies to enable enhanced space operations.  Complete development of an integrated C2 tasking capability to enable seamless full spectrum options to be reasoned over and recommendations provided to the operator that will meet commander's intent."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This thrust was completed in Fy 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the integration of planning tools and information-based intelligent agents for adaptive replanning and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.046"
                                            },
                                            "Text": {
                                                "val": "Developed capabilities to be more agile within a net centric enabled environment.  Developed timely option generation, selection, and coordination capabilities that account for uncertainty and missing and erroneous information, and supports intuitive decision making processes.  Developed dynamic workflow and workload management capabilities to manage the C2 enterprise.  Completed development of a capability to assess adverse events that could potentially impact air and space mobility operations and suggest courses of action (COAs) that could be initiated to continue operations.  Investigated methods to evaluate mobility COAs covering planning through assessment that anticipates multiple constraints and provides prioritized, feasible recommendations that meet commander's intent. Developed capability to assess the impact of cyber on air and space C2 operations and suggest COAs to be initiated to continue operations in the face of cyber threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.345"
                                            },
                                            "Text": {
                                                "val": "Complete the investigation of methods to evaluate mobility COAs covering planning through assessment that anticipates multiple constraints and provides prioritized feasible recommendations that meets commander's intent.  Initiate development of net-centric mission planning and execution capabilities to support master space plan and joint space task order production and a net enabled dynamic decision support capability for a variety of air and space missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.265"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.265"
                                            },
                                            "Text": {
                                                "val": "Continue development of net-centric mission planning and execution capabilities to support  a net enabled dynamic decision support capability for a variety of air and space missions in support of global operations. Initiate design and development of a set of planning tools and services that proactively build and shape the portion of cyberspace employed in support of Mission Assurance (MA) objectives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an effects-based approach for the next generation of planning and assessment techniques that enable decision makers to determine operational effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.148"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated real-time information technologies that enable a decision maker to comprehend their current situational awareness by assessing an operation's progress against desired effects (reflective) and identifying key indicators and observables to assist in anticipating future success or failure of a campaign (predictive).   Completed investigating and evaluating  methods to enable a decision support environment that enables the decision maker to anticipate and shape all aspects of the future battlespace.  Developed predictive battlespace planning tools with the ability to reason over models of the \"enemy as a system.\"  Demonstrated a suite of interacting tools\/services that assist analysts in estimating the cascading effects of proposed actions in near-real-time for diverse COAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.159"
                                            },
                                            "Text": {
                                                "val": "Integrate and test decision support environment, within service oriented architectures, that enables the decision maker to anticipate and shape all aspects of the future battlespace.  Complete development of predictive battlespace planning tools with the ability to reason over models of the \"enemy as a system.\"  Conduct simulation experiments to analyze courses of action and evaluate capabilities across multiple domains.  Design and conduct limited technology experiments to investigate the technical and operational challenges associated with integrated air, space, and cyber C2 within and across multiple service oriented architectures. Continue the development and demonstration of real-time information technologies that enable a decision maker to comprehend their current situational awareness by assessing an operation's progress against desired effects (reflective) and identifying key indicators and observables to assist in anticipating future success or failure of a campaign (predictive). Initiate integration of cascading courses of action reasoners.  Initiate development of a toolset for predictive assessment, developing insight into action, causal mechanisms, and their effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.605"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.605"
                                            },
                                            "Text": {
                                                "val": "Continue an integration and test decision support environment, within service oriented architectures, that enables the decision maker to anticipate and shape all aspects of the future battlespace. Continue designing and conducting limited technology experiments to investigate the technical and operational challenges associated with integrated air, space, and cyber C2 within and across multiple service oriented architectures. Continue the development and demonstration of real-time information technologies that enable a decision maker to comprehend their current situation by assessing an operation's progress against desired effects (reflective) and identifying key indicators and observables to assist in anticipating future success or failure of a campaign (predictive)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635320"
                    },
                    "ProjectTitle": {
                        "val": "Assured Worldwide Connectivity"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.676"
                        },
                        "CurrentYear": {
                            "val": "11.871"
                        },
                        "BudgetYearOne": {
                            "val": "13.103"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.103"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.085"
                        },
                        "BudgetYearThree": {
                            "val": "15.468"
                        },
                        "BudgetYearFour": {
                            "val": "14.640"
                        },
                        "BudgetYearFive": {
                            "val": "17.115"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advanced net-enabled architectures and communications technologies in support of global kinetic and non-kinetic military operations including a secure information grid for worldwide information delivery and exchange of near-real-time information including voice, data, video, and imagery.  This secure environment will be rapidly deployable, mobile, interoperable, and seamless between Air and Space Operations Centers (AOC) and aircraft, either en route or in theater.  This project provides secure information transmission capabilities for a persistent, global, survivable communications backbone network accessible for warfighters operating in all domains; it provides self-healing, self-configuration, anti-jam communication networking capabilities; and it provides enterprise networking capabilities for agile, policy-based network management.  In addition, this project develops and demonstrates advanced optical networking and communications for Air Force air- and space-based information exchange on and between platforms including development of highly integrated multi-gigabit optical and radio frequency networks, all optical data routers, optical backbone interface circuits for on board information exchange, and integrated electronic, adaptive optic systems for atmospheric mitigation.  The Air Force also requires the ability to deliver sovereign options in cyberspace through the development and integration of cyber attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance.  This project develops the ability to deliver cyber attack capabilities (access, stealth and persistence, cyber intelligence, and weapons delivery), cyber defense capabilities (attack detection, attack attribution, and response automation), and cyber support capability (situational awareness and war gaming.)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure wideband assured networking between weapon platforms, ground facilities, and Special Operations teams."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.305"
                                            },
                                            "Text": {
                                                "val": "Completed development of small form-factor networking and reachback capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Note:  This effort completed in FY 2011."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Proactively defend cyberspace through cyber situational awareness, detecting, and defeating cyber threats, and surviving through adaptation and self-generation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.835"
                                            },
                                            "Text": {
                                                "val": "Developed a comprehensive situational awareness and understanding capability of cyber network assets, both red and blue forces, to include both virtual and physical cyber assets.  Developed assured end-to-end quality of assurance (QoA) and QoA integration to the information system enterprise during malicious and non-malicious faults.  Developed capability to automatically discover large-scale network topologies to enhance cyber situation assessment and map the discovered topologies to mission essential functions.  Initiated the development of technologies that provides knowledge of the adversary to strengthen the quality of threat assessments.  Completed the development of a cross-domain voice-over-IP (VOIP) capability to enhance the utility of voice transmissions within a mobile tactical environment. Developed cyber testbed capability for in-house investigations of cyber defense policies and offensive cyber techniques with the ability to conform to command intent for cyber indications and warning, and rules of engagement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.502"
                                            },
                                            "Text": {
                                                "val": "Complete development of capability to automatically discover large-scale network topologies to enhance cyber situation assessment and map the discovered topologies to mission essential functions.  Complete the development of technologies that provides knowledge of the adversary to strengthen the quality of threat assessments.  Develop a capability to integrate indications and warnings and observables into situation awareness and impact assessment capabilities.   Complete assured end-to-end QoA and QoA integration to the information system enterprise during malicious and non-malicious faults."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort completes in FY 2012.  Additional defensive cyber efforts are in Major Thrust 5."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber operations capabilities in a series of Experimental Cyber Craft technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.484"
                                            },
                                            "Text": {
                                                "val": "Analyzed development of additional offensive cyber operations capabilities, integrated kinetic and cyber operations planning and execution capabilities, and Cyber C2 operations functions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.070"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments using testbed capability for in-house investigations of cyber defense policies and offensive cyber techniques to gain a better understanding of how an adversary might attack Air Force systems.  Continue to analyze development of additional offensive cyber operations capabilities, integrated kinetic and cyber operations planning and execution capabilities, and Cyber C2 operations functions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "Continue conducting experiments using testbed capability for in-house investigations of cyber defense policies and offensive cyber techniques to gain a better understanding of how an adversary might attack Air Force systems. Complete analysis of the development  of additional offensive cyber operations capabilities, integrated kinetic and cyber operations planning and execution capabilities, and Cyber C2 operations functions. Continue to develop  and demonstrate capabilities that provide integrated cyber operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate intelligent networking transport and management technology to provide assured, seamless, battlespace connectivity to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.820"
                                            },
                                            "Text": {
                                                "val": "Demonstrated high capacity assured access (anti-jam) communications for global spectrum dominance.  Developed quality of service (QoS)-enabled information management and dissemination combined with network policy language for efficient, prioritized information exchange in airborne networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.859"
                                            },
                                            "Text": {
                                                "val": "Initiate development of cognitive radio technology that will enable mission specific adaptive optimization of communications links responsive to current conditions, situations, and priorities as each mission is executed.  Initiate advanced demonstration of end-to-end QoS and QoA performance for various application-dependent network configuration, management, and implementation scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.998"
                                            },
                                            "Text": {
                                                "val": "Complete development of cognitive radio technology that will enable mission specific adaptive optimization of communications links responsive to current conditions, situations, and priorities as each mission is executed. Continue advanced demonstration of end-to-end QoS and QoA performance for various application-dependent network configuration, management, and implementation scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 5."
                                    },
                                    "Description": {
                                        "val": "Integrate and demonstrate a resilient and self-regenerating information enterprise that dynamically recognizes, characterizes, and understands novel cyber attacks and reconfigures and self-optimizes to resist new attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.566"
                                            },
                                            "Text": {
                                                "val": "Integrated technologies to recognize, characterize, and understand attacks and anomalies, aid in the creation of synthetically diverse, functionally equivalent software, and continuously monitor, reconfigure, and self-optimize."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.613"
                                            },
                                            "Text": {
                                                "val": "Continue integration technologies to recognize, characterize, and understand attacks and anomalies, aid in the creation of synthetically diverse, functionally equivalent software, and continuously monitor, reconfigure, and self-optimize.  Initiate developing techniques for guaranteeing the execution of critical processes during system recovery and data reconstitution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.399"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.399"
                                            },
                                            "Text": {
                                                "val": "Continue integration technologies to recognize, characterize, and understand attacks and anomalies, aid in the creation of synthetically diverse, functionally equivalent software, and continuously monitor, reconfigure, and self-optimize. Continue developing techniques for guaranteeing the execution of critical processes during system recovery and data reconstitution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 6."
                                    },
                                    "Description": {
                                        "val": "Integrate technology to demonstrate an effects-based strategic approach to cyber defense that focuses on avoiding, deferring, and minimizing the threat, and rendering the adversary ineffective."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.666"
                                            },
                                            "Text": {
                                                "val": "Developed technologies to simulate a diverse set of active machines to thwart an adversary by transferring the attack to specialized nodes for analysis. Initiated development of capability to automatically generate secure system\/network configuration based on policy, architectural specifications, and operational requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.572"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies to simulate a diverse set of active machines to thwart an adversary by transferring the attack to specialized nodes for analysis.  Continue development of capability to automatically generate secure system\/network configuration based on policy, architectural specifications, and operational requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.188"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies to simulate a diverse set of active machines to thwart an adversary by transferring the attack to specialized nodes for analysis. Continue development of capability to automatically generate secure system\/network configuration based on policy, architectural specifications, and operational requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 7."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate flight ready systems consisting of high capacity radio frequency (RF) and optical components and architectures for next generation communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Note:  The FY 2010 effort showed that the technology had not matured enough for an advanced technology demonstration.  In FY 2011, the effort was returned to applied research for further maturation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.255"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate a directional networking prototype for tactical data links. (This is a different effort from the one sent back to applied research for maturation.)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.693"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.693"
                                            },
                                            "Text": {
                                                "val": "Initiate development of V\/W band (50 GHz to 110 GHz) airborne communications components.  Initiate flight demonstration of communications systems for use in contested environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635321"
                    },
                    "ProjectTitle": {
                        "val": "Global Battlespace Awareness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.764"
                        },
                        "CurrentYear": {
                            "val": "10.494"
                        },
                        "BudgetYearOne": {
                            "val": "7.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.869"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.979"
                        },
                        "BudgetYearThree": {
                            "val": "13.675"
                        },
                        "BudgetYearFour": {
                            "val": "15.454"
                        },
                        "BudgetYearFive": {
                            "val": "15.196"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In order to achieve information dominance, the Air Force must be able to monitor, assess, plan, and execute (MAPE) missions rapidly across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict (pre-conflict, conflict through stability operations).  This project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and Predictive Battlespace Awareness using information from all sources.  Technology development includes:  tasking information collectors (intelligence, surveillance, and reconnaissance platforms, national intelligence sources, etc.); correlating and geo-registering the collected data; exploiting the data to extract information of military significance; fusing information from multiple sources to create a digital-n-dimensional representation of the battlespace; assessing the situation; predicting adversary courses of action (COA); and archiving the results for ready use by decision makers.  This is a dynamic, complex process that involves technologies for information exploitation, fusion, processing, storage, and retrieval, as well as technologies for machine reasoning, pattern recognition, and timeline analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced signal and data exploitation technologies for detection, tracking, identification, and targeting of time-critical targets, and information extraction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.648"
                                            },
                                            "Text": {
                                                "val": "Developed methodologies and processing of collecting intelligence data from a collection of ever present stand-in multi-sensor ad-hoc networks.  Conducted space situational awareness (SSA) research in the development of a set of algorithms that can both automatically track space objects and complete demonstration of algorithms to detect changes in satellite images.  Developed enhanced signal processing techniques to fit into existing Intelligence, Surveillance, and Reconnaissance (ISR) infrastructures. Integrated previously developed watermarking techniques and protocols for information assurance, provenance, and pedigree leading to the integration of watermarking technologies into network-centric programs of record, and initiated development of novel steganalysis methods for identifying and disrupting embedded information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.698"
                                            },
                                            "Text": {
                                                "val": "Complete development to enhance signal processing techniques to fit into existing ISR infrastructures.  Complete the development of a set of algorithms that can automatically track space objects in support of SSA.  Continue both the integration of developed watermarking techniques and protocols for information assurance, provenance, and pedigree leading to the integration of watermarking technologies into network-centric programs of record, and the development of novel steganalysis methods for identifying and disrupting embedded information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.332"
                                            },
                                            "Text": {
                                                "val": "Continue both the integration of developed watermarking techniques and protocols for information assurance, provenance, and pedigree leading to the integration of watermarking technologies into network-centric programs of record, and the development of novel steganalysis methods for identifying and disrupting embedded information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Developed and demonstrated advanced data handling, event visualization technologies, and distributed data fusion to enable a more effective utilization of data available."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.730"
                                            },
                                            "Text": {
                                                "val": "Developed mature and integrated models for adversarial behavior and provide support for situation analysis utilizing a service oriented architecture.  Developed and demonstrated the capability to conduct distributed fusion to enhance situational awareness of the battlespace.  Initiated development of algorithmic tools and techniques to analyze and exploit recorded signals intelligence data across multiple missions, to provide the capability for forensic analysis of single or multi-platform data across multiple missions for increased situational awareness and intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.949"
                                            },
                                            "Text": {
                                                "val": "Continue development to mature and integrate models for adversarial behavior and provide support for situation analysis utilizing a service oriented architecture.   Continue development of algorithmic tools and techniques to analyze and exploit recorded signals intelligence data across multiple missions, to provide the capability for forensic analysis of single or multi-platform data across multiple missions for increased situational awareness and intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.743"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.743"
                                            },
                                            "Text": {
                                                "val": "Complete development to mature and integrate models for adversarial behavior and provide support for situation analysis utilizing a service oriented architecture. Complete development of algorithmic tools and techniques to analyze and exploit recorded signals intelligence data across multiple missions, to provide the capability for forensic analysis of single or multi-platform data across multiple missions for increased situational awareness and intelligence. Initiate development of a prototype for the fusion of information (temporally and geospatially) from multiple exploitation domains to create a comprehensive understanding of the battlespace."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate capabilities for reasoning and learning, text understanding, link and group discovery, and advanced analysis for situational awareness and understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.257"
                                            },
                                            "Text": {
                                                "val": "Developed a text extraction capability that enables users to fine-tune the extractor, based on their specialized knowledge of the domain, to achieve higher performance.  Developed tools and services for advanced behavioral modeling techniques and advanced capabilities for analysis that integrate situation understanding, situation monitoring, and event anticipation.  Initiated development of dynamic social network analysis methods to provide the analyst with the ability to identify high value targets in social networks and anticipate their role and activity.  Developed a set of algorithms that can automatically develop, reason, dynamically update various sub-sets of the existing intelligence preparation of the battlespace products, and initiated development of techniques for analyzing and assessing activities to support situation assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.471"
                                            },
                                            "Text": {
                                                "val": "Complete development of a text extraction capability that enables users to fine-tune the extractor, based on their specialized knowledge of the domain, to achieve higher performance.  Complete development of tools and services for advanced behavioral modeling techniques and advanced capabilities for analysis that integrate situation understanding, situation monitoring, and event anticipation.  Initiate exploring general purpose bridges between the corpus of electronic text and formal reasoning systems.  Continue development of dynamic social network analysis methods to provide the analyst with the ability to identify high value targets in social networks and anticipate their role and activity.  Complete development of a set of algorithms that can automatically develop, reason, dynamically update various sub-sets of the existing intelligence preparation of the battlespace products,  and continue development of techniques for analyzing and assessing activities to support situation assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.879"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.879"
                                            },
                                            "Text": {
                                                "val": "Continue exploring general purpose bridges between the corpus of electronic text and formal reasoning systems.  Complete development of dynamic social network analysis methods to provide the analyst with the ability to identify high value targets in social networks and anticipate their role and activity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4."
                                    },
                                    "Description": {
                                        "val": "Develop models to provide detailed understanding of the adversary's probable intent and future strategy to identify adversary COAs, the most likely COA, and the COA most dangerous to friendly forces and mission accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.129"
                                            },
                                            "Text": {
                                                "val": "Completed research to forecast actionable futures to support a decision maker's ability to appraise and plan the \"best\" blue course of action for rapid decide, act, and adapt (RDAA).  Completed investigation of ability to forecast potential adversaries and events based on indications of known evidence and projected known and\/or anticipated threat(s).  Investigated the capability to manage multiple possible future adversary COAs prioritized based on current and future (projected) impact\/threat.  Investigated screening techniques that give the analyst\/decision maker insight into the contribution or sensitivity of various factors on a given observable\/response, initiated investigation of techniques that will allow model adaptation to new regions and nations, and started development of a functional graphical user environment to support output analysis.  Initiated capability to model and explore policy actions and reactions taken by the different modeled entities.  Initiated development and demonstrate of robust support applications to enhance multi-intelligence collection requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.376"
                                            },
                                            "Text": {
                                                "val": "Continue development of a functional graphical user environment to support output analysis and complete investigations in developing screening techniques that give the analyst\/decision maker insight into the contribution or sensitivity of various factors on a given observable\/response and use scenarios and conduct user testing and feedback of models for new regions and nations.  Complete investigation of the capability to manage multiple possible future adversary COAs prioritized based on current and future (projected) impact\/threat.  Continue developing capability to model and explore policy actions and reactions taken by the different modeled entities, and start developing the capability to allow users to perform automated generation, assessment, and visualization of traces from model results to key underlying causes.  Continue to develop and demonstrate robust support applications to enhance multi-intelligence collection requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.915"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.915"
                                            },
                                            "Text": {
                                                "val": "Continue development of a functional graphical user environment to support output analysis and complete investigations in developing screening techniques that give the analyst\/decision maker insight into the contribution or sensitivity of various factors on a given observable\/response and use scenarios and conduct user testing and feedback of models for new regions and nations. Continue developing capability to model and explore policy actions and reactions taken by the different modeled entities, and start developing the capability to allow users to perform automated generation, assessment, and visualization of traces from model results to key underlying causes.  Initiate development of tools to increase awareness of alternatives and ramifications of selecting given target sets. Initiate development of exploitation and analysis tools to automate target recognition and tracking."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635322"
                    },
                    "ProjectTitle": {
                        "val": "Knowledge Management and Computing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.410"
                        },
                        "CurrentYear": {
                            "val": "7.525"
                        },
                        "BudgetYearOne": {
                            "val": "5.577"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.577"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.353"
                        },
                        "BudgetYearThree": {
                            "val": "6.621"
                        },
                        "BudgetYearFour": {
                            "val": "6.479"
                        },
                        "BudgetYearFive": {
                            "val": "8.399"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that will provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed Air and Space Operations Center (AOC), as well as among other producers, consumers, and managers of information relevant to other particular communities of interest (COI).  This project demonstrates the enterprise management capabilities needed for the rapid distribution of actionable information, as well as the needed advances in high performance computing to ensure this complex capability.  This project develops an agile information environment that focuses on quality of service, transformation and brokering, a federated information environment focusing the relationship among the members of the environment, a secure cross-domain information sharing capability that focuses on the security layer and inter-COI information exchange in different security domains, and a collaboration environment focusing on the information workflow layer of the enterprise.  This project will also develop:  1) a computational science and engineering capability demonstrating new models of computation; 2) novel approaches for high performance, interactive, net-centric, distributed, and embedded computing systems; and 3) the technological tools enabling affordable, large-scale, complex, software intensive systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game changing computing power to the warfighter, anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.619"
                                            },
                                            "Text": {
                                                "val": "Developed petaflops embedded on-demand computing and completed demonstration of real-time high performance computing services to enhance space situational awareness and complete enhancement of firmware and software for existing high performance computer boards for plug-and play-satellite.  Completed development and demonstration of stacked chip architecture for cognitive and autonomous systems.  Developed and demonstrated high-payoff, high performance computing applications to reduce size, weight, and power restrictions.   Completed development of  predictable software testing tools to ease the complexity, understanding, and managing software in software-intensive systems.  Initiated development of  comprehensive software and hardware solutions for parallel discrete event simulation on emerging multi-core architectures.  Completed development and prototype demonstration of trusted router hardware based upon a hardware root of trust."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.201"
                                            },
                                            "Text": {
                                                "val": "Continue the development of petaflops embedded on-demand computing, and demonstrate achieved performance and functionality.  Initiate development of architectures for a compact large array of many node clusters with very low power demand for intelligent systems.  Initiate development and demonstration of an autocode generation capability for software intensive systems.  Complete development of comprehensive software and hardware solutions for parallel discrete event simulation on emerging multi-core architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.559"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.559"
                                            },
                                            "Text": {
                                                "val": "Complete the development of petaflops embedded on-demand computing, and demonstrate achieved performance and functionality.  Continue development of architectures for a compact large array of many node clusters with very low power demand for intelligent systems.  Continue development and demonstration of an autocode generation capability for software intensive systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Demonstrate how a publish, subscribe, and query information management paradigm can enable vertical and horizontal integration of Air Force information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.036"
                                            },
                                            "Text": {
                                                "val": "Developed secure, accreditable cross domain information sharing techniques in an operational setting and developed a scalable integrated environment where information is easily and securely shared across multiple secure domains while preventing accidental or intentional information disclosure.  Developed an adaptive security policy expression and enforcement mechanism for automated information review and release among different security domains.  Completed development of a method to securely link data and metadata."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.534"
                                            },
                                            "Text": {
                                                "val": "Complete development of an adaptive security policy expression and enforcement mechanism for automated information review and release among different security domains.  Complete developments of secure, accreditable cross domain information sharing techniques in an operational setting and of a scalable integrated environment where information is easily and securely shared across multiple secure domains while preventing accidental or intentional information disclosure. Initiate development of attack resistant cross domain services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.721"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.721"
                                            },
                                            "Text": {
                                                "val": "Continue development of attack resistant cross domain services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Demonstrate how agile information management services enable effective information sharing in a tactical environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.755"
                                            },
                                            "Text": {
                                                "val": "Developed tactical information management(IM) pub\/sub\/query mechanisms focusing on stability, performance, and reliability for assured access and isolation from malicious client applications, and assured levels of QoS.  Initiated investigating and quantifying the network burden and quality of service requirements for service oriented architecture implementations across a variety of tactical environments.  Initiated development of survivable IM services that are highly adaptive and self-aware across the variety of IM architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.790"
                                            },
                                            "Text": {
                                                "val": "Continue development of tactical information management pub\/sub\/query mechanisms focusing on stability, performance, and reliability for assured access and isolation from malicious client applications, and assured levels of QoS.  Initiate design and development of a mission oriented, highly adaptive and self-aware unified intelligent capability to provide observable, actionable insights and visibility across information management services and their deployed platforms from inside-out and provide survivability-aware information sharing capabilities to anticipate achieving the information level mission goals under any conditions.  Continue investigating and quantifying the network burden and quality of service requirements for service oriented architecture implementations across a variety of tactical environments.  Continue development of survivable IM services that are highly adaptive and self-aware across the variety of IM architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.297"
                                            },
                                            "Text": {
                                                "val": "Complete development of tactical information management pub\/sub\/query mechanisms focusing on stability, performance, and reliability for assured access and isolation from malicious client applications, and assured levels of QoS. Continue design and development of a mission oriented, highly adaptive and self-aware unified intelligent capability to provide observable, actionable insights and visibility across information management services and their deployed platforms from inside-out and provide survivability-aware information sharing capabilities to anticipate achieving the information level mission goals under any conditions. Continue investigating and quantifying the network burden and quality of service requirements for service oriented architecture implementations across a variety of tactical environments. Continue to develop information management capabilities in support of force protection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}