{
    "id": "d9c69b2f3c66f24c5ffdc6565ebdaae1d21ceba5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601110D8Z"
        },
        "ProgramElementTitle": {
            "val": "Basic Research Initiatives"
        },
        "R1LineItemNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "7.482"
            },
            "BudgetYearOne": {
                "val": "19.405"
            },
            "BudgetYearOneBase": {
                "val": "19.405"
            },
            "BudgetYearTwo": {
                "val": "13.754"
            },
            "BudgetYearThree": {
                "val": "18.742"
            },
            "BudgetYearFour": {
                "val": "23.631"
            },
            "BudgetYearFive": {
                "val": "20.899"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This PE incorporates Minerva Research Initiative activities – Minerva chairs at Service Institutions and a solicitation for academic university-led research – and activities to implement the basic science office strategic plan for Department of Defense (DoD)."
        },
        "ProgramElementMissionDescription": {
            "val": "Basic Research provides the DoD with a deep and broad awareness of current directions and breakthroughs in science and engineering through the scientific performers in areas of research that are relevant to U.S. military capabilities including: physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences.  Basic Research sustains scientific and engineering communities in areas that form critical technical underpinning of DoD capabilities.  Basic Research through exploration and discovery provides unique means for disruptive non-incremental advances that can improve or radically change military strategy and operations.   \n\nThe Minerva Research Initiative is a university-based social science basic research program initiated in FY 2008 and managed within the Office of the Secretary of Defense.  Minerva seeks to build deeper understanding of the social, cultural, and political forces that shape regions of the world of strategic importance to the U.S.  This will support more effective strategic decisions, operational policies and force deployments.\n\nThe Basic Research Strategic Support program funds initiatives to implement the Assistant Secretary of Defense for Research and Engineering strategic plan for defense basic research.  This plan defines specific and quantifiable actions to help create conditions for defense basic research investments capable of creating high-payoff, transformative scientific breakthroughs for DoD.  These initiatives support the five aims of providing scientific leadership, attracting the Nation’s best scientists and engineers, ensuring the coherence and balance of the basic research portfolio, fostering connections between DoD performers and DoD, and improving the efficiency of the defense research business environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "14.731"
                },
                "BudgetYearOne": {
                    "val": "20.115"
                },
                "BudgetYearOneBase": {
                    "val": "20.115"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "7.482"
                },
                "BudgetYearOne": {
                    "val": "19.405"
                },
                "BudgetYearOneBase": {
                    "val": "19.405"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-7.249"
                },
                "BudgetYearOne": {
                    "val": "-0.710"
                },
                "BudgetYearOneBase": {
                    "val": "-0.710"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-0.197"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.052"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.710"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.710"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Basic Research Initiatives PE reflects the transfer of the Minerva Research Intiative from the Army in FY 2012."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P010"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research Initiatives"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "7.482"
                        },
                        "BudgetYearOne": {
                            "val": "19.405"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.405"
                        },
                        "BudgetYearTwo": {
                            "val": "13.754"
                        },
                        "BudgetYearThree": {
                            "val": "18.742"
                        },
                        "BudgetYearFour": {
                            "val": "23.631"
                        },
                        "BudgetYearFive": {
                            "val": "20.899"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Basic Research provides the Department of Defense (DoD) with a deep and broad awareness of current directions and breakthroughs in science and engineering through the scientific performers in areas of research that are relevant to U.S. military capabilities including: physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, applied mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences.  Basic Research sustains scientific and engineering communities in areas that form critical technical underpinning of DoD capabilities.  Basic Research through exploration and discovery provides unique means for disruptive non-incremental advances that can improve or radically change military strategy and operations.   \n\nThe Minerva Research Initiative is a university-based social science basic research program initiated in FY 2008 and managed within the Office of the Secretary of Defense.  Minerva seeks to build deeper understanding of the social, cultural, and political forces that shape regions of the world of strategic importance to the U.S.  This will support more effective strategic decisions, operational policies and force deployments.\n\nThe Basic Research Strategic Support program funds initiatives to implement the Assistant Secretary of Defense for Research and Engineering strategic plan for defense basic research.  This plan defines specific and quantifiable actions to help create conditions for defense basic research investments capable of creating high-payoff, transformative scientific breakthroughs for DoD.  These initiatives support the five aims of providing scientific leadership, attracting the Nation’s best Scientists and Engineers, ensuring the coherence and balance of the basic research portfolio, fostering connections between DoD performers and DoD, and improving the efficiency of the defense research business environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Minerva Research Initiative"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Support endowed faculty chairs for Minerva Research Fellows at defense education institutions (war colleges and service academies)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.520"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.520"
                                            },
                                            "Text": {
                                                "val": "Support endowed faculty chairs for Minerva Research Fellows at defense education institutions such as war colleges and service academies. Support new university-led research initiatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Research Strategic Support"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.482"
                                            },
                                            "Text": {
                                                "val": "Conduct workshops for scientific situational awareness, convening National research leaders to provide an experts perspective on potential breakthroughs and barriers to advancement in rapidly evolving fields of Basic Reasearch.  Analyze university-related business practices for improvement.  Bring on top scientific experts as IPAs to oversee engineering and social science initiatives.  Hold Assistant Secretary of Defense for Research and Engineering - Deans Dialog event to foster more active connections with research universities.  Establish Department of Defense (DoD)-wide Basic Research objectives and priorities.  Analyze university-related business practices for improvement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.885"
                                            },
                                            "Text": {
                                                "val": "Conduct workshops for scientific situational awareness, convening National research leaders to provide an experts perspective on potential breakthroughs and barriers to advancement in rapidly evolving fields of Basic Research.  Bring on top scientific experts as Intergovernmental Personnel Act (IPAs) to oversee engineering and social science initiatives.  Hold ASD(R&E)-Deans Dialog event to foster more active connections with research universities.  Establish DoD-wide Basic research objectives and priorities.  Analyze university-related business practices for improvement."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}