{
    "id": "dba18f90ca6714d3c7e559aa8560dabe06127c2e",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DSCA_JustificationBook_Defense_Security_Cooperation_Agency_PB_2013.zzz_unzipped_JustificationBook_Defense_Security_Cooperation_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Security Cooperation Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605127T"
        },
        "ProgramElementTitle": {
            "val": "Regional International Outreach (RIO) - Partnership for Peace Information Management System (PIMS)"
        },
        "R1LineItemNumber": {
            "val": "186"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Security Cooperation Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.090"
            },
            "CurrentYear": {
                "val": "2.165"
            },
            "BudgetYearOne": {
                "val": "3.238"
            },
            "BudgetYearOneBase": {
                "val": "3.238"
            },
            "BudgetYearTwo": {
                "val": "3.270"
            },
            "BudgetYearThree": {
                "val": "2.292"
            },
            "BudgetYearFour": {
                "val": "2.361"
            },
            "BudgetYearFive": {
                "val": "2.407"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Regional International Outreach (RIO) - Partnership for Peace (PfP) Information Management System (PIMS) is an Office of the Secretary of Defense (OSD) initiative to deploy a common information technology platform to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions to directly share participants and content across websites - fosters networks of partner influencers and enables better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities as required. The program uses a spiral methodology (making available capabilities as developed), to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the RIO-PIMS effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe RIO-PIMS effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders, the DSCA, OUSD (Policy), North Atlantic Treaty Organization’s (NATO) Military Cooperation Division (MCD), the PfP Consortium of Defense Academies, PfP Partner countries, and other designated DoD institutions and communities. It provides DoD and international partner security practitioners a platform to share information, communicate and collaborate, and improve administrative activities. It also provides the ability to form collaborative communities of interest around security issues. RIO- PIMS facilitates information sharing and knowledge management concepts in accordance with U.S. policy. PIMS, as a part of the NATO Enlargement Facilitation Act of 1996, implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure.  RIO-PIMS provides allies and partner countries the ability to collaborate in critical cooperative activities that underpin the spirit of the PfP program.  The program supports PfP coalition initiatives through development of distributive collaboration tools to support aspects of U.S. and NATO-approved PfP cooperative activities.  This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force.  RIO-PIMS supports internet-based education and collaboration, exercise simulations, and training center requirements. \n\nRCPAMS provides an integrated student and activities management framework that was designed to complement the capabilities of the Security Assistance Network (SAN).  This interface between the SAN, RCPAMS, and RIO-PIMS provides faculty and students an effective information service to ensure student, activity and alumni management.  Data is shared between the systems ensuring improved data integrity."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.139"
                },
                "CurrentYear": {
                    "val": "2.165"
                },
                "BudgetYearOne": {
                    "val": "2.194"
                },
                "BudgetYearOneBase": {
                    "val": "2.194"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.090"
                },
                "CurrentYear": {
                    "val": "2.165"
                },
                "BudgetYearOne": {
                    "val": "3.238"
                },
                "BudgetYearOneBase": {
                    "val": "3.238"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.049"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.044"
                },
                "BudgetYearOneBase": {
                    "val": "1.044"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.049"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment Increase"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Non Pay Economic  Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.044"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.044"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:    RIO-PIMS requires $3.238 to implement the gaming and exercise support module that was researched and defined in FY12; extend the email\/system notification functionality to allow users to respond directly to system generated notifications without having to login to the system; to research the computer human interface (CHI) ensuring it meets RIO-PIMS mission objectives – modify where necessary, validate existing requirements with the user communities and gather new ones; to deploy a native video teleconference (VTC) capability to replace the existing Adobe connect system; to update the GlobalNET implementation to the newest platform release; and to complete the 2013 recertification of security accreditation process that reflects the new and updated software capabilities as well newly integrated educational organizations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000000"
                    },
                    "ProjectTitle": {
                        "val": "Regional International Outreach - Partnership for Peace Information Management Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.090"
                        },
                        "CurrentYear": {
                            "val": "2.165"
                        },
                        "BudgetYearOne": {
                            "val": "3.238"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.238"
                        },
                        "BudgetYearTwo": {
                            "val": "3.270"
                        },
                        "BudgetYearThree": {
                            "val": "2.292"
                        },
                        "BudgetYearFour": {
                            "val": "2.361"
                        },
                        "BudgetYearFive": {
                            "val": "2.407"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Regional International Outreach (RIO) - Partnership for Peace (PfP) Information Management System (PIMS) is an Office of the Secretary of Defense (OSD) initiative to deploy a common information technology platform to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions to directly share participants and content across websites - fosters networks of partner influencers and enables better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities as required. The program uses a spiral methodology (making available capabilities as developed), to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the RIO-PIMS effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe RIO-PIMS effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders, the DSCA, OUSD (Policy), North Atlantic Treaty Organization’s (NATO) Military Cooperation Division (MCD), the PfP Consortium of Defense Academies, PfP Partner countries, and other designated DoD institutions and communities. It provides DoD and international partner security practitioners a platform to share information, communicate and collaborate, and improve administrative activities. It also provides the ability to form collaborative communities of interest around security issues. RIO- PIMS facilitates information sharing and knowledge management concepts in accordance with U.S. policy. PIMS, as a part of the NATO Enlargement Facilitation Act of 1996, implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure.  RIO-PIMS provides allies and partner countries the ability to collaborate in critical cooperative activities that underpin the spirit of the PfP program.  The program supports PfP coalition initiatives through development of distributive collaboration tools to support aspects of U.S. and NATO-approved PfP cooperative activities.  This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force.  RIO-PIMS supports internet-based education and collaboration, exercise simulations, and training center requirements. \n\nRCPAMS provides an integrated student and activities management framework that was designed to complement the capabilities of the Security Assistance Network (SAN).  This interface between the SAN, RCPAMS, and RIO-PIMS provides faculty and students an effective information service to ensure student, activity and alumni management.  Data is shared between the systems ensuring improved data integrity."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Regional International Outreach - Partnership for Peace Information Management System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.090"
                                            },
                                            "Text": {
                                                "val": "In FY2011, RIO-PIMS achieved full operating capability (FOC) through a compressed agile software management process that went through all phases of software delivery.   RIO-PIMS re-validated all the system functional requirements through global audience research.  It distilled technical requirements from those functional requirements, developed use cases, and created a new information architecture (IA). The technical architecture was examined and determined to be inadequate for the validated requirements and a new technical architecture was developed and deployed.  A new user experience was planned and implemented through a new computer human interface (CHI).  An operational test plan, based on all of the requirements and workflow, was developed and executed by an independent authority.  Deployed system to seven members of the RIO-PIMS community. Moved all of the operational software and data from a Network Operations Center (NOC) in Stuttgart, Germany to a NOC in Ashburn, VA to save cost and increase speed for end users.  Closed multiple security holes found in production system in addition to development activities and achieving DoD milestones.\n\nCompleted the Capabilities Production Document (CPD); and Information Support Plan (ISP) required for Joint Capabilities Integration and Development System (JCIDS) process. Completed the security accreditation package in order to maintain Mission Assurance Category (MAC) Level 3, Common Criteria EAL-2, and Federal Information Process Standards (FIPS) Security Level 2. \n\nEnsured supported institutions had system providing faculty and students an effective information service to ensure student, activity and alumni management. Validated, tested, and implemented an integrated student and activities management framework called RCPAMS.  This included migrating legacy data from five regional centers and ensuring RCPAMS met or exceeded all functionality.  In addition, planned and executed an interface between the SAN and RCPAMS.  Planned for an interface between RCPAMS and RIO-PIMS. Planned for student nomination form on the GlobalNET platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.165"
                                            },
                                            "Text": {
                                                "val": "Deploy the new platform to Counter terrorism fellowship program (CFTP) Education and Collaboration Community Online (ECCO), Global Center for Security Cooperation (GCSC), Defense Institute for International Legal Studies (DIILS), PIMS Partners, Defense Language Institute English Learning Centers (DLI-ELC), Military Cooperation Division (MCD) at SHAPE, School if International Graduate Studies (SIGS), and the NATO School.\n\nBegin development of direct data exchange links with relevant information systems to remove the technical limitations to information sharing between GlobalNET and other learning management systems (LMS) implementations.  \n\nRefine, test and deploy the chat capability.  In addition, provide a framework for chat that will include the replacement for the capabilities for Adobe connect to minimize the recurring costs of the VTC capabilities and whiteboarding.\n\nWork with DSCA and OSD-P leaders to identify institutions which need a similar capability.  Work to extend the platform for those institution specific requirements, allowing existing members to avail themselves of the newly developed feature sets.\n\nWork with the integrators of the RCPAMS system to ensure that information is exchanged between RCPAMS and GlobalNET.  This will include the implementation of 1) an automatic provision module allowing information from RCPAMS to populate and provision accounts for eligible participants, 2) participant nomination form, and 3) automatic group enrollment based on course participation.  Work with the exiting platform managers to update the GlobalNET implementation to the newest platform stable release - allowing greater functionality and better security across all members of the platform.\n\nComplete 2012 recertification of security accreditation process that also reflects the new and updated software capabilities as well newly integrated educational organizations. Conduct developmental and operational testing of latest software release.  Release latest validated software release into production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.238"
                                            },
                                            "Text": {
                                                "val": "Fully implement the gaming and exercise support module as researched and defined in FY 2012.  This will include deploying the capability to the indentified user communities, defining the process how to create, modify, test, and deploy scenarios for gaming and exercise support.  In addition, introduce the capability to the unintended communities for review and inclusion into their baseline capabilities.\n\nWork to extend the email functionality support to the system users such that plain language support for common tasks is provided through email. This extends the exiting capability of responding to system generated notifications by allowing user initiated tasks through plain language submitted in an email.  The system will post all of the content correctly and in a structured format for knowledge management.  It begins to turn email into a client for limited functionality.\n\nValidate the existing requirements are still applicable to the aggregate user community across the platform.  Research the effectiveness of the CHI and ensure that it meets all mission objectives and goals and modify where necessary.  Perform user research to validate the new changes and implement the CHI to the platform.\n\nWork with DSCA and OSD-P leaders to identify institutions which need a similar capability.  Work to extend the platform for those institution specific requirements, allowing existing members to avail themselves of the newly developed feature sets.\n\nDeploy a native video teleconference (VTC) capability to replace the existing hosted service.  GlobalNET is currently bundled with a loosely coupled Adobe connect system outside of the GlobalNET stack and hosting environment.  The capability would create a native VTC capability inside of the platform allowing much tighter integrations with messaging, file sharing, white boarding, and chatting and reduce the operations and maintenance (O&M) expense of leasing this service.\nWork with the existing platform managers to update the GlobalNET implementation to the newest platform stable release - allowing greater functionality and better security across all members of the platform.\n\nComplete 2013 recertification of security accreditation process that also reflects the new and updated software capabilities as well newly integrated educational organizations.   Conduct the research and define the requirements for the gaming and exercise simulation module."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "RIO-PIMS employs a spiral acquisition strategy to ensure a well-defined model for each institution\/ community that can be exported globally.  The program uses a regional approach to ensure sustainable, leave-behind technology and information sharing procedures.  By partnering with other U.S. Government agencies, existing assets are leveraged to preserve U.S. investments, avoid duplication of effort between agencies, and offer economically prudent solutions to improve information sharing and achieve U.S. security cooperation goals.  RIO-PIMS has hired an independent Operational Test team to ensure that the program bears independent validation of the development team’s effort.  RIO-PIMS has regional based personnel to assist in the adoption of the GlobalNET platform with partners who are not familiar with social collaboration and networking media."
                        },
                        "PerformanceMetrics": {
                            "val": "RIO-PIMS project performance is measured in several methods: the successful meeting of stated performance objectives in the statement of work, and meeting target dates in the project management plan; via a combination of statistics including the number of trouble tickets generated on the development site, operational user feedback on development site usability, and design; and the system’s performance during developmental and operational testing.   The use of a 3rd party to execute the operational test ensures that the system meets the performance metrics prior to moving to production."
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Execute Operational Test Plan"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deploy System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award Support Services Contract for Support, ISP, and Limited Equipment Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Refine Interface for Community Use"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Certification and Accreditation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Process JCIDS Documents"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Review Operational Requirements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop RCPAMS Interface"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify New Institutions for GlobalNET"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Upgrade Core and Maintenance Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deploy to Other Institutions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Review Technical Architecture"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}