{
    "id": "dbfd18660540070fe666c5388a02fd74eee8e74a",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603121D8Z"
        },
        "ProgramElementTitle": {
            "val": "SO\/LIC Advanced Development"
        },
        "R1LineItemNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.525"
            },
            "CurrentYear": {
                "val": "44.199"
            },
            "BudgetYearOne": {
                "val": "26.324"
            },
            "BudgetYearOneBase": {
                "val": "26.324"
            },
            "BudgetYearTwo": {
                "val": "19.544"
            },
            "BudgetYearThree": {
                "val": "9.952"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "P206, Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC).  The EOD\/LIC Program develops and delivers advanced capabilities for military Explosive Ordnance Disposal (EOD) operators and Special Operations Forces (SOF) to meet the challenges of improvised explosive devices (IEDs), force protection, and the war on terrorism.  EOD\/LIC efforts focus in two areas:  support to SOF to combat terrorism; and access, detection, identification, and neutralization of all types of conventional explosive ordnance and improvised explosive devices.  Requirements submitted by the Joint Service EOD and Service Special Operations communities are prioritized and approved by OASD (SO\/LIC).  \n  \nP207, Special Reconnaissance Capabilities (SRC).  The SRC Program exploits, leverages, and integrates DoD’s service and agency efforts to improve surveillance and reconnaissance tools (unattended sensors, tagging and tracking devices, data infiltration\/exfiltration, remote delivery, and mobility\/delivery of sensors), while providing risk reduction for DoD and other agency technology and development programs.  The SRC Program identifies, integrates, and operationalizes the technical tools for the collection of actionable information against a variety of targets and mission requirements, including emerging requirements , and maintains DoD’s on-line catalog of tools in order to minimize crisis response time for special reconnaissance and surveillance. \n \nP208, Information Dissemination Concepts (IDC).  The IDC Program addresses technology capabilities necessary to enable sustained information dissemination campaigns in denied areas.  The IDC program, working as necessary with DoD and the interagency, develops, modifies, and demonstrates concepts, mechanisms, platforms and payloads to propagate themes and messages that convince target audiences to take action favorable to the United States and its allies. \n \nP209, Irregular Warfare Support (IWS).  The IWS Program (IWSP) develops adaptive and agile capabilities and methodologies to support irregular warfare in the current and evolving strategic environments. IWSP supports joint, interagency, and international partners who conduct or counter irregular warfare through indirect and asymmetric approaches, though they may employ a full range of military and other capabilities, in order to erode an adversary’s power, influence, and will. Solutions include material and non-material operational analysis, concept development, field experimentation, and delivery of capabilities, to defeat the motivations, sanctuaries, and enterprises of targeted state and non-state actors."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.423"
                },
                "CurrentYear": {
                    "val": "45.028"
                },
                "BudgetYearOne": {
                    "val": "45.869"
                },
                "BudgetYearOneBase": {
                    "val": "45.869"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.525"
                },
                "CurrentYear": {
                    "val": "44.199"
                },
                "BudgetYearOne": {
                    "val": "26.324"
                },
                "BudgetYearOneBase": {
                    "val": "26.324"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.898"
                },
                "CurrentYear": {
                    "val": "-0.829"
                },
                "BudgetYearOne": {
                    "val": "-19.545"
                },
                "BudgetYearOneBase": {
                    "val": "-19.545"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.493"
                    },
                    "CurrentYear": {
                        "val": "-0.528"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.179"
                                },
                                "CurrentYear": {
                                    "val": "-0.301"
                                },
                                "BudgetYearOne": {
                                    "val": "-19.545"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-19.545"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic assumption"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.226"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2013 baseline budget was reduced due to fiscal constraints and higher priorities within the Department."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Explosive Ordnance Disposal\/Low-Intensity Conflict"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.487"
                        },
                        "CurrentYear": {
                            "val": "7.520"
                        },
                        "BudgetYearOne": {
                            "val": "4.544"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.544"
                        },
                        "BudgetYearTwo": {
                            "val": "3.374"
                        },
                        "BudgetYearThree": {
                            "val": "1.718"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P206, Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC).  The EOD\/LIC program develops and delivers advanced capabilities for military EOD operators and Special Operations Forces (SOF) to meet the challenges of improvised explosive devices (IEDs), force protection, and the war on terrorism.  EOD\/LIC efforts focus in two areas:  support to SOF to combat terrorism; and access, detection, identification, and neutralization of all types of conventional explosive ordnance and improvised explosive devices.  Requirements submitted by the Joint Service EOD and Service Special Operations communities are prioritized and approved by Office of the Assistant Secretary of Defense (OASD) (SO\/LIC &IC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive Ordnance Disposal\/Low-Intensity Conflict (EOD\/LIC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.487"
                                            },
                                            "Text": {
                                                "val": "Evaluated shaped charges to defeat buried IEDs.  Developed an EOD expeditionary capability for the identification and detection of homemade explosives and precursor materials.  Developed and validated a program of instruction for advanced IED defeat techniques for SOF EOD operators.  Demonstrated a stabilized weapons system module for low-profile combatant craft.  Demonstrated a handheld jamming effectiveness tester device capable of both analyzing signals within the range of common jamming systems and indicating whether the user’s point of measurement is within the protective area of a nearby Electronic Countermeasure Measure (ECM) system.  Demonstrated a portable, battery-powered active jamming device capable of defeating multiple Remote Controlled Improvised Explosive Device (RCIED) threats within a confined space by tossing one or more of the softball-sized devices into the space, similar to standard grenades."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.520"
                                            },
                                            "Text": {
                                                "val": "Develop tools and equipment to enhance situational awareness and operational capability during incident response or direct action operations. Develop an EOD Helmet Liner that allows an operator to optimize fit of an EOD helmet in a deployed setting with minimal support equipment.  Develop an electromagnetic, non-lethal capability to disrupt outboard engines of small craft.  Design a compact, high-power next generation x-ray generator for EOD use.  Design a radio repeater system for robotic platforms. Improve missile launch pod design for use on unmanned surface vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.544"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.544"
                                            },
                                            "Text": {
                                                "val": "Test an EOD Helmet Liner that allows an operator to optimize fit of an EOD helmet in a deployed setting with minimal support equipment.  Demonstrate an electromagnetic, non-lethal capability to disrupt outboard engines of small craft.  Evaluate a compact, high-power next generation x-ray generator for EOD use.  Demonstrate and optimize a radio repeater system for robotic platforms.  Demonstrate a remote missile launch pod module for use on unmanned surface vehicles or other small craft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "207"
                    },
                    "ProjectTitle": {
                        "val": "Special Reconnaisance Capabilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.644"
                        },
                        "CurrentYear": {
                            "val": "20.474"
                        },
                        "BudgetYearOne": {
                            "val": "12.239"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.239"
                        },
                        "BudgetYearTwo": {
                            "val": "9.087"
                        },
                        "BudgetYearThree": {
                            "val": "4.627"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P207, Special Reconnaissance Capabilities (SRC).  The primary objective of the SRC program is to seek out and identify technical tools for the collection of actionable data and information which will assist DoD in its execution of Overseas Contingency Operations (OCO) tasks.  To accomplish this objective, the program leverages emerging and existing developmental technologies from government and commercial ventures and operationalizes them to meet near term reconnaissance and surveillance operational requirements.  The operational tools transition unattended sensors, tagging devices, data transfer, remote delivery, and mobility\/delivery of sensors into established Programs of Record throughout the DoD.  The program evaluates new and existing technical surveillance technologies and incorporates results into a reference database for future access."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SPECIAL RECONNAISANCE CAPABILITIES"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.644"
                                            },
                                            "Text": {
                                                "val": "SRC continued to identify, develop, integrate, and field promising persistent intelligence, surveillance, and reconnaissance (ISR) advanced technologies and capabilities.  High payoff technologies that have been researched and transitioned include: audio and optical technologies; improvement in flexibility and accuracy through integration of disparate technologies into single devices; ultra high speed data processing and transmission; next-generation nanotechnology\/miniaturization; affordable Application Specific Integrated Circuit (ASIC) technology; low profile enhanced micro-optics; next-generation precision Hostile Forces Tagging, Tracking, and Locating capabilities; low profile, advanced material miniature antennas; placement and concealment of unattended ground sensors; and low power, high bandwidth data transmission sub-systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.474"
                                            },
                                            "Text": {
                                                "val": "Continue to identify, develop, integrate, and field promising persistent intelligence, surveillance, and reconnaissance (ISR) advanced technologies and capabilities.  High payoff technologies that will be researched and transitioned include: audio and optical technologies; improvement in flexibility and accuracy through integration of disparate technologies into single devices; ultra high speed data processing and transmission; next-generation nanotechnology\/ miniaturization; affordable Application Specific Integrated Circuit (ASIC) technology; low profile enhanced micro-optics; next-generation precision Hostile Forces Tagging, Tracking, and Locating capabilities; low profile, advanced material miniature antennas; placement and concealment of unattended ground sensors; and low power, high bandwidth data transmission sub-systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.239"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.239"
                                            },
                                            "Text": {
                                                "val": "Continue to identify, develop, integrate, and field promising persistent intelligence, surveillance, and reconnaisance (ISR) advanced technologies and capabilities.  High payoff technologies that will be researched and transitioned include: audio and optical technologies; improvement in flexibility and accuracy through integration of disparate technologies into single devices; ultra high speed data processing and transmission; next-generation nanotechnology\/miniaturization; affordable Application Specific Integrated Circuit (ASIC) technology; low profile enhanced micro-optics; next-generation precision Hostile Forces Tagging, Tracking, and Locating capabilities; low profile, advanced material miniature antennas; placement and concealment of unattended ground sensors; and low power, high bandwidth data transmission sub-systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "208"
                    },
                    "ProjectTitle": {
                        "val": "Information Dissemination Concepts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.461"
                        },
                        "CurrentYear": {
                            "val": "3.175"
                        },
                        "BudgetYearOne": {
                            "val": "1.919"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.919"
                        },
                        "BudgetYearTwo": {
                            "val": "1.425"
                        },
                        "BudgetYearThree": {
                            "val": "0.725"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Information Dissemination Concepts (IDC).  The IDC Program addresses technology capabilities necessary to enable sustained information dissemination campaigns in denied areas.  The IDC Program, working as necessary with DoD and the interagency, develops, modifies, and demonstrates concepts, mechanisms, platforms and payloads to propagate themes and messages that convince target audiences to take action favorable to the United States and its allies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "INFORMATION DISSEMINATION CONCEPTS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.461"
                                            },
                                            "Text": {
                                                "val": "Enhanced language learning tools’ capabilities.  Adapted and integrated existing foreign language applications, practices, and tools into a tactical site exploitation capability.  Improved the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theater-wide exploitation of tactical intelligence.  Deployed capabilities to enrich language packet creation with a variety of media sources.  Delivered a capability that supports the automated inbound and outbound integration of available video and audio sources.  Developed novel approaches to query, track, and exploit multimedia from broadcast, radio, offline videos, and web sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.175"
                                            },
                                            "Text": {
                                                "val": "Develop tools that assist the military in foreign language training courses.  Improve foreign language applications, practices, and tools that are deployed in theater.  Expedite methods of collecting and analyzing media sources and evidence more efficiently and timely.  Enhance triage capabilities to store, organize, and query multimedia acquired from various sources.  Deploy automated technologies capable of ingesting and translating video and audio sources for analysts to effectively report intelligence findings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.919"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.919"
                                            },
                                            "Text": {
                                                "val": "Enhance cultural and language technologies for military educational purposes. Implement multilingual and multimedia technologies in support of language learning for operational deployment.  Rapidly exploit speech from large volumes of sources in foreign languages.  Deliver analytic and linguistic tools for operators.  Field capabilities for collecting and analyzing media sources and evidence."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "209"
                    },
                    "ProjectTitle": {
                        "val": "Irregular Warfare Support (IWS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.933"
                        },
                        "CurrentYear": {
                            "val": "13.030"
                        },
                        "BudgetYearOne": {
                            "val": "7.622"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.622"
                        },
                        "BudgetYearTwo": {
                            "val": "5.658"
                        },
                        "BudgetYearThree": {
                            "val": "2.882"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P209, Irregular Warfare Support (IWS).  The IWS Program (IWSP) develops adaptive and agile capabilities and methodologies to support irregular warfare in the current and evolving strategic environments.  IWSP supports joint, interagency, and international partners who conduct or counter irregular warfare through indirect and asymmetric approaches, though they may employ a full range of military and other capabilities, in order to erode an adversary’s power, influence, and will.  Solutions include material and non-material operational analysis, concept development, field experimentation, and delivery of capabilities, to defeat the motivations, sanctuaries, and enterprises of targeted state and non-state actors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "IRREGULAR WARFARE SUPPORT (IWS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.933"
                                            },
                                            "Text": {
                                                "val": "Continued and expanded Project LEGACY, significantly improving host-nation police counterinsurgency and intelligence capabilities.  Due to revocation of external funding, closed out Project CROWDED HOUSE, which reduced insurgent Improvised Explosive Device (IED) activity through local, indigenous rural development projects. Expanded Project LOCHAN, increasing Special Operations Forces (SOF) and Interagency Irregular Warfare knowledge management, communications and C2 capability through rapid adaptation, experimentation and fielding of Commercial Off The Shelf (COTS)\/ Government Off The Shelf (GOTS) software, hardware tools and novel concepts. Evaluated pilot project for alternative command and control structures in counterinsurgency and other Irregular Warfare organizations (Project MURRAY). Conducted irregular warfare mission analysis and experimentation (Project WALLIS) to enhance shared understanding and synchronize interagency irregular warfare\/operations integration efforts. Conducted counter-radicalization research efforts to erode adversaries' power, influence, and will through indirect communications support, research into health diplomacy, law fare, and initiatives designed to engage populations at-risk of violent radicalization. Developed and monitored emerging solutions for low cost aviation support for small units conducting distributed operations in remote and austere environments.  Explored new concepts for non-standard aviation support to SOF in Irregular Warfare environments.  Actively built and expanded a Countering Violent Extremists (CVE) community of interest. Enhanced IW Pursuit and Denial capabilities through analysis of threat supply chain and alternate finance\/value transfer methodologies to help identify, disrupt, deny, and destroy hostile organizations and their supporting enterprises (Projects MEIWA, BANIAN, and REVOLVER)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.030"
                                            },
                                            "Text": {
                                                "val": "Research and develop promising capabilities and continue current project development, delivery, and transition to support the Department of Defense and Interagency Irregular Warfare mission.  Continuing under IW Joint Operational Concept (JOC 2.0) and DODD 3000.07 on IW, the research and development path will conduct operational analysis, concept design, and pilot-project experimentation efforts in support of 2010 QDR and current NSS\/NSCT lines of engagements.  Pursue, prevent and deter conflict through analysis that supports U.S. diplomatic and development efforts to foster a range of governance efforts to counter radicalization, including working with civilian agencies on security assistance and police training programs. Research and develop non-material approaches to deterring\/countering violent extremism. Assess effectiveness of current Irregular Warfare strategies and capabilities; design solutions to integrate into current systems; and develop enhanced Irregular Warfare training and education programs across participating agencies. Continue spiral development of capabilities to enhance intelligence analysis, methodologies and operational solutions.  Continue to elicit and refine requirements for users within rapid assessment framework in order to successfully pair SOF and Interagency users with off the shelf, high performance technologies and novel capabilities that fulfill specific requirements to share and analyze operational data better and faster (Project LOCHAN).  Research, develop and demonstrate solutions for low cost aviation support for small units conducting distributed operations in remote and austere environments. Assess relevance and applicability of Project LEGACY doctrine and operational approach for operational environments outside Operation Enduring Freedom.  Identify adaptation and\/or transition opportunities from research and development investments to include other areas of potential threat and engagement with hostile organizations and supporting structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.622"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.622"
                                            },
                                            "Text": {
                                                "val": "Research and development of material and non-material solutions, promising capabilities, and continuation of project development, delivery, and transition to support the Department of Defense and Interagency Irregular Warfare mission. Continue to elicit and refine requirements for users within rapid assessment framework in order to successful pair SOF and Interagency users with off the shelf, high performance technologies that fulfill specific requirements to share and analyze operational data better and faster (Project LOCHAN). Research, design and spiral development of program to assist military commands in building host-nation intelligence capacity and capability to include the feasibility of migrating to other areas of operation the unique doctrine and lessons learned during support to Operation Iraqi Freedom and Operation Enduring Freedom (LEGACY). Continue research and development of non-material approaches to deterring\/countering violent extremism and radicalism to include international partners and sharing of lessons learned and best practices. Design and develop enhanced training in support of DOD, International and Interagency IW mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}