{
    "id": "dd0b3203567851d825feef24f4565d047b882942",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V2_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineItemNumber": {
            "val": "96"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "59.469"
            },
            "CurrentYear": {
                "val": "62.206"
            },
            "BudgetYearOne": {
                "val": "42.236"
            },
            "BudgetYearOneBase": {
                "val": "42.236"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "43.044"
            },
            "BudgetYearThree": {
                "val": "42.899"
            },
            "BudgetYearFour": {
                "val": "46.198"
            },
            "BudgetYearFive": {
                "val": "47.688"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force test organizations: 46 Test Wing (to include 46 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Center (AEDC), and Air Force Flight Test Center (AFFTC).  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  Also, all projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in Reliance Area Capability Summaries (RACS).  Further, each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 46TW, at Eglin AFB, FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; and determines target\/test item spectral signatures.  The 46TG at Holloman AFB, NM provides independent test and evaluation of inertial, Global Positioning System and integrated systems used for aircraft navigation and missile guidance systems including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.\n\nAEDC, at Arnold AFB, TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nAFFTC, at Edwards AFB, CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR); and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support C2 functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by JSTARS and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  Space provides planning, improvements, and modernization needed for Space test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities are resident at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled track, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nBudget Activity Justification:  This program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "61.587"
                },
                "CurrentYear": {
                    "val": "62.206"
                },
                "BudgetYearOne": {
                    "val": "60.038"
                },
                "BudgetYearOneBase": {
                    "val": "60.038"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.469"
                },
                "CurrentYear": {
                    "val": "62.206"
                },
                "BudgetYearOne": {
                    "val": "42.236"
                },
                "BudgetYearOneBase": {
                    "val": "42.236"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.118"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-17.802"
                },
                "BudgetYearOneBase": {
                    "val": "-17.802"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.782"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.336"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-17.802"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-17.802"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Cong General Reductions -$0.336 are reflected in Other Adjustment Row. \n\nFY13: $17.8M reduction to fund higher DoD priorities within the T&E portfolio."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.469"
                        },
                        "CurrentYear": {
                            "val": "62.206"
                        },
                        "BudgetYearOne": {
                            "val": "42.236"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.236"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "43.044"
                        },
                        "BudgetYearThree": {
                            "val": "42.899"
                        },
                        "BudgetYearFour": {
                            "val": "46.198"
                        },
                        "BudgetYearFive": {
                            "val": "47.688"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force test organizations: 46 Test Wing (to include 46 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Center (AEDC), and Air Force Flight Test Center (AFFTC).  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  Also, all projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in Reliance Area Capability Summaries (RACS).  Further, each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 46TW, at Eglin AFB, FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; and determines target\/test item spectral signatures.  The 46TG at Holloman AFB, NM provides independent test and evaluation of inertial, Global Positioning System and integrated systems used for aircraft navigation and missile guidance systems including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.\n\nAEDC, at Arnold AFB, TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nAFFTC, at Edwards AFB, CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR); and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support C2 functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by JSTARS and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  Space provides planning, improvements, and modernization needed for Space test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities are resident at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled track, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nBudget Activity Justification:  This program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Airframe\/Propulsion\/Avionics (APA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.107"
                                            },
                                            "Text": {
                                                "val": "Continue to support - ARSU upgrades critical AFFTC range infrastructure, including range tracking, communications and control systems, to overcome near-term obsolescence; ATSU provides upgrades to AFFTC TSPI systems; ARPSU provides upgrades to AFFTC mission control rooms to support increasingly complex test missions and telemetry processing and data analysis requirements; JAII T&E updates for instrumented airborne platforms;  TSIS improvements to telemetry acquisition systems; VKF Plant Modernization upgrades to supersonic and hypersonic wind tunnels; Tunnel 4T Modernization upgrades to flex nozzle actuators & control systems; Tunnels A\/B\/C Modernization to provide superior wind tunnel operations; Advanced Large Military Engine Capability upgrades C1\/C2 test cells for testing of advanced high speed air-breathing engines;  UHARS development of a high-accuracy inertial-based TSPI truth source to validate inertial and GPS based positioning systems; Advanced Small Military (High-Speed) Engine Capability provides upgrades to T3 test facility systems to support high Mach small engine propulsion test requirements; and T&E Board of Directors coordinates Tri-Service investment and Joint T&E Reliance efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.588"
                                            },
                                            "Text": {
                                                "val": "Continue to support - ARSU upgrades critical AFFTC range infrastructure, including range tracking, communications and control systems, to overcome near-term obsolescence; JAII T&E updates for instrumented airborne platforms;  TSIS improvements to telemetry acquisition systems; VKF Plant Modernization upgrades to supersonic and hypersonic wind tunnels; Tunnel 4T Modernization upgrades to flex nozzle actuators & control systems; Tunnels A\/B\/C Modernization to provide superior wind tunnel operations; Advanced Large Military Engine Capability upgrades C1\/C2 test cells for testing of advanced high speed air-breathing engines;  UHARS development of a high-accuracy inertial-based TSPI truth source to validate inertial and GPS based positioning systems; Advanced Small Military (High-Speed) Engine Capability provides upgrades to T3 test facility systems to support high Mach small engine propulsion test requirements; and T&E Board of Directors coordinates Tri-Service investment and Joint T&E Reliance efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.226"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.226"
                                            },
                                            "Text": {
                                                "val": "Continue to support - ARSU upgrades critical AFFTC range infrastructure, including range tracking, communications and control systems, to overcome near-term obsolescence; JAII T&E updates for instrumented airborne platforms;  TSIS improvements to telemetry acquisition systems; Tunnel 4T Modernization upgrades to flex nozzle actuators & control systems; Tunnels A\/B\/C Modernization to provide superior wind tunnel operations; Advanced Large Military Engine Capability upgrades C1\/C2 test cells for testing of advanced high speed air-breathing engines;  UHARS development of a high-accuracy inertial-based TSPI truth source to validate inertial and GPS based positioning systems; Advanced Small Military (High-Speed) Engine Capability provides upgrades to T3 test facility systems to support high Mach small engine propulsion test requirements; and T&E Board of Directors coordinates Tri-Service investment and Joint T&E Reliance efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "I&M (1)"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Armament\/Munitions (A\/M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.087"
                                            },
                                            "Text": {
                                                "val": "Continue to support - OWISS development of capability necessary to test in an overwater environment; AMTI development of new HITL capabilities for testing advanced seeker\/sensor guidance technologies; ARTM for acquiring and upgrading critical TM equipment; OGT development of capabilities to test munitions in an all-up-round configuration and environment; ACDS upgrades of existing command destruct systems; GRTTCC integration of range data systems; Joint Gulf Range Area Network Development (JGRAND) advanced mobile fiber optic and microwave communications capabilities improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.018"
                                            },
                                            "Text": {
                                                "val": "Continue to support - AMTI development of new HITL capabilities for testing advanced seeker\/sensor guidance technologies; ARTM for acquiring and upgrading critical TM equipment; ACDS upgrades of existing command destruct systems; GRTTCC integration of range data systems; JGRAND advanced mobile fiber optic and microwave communications capabilities improvements; Combined High Speed\/High Resolution EO\/IR Imaging provides tracking capability for small, high speed A\/M, missiles & airborne platform testing. Next Generation Munitions Test Environment (NGMTE) upgrades aging munitions test capabilities to support advent of larger, smarter weapons systems requiring more precise data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.510"
                                            },
                                            "Text": {
                                                "val": "Continue to support - AMTI development of new HITL capabilities for testing advanced seeker\/sensor guidance technologies; GRTTCC integration of range data systems; Combined High Speed\/High Resolution EO\/IR Imaging provides tracking capability for small, high speed A\/M, missiles & airborne platform testing; JGRAND advanced mobile fiber optic and microwave communications capabilities improvements. NGMTE upgrades aging munitions test capabilities to support advent of larger, smarter weapons systems requiring more precise data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "I&M (2)"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate C4ISR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.275"
                                            },
                                            "Text": {
                                                "val": "Continue to support - C4ISR Modeling & Simulation to provide the capability to combine synthetic and real-world data to analyze a C4I system's response to operational loads; C2TOC development of a Joint Air Operations Center level test capability to support C2 weapons systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Continue to support C2TOC development of a Joint Air Operations Center level test capability to support C2 weapons systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue to support C2TOC development of a Joint Air Operations Center level test capability to support C2 weapons systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0604256F, Threa..."
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.805"
                                        },
                                        "CurrentYear": {
                                            "val": "22.420"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.812"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.812"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.081"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.076"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.450"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.523"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0605807F, Test ..."
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "752.328"
                                        },
                                        "CurrentYear": {
                                            "val": "704.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "722.071"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "722.071"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "701.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "702.979"
                                        },
                                        "BudgetYearFour": {
                                            "val": "716.873"
                                        },
                                        "BudgetYearFive": {
                                            "val": "725.979"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0605976F, Facil..."
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "46.091"
                                        },
                                        "CurrentYear": {
                                            "val": "44.547"
                                        },
                                        "BudgetYearOne": {
                                            "val": "42.597"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "42.597"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.046"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.815"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.899"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.067"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E AF, PE 0605978F, Facil..."
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.438"
                                        },
                                        "CurrentYear": {
                                            "val": "27.953"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.301"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.301"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "23.849"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.871"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.282"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.599"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This program element uses several different contracting strategies to provide the most cost effective T&E investment solutions.  The main acquisition strategy is to use full and open competition wherever possible to improve and modernize existing test capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}