{
    "id": "dd2cae8ee4166aa7180a91621cd9f7d99c2dc928",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602712A"
        },
        "ProgramElementTitle": {
            "val": "Countermine Systems"
        },
        "R1LineItemNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.507"
            },
            "CurrentYear": {
                "val": "32.728"
            },
            "BudgetYearOne": {
                "val": "18.850"
            },
            "BudgetYearOneBase": {
                "val": "18.850"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "20.574"
            },
            "BudgetYearThree": {
                "val": "21.542"
            },
            "BudgetYearFour": {
                "val": "21.747"
            },
            "BudgetYearFive": {
                "val": "22.113"
            }
        },
        "ProgramElementNote": {
            "val": "FY12 funding increase due to congressional add."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates, designs, and evaluates technologies to improve countermine, signature management and counter-sensors capabilities.  The focus is on sensor components, sub-components and software algorithms to improve detection of mines, explosive threats and directed energy; ballistic methods to defeat mines and explosive threats; and signature management technologies to reduce reconnaissance capabilities of the enemies.  This PE also supports DoD's Center of Excellence for Unexploded Ordnance which coordinates and standardizes land mine signature models; maintains a catalogue of mine signatures; supports the evaluation of mine detection sensors and algorithms; and working in conjunction with the US Army Engineering, Research and Development Center (ERDC), examines countermine phenomenology of surface and buried mines, and explosive threats.  Project H24 advances state of the art Countermine technologies to accurately detect threats with a high probability, reduce false alarms, and enable an increased operational tempo.  Project H35 evaluates and develops advanced signature management and deception techniques for masking friendly force capabilities and intentions.  \n\nWork in this PE is related to and fully coordinated with PE 0602120A, (Sensors and Electronic Survivability), PE 0602622A, (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A, (Weapons and Munitions Technology), PE 0602709A, (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A, (Landmine Warfare and Barrier Advanced Technology), PE 0603710A (Night Vision Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.118"
                },
                "CurrentYear": {
                    "val": "20.280"
                },
                "BudgetYearOne": {
                    "val": "20.878"
                },
                "BudgetYearOneBase": {
                    "val": "20.878"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.507"
                },
                "CurrentYear": {
                    "val": "32.728"
                },
                "BudgetYearOne": {
                    "val": "18.850"
                },
                "BudgetYearOneBase": {
                    "val": "18.850"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.611"
                },
                "CurrentYear": {
                    "val": "12.448"
                },
                "BudgetYearOne": {
                    "val": "-2.028"
                },
                "BudgetYearOneBase": {
                    "val": "-2.028"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "12.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.441"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.028"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.028"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.170"
                                },
                                "CurrentYear": {
                                    "val": "-0.052"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H24"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.724"
                        },
                        "CurrentYear": {
                            "val": "17.321"
                        },
                        "BudgetYearOne": {
                            "val": "15.834"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.834"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "17.508"
                        },
                        "BudgetYearThree": {
                            "val": "18.431"
                        },
                        "BudgetYearFour": {
                            "val": "18.585"
                        },
                        "BudgetYearFive": {
                            "val": "18.898"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and evaluates new countermine components, sub-components and software algorithms for detection, discrimination, and neutralization of individual mines, minefields, and other explosive threats.  The goal of this project is to accurately detect threats with a high probability, reduce false alarms and enable an increased operational tempo.  \n\nThis project supports Army science and technology efforts in the Ground, Command Control and Communications, Air and Soldier portfolios.  Work in this Project is related to and fully coordinated with PE 0602120A, (Sensors and Electronic Survivability), PE 0602622A, (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A, (Weapons and Munitions Technology), PE 0602709A, (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A, (Landmine Warfare and Barrier Advanced Technology), PE 0603710A (Night Vision Advanced Technology).\n         \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense Unexploded Ordnance (UXO) Center of Excellence (UXOCOE)"
                                    },
                                    "Description": {
                                        "val": "The Army serves as executive agent of the Unexploded Ordnance (UXO) Center of Excellence (COE), which provides for the coordination of UXO across the Department of Defense (DoD)  Army, Navy, Air Force, and Marine Corps programs.  The UXOCOE serves as the focal point for research, development, testing and evaluation (RDT&E) for UXO detection, clearance technologies, remediation and sensor\/signature\/DOD program database development.  Technologies investigated for mitigating UXO are oriented to land and underwater approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the coordination, with the Joint services, for the Unexploded Ordnance (UXO) detection and clearance research, demonstration, test and evaluation program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.493"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and evaluate the UXO RDT&E detection and clearance information and coordinate across the DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.487"
                                            },
                                            "Text": {
                                                "val": "Will investigate various UXO detection sensors, perform field data collections against UXO surrogates and real targets in realistic background environments and update signature database."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Mine\/Defeat Neutralization Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates the ability to pre-detonate and neutralize mines, improvised explosive devices (IEDs), and emerging explosive threats at tactically relevant standoff ranges with munition and laser-based technologies.  Starting in FY12, technical efforts will focus on enabling controllable neutralization effects, primarily with lasers.  With the technology transition of the munition-based technology for continued 6.3 developments, funding levels are reduced and commensurate with pursuing laser-based approaches. Achieving low\/high order neutralization, including deflagration, effects will be the principal objective of the effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.369"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted laboratory tests with the brassboards for laser drilling and for munitions in an environment that simulates theater operations (e.g. threat, weather, and environmental conditions) to assess the relative performance against a spectrum of buried and obscured threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and integrate diode based laser pump technology into a neutralization brassboard; evaluate the power and energy output with regards to requirements to defeat mine and threat explosives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Explosive Compound Detection Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates ground based detection and confirmation technologies of explosives compounds from tactically relevant standoff distances. The effort is complimentary to the work being accomplished under PE 0602622A\/project 552."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.201"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed a comprehensive evaluation of the candidate brassboard (such as laser induced breakdown spectroscopy and ultra-violet spectroscopy) for standoff performance validation (standoff range) and continued to refine the performance of the ground based and airborne detection systems. Conducted field evaluations of selected technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.735"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct data collection of domestic and foreign explosive compounds in order to populate and categorize signatures and utilize the data in conjunction with algorithm development; research potential to increase detection sensitivity with newly designed algorithms versus the sensitivity of current technology; investigate explosive detection sensors that have potential to reduce false alarms in high clutter areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electro-Magnetic (EM) and Electro Optic (EO) Sensors for Detection of Emerging Threat Devices"
                                    },
                                    "Description": {
                                        "val": "This effort investigates all-terrain standoff detection using novel detection sensor and detection algorithm approaches in order to locate mine and other emerging explosive hazard threat devices with minimal false alarms. This effort also investigates detection of emerging explosive hazards at deeper burial depths (up to 1.5 meters deep)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.674"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began efforts to investigate advanced electromagnetic induction technologies and electro-optic (EO) sensors; incorporated the advances made in forward looking ground penetrating radar and electromagnetic induction and EO sensors for detection of metallic mines and explosive threats buried in-road and in urban areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop a brassboard with data collection capabilities incorporating Electromagnetic (EM), Electromagnetic Interference (EMI) and Electro-Optic (EO) advancements; evaluate EO sensing and EM detection concepts for detection of emerging threats; integrate and combine emerging Defense Advanced Research Projects Agency standoff vibration detection technology with the EM, EMI and EO based sensors and with a downward looking active EO laser and\/or Laser Detection and Ranging (for ground surface profiling) technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.695"
                                            },
                                            "Text": {
                                                "val": "Will design and fabricate a multi-band ground penetrating radar (GPR) demonstrator integrating both downward looking and forward projecting antennas; begin field data collections and evaluations using GPR demonstrator and based on the results, refine hardware and improve software target recognition algorithms to improve probability of detection and lower false alarm rates. Will investigate phenomenological standoff vibration technology in combination with the EM, EMI and EO based sensors for detection of shallow and more deeply buried explosive hazards; improve software to automatically adapt to available sensor inputs in real time."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection of Home Made Explosive (HME) Production Facilities and Threats"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging chemically-specific explosive hazards (to include homemade explosives (HMEs)) and detection technologies to address Warfighter needs.  The effort will provide technologies for standoff detection and confirmation of emerging threats and production facilities and is complimentary to the work being accomplished under PE 0602622A\/project 552."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate short wave infrared and long wave infrared hyperspectral imaging techniques for detecting homemade explosive threats; determine and analyze concentrations of HME required for reliable detection in different air and ground scenarios (e.g., production and drying facilities, spill sights, residue on vehicles and other objects); research algorithm techniques for separation of HME signatures from background clutter leading to algorithms for automated HME detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.907"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.907"
                                            },
                                            "Text": {
                                                "val": "Will investigate and validate emerging technologies capable of detecting explosive related threats including HME production facilities; conduct technical experiments in technologies for HME detection to include Ultraviolet (UV) laser-based Raman spectroscopy to exploit conventional and HME signatures in complex backgrounds and polymer-based sensors to exploit residues and vapors at ultra trace amounts; investigate and validate point confirmation technologies that exploit conventional and HME residues and vapors at ultra-trace amounts for classification and identification purposes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Short Range Man Portable Explosive Hazard Detector Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging technologies enabling the dismounted Soldier to detect explosive hazards in addition to landmine threats, explosive hazards include: IEDs, HMEs, explosively formed penetrators (EFPs) and antitank\/antipersonnel landmines(metal and non-metallic).  Emphasis will be on rate-of-advance, high detection probability, and low false alarm rates. Size, weight, and power issues will be considered and studied to ensure solutions are viable for Soldier-portable applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.745"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging electromagnetically-based sensor technology and novel helmet-mounted electro-optical sensors; explore front-end physical and explosive materials sampling approaches oriented towards enhancing short-range standoff explosive hazard detection technologies as a component of a conceptual plug-and-play sensor suite for dismounted operations; leverage emerging technologies such as advanced ground penetrating radar antennas, hyperspectral imaging electro-optics, target polarization detection, compact metal detection with target identification, sensor position measurement techniques, explosives sensing materials and virtual display concepts in combination as part of a portable handheld sensor suite for detection of a broad spectrum of explosive hazards."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H35"
                    },
                    "ProjectTitle": {
                        "val": "CAMOUFLAGE  & COUNTER-RECON TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.783"
                        },
                        "CurrentYear": {
                            "val": "2.927"
                        },
                        "BudgetYearOne": {
                            "val": "3.016"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.016"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.066"
                        },
                        "BudgetYearThree": {
                            "val": "3.111"
                        },
                        "BudgetYearFour": {
                            "val": "3.162"
                        },
                        "BudgetYearFive": {
                            "val": "3.215"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and evaluates advanced signature management and deception techniques for masking friendly force capabilities and intentions. Technologies pursued under this effort reduce the cross section of sensor systems.  Technologies such as decentered field lens, wavefront coding and spectral filtering and threat sensing algorithms are investigated along with next generation camouflage coatings and paints. \n\nThis project supports Army science and technology efforts in the Command Control and Communications, and Ground portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage and Counter-Reconnaissance Technology for Advanced Spectral Sensors:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and advances new techniques to reduce electro-optical susceptibility of sensors and camouflage. The two primary objectives are (1) to reduce the optical cross section of currently fielded and emerging electro-optical and infrared (EOIR) sensors and (2) investigate technologies that will enable enhanced spectral signature reduction for next generation camouflage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop the optical signature reduction effort; widen the key sensor waveband coverage and future staring sensors, such as day television and shortwave infrared; investigated camouflage paints or other systems for hyperspectral signature reduction; validated for effectiveness and potential for implementation in operational systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.927"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of the susceptibility of foreign and friendly systems to hyperspectral detection methods; conduct experiments and evaluate multiple technologies to ensure signature reduction is achieved and incorporate results into sensor models for advanced characterization; collaborate with industry to develop near-term improvements to camouflage paints, coatings, and systems in both the visible and other wavelength regions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.016"
                                            },
                                            "Text": {
                                                "val": "Will leverage previous funded efforts to design new approaches to reduce the optical cross section of emerging staring sensors including large format arrays in the visible, near infrared (IR), shortwave IR, thermal and uncooled longwave IR; conduct thermal signature studies for future development of IR signature reduction techniques, approaches include modified optics, computational imaging, polarization control and antireflection coatings.  Camouflage efforts will investigate two sided camouflage netting for the Ultra Lightweight Camouflage And Netting System program; perform laboratory and field evaluations from FY12 developed prototypes and develop specifications for the next generation Army netting."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB2"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.480"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Countermine Systems applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unexploded Ordinance and Landmine Detection Research"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Congressional add funding for Unexploded Ordinance and Landmine Detection Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}