{
    "id": "ddba84615e2723ec6463e46bc5591402b19bf6fb",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604805A"
        },
        "ProgramElementTitle": {
            "val": "Command, Control, Communications Systems - Eng Dev"
        },
        "R1LineItemNumber": {
            "val": "111"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "73.042"
            },
            "CurrentYear": {
                "val": "81.733"
            },
            "BudgetYearOne": {
                "val": "20.776"
            },
            "BudgetYearOneBase": {
                "val": "20.776"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementNote": {
            "val": "FY11 RDTE reduction of $15.0M was the result of a Congressional Mark. \nFY12 RDTE reduction of $56.0M was the result of a Congressional Mark.\nFY13 RDTE reduction of $13.9M was a reduction to fund higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports efforts to develop interoperability of Army programs and products, horizontally and vertically for the digitized battlefield. Project D485 supports Information Standards Interoperability Engineering and Joint Interoperability Certification.  It provides the critical elements of the Army\/Joint Technical Architecture, the mandated standards and communication protocols for Army\/Joint ground and air operations, and crucial certification test tools to evaluate systems' interoperability for the Warfighter in support of the Vice Chief of Staff of the Army (VCSA) and Army Acquisition Executive (AAE).  It also provides Joint certification testing and certification recommendations to the Joint Chiefs of Staff (JCS) for Army systems.  This Army-wide effort directly supports the management, oversight, development, maintenance, and interoperability at the Army enterprise level C4I\/IT (Command, Control, Communications, Computers, and Intelligence\/Information Technology) architecture efforts required to implement Unit Set Fielding (USF), Software Blocking (SWB) Policy and Army Knowledge Management.  \n\nProject D593, Joint Battle Command - Platform (JBC-P) funds the Systems Engineering, Software Development and Testing of JBC-P.  Joint Battle Command - Platforms (JBC-P), which includes Blue Force Tracking (BFT) and Army Aviation, and provides true Joint force Command and Control (C2) Situational Awareness (SA) and communications (e.g., terrestrial, celestial) capability at the platform level through command center locations (e.g., Network Operations Centers (NOC), Tactical Operation Centers (TOCs), Brigade Command Posts) and enables mission accomplishment across the entire spectrum of military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "90.736"
                },
                "CurrentYear": {
                    "val": "137.811"
                },
                "BudgetYearOne": {
                    "val": "33.492"
                },
                "BudgetYearOneBase": {
                    "val": "33.492"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "73.042"
                },
                "CurrentYear": {
                    "val": "81.733"
                },
                "BudgetYearOne": {
                    "val": "20.776"
                },
                "BudgetYearOneBase": {
                    "val": "20.776"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-17.694"
                },
                "CurrentYear": {
                    "val": "-56.078"
                },
                "BudgetYearOne": {
                    "val": "-12.716"
                },
                "BudgetYearOneBase": {
                    "val": "-12.716"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.654"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.040"
                                },
                                "CurrentYear": {
                                    "val": "-0.078"
                                },
                                "BudgetYearOne": {
                                    "val": "1.184"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.184"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-15.000"
                                },
                                "CurrentYear": {
                                    "val": "-56.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-13.900"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-13.900"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "485"
                    },
                    "ProjectTitle": {
                        "val": "Info Standards Interop Eng\/Joint Interop Cert"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.652"
                        },
                        "CurrentYear": {
                            "val": "19.750"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Focus for this project is to support the engineering or evaluation of commercially-available information technology (IT) tools to develop architecture products Information Technology based Command, Control, Computers, and Communications (C4\/IT) systems such as Applications Program Interfaces for Weapons Systems.  A significant effort will be on building Army (consistent with DoD) C4\/IT technical standards-compliant Army data repositories that are web-accessible but secure.  These repositories will be consistent with DoD standards and policies and virtually appear to be a single repository for Army C4\/IT architecture products.  \n\nTo support the Army Vice Chief of Staff (VCSA) and the Army Chief Information Officer\/G6, as cited in the AEA Master Plan, this initiative fulfills the Clinger-Cohen Act mandate of developing sound integrated Information Technology (IT) architectures and the Army's Software Blocking Policy. The increased combat power of the Future Force will be dependent on the information superiority of network & knowledge centric warfare and the ability of systems to be fully -interoperable as a member of the joint, multinational, interagency team as well as emerging Future Force (FF) C4ISR (Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance) Systems. It identifies and reduces interoperability issues earlier in the life cycle by intra-Army\/FF\/Joint\/combined experiments and assessments, and through the establishment & sustainment of common standards.  This Army wide effort directly supports the management, oversight, development, maintenance, and interoperability of the Army enterprise level C4I\/IT architecture efforts required to implement Software Blocking and Army Enterprise Architecture (AEA).  Specifically, this project resources the Army's messaging standards conformance authority in assessing compliance with the Defense Information Systems Repository (DISR), in meeting the warfighter information exchange requirements and in facilitating their interoperability.  It also resources, in accordance with the DISR, the development and maintenance of the following information standards: Variable Message Format (VMF) & Combat Net Radio (CNR) protocol, which support Army\/Joint ground operations; Tactical Digital Information Links (TADILs), which support Air Defense operations; and US Message Text Format (USMTF), which support Intel and Commanders operations.  It provides the Army's lead for configuration management functions of these standards and test tools at both Army and Joint levels.  This project resources the Army participation in joint\/allied messaging certification testing & configuration management processes.  This project also resources the development and fielding of a suite of four (4) crucial tools which are used throughout the entire Army. These tools which are currently under development will provide the ideal means to: a) validate Technical Architecture\/Technical Reference Model (TA\/TRM) critical messaging and protocol standards; b) improve systems interoperability; c) verify\/certify correct system implementations and interpretation to TA\/TRM; d) sustain\/support digitization and transition of fielded systems; e) support Software Blocking and interoperability testing; f) provide Legacy AEA interoperability with Future Combat System (FCS) command and control systems.  These crucial tools are critical to the TA\/TRM Compliance, Certification Testing mission & Interoperability programs.  The task also supports the Army's transformation campaign while mitigating interoperability issues resulting in reducing cost & program slippages.  This project also provides the Configuration Management & Control for the Software Blocking (SWB)\/USF (Unit Set Fielding)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C4ISR"
                                    },
                                    "Description": {
                                        "val": "Funds to support the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.689"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and update architecture standards and protocols necessary to ensure C4ISR systems interoperabilty"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and update architecture standards and protocols necessary to ensure C4ISR systems interoperabilty"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Warfighter Information Standards"
                                    },
                                    "Description": {
                                        "val": "Funds to support the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.011"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Engineer, develop & publish Army Warfighter Information Standards (i.e. XML-USMTF\/VMF,Wireless XML, database exchange, etc...) incorporating DoD standards requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Engineer, develop & publish Army Warfighter Information Standards (i.e. XML-USMTF\/VMF,Wireless XML, database exchange, etc...) incorporating DoD standards requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "technical architecture standards requirements"
                                    },
                                    "Description": {
                                        "val": "Funds to support the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identify, analyze, and provide solutions to gaps in technical architecture standards requirements"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identify, analyze, and provide solutions to gaps in technical architecture standards requirements"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Net-Centric Enterprise Service"
                                    },
                                    "Description": {
                                        "val": "Funds to support the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and engineer Army Net-Centric Enterprise Service standards and protocols supporting OSD Global Information Grid messaging requirements and serve as Army focal point for messaging working group."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and engineer Army Net-Centric Enterprise Service standards and protocols supporting OSD Global Information Grid messaging requirements and serve as Army focal point for messaging working group."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Center Development"
                                    },
                                    "Description": {
                                        "val": "Funds to support the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.309"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Knowledge Center Development - Build & update as necessary access to website repositories for key policies, directives, and architecture products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.310"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Knowledge Center Development - Build & update as necessary access to website repositories for key policies, directives, and architecture products"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The efforts funded in this project are non-system specific, interoperability experimentation, evaluation and certification across multiple systems.  The contractual efforts\/services are obtained from existing competitive omnibus support service contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Labor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USACECOM ,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "56.513"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "19.750"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "589"
                    },
                    "ProjectTitle": {
                        "val": "ARMY SYS ENGINEERING & WARFIGHTING TECH SUP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.740"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project has been re-aligned to better support the mission of Army Chief of Staff (CSA) sanctioned Army Architecture Integration Center (AAIC) for developing, implementing and maintaining the Army Enterprise Architecture for Information Technology based Command, Control, Computers & Communications (C4\/IT) systems. AAIC mission is to develop standards-based architecture products that are inter-operable within the Army as well as the with Joint, Interagency, and Multinational systems.  \n\nThis project funded the Army Systems Engineering Office (ASEO) by providing technical research and development and modeling and simulation with the primary mission of developing technical architecture standards without compromising DoD-mandated standards but ensuring Army C4\/IT systems under development are interoperable with legacy systems still utilized by the Army warfighter, which extend from tactical levels up through operational and strategic components of the Army Battle Command Architecture (ABCA), as well as, the institutional portions of the Enterprise to include the Army's Business Enterprise Architecture (BEA).  The ASEO supports the Army CIO\/G6 Architecture Integration Center (AAIC) in establishing an integrated AEA framework that complements, and is a natural extension of, the GIG-Enterprise Services (GIG-ES).  In addition, the ASEO is an essential contributor in the development of the JBMC2 integrated architecture, the Battle Command Architecture, and emerging Cross-Service Integrated Architecture efforts.  Each of these architecture definition and integration efforts is elemental to achieving the Army's goal of a NetCentric Future Force.  \n\nPreviously, the Joint Technical Architecture (JTA) and JTA-Army (JTA-A) (now the Army Technical Architecture\/Teechnical Reference Model (TA\/TRM) have provided the foundation for designing, building, fielding and supporting Joint interoperable Army systems in an expedient and cost-effective manner.  With the revision to the standardization process as implemented by the Defense Information Systems Agency (DISA), technical architecture standards are encompassed in the new Defense Information Systems Repository (DISR) program.  The Army must participate in DISR to ensure Army requirements are adequately captured and reflected in any new baseline developed by DISA.  The ASEO identifies emerging standards in support of the integration of new technologies into existing Army systems and Advanced Technology Demonstrations\/Advanced Concept Technology Demonstrations (ATD\/ACTDs), enabling the Army transformation to the Future Force.  The ASEO's work efforts in the development and maintenance of Army IT standards within the context of DISR guidelines are critical path elements to achieve transformation, increase joint interoperability and to provide the future Army with the ability to fight and win on tomorrow's battlefields.  However, the Technical Architecture (TA) alone only provides the foundation for interoperability.  Integrated Army Enterprise Architectures (e.g., ABCA, BEA, etc.) fuse Operational, Systems and Technical views of the Army Enterprise into cohesive and manageable information sets that allow the Army to make consequent decisions regarding the Army's inventory of present and future systems and their associated funding.  In this area the ASEO specializes in defining and exploiting (through analysis) the relationships between architectural views to provide quantitative answers to complex questions regarding the Army's future capabilities and the roadmap the Army will pursue in realizing them. \n\nThe allocated resources fund two support efforts for CIO\/G6. First, subsequent to the development of the AKEA (Army Knowledge Enterprise Architecture) Guidance Document, the effort has shifted to development of the Army Technical Reference Model (TRM) for information broker\/mediation services, and mapping the Army's architecture requirements to DOD Information Enterprise Architecture, including NCES (Net-Centric Enterprise Services). Second, support of the design and development of the AAIC (Army Architecture Integration Center) Web-based Knowledge Center continues with increased development requirements and functionality, including the consolidation of architectural repositories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C4ISR"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.820"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analyze and provide Systems Engineering solutions to fill in gaps identified in C4ISR systems under development as well as fielded systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Technical Architecture (JTA)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.416"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identify unique Army requirements to influence Army\/DoD Architecture Technical standards under new Defense information Systems Repository developed under Defense Information Systems Agency (DISA) oversight.  Prior years: Technically influence the development\/implementation of Joint Technical Architecture (JTA).  FY03 accomplishments:  JTA Versions 5.x, 6.0 restructured and aligned with Net-Centric Philosophy and redefined scope and standards applicability. Planned activities: JTA-A version 7.0, 7.5 to include major revision of Information Security Section, to include results of Tactical Imagery Transport Study"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Information Grid (GIG) Technologies"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.312"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate information technical standards for inclusion in DSR, Defense Standards Repository. Global Information Grid (GIG) Technologies (XML, JPEG 2000, MPEG 4, IPV6)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DISR"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.458"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and incorporate applicable emerging open standards-based commercial technologies to influence future force systems. Ensure that open commercial standards adopted by Future Force enabling systems are reflected in the DISR baseline. Maintain subject matter expertise on DISR, Defense Standards Repository Information Technology (IT) standards' mandates to ensure current and future force systems remain interoperable. Ensure a logical and cost-effective evolution of TA baselines while maximizing Joint interoperability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DISR Compliance Requirements"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "DISR Compliance Requirements -Ensure Program Managers have an executable and effective strategy for implementing the Army\/DoD Technical Architecture standards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Enterprise Technical Views"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.506"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate\/Integrate Army Enterprise Technical Views to enable the Army Technical and Systems Architect (CIO\/G6) to monitor, assess and control the inherent risks associated with leveraging continuously changing technologies across all Army Enterprise Functionals\/PEO\/Communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IPv6 protocol"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide systems analysis for implementing IPv6 protocol across Army to ensure communications\/data-sharing\/data-exchange between systems.  \nPrior Years: As a result of the decision agreed to at the 19 Dec 02 AKEA, GOSC, direction of MU17 funding was realigned to support the Protocols Investigation for the Next Generation (PING) program.  The PING supported current technology agreements with various technology developers such as HP, Cisco, Microsoft and Telecordia. In addition, PING represented the ARMY CIO\/G6 office at various ASD (NII)\/DoD CIO meetings discussing DoD IPv6 policy and Transisition Planning, participated with JITC at DISA's Def Interop Comm Exercise 2003 (DICE 2003) demonstrating IPv6 interoperability, active member of DoD IPv6 Test Bed evaluating and testing IPv6 benefits and trade-offs, first Army lab participating with North American IPv6 Task Forces MoonV6 initiative, drafted ARmy's Phase I IPv6 Transition plan and initial transition strategy to migrate Army systems and networks to native IPv6 by FY08 in compliance with DoD policy,prepared evaluation criteria for selecting early IPv6 adopter candidates in support of the Army GIO\/G6 office, hosted first Army IPv6 data call to collect systems impact information and baseline on Army IPv6 transition plan, provided IPv6 technical guidance and knowledge to the Army acquisition community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Define and exploit"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Define and exploit (through analysis) the relationships between architectural views to provide quantitative answers to complex questions regarding the Army's future capabilities and the roadmap the Army will pursue in realizing them."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Blue Force Situational Awareness (JBFSA)initiative"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide systems engineering solutions including techincal architectures for Army systems supporting Joint Blue Force Situational Awareness (JBFSA)initiative"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The JBC-P program was Joint Requirements Oversight Council (JROC) approved in May 2008.  The Acquisition Strategy Report (ASR) was approved in September 2009.  An Acquisition Decision Memorandum, approving a Modified Milestone B and entry into the  Engineering and Manufacturing Development phase, was issued in September 2009."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Systems Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASEO, DCTS, PING\/03 only,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "35.607"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEC, USACECOM,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.195"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grummon (SEC SSES),"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.400"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Labor (Internal Government)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEC, USACECOM,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.411"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USACECOM,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.040"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ITEL,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.400"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Systems Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.877"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Systems Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Litton,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.450"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Systems Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.506"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASEO\/WTS CECOM,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.016"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "593"
                    },
                    "ProjectTitle": {
                        "val": "JOINT BATTLE COMMAND - PLATFORM (JBC-P)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.650"
                        },
                        "CurrentYear": {
                            "val": "61.983"
                        },
                        "BudgetYearOne": {
                            "val": "20.776"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.776"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Battle Command - Platform (JBC-P) provides true Joint force Command and Control (C2) Situational Awareness (SA) and communications (e.g., terrestrial, celestial) capability at the platform level through command center locations (e.g., Network Operations Centers (NOC), Tactical Operation Centers (TOCs), Brigade Command Posts) and enables mission accomplishment across the entire spectrum of military operations.  \n\nJBC-P serves as the cornerstone for Joint Blue Force Situational Awareness (JBFSA).  It provides continuous near-real-time identification of friendly locations to populate the Joint Common Operating Picture (JCOP).  JBC-P enhances Joint Combat Identification to increase combat effectiveness and reduce fratricide in a secure environment.  It enables Joint, Net-Centric Command and Control (C2)\/Battle Command by seamlessly passing\/sharing relevant information vertically and horizontally, within all levels of command, regardless of Service unit hierarchy.  \n\nJBC-P will develop new hardware items and software capabilities designed to run on existing Force XXI Battle Command Brigade and Below (FBCB2) systems, thus reducing the Army's investment in new hardware.  The new JBC-P hardware includes: ruggedized remoteable vehicle computers (tablets), dismounted devices for use with tablets, one way beacons, and ancillary equipment (e.g., Secure Mission Data Loader (SMDL), cables, installation kits, etc.).\n\nFiscal Year 2013 funds provide for the completion of software products for the Army's Capability Set 13-14 fieldings and system\/software requirements analysis and system architecture definition for the Army's Capability Set 15-16 products.  Efforts include system\/software engineering, software development, testing and project management."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Development"
                                    },
                                    "Description": {
                                        "val": "Develop Capabilities, Product Applications, Platform Interoperability, and System Services across the JBC-P family of systems, to include the development of capabilities to meet Key Performance Parameters (KPPs) and in support of Mobile Computing Environment, Multi-Level Security Domains for Network, Users, and Information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop Capabilities, Product Applications, Platform Interoperability, and System Services across the JBC-P family of systems, to include the development of capabilities to meet Key Performance Parameters (KPPs), and in support of Multi-Level Security Domains for Network, Users, and Information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Software System Acceptance Test (SSAT) for product build 2 for Capability Set 13-14 software and deliver to PM.  Complete engineering, design, development, coding and SSAT  for Build 3 and 4 of product software (vehicle, network operations center, command post, and incorporation of Movement Tracking System functionality into JBC-P) for Capability Set 13-14 (to include JBC-P platform IOT&E) and deliver to PM.  Complete engineering, design, development, coding of Handheld PDK in support of NETT Warrior\/JBC-P dismount requirements.  Complete engineering, design and  initiate coding for product build 5 to meet the Key Performance Parameters outlined in the Capability Development Document (with the exception of Aviation (still on BFT-1)) for all of the products.  Conduct User Juries to gain user feedback on the software.  Include Marine Corps participation in working groups  and integrated product\/process teams and provide software builds to the Marine Corps as required for testing to ensure joint requirements are included and adequately addressed throughout the software development effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.915"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.915"
                                            },
                                            "Text": {
                                                "val": "Complete engineering, design and coding for Core\/Product Development Kit (PDK) software.  Complete engineering, design, and coding for product builds 5 & 6 to fully meet the Key Performance Parameters outlined in the Capability Development Document for all of the products.  Conduct User Juries to gain user feedback on the software.  Include Marine Corps participation in working groups  and integrated product\/process teams and provide software builds to the Marine Corps as required for testing to ensure joint requirements are included and adequately addressed throughout the software development effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Engineering"
                                    },
                                    "Description": {
                                        "val": "Perform Software\/Systems Engineering in support of the development of JBC-P Capabilities, Applications, and Services, to include, but not limited to, Conducting Engineering Studies, Architecture Development (both Software and Network), System Analyses, Technical Readiness Assessments, Technical Interchange Meetings\/Events, and development of Related Reports and other deliverables."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.605"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform Software\/Systems Engineering in support of the development of JBC-P capabilities, Applications, and Services, to include, but not limited to, Conducting Engineering Studies, Architecture Development (both Software and Network), System Analyses, Technical Readiness Assessments, Technical Interchange Meetings\/Events, and development of Related Reports and other deliverables."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.235"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In order to meet timelines for the Army's Capability Set 15-16 fielding cycle, begin Software and System Engineering in Fiscal Year 2012.  Begin planning, requirements analysis, system architecture and Family of Systems (FoS) engineering for Capability Set 15-16 software.  Begin security engineering including security certification and accreditation plan, safety engineering and FoS definition study and prototyping.  Begin development of System\/Subsystem specification for Capability Set 15-16 software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.285"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.285"
                                            },
                                            "Text": {
                                                "val": "Complete Capability Set 13-14 security engineering including security certification and accreditation plan, safety engineering and FoS definition study and prototyping.  Complete development of requirements analysis, System\/Subsystem specification and high level system engineering for Capability Set 15-16 software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Design, Develop and Procure Prototypes for Dismountable Vehicle Tablet Product and Beacon Product, Embedded Encryption and Satellite Transceiver"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.605"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design, Develop and Procure Prototypes for Dismountable Vehicle Tablet Product and Beacon Product, Embedded Encryption and Satellite Transceiver."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.550"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test and evaluation of beacon solution.  Test and evaluation of COTS\/GOTS candidates for dismountable vehicle computer solution.  Conduct testing at the Network Integrated Evaluation 12.2 in preparation for Milestone C approval to conduct Initial Operational Test and Evaluation for Capability Set 13-14.  Conduct Milestone C decision review."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "FBCB2 Program Management"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.235"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Management, to include Core, Matrix and Contractor Support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.423"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide within JBC-P requirement, technical, logistics and business oversight for software and hardware development activities.  Monitor progress of performing organizations and prepare reports to higher headquarters.  Develop and implement plans for process and product improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.861"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.861"
                                            },
                                            "Text": {
                                                "val": "Provide within JBC-P requirement, technical, logistics and business oversight for software and hardware development activities.  Monitor progress of performing organizations and prepare reports to higher headquarters.  Develop and implement plans for process and product improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test, Evaluation and Integration"
                                    },
                                    "Description": {
                                        "val": "Develop and Conduct Integration Events (i.e., Tests and Assessments)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.605"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and Conduct Software and Hardware Integration Events (i.e., Tests and Assessments)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.875"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete planning for Capability Set 13-14 Operational Test.  Equip test unit with Engineering and Manufacturing Development hardware.  Conduct test and evaluation of beacon solution.  Test and evaluation of COTS\/GOTS candidates for dismountable vehicle computer solution.  Conduct testing at the Network Integrated Evaluation 12.2 in preparation for Milestone C approval to conduct Initial Operational Test and Evaluation (NIE 13.1) for Capability Set 13-14.    \nEvaluate test data and provide reports to the Project Manager and Milestone Decision Authority for use in decision reviews."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.715"
                                            },
                                            "Text": {
                                                "val": "Conduct developmental and operational testing at NIE 13.2 for targeted Joint Interoperability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Joint Battle Command - Platform"
                                    },
                                    "Title": {
                                        "val": "OPA W61990"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.146"
                                        },
                                        "CurrentYear": {
                                            "val": "69.514"
                                        },
                                        "BudgetYearOne": {
                                            "val": "141.385"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "141.385"
                                        },
                                        "BudgetYearThree": {
                                            "val": "121.658"
                                        },
                                        "BudgetYearFour": {
                                            "val": "137.754"
                                        },
                                        "BudgetYearFive": {
                                            "val": "148.765"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "743.753"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Joint Battle Command - Plat (JBC-P)"
                                    },
                                    "Title": {
                                        "val": "RDTE PE 273759, Proj. No. 122"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.935"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.935"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The JBC-P program was Joint Requirements Oversight Council (JROC) approved in May 2008.  RDTE funding for JBC-P began in Fiscal Year 2010.  The Acquisition Strategy Report (ASR) was approved in September 2009.  An Acquisition Decision Memorandum, approving a Modified Milestone B, and entry into the Engineering and Manufacturing Development phase, was issued in September 2009.  The MS C in 3Q FY12 will allow JBC-P to enter into IOT&E(NIE 13.1) in 1Q FY13 with JBC-P software on mounted vehicular computers (JV5), Remoteable vehicular computers (JPT\/Tablet), TOC Kits, and the Beacon capability."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Battle Command - Platforms (JBC-P) development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SED, Redstone Arsenal"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.600"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "28.900"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.915"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.915"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JBC-P Software\/System Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SED, Redstone Arsenal"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.605"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.235"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.285"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.285"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design, Develop, and Procure Hardware Prototypes"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.605"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.550"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Matrix System\/Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FBCB2"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground (APG), MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.305"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.060"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government In-House System\/Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FBCB2"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground (APG), MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.800"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.861"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.861"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contractor System\/Project Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FBCB2"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Gound (APG), MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.130"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.263"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Develop and Conduct Tests and Assessments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.605"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.875"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.715"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.715"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Critical Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Network Integrated Evaluation (NIE) 12.2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP: Production & Deployment Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.1 (IOT&E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 13.2 (Joint Interoperability)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production (FRP) Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FRP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order (DO) Award Year 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DO Award Year 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DO Award Year 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DO Award Year 5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FRP: Production & Deployment Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}