{
    "id": "e5dcdfa3b0ec18cf6b8f6a4fee652c5dd6e50df1",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804758N"
        },
        "ProgramElementTitle": {
            "val": "Service Support To JFCOM, JNTC"
        },
        "R1LineItemNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.104"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "4.104"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Per the FY 2005 National Defense Authorization Act, Navy Joint National Training Capability (JNTC) RDT&E is managed by US Fleet Forces Command (USFF) Joint & Sustainment Branch (N71) from P\/E 0804758N.  This management reflects the decentralized execution of JNTC RDT&E from JFCOM.  Throughout the FYDP, these funds will continue to be managed and executed by USFF N71.\n\nThe Navy continues to develop joint training technologies that will play a crucial role in it's ability to address current and future joint operational training requirements. Navy program activities include conducting research, development, test and evaluation and cross-service architecture certification on Navy capable systems, developing architectures and roadmaps to ensure that service instrumentation follows a common standard, and researching and assessing Navy mission rehearsal, Joint Semi-Automated Forces (JSAF), Joint National Training Capability (JNTC) Joint Live-Virtual Constructive (JLVC) Federation Object Model (FOM) Interoperabilities.\n\nThe Navy will further develop capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment.  Using a scientific and phased approach, Navy will leverage and research new technologies and methods, based upon focused joint operational training requirements, that provide a crucial technology-based foundation supporting all current and \"to be\" Navy joint training capabilities.  Available commercial-off-the-shelf (COTS) and government -off-the-shelf (GOTS) networked information technologies and collaborative planning tools will be leveraged to provide improved net-centric joint training capability.  Navy will lead the collaboration process to identify, collect and validate the requirements in order to design and develop the modeling and simulation  capabilities that address the shortfalls in current abilities to support Joint Task training to standards.\n\nThe Navy Joint Live-Virtual Constructive (JLVC) Federation Object Model (FOM) development program is the primary means of providing a persistent and interoperable netowork among the Navy, Joint and Coalition federation components.\n\nThe Navy JNTC RDT&E Program efforts directly support the Unified Command Plan (UCP) series and is aligned with the DoD Information Operations (IO) Roadmap."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.260"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.104"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.156"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.134"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.022"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3152"
                    },
                    "ProjectTitle": {
                        "val": "Service Support to JFCOM\/JNTC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.104"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.104"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "BASE REQUEST:\n\nNavy Warfare Development Command (NWDC) provides dedicated Joint Semi-Automated Forces (JSAF) software via development, configuration management, verification and validation and engineering management to ensure that Fleet and Joint requirements are incorporated.  NWDC also supports the development of standards in networking, simulation federation, and tactical system interfaces for Fleet Synthetic Training (FST) interoperability to meet training objectives.  The Joint Live-Virtual Constructive (JLVC) Navy Continuous Training Environment (NCTE) Federation Object Model (FOM)  program provides a persistent and interoperable network among the Navy, Joint and Coalition federation components."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JSAF Improvement Program"
                                    },
                                    "Description": {
                                        "val": "JSAF improvements provide core stimulation for Fleet Synthetic Training (FST) providing the environment and scenario for Naval Forces training from unit level to Force level structures.  FST is the major certifying event for readiness.\n\nArticles:\n1.  Improve Joint exercise and home station training.\n2.  Maximize inclusion of distributed command and control (C2) and intelligence.\n\nAccomplishments \/ Planned Program:\n  JSAF Release v4.2.0 released December 2010\n  JSAF Release v4.3.0 released March 2011\n  JSAF Release v4.5 release August 2011"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.265"
                                            },
                                            "Articles": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Stability and robustness improvements to support Fleet Synthetic Training.  Improved capability of Automated Status Boards and Link 16 Information Display for the Tactical Training Group Schoolhouses.  Improved capability of Class III and V Logistics, Theater Battle Management Core Systems (TBMCS) mission support interface, and Intel fidelity (ELINT) in support of Joint National Training Capability (JNTC) and NTF\/PACOM requirements.  Improved capability in support of virtual and constructive users such as: Manned Flight Systems' H-60R and H-60S trainers, JLVC, and NWDC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JNTC\/JLVC Navy Training FOM Support"
                                    },
                                    "Description": {
                                        "val": "Integration functions for Fleet Synthetic Training (FST) events integrating over 20 Navy programs and Coalition countries as well as Joint simulations into FSTs.  FST is the major certifying event for deployment readiness.\n\nArticles:\n1.  Improve Joint exercise and home station training\n2.  Maximize inclusion of distributed command and controls (C2) and intelligence\n\nAccomplishments \/ Planned Programs\n  MRT3\/EDRT\/EP-3 MAST Fielded \/ Complete\n  Integrate P-3 TORT and MH-60 TOFT Trainers\n  Integrate Aegis Ballistic Missile Defense 4.0.1"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.839"
                                            },
                                            "Articles": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Navy will further develop capabilities to address ASW improvements, information operations, BLUFOR capability representation including Littoral Combat Ship (LCS), P-8A, Surface Warfare Enterprise Advanced Capability Build \n(ACB) - 12\/14 development and integration and emergent threats.  Navy will further address additional Coalition Partner Integration, LCS Shore Based Training Facility (SBTF) integration, Combined Armed Forces (CAF) - Distributed Mission Operations (DMO) integrations and Korean Simulation Battle Center (KSBC) integration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1) Navy Warfare Development Command (NWDC) will produce one Joint Semi-Automated Forces (JSAF) software release to include documentation; will design and implement upgrades to JSAF consistent with approved requirements and Change Requests and document the effects of JSAF capabilities (robustness) and stability.  Will design, implement, test, and integrate JSAF enhancements in accordance with requirements.\n\n2) NWDC will produce one Navy Training FOM (NTF) release to include applicable documentation updates for the Guidance, Rational, and Interoperability Manual (GRIM) and Federation Agreement Document (FAD).  Will implement JSAF capability enhancements to support evolving joint and Coalition training requirements. \n\n3) NWDC will deliver one Navy Continuous Training Environment (NCTE) Interoperability Guide update to be promulagated to all NCTE users.\n\n4)  Facilitate integration by providing dedicated support to the effort, improving the quality of participation and documentation of Navy efforts in the Joint National Training Capability (JNTC).  Refine and mature the Navy Training Federation Object Model (NTF), improving interoperability and integration with other services and the Joint community.  Provides a standardized Federation Object Model (FOM) for integration across the Navy training simulations.\n\n5)  Current Joint Live-Virtual-Constructive (JLVC) and other federation simulation distribution is accomplished by tying simulation data to multicast groups.  This is neither a scalable solution nor is it an effective one as federates are not able to publish and subscribe with fine enough precision.  The Simulation Aware Software Router will address this shortcoming and additionally provide a flexible solution for federating heterogeneous networks and on-the-wire protocols without forcing all federates onto a single, uniform, lowest common denominator solution for each training event.  Ultimately, a simulation aware router will allow simulation users to optimize the network for both simulation scalable traffic and for voice and Command, Control, Communications, (Computers), Intelligence (C4I) traffic."
                        }
                    }
                }
            ]
        }
    }
}