{
    "id": "e61dc793181ef3bc452d2944d4b447d31122bde6",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604321A"
        },
        "ProgramElementTitle": {
            "val": "ALL SOURCE ANALYSIS SYSTEM"
        },
        "R1LineItemNumber": {
            "val": "84"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.322"
            },
            "CurrentYear": {
                "val": "7.405"
            },
            "BudgetYearOne": {
                "val": "5.694"
            },
            "BudgetYearOneBase": {
                "val": "5.694"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "2.489"
            },
            "BudgetYearThree": {
                "val": "1.260"
            },
            "BudgetYearFour": {
                "val": "1.327"
            },
            "BudgetYearFive": {
                "val": "1.367"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The All Source Analysis System (ASAS) provided US Army commanders at all echelons from battalion to Army Service Component Command (ASCC) with automated support to the management and planning, processing and analysis, and dissemination of intelligence, counterintelligence, and electronic warfare. ASAS provided the means to enhance the commander's timely and comprehensive understanding of enemy deployments, capabilities, and potential courses of action. The system used standard joint and Army protocols and message formats to interface with selected National, joint, theater, and tactical intelligence, surveillance, and reconnaissance systems and preprocessors and Army, joint, and coalition battle command systems. The ASAS Family of Systems migrated into the Distributed Common Ground System-Army (DCGS-A) program and Army is using it as the initial platform to provide accelerated DCGS-A capabilities to the force. \n\nThe Counterintelligence and Human Intelligence Automated Reporting and Collection Systems (CHARCS), formerly known as Counterintelligence and Human Intelligence (CI\/HUMINT) Information Management System (CHIMS), provides the Army automation support for collection and reporting of CI\/HUMINT data to satisfy tactical human intelligence requirements. CHARCS functionality provides support for CI\/HUMINT information collection, reporting, investigation, interrogation, biometrics, and document exploitation operations.  The CHARCS architecture extends from the individual Tactical HUMINT team soldier or CI agent to Theater and National intelligence organizations.  CHARCS provides systems to all Army Commands (ARCOM), Special Forces, Reserves, National Guard, Stryker Brigade Combat Teams (SBCT), and the training base.  CHARCS systems produce and disseminate messages and reports through an array of communications systems including: combat Net Radio, Single Channel Ground and Airborne Radio System (SINCGARS), Portable Radio Communications(PRC)-150 Secure Telephone Equipment (STE), Secure Telephone Unit (STU), satellite, and other organic communications devices.  The CHARCS systems reports collected intelligence directly to Operational Management Teams (OMT) of U.S. Army intelligence units.  Future development efforts will provide CI agents and HUMINT collectors improved collection, reporting, biometrics, language, communications and mission management capabilities.   \n  \nThe Machine - Foreign Language Translation System (M-FLTS) program is to develop, acquire, field and sustain the warfighter with a basic automated foreign speech and text translation capability into Army systems of record, to augment and compliment limited human linguistic resources.  These stand-alone and integrated automated translation capabilities will be applicable across three different system configurations; a hand-held\/wearable portable device, a lap-top or mobile device, and in a networked system.  The software modules will translate English into a prioritized listing of languages in a prioritized collection of domains.  M-FLTS  will be interoperable with commercial off-the-shelf (COTS), or government-off-the-shelf (GOTS) automation equipment to include the Net Enabled Command Capability (NECC), the Distributed Common Ground System (DCGS), Battle Command System (BCS), Soldier as a System (SaaS), Ground (GSS), Mounted (MSS) and Air-Soldier Systems (Air-SS), DoD Intelligence Information Systems (DoDIIS) and any associated devices and peripherals."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.674"
                },
                "CurrentYear": {
                    "val": "17.412"
                },
                "BudgetYearOne": {
                    "val": "3.217"
                },
                "BudgetYearOneBase": {
                    "val": "3.217"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.322"
                },
                "CurrentYear": {
                    "val": "7.405"
                },
                "BudgetYearOne": {
                    "val": "5.694"
                },
                "BudgetYearOneBase": {
                    "val": "5.694"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.352"
                },
                "CurrentYear": {
                    "val": "-10.007"
                },
                "BudgetYearOne": {
                    "val": "2.477"
                },
                "BudgetYearOneBase": {
                    "val": "2.477"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.477"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.477"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.352"
                                },
                                "CurrentYear": {
                                    "val": "-10.007"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "B41"
                    },
                    "ProjectTitle": {
                        "val": "CI\/HUMINT Software Products (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.227"
                        },
                        "CurrentYear": {
                            "val": "0.102"
                        },
                        "BudgetYearOne": {
                            "val": "1.319"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.319"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.225"
                        },
                        "BudgetYearThree": {
                            "val": "1.260"
                        },
                        "BudgetYearFour": {
                            "val": "1.327"
                        },
                        "BudgetYearFive": {
                            "val": "1.367"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counterintelligence (CI) and Human Intelligence (HUMINT) Automated Reporting and Collection System (CHARCS) is the Army's CI and HUMINT tactical collection and reporting system. CHARCS provides automation support for information collection, reporting, investigations, source & interrogation operations and document exploitation. The CHARCS automation architecture extends from the individual HUMINT team soldier or CI agent to the Division and Corps Analysis and Control Element (ACE). CHARCS reports digital data such as maps, overlays, images, video, biometrics, scanned documents and audio files. These media are transmitted through secure networks and interfaces with the Distributed Common Ground Systems-Army (DCGS-A) for detailed analysis and creation of finished intelligence products. Collection and reporting teams at Military Intelligence (MI) battalions and their operational managers are equipped with one of two CHARCS systems. The first is the AN\/PYQ-8 Individual Tactical Reporting Tool (ITRT) which provides collection and processing devices for individual HUMINT team member or CI agents. The second is the AN\/PYQ-3 CI\/HUMINT Automated Tool Set (CHATS) which provides the team leader (who normally directs 3-5 team members) tools to process and manage team-collected information and a robust set of devices such as printers, scanners, cameras and audio recorders to assist the collection mission. The CHATS is also used by Operational Management Team (OMT) (who normally directs 5-10 collection and reporting teams). Each CHATS has an associated Mission Support Peripheral Sets and Kits (MS-PSK) or Collection Peripheral Sets and Kits (C-PSK), and each ITRT has an associated C-PSK.\n\nThe C-PSK provides specialized collection component capabilities to support CI\/HUMINT collection missions as an addition to the CHATS and ITRT. C-PSK capabilities are commercial-off-the-shelf (COTS) technologies and include video and camera equipment, global positioning system (GPS), voice recording device and infrared strobe lights. The MS-PSK provides specialized collection component capabilities to support CI\/HUMINT collection missions as an addition to the AN\/PYQ-3 (CHATS). MS-PSK capabilities are COTS technologies and include night vision photography & video, binocular, captured materiel tracking, Document & Media Exploitation (DOMEX), Digital Media Forensics software, Document Exploitation (DOCEX) software, and will interface with a handheld biometric capability for identification.\n\nFY2013 Base amount of $1.319 million will fund additional tests of the CHARCS V1.4 baseline software, software enhancements, CHARCS web-based capability, service packs, IAVA and DIA security updates and compliance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RDTE: Continue security and accreditation, enhancement and hardware integration testing of CHARCS software."
                                    },
                                    "Description": {
                                        "val": "Funds software testing, development and maintenance, PMO support and systems testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.227"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funded $5681K Base continued development of improved collection and reporting software functionality, and 446K continued test and security accreditation efforts.  OCO:   $8100K funded research and development of Document and Media Exploitation (DOMEX) tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "$102K will fund additional tests of the CHARCS V1.4 baseline software, software enhancements, service packs, IAVA and DIA security updates and compliance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.319"
                                            },
                                            "Text": {
                                                "val": "FY2013 Base amount of $1.319 million will fund additional tests of the CHARCS V1.4 baseline software, software enhancements, CHARCS web-based capability, service packs, IAVA and DIA security updates and compliance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BK5275"
                                    },
                                    "Title": {
                                        "val": "CI HUMINT AUTO REPRTING AND COLL (CHARCS) (MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "54.751"
                                        },
                                        "CurrentYear": {
                                            "val": "3.493"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.593"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.077"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "6.516"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.392"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.604"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.782"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program capability documentation is in the process of being updated to include Inc 2 requirements in CHARCS CPD Increment 1, Revision 1, which will support the movement of select capabilities into the revised capabilities document.   PD CHARCS is a post-Milestone C program, scheduled to deliver software version v1.4 in 3Q FY 12. CHARCS software is the common software on two collection and reporting products: CI\/HUMINT Automated Tool Set (CHATS) and Individual Tactical Reporting Tool (ITRT). CHARCS software requires development to keep pace with evolving capability requirements, DIA and IAVA compliance, and to meet JROC approved requirements documented in the CHARCS CPD Increment I, Revision 1. PD is continunously evaluating and assessing existing COTS, GOTS, and QRCs that support CHARCS CPD Inc 1, Revision 1."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management - PD CHARCS Government Acquisition Mgmt - Direct Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASPO\/PD CHARCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.790"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.790"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CHARCS Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM Software Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Huachuca, Arizona"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.988"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DOMEX Tools"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "National Ground Intelligence Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charlottesville, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Acquisition and Engineering Services- Program Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI Technologies, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.857"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support and Interoperability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CTSF,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hood, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.612"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Test \/ Security Accreditation Testing \/ HW Integration Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.234"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.102"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Security Accreditation Collateral"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.381"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Safety release"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.035"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "V1.4  Government Acceptance Testing (GAT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V1.4 ATEC Testing - Field Operating Agency (FOA)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CHARCS Interoperability Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V1.4 Operational Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "B51"
                    },
                    "ProjectTitle": {
                        "val": "SEQUOYAH - FOREIGN LANGUAGE TRANSLATION SYSTEM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.095"
                        },
                        "CurrentYear": {
                            "val": "7.303"
                        },
                        "BudgetYearOne": {
                            "val": "4.375"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.375"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.264"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Machine Foreign Language Translation System (MFLTS), formerly Sequoyah, develops, fields, and sustains a basic automated foreign speech and text translation capability for Army tactical systems to augment and compliment limited human linguistic resources. These integrated automated translation capabilities will be applicable across three different system configurations; a hand-held\/wearable portable device, a laptop\/mobile device, and in a networked\/web-enabled system. The software modules will translate English from a prioritized list of languages in a prioritized collection of domains (e.g. medical, intelligence, base security). MFLTS will be interoperable with Commercial Off-The-Shelf (COTS) or Government Off-The-Shelf (GOTS) automation equipment to include the Distributed Common Ground System-Army (DCGS-A), Nett Warrior (NW), and Counterintelligence Human Intelligence Automated Reporting and Collection System (CHARCS).\n\nFY13 Base RDTE dollars in the amount of $4.375 million will complete the Engineering and Manufacturing Development (EMD) and testing activities, providing deployable automated translation software."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development (PD)"
                                    },
                                    "Description": {
                                        "val": "Development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.308"
                                            },
                                            "Text": {
                                                "val": "Will continue development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation of MFLTS Capabilities"
                                    },
                                    "Description": {
                                        "val": "Testing of the automated language translation capabilities using established metrics, collected standard data sets, and standardized objective validation process"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Testing of the automated language translation capabilities using established metrics, collected standard data sets, and standardized objective validation process"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.881"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.881"
                                            },
                                            "Text": {
                                                "val": "Will continue test of the automated language translation capabilities using established metrics, collected standard data sets, and standardized objective validation process"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Collection of Vocabulary and Test Sets"
                                    },
                                    "Description": {
                                        "val": "Development of the vocabulary collection and testing sets in the prioritized languages"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completion of the vocabulary collection and testing sets in the prioritized languages"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PD Support and Management Services"
                                    },
                                    "Description": {
                                        "val": "Program Support and Matrixed services at other Government activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued program support and matrixed services at other Government activities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide program support and matrixed services at other Government activities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.186"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.186"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide program support and matrixed services at other Government activities"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B88605"
                                    },
                                    "Title": {
                                        "val": "Machine Foreign Language Translation System - MFLTS"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "6.900"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "13.943"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MFLTS acquisition strategy for the Technology Development (TD) Phase is to develop an open software architecture prototype using full and open competition that will allow the addition, upgrade and replacement of translation system components for integration into existing Programs. During the Engineering and Manufacturing Development (EMD) Phase, the program will integrate technology demonstrated during the TD Phase to meet Key Performance Parameters (KPPs).  This includes the requirement to meet an Interagency Language Roundtable (ILR) level of 1 for three speech translation modules and an ILR level of 1+ for two text translation modules in hand-held\/wearable portable, laptop\/mobile, and networked\/web-enabled system configurations."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.171"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.108"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.186"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.186"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.465"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon BBN"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.554"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.446"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.718"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.718"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.718"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.062"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.578"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.230"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation Activities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USA Test and Eval Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.171"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.881"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.881"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.052"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Collection"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Adelphi, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.308"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.308"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "TD Phase Contract Awards"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Preliminary Design Review (PDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - EMD Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LUT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - Limited Deployment (LD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOTE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - Full Rate Production (FRP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}