{
    "id": "e74132a1a84e1d5e7d8cfc6b566abb53d3ff9b35",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602120A"
        },
        "ProgramElementTitle": {
            "val": "Sensors and Electronic Survivability"
        },
        "R1LineItemNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "46.491"
            },
            "CurrentYear": {
                "val": "43.453"
            },
            "BudgetYearOne": {
                "val": "45.260"
            },
            "BudgetYearOneBase": {
                "val": "45.260"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "50.877"
            },
            "BudgetYearThree": {
                "val": "52.127"
            },
            "BudgetYearFour": {
                "val": "58.435"
            },
            "BudgetYearFive": {
                "val": "54.819"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 - Funding realigned to higher priority efforts"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates designs and evaluates sensors and electronic components and software that enhance situational awareness, survivability, lethality, and autonomous mobility for tactical ground forces. Project H15 focuses on Combat Identification (CID) technologies, which include devices to locate, identify, track, and engage targets in the Joint fires environment. Project H16 investigates sensors, signal processing and information fusion technologies to increase target detection range and speed of engagement. Project SA2 conducts applied research on biological sensors and biologically derived electronics that exploits breakthroughs in biotechnology basic research in collaboration with the Institute for Collaborative Biotechnology (ICB) a University Affiliated Research Center (UARC) led by the University of California, Santa Barbara in partnership with California Institute of Technology and Massachusetts Institute of Technology and their industry partners. Project TS1 researches and evaluates space-based remote sensing, signal, and information processing software in collaboration with other Department of Defense (DoD) and government agencies to support space force enhancement and space superiority advanced technology integration into Army battlefield operating systems. Project TS2 focuses on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and unique mobility for unmanned vehicles.  \n\nWork in this program element (PE) complements and is fully coordinated with efforts in PE 0602307A (Advanced Weapons Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603006A (Command, Control, Communications Advanced Technology), PE 0603008A (Command Electronic Warfare Advanced Technology),\nPE 0603710A (Night Vision Advanced Technologies), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology),\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy\n\nWork is performed by the Army Research Laboratory, Adelphi, MD and Aberdeen Proving Ground, MD; the Communications-Electronics Research, Development, and Engineering Center, Aberdeen Proving Ground, MD; and the US Army Space and Missile Defense Technical Center, Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.929"
                },
                "CurrentYear": {
                    "val": "43.521"
                },
                "BudgetYearOne": {
                    "val": "47.014"
                },
                "BudgetYearOneBase": {
                    "val": "47.014"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.491"
                },
                "CurrentYear": {
                    "val": "43.453"
                },
                "BudgetYearOne": {
                    "val": "45.260"
                },
                "BudgetYearOneBase": {
                    "val": "45.260"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.438"
                },
                "CurrentYear": {
                    "val": "-0.068"
                },
                "BudgetYearOne": {
                    "val": "-1.754"
                },
                "BudgetYearOneBase": {
                    "val": "-1.754"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.910"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.754"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.754"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.528"
                                },
                                "CurrentYear": {
                                    "val": "-0.068"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H15"
                    },
                    "ProjectTitle": {
                        "val": "GROUND COMBAT ID TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.112"
                        },
                        "CurrentYear": {
                            "val": "2.066"
                        },
                        "BudgetYearOne": {
                            "val": "2.181"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.181"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.841"
                        },
                        "BudgetYearThree": {
                            "val": "4.705"
                        },
                        "BudgetYearFour": {
                            "val": "4.384"
                        },
                        "BudgetYearFive": {
                            "val": "4.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and investigates emergent techniques, devices and software for combat identification (CID) of Joint, allied, and coalition forces, including air-to-ground and ground-to-ground for mounted, dismounted, forward observer, and forward air controller missions. Efforts include research to enable a common battlespace picture for Joint and coalition situation awareness and fusion efforts to increase the survivability and lethality of coalition forces by fusing battlefield sensor and situational awareness data to identify friend from foe.\n\nThis project supports Army science and technology efforts in the Command, Control and Communications, Soldier and Ground portfolios.  Efforts in this project are complimentary of PE 0602270A (EW Techniques), PE 0603270A (EW Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Identification (CID) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and enhances CID modeling and simulation tools, concepts, and algorithms to improve anti-fratricide and combatant\/non-combatant identification capabilities. Soldier-to-Soldier CID algorithms that interoperate with non-traditional CID sensors (air and ground) are developed to increase situational awareness (SA), feed the common operating picture, and increase the combat effectiveness of Soldier and  Brigade Combat Teams (BCTs). Work being accomplished under PE 0603270A\/project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.905"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Modeled fusion algorithms for improved battlespace awareness to include geolocation and target identification algorithms utilizing blue force emitter information to resolve current radar, laser, and ultra-violet\/infrared (UV\/IR) warning receiver sensor ambiguities; linked to Distributed Common Ground System-Army (DCGS-A) Enterprise for initial assessment\/user jury to obtain user community feedback and recommendations for algorithm improvements; performed communication and network modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.066"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve algorithms to deconflict, fuse and correlate warning receiver and blue force emitter data with DCGS-A provided intelligence, surveillance and reconnaissance, based on initial user jury results; Investigate data transport requirements needed to support the generation of an enterprise-wide ground and air common operating picture that provides accurate and timely reporting of high value targets for enterprise-wide as well as organic platform SA for increased CID awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.181"
                                            },
                                            "Text": {
                                                "val": "Will evaluate tactical and emerging commercial communications, wireless personal area networks and position location information beaconing through modeling and simulation to assess their potential as components of a Soldier-to-Soldier CID capability; evaluate capacity of existing mobile\/handheld platforms to perform CID display and training; investigate signature data from multiple sensor types (infrared, RF and other) to support non-cooperative CID technology development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops software technologies for intelligence\/battle command (Intel\/BC) enterprise collaboration to provide faster and higher quality decision making support for the Commander and his key staff. Specific efforts focus on integrating the intelligence, surveillance and reconnaissance planning and multi-echelon execution (task force\/battalion through individual Soldier) as well as efforts that enable the enterprise to identify, fuse, and trace\/track specific human targets in an asymmetric environment. Work being accomplished under PE 0602270A\/project 906 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.207"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Associated Intel requirements, geolocation data needs and collection opportunities with operational mission tasks for Intel and BC communities; matured common architecture and framework to provide a portable software environment, storage and access for Intel and Operations communities. Complementary work is also being accomplished under PE 0602270A\/project 906."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H16"
                    },
                    "ProjectTitle": {
                        "val": "S3I TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.521"
                        },
                        "CurrentYear": {
                            "val": "19.883"
                        },
                        "BudgetYearOne": {
                            "val": "20.726"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.726"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.258"
                        },
                        "BudgetYearThree": {
                            "val": "21.198"
                        },
                        "BudgetYearFour": {
                            "val": "21.382"
                        },
                        "BudgetYearFive": {
                            "val": "21.370"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, investigates and evaluates advanced sensor components, signal processing, and information fusion algorithms that will provide the future Soldier decisive new capabilities to locate, identify, decide and engage battlefield targets in tactical environments.  The ultimate impact and utility of this work will be to greatly increase the lethality, range, and speed of engagement of the Soldier.  Emphasis is on solving critical Army-specific battlefield sensing and information management problems such as false targets, complex terrain (including urban applications), movement of sensors on military vehicles, and exploitation of multimodal sensors.  Significant areas of research include: low cost sensors designed to be employed in large numbers of networked sensors for force protection, hostile fire defeat, homeland defense, counter terrorism operations, and munitions; fusion of disparate sensors such as non-imaging acoustic, seismic, electric-field (E-field), magnetic, radar; imaging infrared (IR), forward looking IR (FLIR), laser detection and ranging (LADAR), visible imagers; low cost acoustic, seismic, and magnetic sensors that can passively detect, classify, and track battlefield targets such as personnel, heavy\/light vehicles, and helicopters.  Other areas of research include sensing technologies for tagging, tracking, and locating (TTL) non-traditional targets as well as the location of direct and indirect fires and other hostile threats. Further areas of research include Ultraviolet (UV) optoelectronics for battlefield sensors, networked compact radar for vehicle and dismount identification and tracking; ultra wideband radar for buried and concealed threat detection, enhanced robotic mobility, stand-off characterization of infrastructure; and the detection, classification, and tracking of humans in urban terrain.  Additional areas of research are aided\/automatic target recognition (ATR) allowing sensors to autonomously locate and identify targets; advanced battlefield sensor and information processing to conduct a dynamic and real time situational assessment to present a common picture of the battlespace focused on low echelon commanders; and advanced information processing methods to provide automatic information technologies that utilize widely dispersed sensor and legacy information sources.\n\nThis project supports Army science and technology efforts in the Command Control and Communications, Ground and Soldier portfolios.  The work in this project complements efforts funded in PE 0601104A (University and Industry Research Centers), PE 0602709A (Night Vision Technology), PE 0603710A (Night Vision Advanced Technologies), and PE 0603001A (Warfighter Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this area is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-Imaging Intelligence, Surveillance, and Reconnaissance (ISR) Sensing (previously titled Unattended Ground Sensors (UGS))"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and designs technologies for multi-modal low-cost networked sensors to enhance persistent sensing capabilities with increased probability of target detection and reduced false alarms.  A key focus is on acoustic, seismic, magnetic, E-field, and passive RF with unique capabilities for Army & DoD applications such as technologies that enable detection of underground facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.242"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented the concept of unattended ground sensors (UGS) for persistent surveillance with increased interoperability with multiple UGS vendors; enhanced acoustic localization accuracy through meteorological correction of solution vectors; exploited acoustic, seismic, magnetic, and electric fields for locating, reliable target characterization, and classification; and investigated airborne multimodal sensing of targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.860"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate new fusion techniques for enhanced discrimination between vehicles, humans and animals and develop algorithms for acquiring 360 degree situational awareness from multisensory wide-area persistent surveillance platforms; apply acoustic, seismic, magnetic, and E-field to subsurface anomaly detection and characterization; apply advanced transient event classification algorithms to fielded acoustic systems; and enhance detection range and localization accuracy of airborne acoustic systems to include an unmanned aerial vehicle (UAV) with both acoustic and E-field sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.014"
                                            },
                                            "Text": {
                                                "val": "Will investigate, design, and code new algorithms and assess sensor performance to enable faster identification and localization of transient\/hostile threat events such as gunfire, explosions, weapon launches, etc. to enable rapid counter responses in urban environment and for base camps; investigate, code new algorithms for fusing the output of multi-modal sensors to differentiate, with very high confidence, the presence of humans versus animals to reduce the costs for sensor deployment required for target classification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Sensing and Data Fusion (previously titled Sensor and Data Fusion)"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and assess a concept to link physical sensors and information sources to Soldiers and small units.  Specifically the research focuses on (1) multi-modal sensor fusion for detection and classification of human activities and infrastructures such as personnel, vehicles, machinery, RF emissions, chemicals and computers in hidden and confined spaces (i.e., tunnels, caves, sewers and buildings), (2) interoperability and networking of disparate sensors and information sources, (3) distributed information for decision making and (4) devise approaches for fusing results of processed outputs of multimodal sensors such as visible, IR and hyperspectral imagers, and acoustic, magnetic & E-field sensors. This effort is complementary with PE 0601104A\/H50 and PE0601104A\/J22."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented novel fusion methodologies, and decentralized and distributed data fusion using heterogeneous sensor systems, platforms, and networks for enhanced detection, tracking, and classification of threats; exploited multi-modal sensing and fusion concepts to characterize underground facilities, materiel and tunnels; developed new policy-based sensor information algorithms for robust communication up to coalition level; and implemented new computationally efficient anomaly detection algorithms for imaging target recognition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.127"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply advanced fusion algorithms to multimodal sensors and systems; exploit magnetic and E-field fusion for equipment characterization, power line monitoring, and target localization; employ acoustic and seismic techniques to augment E-field subsurface imaging; enhance sensing from airborne platforms with multi-modal sensors, cueing and fusion algorithms; and implement fusion algorithms to discriminate humans versus other targets with high accuracy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.650"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.650"
                                            },
                                            "Text": {
                                                "val": "Will develop and assess novel multi-modal sensing and processing algorithms for acquiring information on human activity; investigate and perform experiments in a realistic or simulated environment to evaluate FY12 distributed networking and interoperability algorithms and tools for coalition information sharing and decision making; implement quality of information (QoI) based data discovery, collection and fusion techniques to extract desired information from large data sets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging Tracking and Locating (TTL)"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to support advances in state-of-the-art clandestine TTL for non-traditional hostile forces and non-cooperative targets. Specific technical details related to this effort are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed, fabricated, and evaluated TTL experimental devices including unattended ground sensors (UGS) integration, RF Tags, and IR Tags for transition to CERDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize and transition TTL technologies to CERDEC and implement improvements to RF and IR Tags."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.072"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.072"
                                            },
                                            "Text": {
                                                "val": "Will investigate alternate technologies including UV, IR, RF, and acoustic modalities for application to TTL; design advanced hyperspectral algorithms for locating and tracking targets of interest; develop advanced biometric techniques for locating and identifying humans of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultra Wideband Radar"
                                    },
                                    "Description": {
                                        "val": "Design technical underpinnings of ultra wideband (UWB) radar for several key Army concealed target detection technology requirements including landmine detection, sensing through-the-wall (STTW), and obstacle detection.  Validate advanced computational electromagnetic algorithms, estimate performance improvements of proposed radar systems, and predict target signatures for advanced detection requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.724"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated advanced Improvised Explosive Device (IED)-discrimination algorithms and technologies that exploit physics-based features to reduce false alarms in low-artifact radar imagery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collect data with improved forward-looking UWB radar testbed to assess IED detection performance gains relating to the following areas: increased antenna height above ground, new antenna\/balun design with enhanced low frequency content for better ground penetration, and polarimetric effects; and investigate techniques to utilize information embedded in low frequency radar data to develop an effective combination of interior building maps, moving target indication algorithms and RF Measurement & Signatures Intelligence technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.114"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.114"
                                            },
                                            "Text": {
                                                "val": "Will complete FY12 assessments that combine electromagnetic models, rough surface models, measurement data and signal processing techniques to recommend forward looking radar parameters for optimized detection of IEDs to improve detection performance at increasing standoff distances; investigate utilizing radar data to build interior structure maps as well as stationary target detection techniques using 3-D computer-generated radar images."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Compact Radar, Wide Bandgap Optoelectronics, and Laser Protection Technologies (previously titled Multi- Function Radio Frequency System (MFRFS) and Wide Bandgap Optoelectronics)"
                                    },
                                    "Description": {
                                        "val": "Design Networked Compact Radar for use on small ground and air vehicles and future Soldier technologies. Develop understanding of phenomenology for an integrated RF sensor that performs radio, radar, and control functions to allow communications, combat ID, and target acquisition\/tracking,. Develop semiconductor-based ultraviolet (UV) optoelectronics for communications, water\/air\/surface purification, and detection and identification of biological threats. Conduct applied research in sensor and eye protection from laser threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.021"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied RF biometric algorithms to an unattended compact radar for perimeter watching as part of a larger unmanned ground sensor network and established baseline designs of a sub-millimeter wave (sub-mmW) imager for human-borne IED detection; extended UV source and detector research to 250-nm."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop new methods of moving target classification based on micro-doppler analysis; explore the phenomenology and image processing associated with sub-mmW imaging of human-borne IEDs and validate new sub-mmW \/ terahertz device technology; extend research on 230-275-nm optical sources including LEDs, lasers, and detectors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.115"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.115"
                                            },
                                            "Text": {
                                                "val": "Will assess the application of RF micro-Doppler algorithms to the remote sensing of human activities for counter-IED applications; investigate non-traditional radar modes in a compact radar device for force protection and surveillance; improve performance of UV lasers, LEDs, and detectors operating at 230-275-nm for enabling communications, water\/air\/surface purification, and detection and identification of biological threats; and investigate new optical limiting components for detecting emerging laser threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops network infrastructure concepts and validates algorithms, filters and software agent technologies to enable improved situational awareness in complex\/urban terrain and reduced cognitive load for Soldiers and small units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated the transition of Network Science and the Micro Autonomous Systems and Technology Collaborative Technology Alliance technologies and assessed their potential impact on persistent surveillance for situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.667"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop algorithms and enhance applications directed to persistent surveillance, sensor management, and asset-to-asset taskings to minimize the cognitive workload of a lower echelon commander."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.761"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.761"
                                            },
                                            "Text": {
                                                "val": "Will assess Cloud-based cellular architectures and explore implementation of decision support tools at the sensor level to more effectively support the collection and dissemination of information specifically tailored to the Soldiers cognitive requirements for more accurate decision making."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SA2"
                    },
                    "ProjectTitle": {
                        "val": "BIOTECHNOLOGY APPLIED RESEARCH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.296"
                        },
                        "CurrentYear": {
                            "val": "5.476"
                        },
                        "BudgetYearOne": {
                            "val": "4.852"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.852"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.131"
                        },
                        "BudgetYearThree": {
                            "val": "5.859"
                        },
                        "BudgetYearFour": {
                            "val": "5.316"
                        },
                        "BudgetYearFive": {
                            "val": "6.072"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, develops and evaluates biotechnology with application to sensors, electronics, photonics, and network science.  This project funds collaborative applied research and integration of government, academic and industry scientific research on biotechnology from PE 0601104\/H05, Institute for Collaborative Biotechnologies (ICB) to advance innovative capabilities. Areas of applied research include bio-array sensors, biological, and bio-inspired power generation and storage, biomimetics, proteomics, genomics, network science, DNA research and development, control of protein, and gene expression.  \n\nThe ICB is a collaborative effort led by the University of California, Santa Barbara (Santa Barbara, CA) in partnership with the California Institute of Technology (Pasadena, CA), the Massachusetts Institute of Technology (Cambridge, MA), the Army Laboratories and Research, Development and Engineering Centers, and the ICB industrial partners.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory, Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Institute for Collaborative Biotechnologies (ICB)"
                                    },
                                    "Description": {
                                        "val": "This effort exploits breakthroughs in biotechnology basic research invented at the ICB to enable capabilities in sensors, electronics, photonics, and network science."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and evaluated arrays of bio-inspired material-based thermal imagers; implemented bio-inspired algorithms for optimized collection of data from sensor networks; implemented gecko-mimicking reversible adhesives in robotic applications; experimentally validated surface-enhanced Raman spectroscopic detection of explosives in open-channel micro-fluidic devices; and implemented bio-inspired flocking and search algorithms for unmanned vehicles in GeoTrack system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design\/build hardware\/software required to image single cells in 3D and collect initial 3D images; apply the lessons learned in microbial fuel cells to implement enhanced fermentation, environmental monitoring, and investigate waste water treatment; complete characterization and investigation of bacterial nanowires fabricated artificially from the naturally occurring proteins; and complete and validate algorithms for control of data displayed on crew stations based on neural processing, and begin two new start projects selected in FY11."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.852"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.852"
                                            },
                                            "Text": {
                                                "val": "Will complete design and fabricate hardware and software required to image single cells in 3D to better understand the interactions between biological materials and inorganic surfaces; experimentally validate increased electron acceptors ability to improve fermentation for bioprocessing and monitoring systems; analyze wastewater treatment on increased laboratory scale to optimize bioremediation; characterize artificial biofilms doped with organic conductive structures for increased current density microbial fuel cells; evaluate bio-inspired algorithms for control of swarms of micro-unmanned aerial vehicles; evaluate yeast cell based electrodes and membranes in a microbial fuel cell for powering unattended ground sensors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS1"
                    },
                    "ProjectTitle": {
                        "val": "TACTICAL SPACE RESEARCH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.526"
                        },
                        "CurrentYear": {
                            "val": "3.719"
                        },
                        "BudgetYearOne": {
                            "val": "4.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.303"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.956"
                        },
                        "BudgetYearThree": {
                            "val": "6.428"
                        },
                        "BudgetYearFour": {
                            "val": "7.100"
                        },
                        "BudgetYearFive": {
                            "val": "6.202"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project researches and evaluates technologies for space-based, high altitude, and cyberspace applications for Army tactical ground forces.  Applied research efforts include the design and development of sensors and electronic components, communications, signal and information processing, target acquisition, position\/navigation, and threat warning within space and high altitude environments as well as the design and development of technologies and analytical tools for cyber risk assessment and mitigation in acquisition systems.  The applied research and technology evaluations conducted under this Project leverage other DoD space science and technology applications to support Army space force enhancement and cooperative satellite payload development.  \n\nThis project supports Army science and technology efforts in the Command, Control, and Communications (C3) portfolio.\n\nWork in this project complements and is fully coordinated with PE 0603006A (Space Applications Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.     \n  \nWork in this project is performed by the US Army Space and Missile Defense Command (SMDC) in Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Space Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and evaluates space-based, high altitude and cyberspace technologies, components, and tools that lead to smaller, lighter,  more responsive payloads and applications to assess cyber risks. These technologies allow for the rapid integration and development of tactical payloads in support of responsive space and high altitude environments. In addition, this effort evaluates cyber risks from supply chain components to integrated weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated component technologies for high altitude payloads and small satellites, such as sensor subsystems, data links\/cross links, propulsion, power, energy, guidance, navigation, and flight control; Investigated protection technologies for uplinks, downlinks, and cross-links of space and high altitude assets; investigated and designed a Space Analysis Laboratory for component development, testing, and system integration for ground testing and evaluation in support of space and high altitude applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced power technologies for use in space and high altitude payload efforts; investigate and identify previously developed space sensor and power component technologies to implement in high altitude payloads; begin tool development to support evaluations of cyber attack risks and remediation approaches for acquisition efforts, to include space and high altitude payloads and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.303"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.303"
                                            },
                                            "Text": {
                                                "val": "Will design and develop optics, processor, and gimbal systems component technologies for small satellite Electro-Optical (EO) video subsystems, small satellite deployable arrays, and small satellite constellation enablers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and Analysis Lab"
                                    },
                                    "Description": {
                                        "val": "This effort provides an in-house capability to design and conduct analytic evaluations of space, high altitude, and cyberspace technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement the design of the Space Analysis Lab to stand up an in-house capability to support component development and system integration for ground demonstrations and evaluation of space, high altitude, and cyberspace technology applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will design payload ground systems to monitor health and status of small satellite systems during flight operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS2"
                    },
                    "ProjectTitle": {
                        "val": "ROBOTICS TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.036"
                        },
                        "CurrentYear": {
                            "val": "12.309"
                        },
                        "BudgetYearOne": {
                            "val": "13.198"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.198"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.691"
                        },
                        "BudgetYearThree": {
                            "val": "13.937"
                        },
                        "BudgetYearFour": {
                            "val": "20.253"
                        },
                        "BudgetYearFive": {
                            "val": "16.719"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, evaluates, and investigates autonomous technologies to enable robotics to assist military missions.  Technical efforts are focused on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and improved mobility for unmanned vehicles of scales from micro-systems through tactical vehicles.  The project provides the basis for the Robotics Collaborative Technology Alliance (CTA), a cooperative arrangement with industry and academia to conduct a concerted, collaborative effort advancing key enabling robotic technologies required for future unmanned systems.\nThis project sustains Army science and technology efforts supporting the Ground portfolio.\n\nThis project leverages basic research conducted under PE 0601102A, project T63 and PE 0601104A, project H09 and transitions knowledge and emerging technologies to PE 0603005A (Combat Vehicle Advanced Technology) for maturation and demonstration.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.\n\nWork in this project is performed by the Army Research Laboratory (ARL) at the Aberdeen Proving Ground, MD, and the Robotics Collaborative Technology Alliance consisting of: Boston Dynamics, Carnegie Mellon University, Florida A&M University, General Dynamics Robotics Systems, Jet Propulsion Laboratory, QinetiQ North America, University of Central Florida, and University of Pennsylvania."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics CTA"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to provide essential capabilities for advanced perception, intelligent control and tactical behavior, human-robot interaction, robotic manipulation, and unique mobility for unmanned systems to conduct multiple military missions for a full range of robots from man-portable to larger systems. Research focuses on new sensor and sensor processing algorithms for rapid detection and classification of objects in cluttered and unknown environments, enabling autonomous mobility and intelligent tactical behavior by future unmanned systems; implementing adaptive control strategies that will enable unmanned systems to display intelligent tactical behavior, formulation of control strategies that will facilitate use of unmanned systems in populated environments and minimize the cognitive workload on Soldier operators, enable more dexterous manipulation of objects, and explore unique modes of mobility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extended research to examine robot understanding of cues and activity permitting more 'human-like' control of unmanned systems; researched methods for improving perception in increasingly cluttered environments from both a static and dynamic perspective, and increased application of learning techniques to improve flexibility in unknown environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enable lower cost sensory capability for smaller unmanned systems; examine issues of trust in automation and develop a common mental picture between soldier and unmanned system; and will examine mid- and long- range scene recognition to facilitate tactical behavior in unmanned systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.925"
                                            },
                                            "Text": {
                                                "val": "Will design algorithms to enable both improved comprehension of the sensed environment by small unmanned systems and adaptability in planning and execution of tactical behaviors; and investigate concepts for more efficient locomotion by small, legged unmanned systems to improve mobility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception and Intelligent Control"
                                    },
                                    "Description": {
                                        "val": "Advance perception and intelligent control technologies required to achieve autonomous tactical behaviors and other objective capabilities for future unmanned vehicles of multiple size scales and to transition this technology to advanced development programs being conducted under PE 0603005A (Combat Vehicle and Automotive Advanced Technology) project 515 (Robotic Ground Systems) for integration into test bed systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated tactical behavior appropriate to military missions in 'urban-like' environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.815"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research for improved shared understanding of tactical environment between soldier and unmanned systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.273"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.273"
                                            },
                                            "Text": {
                                                "val": "Will investigate FY12 learned understanding of tactical environment between soldier and unmanned systems for improving autonomous tactical behaviors and validate technologies in collaboration with CTA efforts; investigate and evaluate the state-of-the-art in intelligent control and focus on the technology gaps."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Robotics - Component Maturation"
                                    },
                                    "Description": {
                                        "val": "Matures component technologies on unmanned ground vehicle test beds by  conducting extensive field evaluation and technology characterization to establish improved capability for near autonomous UGVs. Conduct regular, periodic evaluation at Ft. Indiantown Gap, PA, and other military facilities that will stress the technology in complex environments to further focus CTA sponsored research, assess performance, and provide the opportunity for US Army Training and Doctrine Command to engage in the early development of the tactics, techniques, and procedures required for successful utilization of unmanned systems in future conflicts. Work is done collaboratively with industry, academia and other government agencies to include Tank and Automotive Research, Development, and Engineering Center (TARDEC) to support future transitions of knowledge and emerging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.743"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated the ability of unmanned systems to maneuver intelligently and autonomously in urban-like environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct initial assessments to establish baseline capability for unmanned systems to understand terrain and behaviors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}