{
    "id": "e7a1483a46bca0d5a6b345028f9cf7782556fa85",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V1_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602602F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Munitions"
        },
        "R1LineItemNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.365"
            },
            "CurrentYear": {
                "val": "60.656"
            },
            "BudgetYearOne": {
                "val": "77.175"
            },
            "BudgetYearOneBase": {
                "val": "77.175"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "84.162"
            },
            "BudgetYearThree": {
                "val": "83.955"
            },
            "BudgetYearFour": {
                "val": "84.648"
            },
            "BudgetYearFive": {
                "val": "87.731"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and establishes the technical feasibility and military utility of advanced guidance and ordnance technologies for conventional air-launched munitions.  Program supports core technical competencies of fuze technology, energetic materials, damage mechanisms, munitions aerodynamics and guidance, navigation, and control, terminal seeker sciences, and munition systems effects.  Technologies to be developed include blast, fragmentation, penetrating and low-collateral damage warheads, variable height\/depth fuzing, precise terminal guidance, and high performance and insensitive explosives.  Efforts in this program have been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "61.330"
                },
                "CurrentYear": {
                    "val": "60.692"
                },
                "BudgetYearOne": {
                    "val": "64.676"
                },
                "BudgetYearOneBase": {
                    "val": "64.676"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.365"
                },
                "CurrentYear": {
                    "val": "60.656"
                },
                "BudgetYearOne": {
                    "val": "77.175"
                },
                "BudgetYearOneBase": {
                    "val": "77.175"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.965"
                },
                "CurrentYear": {
                    "val": "-0.036"
                },
                "BudgetYearOne": {
                    "val": "12.499"
                },
                "BudgetYearOneBase": {
                    "val": "12.499"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.036"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.550"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.883"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.632"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "12.499"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.499"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Other Adjustments include -0.632 Congressional General Reductions\n\nFY13: Increase due to higher Air Force priorities"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622068"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Guidance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.555"
                        },
                        "CurrentYear": {
                            "val": "20.820"
                        },
                        "BudgetYearOne": {
                            "val": "32.955"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.955"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "34.081"
                        },
                        "BudgetYearThree": {
                            "val": "34.227"
                        },
                        "BudgetYearFour": {
                            "val": "35.884"
                        },
                        "BudgetYearFive": {
                            "val": "35.565"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013, changes in funding are due to higher AF priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional munitions advanced guidance technologies to establish technical feasibility and military utility of advanced munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation.  Project payoffs include adverse-weather, networked, and autonomous precision munition guidance capability; increased number of kills per sortie, increased aerospace vehicle survivability, improved reliability and affordability, and improved survivability and effectiveness of conventional weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1"
                                    },
                                    "Description": {
                                        "val": "Develop advanced seeker technologies for air-delivered munitions to provide high confidence target discrimination and classification, precise target location, and robust terminal tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.893"
                                            },
                                            "Text": {
                                                "val": "Completed model verification and demonstration of optical seeker technologies to improve targeting of obscure targets.  Continued development and evaluation of test components for laser ranging, multi-mode, and synthetic aperture and high resolution radar seeker technologies for guidance in adverse weather.  Continued developing theory for seeker\/sensor fusion, autonomous target recognition using differential geometry and topology, and application of neurophysiology of insects to guide small vehicles to moving targets.  Investigated guidance technologies that optimize delivery of selectable effects munitions through countermeasures.  Began development of seeker technology for adverse weather capability for small weapons, hypersonic environments, and discriminating tunnels and surface aimpoints for boosted\/high speed penetrators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.024"
                                            },
                                            "Text": {
                                                "val": "Continue laboratory development and evaluation of test components for laser ranging, improved multi-mode, adverse weather synthetic aperture and high resolution radar modes seekers.  Begin technology development of very low-cost, adverse weather capable, radar seeker for small weapons.  Develop theory for seeker sensor fusion and autonomous target recognition, and study multi-weapon and conformal apertures for enhanced resolution and beam forming on small cooperative weapons.  Continue applying the neurophysiology of insects to guide small vehicles to moving targets, investigate guidance technologies that optimize delivery of selectable effects munitions through countermeasures and develop dual mode seeker for hypersonic environments and discriminating tunnels and surface aimpoints for boosted\/high-speed penetrators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.487"
                                            },
                                            "Text": {
                                                "val": "Develop technologies that simplify, increase the flexibility, and reduce the cost of passive and active electro-optical, infrared, and radar munition seekers, with focus on combat operations in adverse weather and in high-speed engagements.  Increase emphasis on seeker technologies that provide enhanced mission capability for fifth-generation aircraft, specifically as it applies to success in denied or anti-access environments.  Continue developing algorithms and processing technologies to acquire and track targets with and without an operator in the loop.  Continue pursuing revolutionary bio-inspired seeker technologies to increase immunity to countermeasures, to exploit multi-discriminant signatures, and to reduce the size and cost of detectors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop advanced weapon aerodynamic, control, navigation, and networking technologies for air-delivered munitions to provide precise, agile flight, networked effects, and immunity to countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.773"
                                            },
                                            "Text": {
                                                "val": "Continued developing and evaluating advanced weapon airframe and control concepts to achieve high levels of agility and maneuverability, developing multi-functional structures, and evaluating navigation systems within Global Positioning System (GPS) jamming environments.  Continued development of algorithms to use wide field-of-view optical imager data, enabling navigation under GPS-denied conditions.  Determined feasibility of highly compact, high throughput avionics processors and mature technologies allowing weapons to communicate and exploit information in a secure, low probability of detection mode with launch platforms, other weapons, and\/or ground elements.  Began developing robust control methodologies for terminal guidance and control and actuation technologies for future weapon concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.338"
                                            },
                                            "Text": {
                                                "val": "Continue developing advanced weapon airframe and control concepts to achieve high levels of agility and maneuverability, developing multi-functional structures, and evaluating navigation mode with other systems.  Continue developing nonlinear, robust control methodologies for future weapons, such as high-speed terminal guidance on long-range strike weapons and control and actuation technologies for boosted penetrators systems within GPS jamming environments.  Continue development of algorithms to use wide field-of-view optical imager data, enabling navigation under GPS-denied conditions.  Develop highly compact, high throughput avionics processors, and continue maturing technologies allowing weapons to communicate and exploit information in a secure, low probability of detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.356"
                                            },
                                            "Text": {
                                                "val": "Continue developing technologies that achieve precision navigation under GPS-degraded and GPS denied conditions.  Identify and pursue additional weapon navigation and control networking technologies that provide enhanced mission capability in denied or anti-access environments.  These technologies facilitate agile and maneuverable weapons, foster autonomy, trust, and networking, and enable precise munition control and actuation, especially for boosted penetrating munitions or during high-speed engagements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3"
                                    },
                                    "Description": {
                                        "val": "Develop guidance subsystem integration and evaluation technologies to provide open and closed loop ground testing, flight test risk reduction, and digital simulation of advanced concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.889"
                                            },
                                            "Text": {
                                                "val": "Continued investigating precision guided munition integration technology issues and functionality in various flight environments and refining the set of interoperable simulations to evaluate emerging munitions guidance technologies.  Continued evaluating multi-weapon search and attack technologies on a time critical moving target.  Simulated highly innovative concepts and approaches in guidance and control technology, and develop capability to test and refine development programs and future weapon concepts in a realistic operational environment.  Began development of seeker scene projection technologies and dynamic simulation technologies for terminally guided weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.458"
                                            },
                                            "Text": {
                                                "val": "Investigate precision guided munition integration technology issues and functionality in various flight environments and refine the set of interoperable simulations to evaluate emerging munitions technologies.  Simulate highly innovative concepts and approaches in guidance and control technology.  Develop capability to test and refine development programs and future weapon concepts in a realistic operational environment.  Continue multi-weapon search and attack technologies on a time critical moving target.  Begin build-up of test technologies for evaluating higher speed weapon guidance subsystem."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.112"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.112"
                                            },
                                            "Text": {
                                                "val": "Develop precision guided munition integration technology issues and functionality.  Expand efforts to develop the capability to simulate, test, and refine innovative seeker concepts and navigation and control approaches in a realistic operational environment.  Increase emphasis on guidance integration and evaluation technologies that provide enhanced mission capability for fifth-generation aircraft.  Continue pursuing multiweapon search and attack technologies on a time critical moving target.  Continue the build-up of test technologies for evaluating higher speed weapon guidance subsystems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622502"
                    },
                    "ProjectTitle": {
                        "val": "Ordnance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.810"
                        },
                        "CurrentYear": {
                            "val": "39.836"
                        },
                        "BudgetYearOne": {
                            "val": "44.220"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.220"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "50.081"
                        },
                        "BudgetYearThree": {
                            "val": "49.728"
                        },
                        "BudgetYearFour": {
                            "val": "48.764"
                        },
                        "BudgetYearFive": {
                            "val": "52.166"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional ordnance technologies to establish technical feasibility and military utility for advanced explosives, fuzes, warheads, submunitions, and weapon airframes, carriage, and dispensing.  The project also assesses the lethality and effectiveness of current and planned conventional weapons technology programs and assesses target vulnerability.  The payoffs include improved storage capability and transportation safety of fully assembled weapons, improved warhead and fuze effectiveness, improved submunition dispensing, low-cost airframe\/subsystem components and structures, and reduced aerospace vehicle and weapon drag."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Investigate and develop energetic materials technology that can maximize weapon lethality, while applying appropriate safety and security features."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.743"
                                            },
                                            "Text": {
                                                "val": "Completed the materials properties database to develop system level models for predicting initiation.  Tested and modeled explosive fills that reduce pre-detonation during high \"G\" loading.  Developed low-density energetic materials for micro-munitions applications.  Investigated high-density case materials to tailor or improve warhead performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.586"
                                            },
                                            "Text": {
                                                "val": "Test and model explosive fills that reduce pre-detonation during high \"G\" loading.  Develop low-density energetic materials for micro-munitions applications.  Investigate high-density case materials to tailor or improve warhead performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.267"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.267"
                                            },
                                            "Text": {
                                                "val": "Develop, model, and test explosive fills that reduce pre-detonation during high \"G\" loading.  Continue developing low density energetic materials for small munition applications.  Exploit new nanoenergetic materials to enhance and tailor explosive effects.  Increase emphasis on developing energetic materials that enable increased capability and capacity for fifth-generation aircraft."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Investigate and develop fuzes for air-delivered weapon applications to develop novel energetic initiation concepts, penetration fuzing, point burst fuzes, and develop predictive models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.226"
                                            },
                                            "Text": {
                                                "val": "Continued investigating novel methods to initiate explosives, including new modeling and testing techniques. Continued to investigate and characterize the mechanical environment that a fuze must survive during hard target penetration events.  Continued to explore ground profiling imaging fuze technology.  Continued development of a hardened chip fuze that uses integrated logic."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.068"
                                            },
                                            "Text": {
                                                "val": "Continue investigating novel methods to initiate explosives, including new modeling and testing techniques. Continue to investigate and characterize the mechanical environment that a fuze must survive during hard target penetration events.  Continue to explore ground profiling imaging fuze technology.  Continue development of a hardened chip fuze that uses integrated logic."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.252"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.252"
                                            },
                                            "Text": {
                                                "val": "Expand effort to investigate novel methods to initiate explosives, including new modeling and testing techniques.  Increase emphasis on fuze technologies that enable increased capacity and capability of fifth-generation aircraft, specifically as it facilitates success in denied or anti-access environments.  Continue to investigate and characterize the mechanical environment that a fuze must survive during hard target penetration events.  Continue to explore ground profiling imaging fuze technology, and develop a hardened chip fuze that uses integrated logic."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Investigate and develop advanced warhead kill mechanisms, such as adaptable\nwarheads, directional control, fragmenting warheads, and application of reactive metals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.958"
                                            },
                                            "Text": {
                                                "val": "Developed compact lethality warhead technologies for use in urban terrain.  Continued investigating directional warhead concepts employing reactive fragments to improve standoff kills for non-direct hit encounters.  Continued developing numerical algorithms for material-to-material interface dynamics, loading, and vibration during high-speed penetration.  Continued investigating techniques to control, direct, and focus the energy release from explosives in real-time by means of applying small amounts of electromagnetic energy.  Investigated novel warhead designs that provide warfighting capability to deliver selectable effects on targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.787"
                                            },
                                            "Text": {
                                                "val": "Develop compact lethality warhead technologies for use in urban terrain.  Continue investigating directional warhead concepts employing reactive fragments to improve standoff kills for non-direct hit encounters.  Continue developing numerical algorithms for material-to-material interface dynamics, loading, and vibration during high-speed penetration.  Continue investigating techniques to control, direct, and focus the energy release from explosives in real-time by means of applying small amounts of electromagnetic energy.  Investigate novel warhead designs that provide warfighting capability to deliver selectable effects on targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.824"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.824"
                                            },
                                            "Text": {
                                                "val": "Continue developing novel warhead technologies, especially those that enable small, agile munitions or that provide the capability to deliver selectable effects on targets.  Continue investigating directional warhead concepts to improve standoff kills for non-direct hit encounters by employing reactive fragments or by utilizing a forward focusing fragment capability.  Continue developing tools to better predict material-to-material interface dynamics, loading, and vibration during high-speed penetration."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4."
                                    },
                                    "Description": {
                                        "val": "Using a system approach, investigate and develop ordnance concepts by making technology trades between fuzes, warheads, and explosives and by improving weapon carriage, release, and dispensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.883"
                                            },
                                            "Text": {
                                                "val": "Continued investigation of precision guided munition integration issues and functionality in various flight environments.  Continued building and using interoperable simulations to evaluate emerging technologies.  Continued developing and enhancing new models and improvements for micromunitions, penetrators, and counter-chemical, biological, radiological, and nuclear effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.395"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of precision guided munition integration issues and functionality in various flight environments.  Continue building and using interoperable simulations to evaluate emerging technologies.  Continue developing and enhancing new models and improvements for micromunitions, penetrators, and counter-chemical, biological, radiological, and nuclear effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.877"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of precision guided munition integration issues and functionality in various flight environments.  Continue building and using interoperable simulations to evaluate emerging technologies.  Continue developing and enhancing new models and improvements for small munitions, penetrators, and counter chemical, biological, radiological, and nuclear effects.  Increase emphasis on advanced ordnance concepts that increase the capacity and capability of fifth-generation aircraft."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}